{"video": {"id": "0n809nd4Zu4", "title": "Build a Chrome Extension – Course for Beginners", "description": "Learn how to create a Chrome browser extension using JavaScript and the new iteration of the web extensions platform, called Manifest V3.\n\n✏️ Raman Hundal developed this tutorial.\n\n💻 YouTube Bookmarker Starter Code: https://github.com/raman-at-pieces/youtube-bookmarker-starter-code\n💻 YouTube Bookmarker Finished Code: https://github.com/raman-at-pieces/youtube-bookmarker-finished-code\n🔗 Pieces Code Snippet Assistant download: https://pieces.app/install\n\n🔗 Publishing extension on the chrome store docs: https://developer.chrome.com/docs/webstore/publish/\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Intro\n⌨️ (0:02:15) Demo\n⌨️ (0:05:18) Understanding manifest.json\n⌨️ (0:08:46) Coding the extention\n⌨️ (0:31:37) newVideoLoaded function\n⌨️ (0:31:37) fetchBookmarks\n⌨️ (0:37:08) addEventListener\n⌨️ (0:48:03) addNewBookmark function\n⌨️ (1:00:33) Testing the extention\n\n🎉 Thanks to Pieces.app for providing a grant that made this course possible.\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H6M25S", "likes": "5907", "views": "225004"}, "comments": [{"topLevelComment": {"author": "Vikrant Walia", "text": "i want to create a gmail extension\ncan you teach me how i can create a gmail extension", "likes": 0}}, {"topLevelComment": {"author": "Neko", "text": "Thank you. I learned a lot, this cover many things!", "likes": 0}}, {"topLevelComment": {"author": "Omer Faran", "text": "If I'm not mistaken, tabs.onUpdated listener callback now takes 3 arguments, tab is the third one, not second", "likes": 0}}, {"topLevelComment": {"author": "Arun KG", "text": "Great tutorial. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "ShadeTree HandyMan", "text": "How hard would it be to make a randomizer for youtube?\nAs a long time youtube viewer and maker of a few videos the user interface for youtube has become mind numbingly boring and repetitive. It used to be somewhat of an adventure when you went to your youtube home page and be presented with a wide and somewhat unpredictable choice of videos. Sadly this is no long true... you are constantly shown videos that either the same video you just watched or similar ones.... or worse shown the same videos day in and day out for weeks if you dont reject them.  I often go through and check the dont recommend channel on a whole page of videos hit the reload button and hope for better choices. \n\nSo would it be possible to make a chrome extension that could automate this process in some way such as take the fist 10 or however many videos presented and  do the dont recommend channel for each and then reload the page. I will add that I tend to do all my youtubing on a computer and not on a phone.", "likes": 0}}, {"topLevelComment": {"author": "Verma Web", "text": "Looks like this guy was just teaching himself. Disappointed", "likes": 0}}, {"topLevelComment": {"author": "Timur Timaev", "text": "I was struggling at first few minutes. I was not getting tab.url. Then googled up onUpdated and got this:\n\nin background.js you also have to add another param like this\nchrome.tabs.onUpdated.addListener((tabId, changeInfo, tab) ...\n\nthen it works. gonna continue now...", "likes": 1}}, {"topLevelComment": {"author": "Techy", "text": "gtgtgrtfv", "likes": 0}}, {"topLevelComment": {"author": "Udochi Okeke", "text": "I want to create an extension that allows people to type special non-English characters into whatever they are typing online.", "likes": 0}}, {"topLevelComment": {"author": "WaterJackattack", "text": "pieces de eyah", "likes": 0}}, {"topLevelComment": {"author": "about67turtles", "text": "I keep getting detered from buidling my own extension due to the brutal developer experience having to click reaload extension and reload the page manually on every change...", "likes": 1}}, {"topLevelComment": {"author": "tuan tran", "text": "i fail to see how the logic flows", "likes": 0}}, {"topLevelComment": {"author": "Srinivasa Odela", "text": "Whats the IDE that Raman is using?? Can you share the name and if possible where can i download it from.", "likes": 0}}, {"topLevelComment": {"author": "Watcher Node", "text": "I git cloned the final code and loaded unpacked the extension folder. But, for some reason, the  chrome.storage.sync.get always returns undefined in popup.js", "likes": 0}}, {"topLevelComment": {"author": "cloud computing", "text": "is he rehman", "likes": 0}}, {"topLevelComment": {"author": "ragtop63", "text": "I'd really like to see a thorough tutorial on how to build a browser extension using a framework, like Vue. Finding any information on how to do it seems to be one of the most difficult things to find on YouTube right now.", "likes": 1}, "replies": [{"author": "212", "text": "rightt? there are so many videos that talk about manifest version 2 but none on mv3", "likes": 0}]}, {"topLevelComment": {"author": "nounou mouh", "text": "hi \nthnx for this video \nplease tell me what is the text editor used in this tuorial ?", "likes": 0}}, {"topLevelComment": {"author": "Fareed Ezzedeen", "text": "I was looking for this for a long time,\n\nAll contents talks about v2", "likes": 0}}, {"topLevelComment": {"author": "Jono Charles Davey", "text": "The section on the Manifest file doesn't really give me much to work on, it just tells me that you specifically chose those options for a specific purpose. Where's the documentation to find the options for my own project? Do I have to copy and paste a full template or do I have to pick and choose from the documentation? What's the easiest thing to do in regarding that? Everything seems relatively easy apart from the Manifest file, which is incredibly vague. Not that any of this matters, given Google are like Facebook in which they'll update and break all their code every five minutes.", "likes": 0}}, {"topLevelComment": {"author": "Andrey Li", "text": "Many thanks!))", "likes": 0}}, {"topLevelComment": {"author": "Mohd Sajid Shaikh", "text": "Can we build vpn extension 😇, if yes then what library to use for connecting vpn", "likes": 0}}, {"topLevelComment": {"author": "Varad Rane", "text": "Just what i needed. I dont know if its already an extension, but i want to make one where you can go to youtube playlists, and then it will add a  statistics section for that playlist in the DOM. Showing things that youtube doesn't show right now. Like total watch time, and watch time if you sped up everything by say 1.25x", "likes": 0}}, {"topLevelComment": {"author": "Bruno", "text": "25:20 does not work, event is still not fired on page refresh", "likes": 1}}, {"topLevelComment": {"author": "Khan Tariq", "text": "not working when i console in background.js", "likes": 1}}, {"topLevelComment": {"author": "Limited Edition", "text": "We can bookmark (time ) more than one video at one time", "likes": 0}}, {"topLevelComment": {"author": "listerofsmeg", "text": "It's broken\nbackground.js:1 Uncaught (in promise) Error: Could not establish connection. Receiving end does not exist.", "likes": 2}, "replies": [{"author": "Sounak Roy", "text": "yes", "likes": 0}]}, {"topLevelComment": {"author": "Andrew Courter", "text": "This is great. Thanks for sharing this. Is it best practice to aim for high compatibility when building extensions or do people include polyfills or other libraries like jquery when writing extensions?", "likes": 1}, "replies": [{"author": "Mike Valeriano", "text": "It's 2022, no one should be using jQuery for anything anymore.", "likes": 1}]}, {"topLevelComment": {"author": "Libera", "text": "The downside about this method is that the same video is considered a totally different video when is in a playlist. \nSuch as \"watch?v=mCdA4bJAGGk\" and \"watch?v=mCdA4bJAGGk&list=RDmCdA4bJAGGk\"", "likes": 0}, "replies": [{"author": "Euan Morgan", "text": "Touché", "likes": 0}]}, {"topLevelComment": {"author": "Wajahat Ali Basharat", "text": "I watched tNice tutorials video and tried to use soft soft and I couldn't work it. Its my tNice tutorialrd ti going through tNice tutorials video and tNice tutorials ti I connected to", "likes": 0}}, {"topLevelComment": {"author": "Eric studiox", "text": "this is a beginners question im sure but when i click on loadunpack, it doesn't see any of my files which i created in dreamweaver..ie js,json,css,html , nothing...help please", "likes": 0}}, {"topLevelComment": {"author": "Kshitij Gupta", "text": "0:24", "likes": 0}}, {"topLevelComment": {"author": "Learn code in Bangla", "text": "Hello,\nyour videos are very helpful.\ncould you please make an extension that can scrap amazon search results?", "likes": 0}}, {"topLevelComment": {"author": "jai ganesh", "text": "Hey, great tutorial to get started with manifestv3 and chrome api.. You've got everything covered", "likes": 0}}, {"topLevelComment": {"author": "أحمد عبدربه Ahmed AbdRapo", "text": "Something is missing here\nHow do the extension is being updated on the flay?\nYou didn't even mention that part.", "likes": 0}}, {"topLevelComment": {"author": "Alper Kaya", "text": "13:19 it's not going to include &index=2 part because it's not part of v parameter!", "likes": 1}}, {"topLevelComment": {"author": "Alper Kaya", "text": "YOU HAVE A TYPO AT DESCRIPTION, \"extention\" => \"extension\"", "likes": 0}}, {"topLevelComment": {"author": "Sheroz Nazhmudinov", "text": "Nice tutorial, thanks! I have noticed smth - the extension isn't alway loaded when navigating from, let's say www.youtube.com, to some specific video.\nOnly after the reload, the extension is loaded and the + sign is visible.\n\nI put some log statements in the background.js and contentScript.js (around the message sending and handling parts), and I can see the message doesn't always get consumer in the contentScript.js, even though it's sent by the background.js. \n\nDo you know if it's some sort of bug in the extension framework, or do we need to listen to a different event?", "likes": 1}}, {"topLevelComment": {"author": "Saad Bahir", "text": "Anyone is able to debug the app? None of the breakpoints in popup.js work for me :/", "likes": 0}}, {"topLevelComment": {"author": "mbdAli", "text": "this one saved me ton of time.  how to get pagesource of new window opened?", "likes": 0}}, {"topLevelComment": {"author": "Es_Stinkt_Puh Felix", "text": "So noone else having problems with the manifest.json part and thr background.js?", "likes": 0}}, {"topLevelComment": {"author": "9-teen", "text": "can this be added to our resume?", "likes": 0}}, {"topLevelComment": {"author": "RAYMOND", "text": "Can you please, give me an understanding of how to automate the submission of this extension to webstore?", "likes": 0}}, {"topLevelComment": {"author": "05060024", "text": "Why did \"async\" suddenly appear on line 14 at 24:34? There's no explanation of that.", "likes": 0}}, {"topLevelComment": {"author": "Rubyanka", "text": "Why is there no Turkish in automatic translation? :((", "likes": 0}}, {"topLevelComment": {"author": "Jose Montalvo", "text": "How would you go about doing the following: \n\nWhen you click on the icon to bookmark, the extension popup opens automatically? no need for you to go all the way to the icon and click it?", "likes": 1}}, {"topLevelComment": {"author": "Vitor Mendes", "text": "Funtastic! Tank you Raman for this sharing \nI've created my first Chrome extension :-)", "likes": 0}}, {"topLevelComment": {"author": "LesPtitsOiseaux", "text": "Thanks for this great course! :) May I ask, anyone, if you wanted to translate every page in Klingon before the user sees it loading, what's the trick to prevent the page from being display as you translate it Klingon?", "likes": 0}, "replies": [{"author": "Md Zaid Siddiqui", "text": "I could be wrong about this, and you're welcome to correct me, but I believe it could be achieved with the display: none (or even better opacity: 0) on the body until the translation function is done executing.", "likes": 1}]}, {"topLevelComment": {"author": "William Jocere", "text": "do u teaching? i want 1:1 coach", "likes": 0}}, {"topLevelComment": {"author": "Abdul Qadir", "text": "Woow i love the content. 😍", "likes": 0}}, {"topLevelComment": {"author": "Raghava Reddy", "text": "How to turn Reactjs Project Into chrome extension ?", "likes": 0}}, {"topLevelComment": {"author": "Typically Thomas", "text": "This tutorial is excellent if you want to make the exact program you're making. This doesn't teach the underlying principles of what you need to do something similar on your own. It's a poor tutorial, I'm sorry to say. You skip over important parts, don't explain a few key details. It feels too much like your many follow-along tutorials and not a course on how to do it using examples.", "likes": 8}, "replies": [{"author": "aswan aswan", "text": "this  is  what i thought , this  too much for  a  beginner or  even for someone that want to do something similar i just learned some  js  html css and  i was  able to make basic chrome extension  on freecodecomp blog  ,  but  this  tutorial already  started  creating  extension  with  8 files  i don't know  how  this  is for  beginners .", "likes": 0}]}, {"topLevelComment": {"author": "mistah mayne", "text": "left off at 27:06 (kind of ironic putting this given the extension we're making lol)", "likes": 0}}, {"topLevelComment": {"author": "simon busch", "text": "Excellent tutorial thank you so much! \n\nI keep getting this error: Unchecked runtime.lastError: Could not establish connection. Receiving end does not exist. \n\nI tried many things to solve it ( even uninstall all my chrome ext. ) but couldn't solve it...\n\nWould you have an idea ??", "likes": 0}, "replies": [{"author": "Joseph T", "text": "@MonkMode yeah", "likes": 0}, {"author": "MonkMode", "text": "​@Joseph T It's working a few times and then gives the same error again, did you fix that completely?", "likes": 0}, {"author": "Joseph T", "text": "I had this too and then i disabled all other extensions beside the one we're building, removed the one we're building and then restarted my browser and re added the one we're building and it worked", "likes": 0}, {"author": "DNAMcKnight", "text": "That makes the 3 of us", "likes": 0}, {"author": "Deniz Durmuş", "text": "I am getting the same, and couldn't find anything useful anywhere yet.", "likes": 0}]}, {"topLevelComment": {"author": "Sakyb", "text": "can i have the source code..?", "likes": 0}}, {"topLevelComment": {"author": "Fernando Cordeiro", "text": "Can you point me towards how to make a long-term fix to the correction made at \"https://www.youtube.com/watch?v=0n809nd4Zu4&t=1564s\"? I've been searching for a way to send the message on page refresh to no avail 😩", "likes": 0}}, {"topLevelComment": {"author": "the cats Krümel and Keksi", "text": "Just for understanding: Where are the bookmarks stored?", "likes": 0}, "replies": [{"author": "MonkMode", "text": "It's been 2 months since you asked this, but I still wanted to answer this:\r\n\r\nThese bookmarks stored at the local storage of chrome. Many browser extensions store their data in the browser's so-called Local Storage, which is nothing else than a storage location managed by the web browser. And as the same suggests, all is saved locally on the machine where the browser is installed.", "likes": 0}]}, {"topLevelComment": {"author": "Alex Adamov", "text": "Nice Tutorial. Made me realize I needed to brush up on Dom manipulation. Don<t do much of that when working in React!", "likes": 1}}, {"topLevelComment": {"author": "MuppetGamers", "text": "very helpful", "likes": 0}}, {"topLevelComment": {"author": "INTRIG DCA/FEEC/UNICAMP", "text": "Where we need to upload this code to appear in Chrome", "likes": 0}}, {"topLevelComment": {"author": "Abhijeet Gavali", "text": "use this to list your idea for the new extension,\n\nlet's see who comes up with the best idea!", "likes": 0}}, {"topLevelComment": {"author": "The Sleeping Dragon", "text": "Definitely the best chrome extension tutorial I've seen so far. Others are either really outdated or don't teach much, or both. This is great.", "likes": 19}, "replies": [{"author": "Zoldlen", "text": "@Dimitri Vasilev you have more resources at a school than you do just the internet incase there are things you dont understand. It will always be the better option.", "likes": 0}, {"author": "Dimitri Vasilev", "text": "@Zoldlen not sure how school is any better. School will introduce you to the concept of making a google chrome extension and then quiz you on it with the expectation that you’ve already mastered it.", "likes": 0}, {"author": "Zoldlen", "text": "@Typically Thomas You will need to go to school for it then. That's all the internet is. Follow alongs.", "likes": 1}, {"author": "Typically Thomas", "text": "@bharath kumar Don't have any I'm afraid", "likes": 0}, {"author": "bharath kumar", "text": "@Typically Thomas plz tell me other sources for learning chrome extensions plz", "likes": 1}]}, {"topLevelComment": {"author": "kerolos aziz", "text": "Will this work if I follow along on safari?", "likes": 0}}, {"topLevelComment": {"author": "MD FAHIM", "text": "Bullshit.Dosen't work properly.The instructor dosent know how to teach.Bro if you cant teach someone then simply dont teach.He just did this to promote the Bullshitting Pieces Code Snippet Assistant.The people who are saying nice tutorial doesn't watched it properly..", "likes": 2}}, {"topLevelComment": {"author": "Rooster", "text": "Where is boilerplate code?", "likes": 0}}, {"topLevelComment": {"author": "Michael Johns", "text": "I tried my 1st extension a few months ago and could never figure out how to call a global function in the web app and pass some parameters from the extension to it? I even hired someone from a website to help and they couldn't do it! I gave up!", "likes": 0}}, {"topLevelComment": {"author": "md hossen", "text": "Please make webRTC tutorial,  how to make video colling app, Please make a video", "likes": 0}}, {"topLevelComment": {"author": "md hossen", "text": "Wow,, this video is Very helpful,", "likes": 0}}, {"topLevelComment": {"author": "Gary Tate", "text": "Great Video, but why is ever sentence a question?", "likes": 0}}, {"topLevelComment": {"author": "Lars Cichowski", "text": "Why does the pieces app need all these rights to my system? Thank you, but no thank you", "likes": 0}}, {"topLevelComment": {"author": "Edgar Greene", "text": "thx for this amazing tutorials", "likes": 0}}, {"topLevelComment": {"author": "Raymond Goldman Seger", "text": "it's unreliable and locked only to Chrome. People that use firefox or opera or safari can't use it.", "likes": 0}}, {"topLevelComment": {"author": "cu0ngpitt", "text": "why do you write the content script in a immediately invoked function?", "likes": 0}}, {"topLevelComment": {"author": "Gus R", "text": "Hey everyone. If you add   newVideoLoaded(); at the end of contentScript as the purposed quick fix, the extension won't work properly on reload. The reason is that you will not get the video ID into the currentVideo variable, so you won't be able to add new timestamps. The best quick fix I came up with was to force a new URL (I also studied how YouTube deals with different URLs) and I came up with this code that you can add to your contentScript in the place of newVideoLoaded() (the one at the end, line 64 of the finished code);\n\nlet trail=\"&ytExt=ON\";\r\nif(!window.location.href.includes(trail)&&!window.location.href.includes(\"ab_channel\")){\r\n        window.location.href+=trail;\r\n   }\n\nThis should force an update on the URL of the YouTube when necessary, which will then trigger the chrome.tabs.onUpdated. I hope this helps. (For those who want to know what is ab_channel, it is something youtube adds spontaneously for some videos (with channel info) and that triggers the chrome.tabs.onUpdated on its own.) Cheers!\n\nEDIT!!\n\nAlso include a condition &&window.location.href.includes(\"youtube.com/watch\") in the if statement i gave. You don't want it to update the URL in non-YouTube websites.", "likes": 15}, "replies": [{"author": "Sultana Ionut", "text": "Thanks for helping us out. I was debugging this due to an \"Extension context invalidated\".  \nThat was generated because when calling the newVideoLoad() the fetchBookmarks function didn't have with what videoId to work with.", "likes": 0}, {"author": "Ayomide Oguntuase", "text": "Admin should definitely pin this comment or help fix the github repo cos it fixed a major issue that renders the extension useless.", "likes": 1}]}, {"topLevelComment": {"author": "Liam Converse", "text": "I suppose the process for making a vs code extension would be similar?", "likes": 0}}, {"topLevelComment": {"author": "Nurolkel", "text": "shoot could've been a nice introduction to making chrome extensions but It doesn't work. Going to have to tool it myself to see if I can make it work", "likes": 0}}, {"topLevelComment": {"author": "vafadie kongolo", "text": "a ad blocker", "likes": 1}}, {"topLevelComment": {"author": "LHebreu00 ivri", "text": "The uses of arrow functions make the code very difficult to understand for beginner (total lack of understanding the building of the code)", "likes": 1}}, {"topLevelComment": {"author": "Karam Khanna", "text": "🔥🔥🔥", "likes": 1}}, {"topLevelComment": {"author": "Liam Converse", "text": "I want to make a porn blocker extension", "likes": 0}}, {"topLevelComment": {"author": "REGO350", "text": "Ramen 🍜", "likes": 0}}, {"topLevelComment": {"author": "Doge Multiverse - Billionaire Wisdom Money Glitch", "text": "learning thru the chrome extension discord is amazing!", "likes": 2}, "replies": [{"author": "MD FAHIM", "text": "did it work??", "likes": 0}]}, {"topLevelComment": {"author": "Sunil Jadaun", "text": "Arrre  bhartiya   ...   feel  proud", "likes": 1}}, {"topLevelComment": {"author": "janvi", "text": "Hey if you seeking someone to add subtitles for you\nI can help", "likes": 1}}, {"topLevelComment": {"author": "Hoshiyar Deen", "text": "Solid js course please", "likes": 1}}, {"topLevelComment": {"author": "Alex Bright", "text": "This is what i did need yesterday and you posted this thanks❤️❤️❤️❤️❤️", "likes": 1}}, {"topLevelComment": {"author": "Mantis human", "text": "Great", "likes": 1}}, {"topLevelComment": {"author": "Patrick Taylor", "text": "Thanks for the tutorial!", "likes": 1}}, {"topLevelComment": {"author": "H Vijay", "text": "can u make Sid and hsid cookies sir?", "likes": 1}}, {"topLevelComment": {"author": "Abderrahman Fodili", "text": "An extension that detects when a YouTube ad plays , mutes my computer for five seconds and then automatically clicks skip ad and unmutes the computer", "likes": 2}, "replies": [{"author": "Abhinav Kumar", "text": "there are many ad blockers use them", "likes": 1}]}, {"topLevelComment": {"author": "Gaurish D'Souza", "text": "This is just amazing", "likes": 1}, "replies": [{"author": "frodelius", "text": "Was it too good to be true after all?", "likes": 1}]}, {"topLevelComment": {"author": " Mr. Fact Lee", "text": "Plse make video on full stack web development in one video which is longer like more than 30 hours and cover popular framework and libraries. Plese make a video", "likes": 1}}, {"topLevelComment": {"author": "516_Harsh Jain", "text": "I did code along with this tutorial, but actually the code is not working, it is not adding timestamps to extension", "likes": 5}, "replies": [{"author": "timislaw", "text": "@frodelius sorry haven't tried. I figured if you used the chrome dev debugger and go step by step you might find the issue", "likes": 0}, {"author": "frodelius", "text": "@timislaw I didn't get any errors, the bookmarks still didn't show up in the list. Does it work for you?", "likes": 0}, {"author": "timislaw", "text": "Use the chrome debug tools to see where it might be going wrong. Any errors that you're getting?", "likes": 0}, {"author": "frodelius", "text": "You can see in the console that it is adding timestamps on click of the Plus icon. It just fails to make them appear in the list when you click the extension. I am sure the author could be able to fix this if he really wanted, but it seems he is too preoccupied with something else. Let's hope he can find the time soon, or someone else with the know-how help us out.", "likes": 1}]}, {"topLevelComment": {"author": "LLouG", "text": "I've been learning js and html these past few days, this one seem like a fun adventure for when I finish the Scrimba course.", "likes": 30}, "replies": [{"author": "Jack Epner", "text": "Came here BECAUSE of the Scrimba course... Scrimba is far better for gaining understanding of what javascript does and how to use it.  But when it comes to a project... I was pretty disappointed to see the chrome extension project be nothing but a bookmark extension, which of course exists natively in all browsers.  Useless.  I'd at least like to spend my hours committed to a course building something that isn't completely worthless.", "likes": 0}]}, {"topLevelComment": {"author": "frodelius", "text": "Followed the instructions on how to install the extension, using Chrome on Windows 10. Nothing happens when I click the blue Plus icon, and when I click the My YT Bookmarks extension icon, it just says: Your bookmarks for this video (with nothing else...)", "likes": 0}, "replies": [{"author": "Simple Life", "text": "​@frodelius @Admin is a scammer, Never message him.", "likes": 0}, {"author": "frodelius", "text": "@Safe Do you have any suggestions why it doesn't work for me?", "likes": 0}, {"author": "frodelius", "text": "Actually, now that I check the Console, I do get a Console log output when I click the blue Plus: {time: 2089.02688, desc: 'Bookmark at '}", "likes": 0}]}, {"topLevelComment": {"author": "jitendra mistry", "text": "angular lecture please ??", "likes": 2}}, {"topLevelComment": {"author": "Preadsy 69", "text": "Very interesting!! This course is really exciting and modernistic", "likes": 3}}, {"topLevelComment": {"author": "Dheeraj Rawat", "text": "This is the thing i wanted from such a long  time", "likes": 2}}, {"topLevelComment": {"author": "Cbb Cbb", "text": "Is it possible to make Firefox extension", "likes": 1}}, {"topLevelComment": {"author": "Juhand Van.", "text": "I want to mark notification on Youtube that I have seen most recent. so the next time, when I open notification I can easily realize which is new.\nCan you make video to guide please", "likes": 1}, "replies": [{"author": "Juhand Van.", "text": "@MD FAHIM could you please more details", "likes": 0}, {"author": "MD FAHIM", "text": "but youtube alrady has that build in.", "likes": 0}]}, {"topLevelComment": {"author": "Amir Hassan", "text": "Good tutorial", "likes": 1}, "replies": [{"author": "frodelius", "text": "Yes it is, just a pity the extension doesn't work for me. Does it work for you?", "likes": 1}]}, {"topLevelComment": {"author": "Code Master", "text": "Nice tutorial, I was looking for such a video for a while. Thanks for your content 😍🤩", "likes": 12}}, {"topLevelComment": {"author": "Joey Lucas", "text": "Something I've wanted to do", "likes": 1}}, {"topLevelComment": {"author": "Follow Trend", "text": "Divine Blessings to all of you, FreeCodeCamp for all your hard work and passion to make our world a better place 👍❤️\nBig-Big-Big Thank you!", "likes": 3}}, {"topLevelComment": {"author": "Ahmed Z", "text": "... now for Firefox? Manifest v3 isn't as privacy-hating there", "likes": 2}}, {"topLevelComment": {"author": "Eitan Schwartz", "text": "Waited for tutorial like this for long time", "likes": 1}}, {"topLevelComment": {"author": "Shreedhar Pandey", "text": "This is gonna make me some good money.", "likes": 1}}, {"topLevelComment": {"author": "Abu Faizal", "text": "love it, thanks for making this video", "likes": 2}}, {"topLevelComment": {"author": "pastuh", "text": "Extensions helps when company programmers can't fast provide specific functions.", "likes": 6}}, {"topLevelComment": {"author": "ricky Pickens", "text": "scrimbaaa i neeed refund", "likes": 1}}, {"topLevelComment": {"author": "Ahmed Elkordy", "text": "We want svelte & svelte kit course .", "likes": 1}}, {"topLevelComment": {"author": "/* Ms. R */", "text": "Lol someone steal this idea for me, I wanna create Shazam -like extension", "likes": 1}}, {"topLevelComment": {"author": "Havohej", "text": "I love you guys <3", "likes": 1}}, {"topLevelComment": {"author": "Nodsaibot", "text": "lmao a chrome extension, whats next a java applet? flash animation?", "likes": 3}}, {"topLevelComment": {"author": "Lunolux", "text": "nice", "likes": 1}}, {"topLevelComment": {"author": "Siddharth", "text": "Can somebody help me i wanted to ask that if I have been provided with any extension can I know what all JavaScript library files are used in that extention?", "likes": 5}}, {"topLevelComment": {"author": "Tazim mahta", "text": "Yoo\n ! what a timing ❤❤❤", "likes": 2}}, {"topLevelComment": {"author": "kin tag44", "text": "Thank you M.r", "likes": 3}}, {"topLevelComment": {"author": "Raman Hundal", "text": "Hope everyone finds this video helpful and thank you FreeCodeCamp for posting this! Look forward to teaching everyone next time.", "likes": 14}, "replies": [{"author": "أحمد عبدربه Ahmed AbdRapo", "text": "Something is missing here\r\nHow do the extension is being updated on the flay?\r\nYou didn't even mention that part.", "likes": 0}]}, {"topLevelComment": {"author": "Meta crusader", "text": "Low-key wanted this. Love free code camp", "likes": 13}, "replies": [{"author": "who's afraid", "text": "​@Bekhruz Otaev it says it has meaning of restrained, like “of low or moderate intensity, not very forceful\" or chilly.", "likes": 1}, {"author": "Bekhruz Otaev", "text": "What's low-key?", "likes": 3}]}, {"topLevelComment": {"author": "EdgyMan", "text": "I've been looking for this course for so long", "likes": 20}, "replies": [{"author": "frodelius", "text": "Keep looking.", "likes": 0}]}, {"topLevelComment": {"author": "Aznood", "text": "aha i dont know anything about js, i need to learn it", "likes": 2}}, {"topLevelComment": {"author": "Abdulaziiz Abdulrashiid Rube", "text": "Courses for engineering is free?", "likes": 2}}, {"topLevelComment": {"author": "Ahmet Akyol", "text": "we are waiting for tauri tutorial", "likes": 3}}, {"topLevelComment": {"author": "Clown", "text": "We need lesson about creating extension for Firefox!!!!", "likes": 5}, "replies": [{"author": "Clown", "text": "ok i will check your github, thanks", "likes": 0}, {"author": "Okeowo Aderemi", "text": "I have created extension for FF/Edge and Chrome, the code are portable except for specific API(s), the same code will most likely work for the browsers", "likes": 3}]}, {"topLevelComment": {"author": "Ben Varkey", "text": "Was waiting ❤️", "likes": 4}}, {"topLevelComment": {"author": "No Copyright Gameplay Stock Videos", "text": "I am going to develop a pdf maker for the code in the webIDE.", "likes": 5}}, {"topLevelComment": {"author": "Pintarider Gaming", "text": "Ok this is crazy, i searched for this yesterday and now this came out", "likes": 6}, "replies": [{"author": "MD FAHIM", "text": "did you make it successfully?", "likes": 0}]}, {"topLevelComment": {"author": "Paul The Pigeon", "text": "for anyone thinking of making one and putting it in their resume: i would not recommend this for a resume project. \n\n1. it’s hard to get a ton of people to use\n2. the person reading your resume / recruiter will not open their computer and look for your extension to download. too much barriers so stick to normal projects.", "likes": 3}, "replies": [{"author": "frodelius", "text": "@Paul The Pigeon It doesn't work either so... Can you help in making it work? That would be something to put on your resume!", "likes": 0}, {"author": "Paul The Pigeon", "text": "@TJ Hooper i would still not recommend a chrome extension as a project to put on your resume and i know other experienced developers who say the same. There are many other projects that aren't chrome extensions that get people SWE jobs.\n\nYour extension would have to big massively successful, used by thousands or hundreds of thousands of people for it to hold any weight on your resume. recruiters see tons of resume's daily and they will not stop to search for, download and try out your chrome extension.", "likes": 0}, {"author": "TJ Hooper", "text": "This may be true, but also how many people put chrome extension projects on their resume? Especially junior developers? This could help a candidate stand out and show he/she is willing to learn more than the rudimentary todo list project.", "likes": 2}]}, {"topLevelComment": {"author": "Aditya", "text": "Gonna watch da whole thing. Who is stayin with me?", "likes": 4}}, {"topLevelComment": {"author": "Curtis Dyess", "text": "Android 12 S OS", "likes": 2}}, {"topLevelComment": {"author": "Rishi Raj", "text": "Thanks a million", "likes": 3}}, {"topLevelComment": {"author": "Universe Code", "text": "This is very cool, thanks guys 🤩", "likes": 10}}, {"topLevelComment": {"author": "CHRiS DESiGN STUDIOS", "text": "Freecode camp is incredible. One love❤️", "likes": 10}}, {"topLevelComment": {"author": "Mehroz Baig", "text": "👍", "likes": 3}}, {"topLevelComment": {"author": "Quran Urdu Translation Courtesy of Madani Channel ", "text": "Masha'Allah 🌹", "likes": 3}}, {"topLevelComment": {"author": "Quiyoma", "text": "Time to save to the PlayList of videos I wanna watch but will never watch", "likes": 46}, "replies": [{"author": "Rudranarayan Yadav", "text": "😀😀😀😅😆", "likes": 0}, {"author": "Boredom Index", "text": "😂", "likes": 0}, {"author": "Dimitri Vasilev", "text": "This one is only an hour long! I’m sure you can fit it in your schedule somewhere. I believe in you 💪", "likes": 1}, {"author": "Maxfrischdev", "text": "*cough cough* 😅🤣🤣🤣", "likes": 0}, {"author": "yochutes", "text": "😂", "likes": 0}]}, {"topLevelComment": {"author": "Benedict ocheme", "text": "(θ‿θ)", "likes": 0}}, {"topLevelComment": {"author": "Brijesh Morya", "text": "First", "likes": 2}}, {"topLevelComment": {"author": "TipsJazzInferno", "text": "First Comment Thank you mcuh great", "likes": 1}}, {"topLevelComment": {"author": "Harsh Jaiswal", "text": "Exactly what I was looking for", "likes": 71}, "replies": [{"author": "MD FAHIM", "text": "@Hamza El Maarouf did it work for you??", "likes": 0}, {"author": "Hamza El Maarouf", "text": "@frodelius and that's the question I'm looking for?", "likes": 0}, {"author": "frodelius", "text": "@Ana Well, does it work for you guys?", "likes": 0}, {"author": "Ana", "text": "Also, exactly what I was looking for! 😆", "likes": 0}]}, {"topLevelComment": {"author": "okoro bright", "text": "First🔥", "likes": 2}}, {"topLevelComment": {"author": "Jоrdиiаи  🇯🇴", "text": "♥️🇯🇴", "likes": 2}}, {"topLevelComment": {"author": "Honaok99", "text": "Fifth", "likes": 2}}, {"topLevelComment": {"author": "Praveen kumar", "text": "Awesome ❤️", "likes": 9}}, {"topLevelComment": {"author": "sid", "text": "first", "likes": 2}}, {"topLevelComment": {"author": "Muhammad Arslan", "text": "First", "likes": 2}, "replies": [{"author": "frodelius", "text": "\"So the last shall be first, and the first last: for many be called, but few chosen.\"", "likes": 0}]}, {"topLevelComment": {"author": "Arosh Jayamanna", "text": "1st comment", "likes": 2}, "replies": [{"author": "Dimash Yeszhan", "text": "@Arosh Jayamanna I just thought that commenting “First” on a vid about programming is weird", "likes": 0}, {"author": "Arosh Jayamanna", "text": "@Dimash Yeszhan lol you cared to get triggered .. 😆😆", "likes": 0}, {"author": "ScrimSi", "text": "@Dimash Yeszhan xd", "likes": 0}, {"author": "Honaok99", "text": "dd", "likes": 0}, {"author": "Dimash Yeszhan", "text": "no one cares", "likes": 0}]}]}