{"video": {"id": "0oSsLbh_Kv4", "title": "Django Tutorial - Create a Digital Resume with a Python Backend", "description": "Improve your Django skills by building a digital resume website. You are provided a free resume template and you will learn how to create the backend using Django and Python.\n\n✏️ Course from Bobby Stearman. Check out his channel: https://www.youtube.com/channel/UCitbHjDxcR3JBErnRLCuYkw\n\n💻 Template: https://github.com/bobby-didcoding/didcoding_resume_template\n💻 Django Code: https://github.com/bobby-didcoding/resume_app\n\n⌨️ (00:00) Intro \n⌨️ (01:28) Select template \n⌨️ (03:28) Start django project \n⌨️ (05:57) Backend \n⌨️ (44:06) Frontend \n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Wong Voon jinq\n👾 hexploitation\n👾 Katia Moran\n👾 BlckPhantom\n👾 Nick Raker\n👾 Otis Morgan\n👾 DeezMaster\n👾 AppWrite\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H22M23S", "likes": "3148", "views": "105902"}, "comments": [{"topLevelComment": {"author": "Did Coding", "text": "Thanks for posting this tutorial. I had a lot of fun putting it together. If I can help one developer get their dream job then I’ll chalk that down as a win 😀", "likes": 63}, "replies": [{"author": "Reden BLOODYROAR", "text": "Hello, I would like to know if this is a video for a django first timer. I have already my html and css file, do I need something else to follow the video ? I didn't do that much of back-end (just a bit for the development of an api with a tuto of ania) is it enough ? Thank you very much !", "likes": 1}, {"author": "Samira Hassannoor", "text": "I need a teacher", "likes": 2}, {"author": "Did Coding", "text": "@Alexander 😂😂😂", "likes": 0}, {"author": "Alexander", "text": "Thank you Jason Statham", "likes": 3}]}, {"topLevelComment": {"author": "雪花飄飄", "text": "4:10 I'm already stuck lolll\n(mkvirtualenv : The term 'mkvirtualenv' is not recognized as the name of a cmdlet, function, script file, or operable program. Che\r\nck the spelling of the name, or if a path was included, verify that the path is correct and try again.)", "likes": 0}}, {"topLevelComment": {"author": "Eanam Hossain", "text": "jazakallah, I create my first Django portfolio", "likes": 0}}, {"topLevelComment": {"author": "L R", "text": "Great video. Thank you! I have a question here. Why my own added static .svg files can't be desplayed in footer?", "likes": 0}}, {"topLevelComment": {"author": "business simplified", "text": "One of the worst tutorials ever", "likes": 0}}, {"topLevelComment": {"author": "Knife", "text": "what a nice tutorial you can copy paste !", "likes": 0}}, {"topLevelComment": {"author": "Sankar Kumaravel", "text": "Where you are copy and pasting the codes can you explain it", "likes": 1}}, {"topLevelComment": {"author": "Umeleuma B. Marcus", "text": "Would have been a great tutorial if you'd type the code out.\n\nGo check out Dennis Ivy and learn", "likes": 1}}, {"topLevelComment": {"author": "Shib Mobileverse", "text": "6 minutes in and it's been over 2 hours of Googling to fix errors, BS Copy and Paste Code with limited explanation, constant BS, absolutely fruitless.", "likes": 0}}, {"topLevelComment": {"author": "Shib Mobileverse", "text": "ABSOLUTE TRASH", "likes": 0}}, {"topLevelComment": {"author": "Dmitriy Nayanov", "text": "If you don't see skills, do two things:\n1. find in index.html a string \"<div class=\"progressCard\">\" and two strings below change \"{% if sk.is_key_skill %}\" to \"{% if not sk.is_key_skill %}\" (condition \"not\" is needed here)\n2. In admin panel in your user profile select all the skills holding down a key Ctrl, press Save\nEnjoy :)", "likes": 2}}, {"topLevelComment": {"author": "Dmitriy Nayanov", "text": "Ive just watched it. It's messin' with my head.", "likes": 0}}, {"topLevelComment": {"author": "venkatesh akhouri", "text": "Can you explain what is class meta doing, in models.py. We created it inside Skills class as well as User class?", "likes": 0}}, {"topLevelComment": {"author": "pcdc dc", "text": "Hi bobby ,\nappreciate it thanks so much ,\nIn Index.html this   Line <div class=\"progress-bar\" role=\"progressbar\" style=\"width: {{sk.score}}%\" aria-valuenow=\"{{sk.score}}\" aria-valuemin=\"0\" aria-valuemax=\"100\"></div  plz can u help me bit details,", "likes": 0}}, {"topLevelComment": {"author": "Daniel Mbazu", "text": "Am getting an error when I try to do (import main.signals) on my app, I had to comment out the code to continue with the tutorial but i want to understand how to fix the issue, please how do i go about it?", "likes": 0}}, {"topLevelComment": {"author": "Linda Lu", "text": "I meet with a problem - after deleted and added several times \"skills\", the backend \"skills\" part can't appear at frontend any more. The ID in backend \"skills\" part continue count incremently. May I ask how to do?", "likes": 1}, "replies": [{"author": "Dean Pierrot", "text": "Try highlighting the skills and then save. Should work from there.", "likes": 0}, {"author": "ombima Titus", "text": "Hello, did you find a solution. I have the same problem.", "likes": 0}]}, {"topLevelComment": {"author": "Wafula Lukorito", "text": "A warning to those who are not experts in Django. This is not a tutorial, the instructor does a lot of copy and pasting without bothering to explain. Do not follow this, it is not a tutorial as it claims", "likes": 1}, "replies": [{"author": "syaoran sakura", "text": "@Dmitriy Nayanov check tomi video about python backend development course. It's really good. I am beginner too and found his course it's really made me understand a little bit about django", "likes": 1}, {"author": "syaoran sakura", "text": "Same with me. But I just watch it. But it's full of copy paste code. Not really satisfying to watch", "likes": 0}, {"author": "Dmitriy Nayanov", "text": "This video is my first experience in Django. I did not understand anything :)", "likes": 0}]}, {"topLevelComment": {"author": "Vice Šodan", "text": "This is not a tutorial, it is a copy-paste journey. \nDo not recommend for people who are here to learn Django", "likes": 4}}, {"topLevelComment": {"author": "JakeTheHuman", "text": "What a fantastic tutorial. Exactly what I needed. Thank you so very much for your hard work!", "likes": 0}}, {"topLevelComment": {"author": "Leo Montagut", "text": "Can't get the progress bar or the skills/key skills to show up... any toughts?", "likes": 0}}, {"topLevelComment": {"author": "BUNNY Bharath", "text": "is it possible if i can do this project in pycharm?", "likes": 0}}, {"topLevelComment": {"author": "Mg Edits", "text": "workon is not working help\nPleaseee\ni need to finish this project fast", "likes": 0}}, {"topLevelComment": {"author": "Cyprian Czerwiński", "text": "I love this one, but i have a problem with rendering the skills. They just wont appear.", "likes": 1}, "replies": [{"author": "Linda Lu", "text": "@Leo Montagut Thank you, Leo. May I ask am I right? I tried logged into the Django admin page and click the check box before the skills, but I can't find save.", "likes": 0}, {"author": "Leo Montagut", "text": "@Linda Lu sorry, I ment the frontend, the admin webpage when you add skills manually and click + sign", "likes": 0}, {"author": "Leo Montagut", "text": "@Linda Lu In the backend admin section Ctrl + click to select all skills that you logged no matter if they are key skills or not, just select them and click save", "likes": 0}, {"author": "Linda Lu", "text": "@Leo Montagut May I ask do you mean the backend \"admin section\", and select \"Is key skill\"?", "likes": 0}, {"author": "Leo Montagut", "text": "@Joseph Joju i fixed it, i just selected the skills in the admin section of django and clicked save. Try it!", "likes": 0}]}, {"topLevelComment": {"author": "Nyan Pasu", "text": "hi i did not do the first step, do you have a video about installing python environment do not make virtualevn", "likes": 0}}, {"topLevelComment": {"author": "Kazi Islam", "text": "Thank You Sir", "likes": 0}}, {"topLevelComment": {"author": "Syed Noveedh", "text": "Hi,\n\nCan I use this template for myself and can host?", "likes": 0}}, {"topLevelComment": {"author": "Balakumar .N", "text": "#responsiveportfolio #portfoliowebsite", "likes": 0}}, {"topLevelComment": {"author": "Scooter Girl", "text": "My only criticism is that I wish this came out 3 years ago lol.", "likes": 0}, "replies": [{"author": "monika chivate", "text": "😂😂", "likes": 0}]}, {"topLevelComment": {"author": "Avery Chang", "text": "Please help me!\nI got \"path(' ', include('main.urls',namespace='main'))  NameError: name 'include' is not defined\" error messages\nafter running \"python manage.py makemigration\" , and I tried to add \"from django.conf.urls import include\" at urls.py,\nbut this error is still there......", "likes": 0}, "replies": [{"author": "Avery Chang", "text": "@Rodrigo Alarcón  Thank you very much, I'll try it later~", "likes": 1}, {"author": "Rodrigo Alarcón", "text": "Hey... your import is wrong, is not \"django.conf.urls\" is from \"django.urls.conf\"", "likes": 0}]}, {"topLevelComment": {"author": "eoin vaughan", "text": "Does anyone know how to easily change the color scheme,  have tried to modify the style.css file by changing the `: root {}` default colors but this doesn't change anything. Help would be appreciated.", "likes": 3}}, {"topLevelComment": {"author": "노잼No Jam", "text": "commands like workon and mkvirtualenwrapper keeps giving me errors any tips?", "likes": 2}}, {"topLevelComment": {"author": "Aravind Reddy", "text": "Sir can you make a video about how to create own Operating system", "likes": 0}, "replies": [{"author": "Dmitriy Nayanov", "text": "In two hours, haha", "likes": 0}]}, {"topLevelComment": {"author": "Haider Ali", "text": "The website hosting is free?", "likes": 1}}, {"topLevelComment": {"author": "Rowdy boys", "text": "I want django projects  sir", "likes": 0}}, {"topLevelComment": {"author": "eoin vaughan", "text": "I'm having difficulty at adding coding skills with the code provided, also when I add key skills I'm getting it populated for the coding skills section of the web page. Any thoughts?", "likes": 2}, "replies": [{"author": "Linda Lu", "text": "@Joseph Segbefia Thank you! I solved the same problem according to your solution. For mine, the skills box must remain unselected. And the \"if not\" works. I tried delete if loop, just keep the content, it also works.", "likes": 1}, {"author": "eoin vaughan", "text": "@Joseph Segbefia Awesome, found it thanks to you. New to this so getting my head around how all the pieces fit together and talk to each other. Very interesting stuff.", "likes": 1}, {"author": "Joseph Segbefia", "text": "@eoin vaughan in the index.html file. Under the h4 tag with the text coding skills  there is a for loop and under the for loop there is an if statement. That is the one i am referring to.", "likes": 2}, {"author": "eoin vaughan", "text": "@Joseph Segbefia if statement where? which file are you referencing?", "likes": 1}, {"author": "Joseph Segbefia", "text": "I had the same problem, I realised that in the admin section under user profiles, all skills present in the skills box must remain selected to get rendered on the front end. An on the front end under the coding skills section,  and within the if statement add the word 'not' right after the 'if'. It should work from now on.", "likes": 2}]}, {"topLevelComment": {"author": "Bob Loblaw", "text": "How to get this to run?", "likes": 0}}, {"topLevelComment": {"author": "RUBEL", "text": "22:57", "likes": 0}}, {"topLevelComment": {"author": "Mj Tech Journey", "text": "Thank you for the lovely course in a short time. ♥️", "likes": 0}}, {"topLevelComment": {"author": "Richard Green", "text": "You could improve this by suggesting its intended audience. There are many unexplained steps which assume prior knowledge of Django (or at least an uncritical approach to copying code without review).", "likes": 12}, "replies": [{"author": "cain abel", "text": "@D Israel \n\nGood questions, the first two questions I would answer \"yes\". I believe in both self-improvement as well as learning new ideas and concepts. \n\nTo answer you final question I have a schedule in which I follow to make sure I get the things I want to get done. Mine you it is not a todo list I took a masterclass from a guy from MIndvalley who stated that TOO list are not the way to go.\n\nYou can see a short 3 mins intro\n\nhttps://www.youtube.com/watch?v=N2aSKmV6obg", "likes": 0}, {"author": "D Israel", "text": "@cain abel wow that really facsinating what you've shared.. \n\nAre you trying to \"improve yourself\" in a sense of trying to be the best version of your self e.g. reddit self improvement and YouTube videos about self improvement books summarize etc or you simply like learning new stuff regardless of self improvement ideas?\n\nAlso do you learn other videos-projects at the same time or only doing this one everyday?", "likes": 0}, {"author": "cain abel", "text": "@D Israel \n\nMost people would say to make money but for me I love learning, I love learning about all sort of things new technologies, old technologies,  software, hardware, history, poetry, cooking,  English literature, math, languages,  drawing, etc, but I do not learn these things to lord it over someone but rather to acquire knowledge in order to improve myself.  It is hard to quantify the hunger I feel when it comes to learning and acquiring knowledge, most people do not understand the need I feel to learn, to acquire knowledge not for money but for the sake of knowledge itself.\n\nTo answer you question my motivation for learning to code is because I find it extremely interesting, the way lines of characters come together in order to create a piece of a software,  as a by product if I were to make money out of it then great if not then I still okay with it.\n\n  I am at around 1:19:19 mark because they were certain things that did not work and I had to do a little bit of research in order to get it to work.", "likes": 0}, {"author": "D Israel", "text": "@cain abel what's your motivation to learn coding? Is to make a lot of money , or you just find it all interesting?\nP.s. did you follow this whole 1;22;22 tutorial?", "likes": 0}, {"author": "D Israel", "text": "I agree missing lots of explanation too many copy paste", "likes": 2}]}, {"topLevelComment": {"author": "kester dave", "text": "Please help me , I just want to know which is best to learn In 2021, django or node js ??", "likes": 0}}, {"topLevelComment": {"author": "Ryan Evaristo de Lima", "text": "great teaching, hugs from Brazil", "likes": 0}}, {"topLevelComment": {"author": "Saransh Thukral", "text": "Ay yo ppl i have issues with running mkvirtualenv  ---says already exist ,\nBut on workon :\n C:\\Users\\PC\\Envs\\resume_demo\r\n    doesn't contain a virtualenv (yet).\r\n    Create it with \"mkvirtualenv resume_demo\"\n\nHow to resolve ..", "likes": 2}}, {"topLevelComment": {"author": "Abdullokh Alimov", "text": "Keep Publishing Django Courses!", "likes": 1}}, {"topLevelComment": {"author": "Enrico Saccheggiani", "text": "Wonderful  !!!!   I have shared in my linkedin Network", "likes": 1}}, {"topLevelComment": {"author": "krnl tth", "text": "Hi, could you do Verilog tutorial?", "likes": 3}, "replies": [{"author": "Perrissonwhitestone   Gmail Com", "text": "⬆️ Available", "likes": 0}]}, {"topLevelComment": {"author": "Pranav Bakare", "text": "Absolutely amazing 👏 Thank you so much and we All are looking forward for your collaboration further!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "මැහුම් LK", "text": "Please do a tutorial on how to make a Social Media website using Django...❤️", "likes": 1}, "replies": [{"author": "UzoAfrica", "text": "I am interested too", "likes": 0}, {"author": "Perrissonwhitestone   Gmail Com", "text": "Msg for guide", "likes": 0}]}, {"topLevelComment": {"author": "Andile Ntsele", "text": "😭😭😭 please help!!\n\ndeprecated gradle features were used in this build making it incompatible with gradle 8.0. android", "likes": 0}, "replies": [{"author": "Perrissonwhitestone   Gmail Com", "text": "Dm", "likes": 1}]}, {"topLevelComment": {"author": "CrunchtimeTV", "text": ".", "likes": 0}}, {"topLevelComment": {"author": "xxx xxx", "text": "Give us MEVN stack or Full Secure auth with JWT", "likes": 0}}, {"topLevelComment": {"author": "shau rya", "text": "most django tutorials spend a good first 15 minutes setting eveyrthing up that's kinda hard for a beginner to grasp. no IDE has a nice integration either.", "likes": 10}, "replies": [{"author": "Faiq Ali", "text": "Pycharm has nice integration", "likes": 0}, {"author": "Perrissonwhitestone   Gmail Com", "text": "DM for guide", "likes": 0}]}, {"topLevelComment": {"author": "Griffin Cosgrove", "text": "Didn't know Tim Ferris knew python", "likes": 2}, "replies": [{"author": "Did Coding", "text": "😂😂😂", "likes": 1}]}, {"topLevelComment": {"author": "Sitraka FORLER", "text": "Well ….ok I will try 😂", "likes": 1}}, {"topLevelComment": {"author": "Kaustubh Jadhav", "text": "How to create virtual environment like that?", "likes": 4}, "replies": [{"author": "Aditya Parida", "text": "You have to install virtualenv using pip command then create virtual environment using command \"virtualenv venv\", then go inside the script folder which is inside the venv folder to activate virtual environment.  \nNote: instead of venv you can use any name for that.", "likes": 0}, {"author": "Ahbar Ahad", "text": "I haven't watched the video but I'm guessing you are asking about how to generate a virtual environment for python projects, the answer is: \"venv\" or \"pipenv\"", "likes": 0}]}, {"topLevelComment": {"author": "Adrian Dev", "text": "En español por favor 🙏🙏🙏🙏", "likes": 2}, "replies": [{"author": "chavaspada", "text": "Aprende inglés, un dev que no sabe inglés es un dev que no va a poder mejorar, ya que la documentación de casi todos los lenguajes y frameworks están en inglés.", "likes": 1}]}, {"topLevelComment": {"author": "Simba Mandeya", "text": "Thank you, quite informative!", "likes": 2}}, {"topLevelComment": {"author": "MarshmelloPlays", "text": "I love seeing this guy at the start of every video ❤️❤️❤️", "likes": 9}}, {"topLevelComment": {"author": "Aditya Parida", "text": "Wish someone teach with mysql and django.", "likes": 4}, "replies": [{"author": "Aditya Parida", "text": "@Did Coding okay then I'll wait for that, Thank you for responding.", "likes": 0}, {"author": "Did Coding", "text": "I’ll put a tutorial together with MySQL next time 👍", "likes": 5}]}, {"topLevelComment": {"author": "TECH IN 5 MINUTES", "text": "Django is interesting because it has stable ways of working with some modules. You can choose them when you need them, saving you a lot of time, money, and effort, getting all the solutions right out of the box.", "likes": 38}, "replies": [{"author": "Raikumar Khangembam", "text": "Yes, it saves time because of built in the admin panel. So far we created 5 to 7 projects. Clients have been using that with no complaint. \nPrevious 3 years ago I used PHP and its framework laravel and slim. It needed to create an admin panel separately from scratch.", "likes": 1}, {"author": "Did Coding", "text": "I’m a big Django fan!", "likes": 0}]}, {"topLevelComment": {"author": "Shuvadeep Paul", "text": "Thank you sir 🥰🙏", "likes": 1}, "replies": [{"author": "Did Coding", "text": "No worries. Glad you like it", "likes": 1}]}, {"topLevelComment": {"author": "ABDUL HAQ", "text": "👌🏻🔥", "likes": 1}}, {"topLevelComment": {"author": "Md. Yasin Arafath Piyal", "text": "BEST channel  on YOUTUBE", "likes": 3}}, {"topLevelComment": {"author": "abc def", "text": "💜💜💜💜", "likes": 2}}, {"topLevelComment": {"author": "Aiden Pearce", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "xzandyaxis", "text": "Hi", "likes": 1}}, {"topLevelComment": {"author": "Fahad Bawazir", "text": "Good", "likes": 1}}]}