{"video": {"id": "1NSPAz1Qc-I", "title": "Full Stack Web App using Vue.js & Express.js: Part 4", "description": "Welcome to part 4 of a new series where I will create a full stack web application using Vue.js and Express.js\n\nGitHub repo: https://github.com/codyseibert/tab-tracker\n\nFollow Cody on Twitter: https://twitter.com/CodyLSeibert\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT1H10M1S", "likes": "505", "views": "58310"}, "comments": [{"topLevelComment": {"author": "CrimsonSlayer7", "text": "5:50, 16:07, 19:32, 29:19, 1:01:38", "likes": 0}}, {"topLevelComment": {"author": "Olatunbosun Dare", "text": "Incase v-layout and v-flex isn't working properly, v-layout has been replaced with v-row, and v-flex has been replaced with v-col, and you have to use cols=\"4\" as a replacement for xs4... Loving the challenge so far...", "likes": 0}}, {"topLevelComment": {"author": "Paul T", "text": "hey everyone. been following this guide in 2021 and it's been really helpfull.  i'm stuck in the part where we bind each textfield with the prop v-model. It doesn't seem to work when i type song.title for exemple. Anyone has ideas on how to solve this? that's with vuetify 2.4", "likes": 0}}, {"topLevelComment": {"author": "Roxana González", "text": "did you consider the SEO for this project'?", "likes": 0}}, {"topLevelComment": {"author": "iheb dhouibi", "text": "there is a better way to do required fields check using this : this.$refs.form.validate() \nyou have to add a ref to the v-form tag though", "likes": 0}}, {"topLevelComment": {"author": "Enrico Dell'Aquila", "text": "Ready to go to part 5, following in 2020... many things have changed. Different versions, deprecated features, different syntax/behaviour of some module (in particular the hash part)... but still I was able to follow and modify accordingly... still a great tutorial.\nI wonder if there will be at least an updated version of the files on github...", "likes": 1}, "replies": [{"author": "Jeevan sira manjunath", "text": "@Enrico Dell'Aquila i needed till 4th part ,so i think u have that so it would be very help full for me if u push those", "likes": 0}, {"author": "Enrico Dell'Aquila", "text": "@Jeevan sira manjunath I'm stuck on the last chapter, part 7.\nI'm proceeding very slowly as now he's covering some aspect I'm not quite interested, and I'm eager to start my own project.\nBut sooner or later I think I'll conclude the course, and at that point I think a push to github should be easy to do... cannot say when, though.", "likes": 0}, {"author": "Jeevan sira manjunath", "text": "can u please share a github link of your newer version of code please", "likes": 0}]}, {"topLevelComment": {"author": "Siddharth Thakur", "text": "Vuetify has surely evolved soo much now...", "likes": 0}}, {"topLevelComment": {"author": "Flavien", "text": "9:36 Slots vuejs\n37:33 Frontend create new song\n1:01:35 Style views songs", "likes": 0}}, {"topLevelComment": {"author": "Frédéric Chopin", "text": "The <v-icon>add</v-icon> does not work anyomore, you must use <v-icon>mdi-plus</v-icon>", "likes": 1}}, {"topLevelComment": {"author": "fdR", "text": "But no one is facing issues with displaying the image in Songs.vue? I get broken image or none at all (height 0 inspecting the element). I'm referring to <img class=\"album-image\" :src= \"song.albumImageUrl\" alt=\" Album Cover\" />", "likes": 1}}, {"topLevelComment": {"author": "Mauro Insacco", "text": "If I try to post a song with no data in it it just creates a Song with blank data, not sure of what I forgot,  can anyone help? He doesn't seem to add a \"required\" field to his table, I dont get it :(", "likes": 0}, "replies": [{"author": "Kevin Brown", "text": "It looks like adding this nonEmpty validation in Songs.js makes it require a non-empty string\ntitle: {\n      type: DataTypes.STRING,\n      validate: {notEmpty: true}\n    },", "likes": 0}, {"author": "Kevin Brown", "text": "I am having this same issue. Not sure what it is on the User that requires it to have data in the fields. Maybe it's something in the AuthenticationControllerPolicy?", "likes": 0}]}, {"topLevelComment": {"author": "Arnold", "text": "Almost done with part 4. I can't figure out why I'm always getting false on areAllFieldsFilledIn. Is anyone experience the same? Thank you\nmethods: {\n    async create () {\n      // Validate the all mandatory fields were satistified\n      this.error = null\n      const areAllFieldsFilledIn = Object\n        .keys(this.song)\n        .every(key => !!this.song[key])\n      if (!areAllFieldsFilledIn) {\n        console.log(areAllFieldsFilledIn)\n        this.error = 'Please fill in all the required fields.'\n        return\n      }\n      // Call API\n      try {\n        await SongsService.post(this.song)\n        this.$router.push({\n          name: 'songs'\n        })\n      } catch (err) {\n        console.log(err)\n      }\n    }\n  }", "likes": 0}, "replies": [{"author": "Arnold", "text": "This is resolved. I had a typo in the html side :)", "likes": 0}]}, {"topLevelComment": {"author": "AppSeed App Generator", "text": "Hello coders, \nthanks for checking out this UI-Ready Vue.js / Express starter. \nMore here: https://blog.appseed.us/fullstack-vuejs-express-app-argon-design/ \nAppSeed.us - Full Stack App Generator", "likes": 0}}, {"topLevelComment": {"author": "Vitaliy Ostapchuk", "text": "Great tutorials!! Was interested in Vue, but didn't see any full-stack dev like that yet. So thanks very much for the work!\n\nCan I ask how you actually change those many lines at once?", "likes": 1}, "replies": [{"author": "dejo095", "text": "There are plenty of ways to change multiple data in Vsc. I mostly dbl click name then press F2 to refactor, this will change name thru your project. You can alsi use ALT plus mouse click to put as many cursors as you want and just start typing... Also dbl click on name then CTRL+D will select multiple instances of your selected text", "likes": 1}]}, {"topLevelComment": {"author": "Anu Gaavar", "text": "some people might encounter problems with login end point, we have to delete the beforeSave hooks. that is a bug in the code", "likes": 2}}, {"topLevelComment": {"author": "McDonut", "text": "Question, how do you handle files (images, pdfs, etc)? Does the file get send through axios to the backend to be stored? and then how does the client get access to the files on the server?", "likes": 1}}, {"topLevelComment": {"author": "Darius Goore", "text": "really helpful series. 2 things in particular. I am familiar with RoR, so when you make comparisons to that framework/language, it is very helpful to me. eg, subcomponents remind me of partials in rails and slot tags seem very much like yield tags in rails. otoh, a service seems to be a mix between a model and controller. I imagine to the extent ou have other analogies i imagine it would help others understand as well Secondly, I very much appreciate you showing how you troubleshoot using the docs instead of pretending that everything went perfectly on the first go through!", "likes": 0}}, {"topLevelComment": {"author": "DJ Samke", "text": "Hey Cody, Say you have a list of ids [1,2,3,4,5,6,8,9] and you use :key=\"song.id\" and then later we delete id=4 and we're left with [1,2,3,5,6,7,8,9]. How will this affect the iterator? Will it know to go '3' then '5' or will it crash? Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Alexander P", "text": "If you have vetur installed in vscode type `scaffold` to generate basic template\nAnd you can iterate through object to build a form:\n\n<v-text-field v-for=\"(item, key) in song\"\n  :key=\"key\"\n  type=\"text\"\n  :name=\"key\"\n  :label=\"key\"\n  autocomplete=\"off\"\n  clearable\n  v-model=\"song[key]\"></v-text-field>\n\ndata() {\n    return {\n      song: {\n        title: '',\n        genre: '',\n        artist: '',\n        album: '',\n        albumImage: '',\n        youtubeId: '',\n        lyrics: '',\n        tab: ''\n      }\n    };\n  }", "likes": 0}}, {"topLevelComment": {"author": "Razva Cos", "text": "SAILS. JS + VUE. JS and jwt auth please", "likes": 0}, "replies": [{"author": "AppSeed App Generator", "text": "Hello Razvan, \nYou need help to integrate JWT in Sails?", "likes": 0}]}, {"topLevelComment": {"author": "ZhorZhan", "text": "That thing that you don't know to much about some specifics, makes this tutorial special and easy to understand, that's because you're solving things you don't know in realtime.", "likes": 1}}, {"topLevelComment": {"author": "Maximilian Berkmann", "text": "Why don't you use v-textarea?\n\nAlso, you can simply specify to=\"...\" in a v-btn instead of encapsulating inside a router-link.\nSo no need to use a navigateTo function.\n\nA quick tip which I recently learnt: use rem to allow the user to have font size being relative to what he/she set it in his/her browser which wouldn't change the pixel unit text but would do so for those using rem/em units (for accessibility sake)", "likes": 1}}, {"topLevelComment": {"author": "Game Academy", "text": "Thank you so much for this video", "likes": 0}}, {"topLevelComment": {"author": "Tess Porter", "text": "hey! I am at the very tail end of this tutorial and for some reason I cannot get the router and the navigateTo function to work for the view song button. Is there supposed to be a navigateTo function in the Songs.vue file?", "likes": 0}}, {"topLevelComment": {"author": "Leon Helland", "text": "You actually could use mixins to extract some general/repetitive functions, methods, even lifecycle hooks into a mixin-file and then import it into your components.", "likes": 1}}, {"topLevelComment": {"author": "Tyler Williams", "text": "You mentioned that you would like .Vue files to generate the template script style...etc tags without a copy  and paste. I am not sure if it was the vue extension in VS Code but I can type scaffold and hit enter and it adds it all for me.", "likes": 3}, "replies": [{"author": "Maximilian Berkmann", "text": "That's because VS Code doesn't pre-fill files based on templates like WebStorm and PhpStorm does.\nPlus, Cody doesn't seem to be the kind of coder who would create/use templates/snippets to type short stuff to get say a full base of a file (`<template>...</template> <script>...</script> <style scoped>...</style>`) which is doable in Sublime Text and normally also in VS Code.", "likes": 0}]}, {"topLevelComment": {"author": "Daniil Vatahovych", "text": "Very nice and interesting!", "likes": 0}}, {"topLevelComment": {"author": "rojimark", "text": "I see so many people started this tutorial but it got fewer and fewer as it went on. \nThumbs up to those who are still here. \nThe rest might have already given up ;)", "likes": 59}, "replies": [{"author": "Ecsa", "text": "Or maybe 'cause this it's not what they need", "likes": 1}, {"author": "E Karim", "text": "Yeah lol I'm following this tutorial just to get familiar (and quickly) with Vuejs since I am a backend developer and don't know much about Vuejs and i need to implement it in a project.", "likes": 2}, {"author": "KtoByłPierwszy ?", "text": "For me every 1h part of this TT it's something like  2-4hours in real time : when i add documentation and try to understanding how things works - great stuff !", "likes": 7}]}, {"topLevelComment": {"author": "alonza thompson", "text": "Nice job with the architecture really like how you set up the project structure.", "likes": 0}}, {"topLevelComment": {"author": "Kettle-Potato", "text": "Hey Cody.  I am on Part 4 right now...I see you are, at this point, using SQLite...is the final version going to be deployed using a different database (e.g. MySQL or PostgreSQL)? just curious...", "likes": 4}}, {"topLevelComment": {"author": "Iain Diamond", "text": "I'm really enjoying this video series, so many thanks Cody! \n\nAlso, I'd like to recommend using a tool like DB Browser for SQLite (http://sqlitebrowser.org). I find it useful to see what's happening inside the database as well as edit specific fields during development. This becomes especially helpful as apps grows more complex.", "likes": 6}, "replies": [{"author": "Rui Ferreira", "text": "you can also just create routes for get methods to return the json of all the database entries.\nit's not as pretty but it's still as usefull to view the data.", "likes": 0}]}, {"topLevelComment": {"author": "longX0R", "text": "On the button to navigate to name route: <v-btn :to=\"{name: 'songs-create'}\" .. .>", "likes": 1}}, {"topLevelComment": {"author": "Gil", "text": "At 55:30 you can navigate with a <v-btn to=\"songs/add\" ... >", "likes": 12}, "replies": [{"author": "Ivan Miljanić", "text": "Yes but what if you need to change all routes from project, then its easy to only change route from component in routes.js file", "likes": 0}, {"author": "Gil", "text": "Also at 1:00:00 instead of a your <div class=\"danger-alert\"/> you can use the builtin alert like so => \n<v-alert\n        class=\"ml-4\"\n        :value=\"error\"\n        transition=\"scale-transition\"\n        error>\n        {{error}}\n</v-alert>", "likes": 6}]}, {"topLevelComment": {"author": "Gil", "text": "Around 30:00 the reason why your backend is crashing is because you started to define your Song's model with the attribute \"albumImage\" and  \"youtubeId\". You saved your file, the DB recorded the table as it is. Then you changed this attribute to \"albumImageUrl\" and \"youtubeIdUrl\". So now the model Song doesn't match what the engine is looking for.\n\nA .sync({force: true}) drop the previous table and create one with the last model. :D", "likes": 2}}, {"topLevelComment": {"author": "墨翟嗨喽", "text": "Can you demonstration the refreshToken in the login features? thank you^^", "likes": 1}}, {"topLevelComment": {"author": "Kraulain", "text": "These tutorials are invaluable. Thanks so much for everything", "likes": 13}}, {"topLevelComment": {"author": "blyat", "text": "OMG, I love how fast you're going with this. Let's make love!", "likes": 2}}, {"topLevelComment": {"author": "Mr.Nobody", "text": "Hey cody i have a question i started watching your first video the intro and you said open the console but i dont know how im new to coding. and i dont know how to download anything can you plsss help me set up everything so that i can start. And also everytime i try to download something that you say this comes up npm : The term 'npm' is not recognized as the name of a cmdlet, function, script file, or operable program. Check the spelling of the\nname, or if a path was included, verify that the path is correct and try again.\nAt line:1 char:1\n+ npm install -g vue-cli\n+ ~~~\n    + CategoryInfo          : ObjectNotFound: (npm:String) [], CommandNotFoundException\n    + FullyQualifiedErrorId : CommandNotFoundException.What do i do ?. Best Regards Angel :)", "likes": 0}, "replies": [{"author": "Mandeep Kundal", "text": "The 'npm' error probably shows up because it seems that you don't have Node.js installed in your pc/laptop. Open https://nodejs.org/en/ and install the latest version of node. Good luck!", "likes": 0}]}, {"topLevelComment": {"author": "Gede Arya Indra Prabawa", "text": "Hey cody, thank you so much for this inspiring tutor :)  can i request a video of simple full stack web apps using vanilla js ?  Cause im still a beginner and i really want to learn the fundamentals on how creating web apps. Thank you so much :))", "likes": 0}, "replies": [{"author": "Gil", "text": "Hey Joe ! If you let me give you an advice. If you want to mastered JS a little bit more to be fully award about what you are doing that's great. I can point to you this amazing tutorial from Wes Bos : https://javascript30.com/\n\nThen when you will want to build a real app you won't want to reinvent to wheel and become as productive as possible. So you will need to learn a framework like Angular/React/Vue.\n\nBut Cody here explain a lot of concept. But you need to have some knowledge in programming in general. Also what can be a bit  disturbing is the ES6 syntax. You can easily find nice materials on the web too.", "likes": 1}]}, {"topLevelComment": {"author": "Ayorinde Adesugba", "text": "Great job again... If you install the VS Code extension vetur, you can scaffold the basic vue file with 'sca'", "likes": 8}, "replies": [{"author": "elhe26", "text": "Could you please explain how? Beginner here, hehe.", "likes": 0}]}]}