{"video": {"id": "2SpuBqvNjHI", "title": "Maths for Programmers Tutorial - Full Course on Sets and Logic", "description": "Learn the maths and logic concepts that are important for programmers to understand.\n\nShawn Grooms explains the following concepts:\n\n⌨️ (00:00) Tips For Learning\n⌨️ (01:32) What Is Discrete Mathematics?\n⌨️ (03:45) Sets - What Is A Set?\n⌨️ (06:22) Sets - Interval Notation & Common Sets\n⌨️ (08:25) Sets - What Is A Rational Number?\n⌨️ (10:18) Sets - Here Is A Non-Rational Number\n⌨️ (12:17) Sets - Set Operators\n⌨️ (13:45) Sets - Set Operators (Examples)\n⌨️ (15:49) Sets - Subsets & Supersets\n⌨️ (17:30) Sets - The Universe & Complements\n⌨️ (20:02) Sets - Subsets & Supersets (Examples)\n⌨️ (21:56) Sets - The Universe & Complements (Examples)\n⌨️ (24:16) Sets - Idempotent & Identity Laws\n⌨️ (25:14) Sets - Complement & Involution Laws\n⌨️ (27:08) Sets - Associative & Commutative Laws\n⌨️ (28:42) Sets - Distributive Law (Diagrams)\n⌨️ (30:22) Sets - Distributive Law Proof (Case 1)\n⌨️ (32:07) Sets - Distributive Law Proof (Case 2)\n⌨️ (33:48) Sets - Distributive Law (Examples)\n⌨️ (35:25) Sets - DeMorgan’s Law\n⌨️ (37:32) Sets - DeMorgan’s Law (Examples)\n⌨️ (39:38) Logic - What Is Logic?\n⌨️ (41:26) Logic - Propositions\n⌨️ (43:06) Logic - Composite Propositions\n⌨️ (44:41) Logic - Truth Tables\n⌨️ (46:30) Logic - Idempotent & Identity Laws\n⌨️ (48:13) Logic - Complement & Involution Laws\n⌨️ (49:58) Logic - Commutative Laws\n⌨️ (51:35) Logic - Associative & Distributive Laws\n⌨️ (53:09) Logic - DeMorgan’s Laws\n⌨️ (54:23) Logic - Conditional Statements\n⌨️ (55:45) Logic - Logical Quantifiers\n⌨️ (57:59) Logic - What Are Tautologies?\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT1H8S", "likes": "38515", "views": "1177012"}, "comments": [{"topLevelComment": {"author": "freeCodeCamp.org", "text": "Want to learn more about logic for programmers? Watch this next: https://youtu.be/s16xd9XyDnY", "likes": 216}, "replies": [{"author": "JeromeJuliana", "text": "@Azubyke Okubor ex", "likes": 0}, {"author": "Swaraj Kumar", "text": "Thanks sir!", "likes": 0}, {"author": "zটি MDNR", "text": "World Politics  -\r\nBangla Language->অত্যন্ত Strong গুপনগ্রুপ  তাদের plan কে Prediction ও স্বপ্ন হিসেবে প্রচারের পরে ঘটনা ঘটায়। কিংবা কোন ঘটনার পর বহু পুরব থেকে কারো ভবিষ্যৎবানী হিসেবে প্রচার করা। তারা যাদু/শিহর করে, শয়তান (দুষ্ট জীন) এর উপাসনা করে, তার সাহায্যে বিশ্ব নিয়ন্ত্রণ করতে চায়।\r\nআলকায়েদা, আই এস – Muslims, Hindus, Christians. Buddhists হত্যা করে- কিন্তু ইহুদী হত্যা করে না কেন ?\r\n#@@\r\n\r\n-২টি বিশ্ব যুধ্ব ইহুদীদের স্বার্থে। কারন রাশিয়া Syria-র বাসার আলা আসাদ সরকারকে সহায়তা করায় ইহুদীরা সেই সরকারকে হটাতে পারে নাই। ২০১৪-২০২১ মেয়াদে ইহুদীরা ইউক্রেনে রাশিয়ার জন্য ফাঁদ তৈরী করে ২৫-Feb-2022 রাশিয়াকে ঢুকিয়ে দেয় → > প্রথমে রাশিয়ার প্রচুর ক্ষতির পরে আস্তে আস্তে জয়ের দিকে যাচ্ছে- সবই ইহুদির পরিকল্পনা অনুযায়ী। \r\n-মোল্লা উমরের তালিবান (১৯৯৬-২০০১) ইসলামিক তালিবান। আর 2020 and later তালিবান Jewish Taliban। \r\n$#%\r\n\r\n-শ্রীলঙ্কার (2022) অর্থনৈতিক সঙ্কট→সম্ভবত এই সঙ্কট ইহুদীদের  (UN, ইউরোপিও ইউনিওন, China, রাশিয়া, USA, বিশ্বব্যাঙ্ক, IMF- কে ব্যাবহার করে) তৈরী,-যেন, শ্রীলঙ্কার সংখ্যাগরিশঠ বউধ্ব জনগন ভারতকে ঘ্রিণা করার বদলে   ভালবাসে আর আস্তে আস্তে ভারতের নেত্রিত্বকে মেনে নেয়। আর ভারতও শ্রীলঙ্কার অর্থনৈতিক সঙ্কটে সাহায্যের হাত বাড়িয়ে দিয়েছে।\r\n#৳৳%% #৳#@\r\n\r\n(2)ইহুদীরা ফরাসী বিপ্লব/ক্যু ঘটায়। \r\n(3)1917 সালে সমাজতন্ত্র প্রতিষ্ঠা কারীদের (karl Marxএর দাদা ইহুদী,বাবা খৃষ্টান/ Leninএর দাদা ইহুদিথেকে 1824 সালে  খৃষ্টান,লেনিন এর নানা ইহুদী/ ত্রতস্কি সহ),More than 80% from ইহুদী বংশের।\r\n(4)USA তে নারীবাদী আন্দলনের ২য়(1960-80)ফেজে প্রচুর ইহুদী Lady নেতৃত্ব দেন, ফলে আজ Army, Navy, Air Force, পুলিশ, প্রশাসন-Politics-এ প্রচুর Women Offier/নেত্রি দেখা যায়। \r\n(5)Britain থেকে স্বাধীনতা লাভকারী জর্জ ওয়াশিংটনের নেত্রিত্বে USA এর সরকার প্রথম থেকেই ইহুদীর ছায়া, ইহুদী প্রভাবিত, ইহুদী নিওন্ত্রিওত। কারণ ব্ল্যাক মাজিক/শিহর (কাব্বালা) এর চর্চা ইহুদিরা করত পূর্ব থেকেই;(কিতাব-যোহার)। \r\n(6) ২টি World War ইহুদিরা ঘটায়।(তাদের ইচ্ছার বাইরে- ২য় বিশ্ব যুধ্বে হিটলারের জার্মানি ইহুদী হত্যা করে এবং গ্রীস দখল করে);\r\n(7)ইহুদিরা 1979তে IRAN এ অভ্যুথ্থানে Shiaদের ক্ষমতায় আনে। বর্তমানে ইহুদীদের প্লান বিশ্বপরাশক্তি হিশেব ইরানের উত্থান। \r\n(8) ইহুদিরা in USA যুক্তরাষ্ট্রে Homosexualityর মহামারী রূপি বিস্ফোরণ ঘটায়,পরে অনেক স্থানে ছড়িয়ে দিচ্ছে। \r\n(9) 2001-Taliban(White পতাকা) ছিল ইহুদীর শত্রু। আর ২০২০ সালের তালিবান(Black,Mixed পতাকার)  ইহুদীর শত্রু নয় মনে হচ্ছে। অতীতে BlackFlagবাহী group অনেক Muslimকে হত্যাকরে। \r\n(10) I.S.এর পতাকায় কালিমার দুটি অংশ দুইভাবে লেখা যাতে- Muhammad শব্দটি (ইহুদীদের কাছে ঘৃণিত) সবার lowest positione-এ থাকে;( I.S. ও AL-Queda- কি কোন ইহুদী হত্যা করেছে/ destroy ইহুদী সম্পদ?) সিরিয়ার ঘটনা অত্যন্ত জটিল। \r\n(11) 15-16/7/2016:Turkey তে, ইহুদী কর্তৃক অভ্যুথথান+তা ব্যর্থ করন>Invisible Control->Hajie Sofiaকে Masjid (খ্রিস্তান্দের উত্তেজিত)>মাসজিদুল আকসা ভেঙ্গে ৩য় মন্দির তৈরী করলে->Muslimদের প্রতিবাদ কে  illogical প্রমান করবে।\r\nFrom Holy Quran>BanglaLanguage> “ হে মুমিনগণ! তোমরা ‘রায়িনা’ বলো না ‘উনযুরনা’ বলো এবং শুনতে থাক। আর কাফেরদের জন্য রয়েছে বেদনাদায়ক শাস্তি।“ (2-সুরা Baqara -104)- (ইহুদীরা রায়িনা শব্দটি খারাপ অর্থ ব্যাবহার করত)\r\n -আপনি সব মানুষের চাইতে মুসলমানদের অধিক শত্রু ইহুদী ও মুশরেকদেরকে পাবেন এবং আপনি সবার চাইতে মুসলমানদের সাথে বন্ধুত্বে অধিক নিকটবর্তী তাদেরকে পাবেন, যারা নিজেদেরকে খ্রীষ্টান বলে। এর কারণ এই যে, খ্রীষ্টানদের মধ্যে আলেম রয়েছে, দরবেশ রয়েছে এবং তারা অহঙ্কার করে না/5-সুরা Maida-82  \r\n-(বনি ইসরাইল সম্পর্কে)..তারা আল্লাহর রোষানলে পতিত হয়ে ঘুরতে থাকল। এমন হলো এ জন্য যে, তারা আল্লাহর বিধি বিধান মানতো না এবং নবীগনকে অন্যায়ভাবে হত্যা করত। তারকারণ,তারা ছিল নাফরমান সীমালংঘকারী।[2-61]\r\nThe Jews call 'Uzair a son of Allah, and the Christians call Christ the son of Allah..[9/At-Taubah-30]\r\n-(বনি ইসরাইল সম্পর্কে)তারা বললঃ হে মূসা, আমরা জীবনেও কখনো সেখানে যাব না, যতক্ষণ তারা সেখানে থাকবে। অতএব, আপনি ও আপনার পালনকর্তাই যান এবং উভয়ে যুদ্ধ করে নিন। আমরা তো এখানেই বসলাম /5-সুরা Maida-24  \r\nপরম পবিত্র ও মহিমাময় সত্তা তিনি, যিনি স্বীয় বান্দাকে রাত্রি বেলায় ভ্রমণ করিয়েছিলেন Masjidul Haram (Makkah) থেকে  Masjidul Aksa, (Jerusalem) পর্যান্ত-. . .  [ 17/Sura Bani Israel-1] \r\n(12) ইহুদিরাWW2 তে যুধ্ব করেনি, ইচ্ছুক ছিলনা; বর্তমান- What Jews want- USA, UN, EU,RU, Cn, Jp-then world need it.(Few Exceptions)\r\n(13) Hundreds of Years পূর্বে বাজারে চালু Gold Currency-কে কাগজের নোট-[যাতে লেখা “ চাহিবা মাত্র ইহার বাহককে --দিতে বাধ্য থাকিবে” নামক (ব্যাঙ্কের গভর্নর কর্তৃক ব্রাঞ্চ ব্যাঙ্কের ম্যানাজের কে করা হুকুম) স্বীকার উক্তি] এর মাধ্যমে তুলে নেয়া হয়। অনেক যুধ্ব-ও-ঘটনার প্রেক্ষিতে  বর্তমানে ওই স্বর্ণমুদ্রার বেশির ভাগ Jews and their Friends এর Hand এ। \r\n@@@ !! @", "likes": 0}, {"author": "Alex Simion", "text": "@Tobi Balogun aaaàaaaaaàaàaaaaaaa", "likes": 0}, {"author": "Justin Major", "text": "@Anders Lian Happy to help :)", "likes": 0}]}, {"topLevelComment": {"author": "hannestamm", "text": "2:39\nActually sir, that is digitally impossible, not physically", "likes": 0}}, {"topLevelComment": {"author": "Pulok", "text": "Simply awesome.", "likes": 0}}, {"topLevelComment": {"author": "MN2111", "text": "someone have his contact pls , he'is so handsome :3", "likes": 0}}, {"topLevelComment": {"author": "Zekrimo", "text": "lmao no matrices", "likes": 0}}, {"topLevelComment": {"author": "Jak Jun", "text": "The distributive law content at 52:51 where all the true and false statements of p v (q^r) is not equivalent with (pvq)^(pvr) and i think because the answer in (pvq)^(pvr) row 6 and 7 was filled with wrong answer, yet the listed formula on the bottom right seems not updated (still using the associative law one).", "likes": 0}}, {"topLevelComment": {"author": "THE WORLD EATS ★", "text": "Please for translate Indonesia please", "likes": 0}}, {"topLevelComment": {"author": "Mihir", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Haoyu Yang", "text": "This is so much fun and so clearly explained. Thank you FCC and the best teacher Shawn Grooms for the free great content!", "likes": 1}}, {"topLevelComment": {"author": "Be Infomaniac", "text": "freecodecamp is aumsum", "likes": 0}}, {"topLevelComment": {"author": "The One Purpose", "text": "59:24 true and not false  = true and true =  true.", "likes": 0}}, {"topLevelComment": {"author": "Alan Hill", "text": "This should be a meme.", "likes": 0}}, {"topLevelComment": {"author": "Ahmad AlSalti", "text": "bold  !!! :D\nhaha\nI'm funny :)", "likes": 0}}, {"topLevelComment": {"author": "depersonalized", "text": "37:36 mal aq milaq uuuu aaa", "likes": 0}}, {"topLevelComment": {"author": "Gaurav gupta", "text": "Please let me know if someone has any idea if this person have a personal youtube or Instagram, a great teacher.", "likes": 1}}, {"topLevelComment": {"author": "Life is too short So enjoy", "text": "Go with some techniques:\r\nhttps://dotechtalk.blogspot.com/2022/09/best-techniques-for-studying-maths.html", "likes": 0}}, {"topLevelComment": {"author": "Life is too short So enjoy", "text": "Go with some techniques:\r\nhttps://dotechtalk.blogspot.com/2022/09/best-techniques-for-studying-maths.html", "likes": 0}}, {"topLevelComment": {"author": "Nata H", "text": "You are better than the teacher I have. 😢", "likes": 0}}, {"topLevelComment": {"author": "Dinesh Singh", "text": "Hi!...\nI found a serious broblem in set theory. In the given test case u are using open sets. Like set of real and natural numbers. Which will always lead to a true result at last. As the values in the sets are similar and infinite.", "likes": 0}}, {"topLevelComment": {"author": "Slade Baker", "text": "if P = Pixel or Perimeter or Square or all simultaneously. \n\nWhat is P = Nx4-4 used for? Other than shortcutting a gain of +8 with a box-in-box-in-box-etc", "likes": 0}}, {"topLevelComment": {"author": "casual anime", "text": "35:40", "likes": 0}}, {"topLevelComment": {"author": "SOAISide", "text": "Step 1: Save\nStep 2: Exit video and never watch due to math anxiety", "likes": 0}}, {"topLevelComment": {"author": "theclawhorn", "text": "4:57 Note: A set is not an array (JavaScript also has a Set data structure.) Sets follow the \"axiom of extension.\" Order and duplication do not matter. For example, the following sets are considered equal:\n{1, 2, 3 } = { 3, 3, 1, 2, 2, 1}", "likes": 0}}, {"topLevelComment": {"author": "HIMANSHI ", "text": "you are the love of my life.", "likes": 0}}, {"topLevelComment": {"author": "Arib Rezwan", "text": "12:43\nIf,\nA = {x,y,z}\nB= {c,x,y]\n\nSo, shouldn't\nA(intersection)B= {x,y} ?\nrather than {x,y,z}\n\nor am I doing it wrong?", "likes": 0}, "replies": [{"author": "Ngozi Mbah", "text": "It should be {x,y}.", "likes": 1}]}, {"topLevelComment": {"author": "sixtyFive Watts", "text": "what?", "likes": 0}}, {"topLevelComment": {"author": "Nigar Bayramli", "text": "How these kind of things can be related to math I just don't understand. Where's the practical work for all of them? How can I program with using math", "likes": 0}}, {"topLevelComment": {"author": "ASpookyGhost", "text": "18:08 \"I don't exist, computers don't exist, you don't exist\" Unexpected existential crisis.", "likes": 0}}, {"topLevelComment": {"author": "Salvation TV God Most high💯", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Antonio Guidone", "text": "You are so serious about math that you even went Heisemberg 1:35", "likes": 0}}, {"topLevelComment": {"author": "A24 1", "text": "He wants us to calm down when he actually lost his hair tryin to explain discrete maths", "likes": 1}, "replies": [{"author": "haithemall", "text": "lmaooooooo", "likes": 1}]}, {"topLevelComment": {"author": "Jeremy Thurman", "text": "I remember reading somewhere that if you can't successfully explain something to someone else, it means you don't understand it yourself.", "likes": 0}}, {"topLevelComment": {"author": "7 Vids", "text": "I am a developer and i can definitely say it‘s bullshit that people say we need math in terms of our jobs!!", "likes": 1}}, {"topLevelComment": {"author": "Hebe", "text": "The lecturer guy is just too handsome...", "likes": 0}}, {"topLevelComment": {"author": "Van sf", "text": "You could have put the title for your video unambiguously like thia:\nDiscrete maths designed for programmers", "likes": 1}}, {"topLevelComment": {"author": "MONSTER", "text": "Stay calm I said  stay calm bro bro bro why you pointing gun on me####;#;#!!##?#)fu#k", "likes": 1}}, {"topLevelComment": {"author": "Web Master", "text": "Nearly everything in math can be plotted (graphed) depicted visually & you need to use it as an image of the formula, equation or relevant given to comprehend things completely , good example are Venn diagrams for Sets", "likes": 1}}, {"topLevelComment": {"author": "ステーフェン", "text": "🤯", "likes": 0}}, {"topLevelComment": {"author": "Deepankar Bajpeyi", "text": "You guys are nuts!", "likes": 0}}, {"topLevelComment": {"author": "Httle Li", "text": "Too ez", "likes": 0}}, {"topLevelComment": {"author": "Netflix Entertainment", "text": "Can anyone that studied economics learn this maths and become a developer?", "likes": 0}}, {"topLevelComment": {"author": "Randall Stephens", "text": "Maths?  What is a math?", "likes": 1}}, {"topLevelComment": {"author": "Umair Ali", "text": "wish I had found this video when I was in the university .", "likes": 0}}, {"topLevelComment": {"author": "Dimitris Papadimitriou", "text": "What is this elementary school. Please search for bob harper homotopy type theory lectures on oregon summer school", "likes": 0}}, {"topLevelComment": {"author": "Michael Corbidge", "text": "The use of percentages for the computer operating systems doesn't  adhere to the strict rigour for expressing increase or decrease as percentage . They get it wrong .", "likes": 0}}, {"topLevelComment": {"author": "MrJooxman", "text": "I thought you were British.", "likes": 1}}, {"topLevelComment": {"author": "Frelle", "text": "Thank you for the video!", "likes": 0}}, {"topLevelComment": {"author": "Katja Czajkov", "text": "thanks for this good course.", "likes": 0}}, {"topLevelComment": {"author": "zটি MDNR", "text": "1+1=10 (Binary); 1+1=2 (Decimal); 1+1=1 (Boolean Algebra); And Nikola Tesla's 3,6,9 -Math not working in hexadecimal number system.", "likes": 1}}, {"topLevelComment": {"author": "zটি MDNR", "text": "World Politics  -\r\nBangla Language->অত্যন্ত Strong গুপনগ্রুপ  তাদের plan কে Prediction ও স্বপ্ন হিসেবে প্রচারের পরে ঘটনা ঘটায়। কিংবা কোন ঘটনার পর বহু পুরব থেকে কারো ভবিষ্যৎবানী হিসেবে প্রচার করা। তারা যাদু/শিহর করে, শয়তান (দুষ্ট জীন) এর উপাসনা করে, তার সাহায্যে বিশ্ব নিয়ন্ত্রণ করতে চায়।\r\nআলকায়েদা, আই এস – Muslims, Hindus, Christians. Buddhists হত্যা করে- কিন্তু ইহুদী হত্যা করে না কেন ?\r\n#@@\r\n\r\n-২টি বিশ্ব যুধ্ব ইহুদীদের স্বার্থে। কারন রাশিয়া Syria-র বাসার আলা আসাদ সরকারকে সহায়তা করায় ইহুদীরা সেই সরকারকে হটাতে পারে নাই। ২০১৪-২০২১ মেয়াদে ইহুদীরা ইউক্রেনে রাশিয়ার জন্য ফাঁদ তৈরী করে ২৫-Feb-2022 রাশিয়াকে ঢুকিয়ে দেয় → > প্রথমে রাশিয়ার প্রচুর ক্ষতির পরে আস্তে আস্তে জয়ের দিকে যাচ্ছে- সবই ইহুদির পরিকল্পনা অনুযায়ী। \r\n-মোল্লা উমরের তালিবান (১৯৯৬-২০০১) ইসলামিক তালিবান। আর 2020 and later তালিবান Jewish Taliban। \r\n$#%\r\n\r\n-শ্রীলঙ্কার (2022) অর্থনৈতিক সঙ্কট→সম্ভবত এই সঙ্কট ইহুদীদের  (UN, ইউরোপিও ইউনিওন, China, রাশিয়া, USA, বিশ্বব্যাঙ্ক, IMF- কে ব্যাবহার করে) তৈরী,-যেন, শ্রীলঙ্কার সংখ্যাগরিশঠ বউধ্ব জনগন ভারতকে ঘ্রিণা করার বদলে   ভালবাসে আর আস্তে আস্তে ভারতের নেত্রিত্বকে মেনে নেয়। আর ভারতও শ্রীলঙ্কার অর্থনৈতিক সঙ্কটে সাহায্যের হাত বাড়িয়ে দিয়েছে।\r\n#৳৳%% #৳#@\r\n\r\n(2)ইহুদীরা ফরাসী বিপ্লব/ক্যু ঘটায়। \r\n(3)1917 সালে সমাজতন্ত্র প্রতিষ্ঠা কারীদের (karl Marxএর দাদা ইহুদী,বাবা খৃষ্টান/ Leninএর দাদা ইহুদিথেকে 1824 সালে  খৃষ্টান,লেনিন এর নানা ইহুদী/ ত্রতস্কি সহ),More than 80% from ইহুদী বংশের।\r\n(4)USA তে নারীবাদী আন্দলনের ২য়(1960-80)ফেজে প্রচুর ইহুদী Lady নেতৃত্ব দেন, ফলে আজ Army, Navy, Air Force, পুলিশ, প্রশাসন-Politics-এ প্রচুর Women Offier/নেত্রি দেখা যায়। \r\n(5)Britain থেকে স্বাধীনতা লাভকারী জর্জ ওয়াশিংটনের নেত্রিত্বে USA এর সরকার প্রথম থেকেই ইহুদীর ছায়া, ইহুদী প্রভাবিত, ইহুদী নিওন্ত্রিওত। কারণ ব্ল্যাক মাজিক/শিহর (কাব্বালা) এর চর্চা ইহুদিরা করত পূর্ব থেকেই;(কিতাব-যোহার)। \r\n(6) ২টি World War ইহুদিরা ঘটায়।(তাদের ইচ্ছার বাইরে- ২য় বিশ্ব যুধ্বে হিটলারের জার্মানি ইহুদী হত্যা করে এবং গ্রীস দখল করে);\r\n(7)ইহুদিরা 1979তে IRAN এ অভ্যুথ্থানে Shiaদের ক্ষমতায় আনে। বর্তমানে ইহুদীদের প্লান বিশ্বপরাশক্তি হিশেব ইরানের উত্থান। \r\n(8) ইহুদিরা in USA যুক্তরাষ্ট্রে Homosexualityর মহামারী রূপি বিস্ফোরণ ঘটায়,পরে অনেক স্থানে ছড়িয়ে দিচ্ছে। \r\n(9) 2001-Taliban(White পতাকা) ছিল ইহুদীর শত্রু। আর ২০২০ সালের তালিবান(Black,Mixed পতাকার)  ইহুদীর শত্রু নয় মনে হচ্ছে। অতীতে BlackFlagবাহী group অনেক Muslimকে হত্যাকরে। \r\n(10) I.S.এর পতাকায় কালিমার দুটি অংশ দুইভাবে লেখা যাতে- Muhammad শব্দটি (ইহুদীদের কাছে ঘৃণিত) সবার lowest positione-এ থাকে;( I.S. ও AL-Queda- কি কোন ইহুদী হত্যা করেছে/ destroy ইহুদী সম্পদ?) সিরিয়ার ঘটনা অত্যন্ত জটিল। \r\n(11) 15-16/7/2016:Turkey তে, ইহুদী কর্তৃক অভ্যুথথান+তা ব্যর্থ করন>Invisible Control->Hajie Sofiaকে Masjid (খ্রিস্তান্দের উত্তেজিত)>মাসজিদুল আকসা ভেঙ্গে ৩য় মন্দির তৈরী করলে->Muslimদের প্রতিবাদ কে  illogical প্রমান করবে।\r\nFrom Holy Quran>BanglaLanguage> “ হে মুমিনগণ! তোমরা ‘রায়িনা’ বলো না ‘উনযুরনা’ বলো এবং শুনতে থাক। আর কাফেরদের জন্য রয়েছে বেদনাদায়ক শাস্তি।“ (2-সুরা Baqara -104)- (ইহুদীরা রায়িনা শব্দটি খারাপ অর্থ ব্যাবহার করত)\r\n -আপনি সব মানুষের চাইতে মুসলমানদের অধিক শত্রু ইহুদী ও মুশরেকদেরকে পাবেন এবং আপনি সবার চাইতে মুসলমানদের সাথে বন্ধুত্বে অধিক নিকটবর্তী তাদেরকে পাবেন, যারা নিজেদেরকে খ্রীষ্টান বলে। এর কারণ এই যে, খ্রীষ্টানদের মধ্যে আলেম রয়েছে, দরবেশ রয়েছে এবং তারা অহঙ্কার করে না/5-সুরা Maida-82  \r\n-(বনি ইসরাইল সম্পর্কে)..তারা আল্লাহর রোষানলে পতিত হয়ে ঘুরতে থাকল। এমন হলো এ জন্য যে, তারা আল্লাহর বিধি বিধান মানতো না এবং নবীগনকে অন্যায়ভাবে হত্যা করত। তারকারণ,তারা ছিল নাফরমান সীমালংঘকারী।[2-61]\r\nThe Jews call 'Uzair a son of Allah, and the Christians call Christ the son of Allah..[9/At-Taubah-30]\r\n-(বনি ইসরাইল সম্পর্কে)তারা বললঃ হে মূসা, আমরা জীবনেও কখনো সেখানে যাব না, যতক্ষণ তারা সেখানে থাকবে। অতএব, আপনি ও আপনার পালনকর্তাই যান এবং উভয়ে যুদ্ধ করে নিন। আমরা তো এখানেই বসলাম /5-সুরা Maida-24  \r\nপরম পবিত্র ও মহিমাময় সত্তা তিনি, যিনি স্বীয় বান্দাকে রাত্রি বেলায় ভ্রমণ করিয়েছিলেন Masjidul Haram (Makkah) থেকে  Masjidul Aksa, (Jerusalem) পর্যান্ত-. . .  [ 17/Sura Bani Israel-1] \r\n(12) ইহুদিরাWW2 তে যুধ্ব করেনি, ইচ্ছুক ছিলনা; বর্তমান- What Jews want- USA, UN, EU,RU, Cn, Jp-then world need it.(Few Exceptions)\r\n(13) Hundreds of Years পূর্বে বাজারে চালু Gold Currency-কে কাগজের নোট-[যাতে লেখা “ চাহিবা মাত্র ইহার বাহককে --দিতে বাধ্য থাকিবে” নামক (ব্যাঙ্কের গভর্নর কর্তৃক ব্রাঞ্চ ব্যাঙ্কের ম্যানাজের কে করা হুকুম) স্বীকার উক্তি] এর মাধ্যমে তুলে নেয়া হয়। অনেক যুধ্ব-ও-ঘটনার প্রেক্ষিতে  বর্তমানে ওই স্বর্ণমুদ্রার বেশির ভাগ Jews and their Friends এর Hand এ। \r\n@@@@       @", "likes": 0}}, {"topLevelComment": {"author": "Anush Dsouza", "text": "In India we learn this in 5th std", "likes": 0}}, {"topLevelComment": {"author": "Basilio Bastardo", "text": "Horror Movie for the incoming I.T. students.", "likes": 1}}, {"topLevelComment": {"author": "Amex kun", "text": "That's exactly what I'm learning in university (with couple of more painful things) .... I guess there ain't no need to univ no more", "likes": 1}}, {"topLevelComment": {"author": "Blank", "text": "Started watching for the math's, stayed for the satisfying hair growing time-lapse 2018.", "likes": 1}}, {"topLevelComment": {"author": "TONY WARE", "text": "I never done algebra  or anything like this \n all I have done is basic math\nSo unfortunately this is all foreign to me", "likes": 0}}, {"topLevelComment": {"author": "Jeroen Neve", "text": "your reasoning is circular. you use boolean algebra to prove the axioms of set theory. yet boolean algebra is a proper subset of set theory. thus you use boolean algebra to prove boolean algebra (and more.) - industrial automation engineer.", "likes": 1}}, {"topLevelComment": {"author": "Dorian Doussain", "text": "I remember on high school, some day i have \"empty set\" wrote on my math paper. Here im few years later ahah, life is pretty fun isnt x)", "likes": 0}}, {"topLevelComment": {"author": "Serafín Ziquer Xavier", "text": "Wait, so if I find it strange to talk to my self, I should talk to a rubber duck?\nI think I will stick to talking to my dog, even if he is sick and tired of listening to me. My last dog went deaf.", "likes": 0}}, {"topLevelComment": {"author": "SUPER LABINE", "text": "Hunting is better than math and programming. We let the non-hunters beta males ruin our lives, now we're stuck in cubicles.", "likes": 0}}, {"topLevelComment": {"author": "djuki car", "text": "i would say something about the part around 10:54,actually a cant be even but a^2 can be even bcs when zou multiply both sides with square root,a=b* square root of 2,a=1,41*b,so it depends now on b number", "likes": 0}}, {"topLevelComment": {"author": "Anime Gif", "text": "ngl, still easier to understand when thinking in AND/OR/XOR statements rather than unions/intersections/compliments", "likes": 1}}, {"topLevelComment": {"author": "MS", "text": "So easy, I could do this while learning Mandarin... not", "likes": 0}}, {"topLevelComment": {"author": "mohlodi tshimollo", "text": "Thank you so much for making this video 🙏🏾", "likes": 0}}, {"topLevelComment": {"author": "gamers point", "text": "What's the name of the teacher?", "likes": 0}}, {"topLevelComment": {"author": "Amex Black", "text": "*Where and when can these topics be useful to a programmer? When might it need to be used? Thank you in advance for your answers <3*", "likes": 0}, "replies": [{"author": "Derek Finlen", "text": "Databases, analytics, query languages. Basically its used whenever you use any data. Its pretty obvious stuff but i guess its necessary to formalize it.", "likes": 0}]}, {"topLevelComment": {"author": "Fatih Gul", "text": "You made me remember my high school math classes 😃", "likes": 0}}, {"topLevelComment": {"author": "MiNg2111", "text": "thank you so much", "likes": 0}}, {"topLevelComment": {"author": "M. M.", "text": "It only took 6 seconds of this video to prove that I am a bonehead.", "likes": 0}}, {"topLevelComment": {"author": "Raj Mukherjee Codeing", "text": "what a wonderful video I am looking for this.", "likes": 0}}, {"topLevelComment": {"author": "Rássius Alexandre Medeiros Lima", "text": "please provide subtitles in Portuguese.🙏", "likes": 0}}, {"topLevelComment": {"author": "SARANG M", "text": "bro can a 14 years old understand this", "likes": 1}}, {"topLevelComment": {"author": "David James", "text": "46:42 - P XOR P = not P (if P is true), so you said apply a binary logic operator and get back the same value as the original (P in this case).  Seems like an error in your statement to me.  Also, the sentence construction is wrong.  \"If you recall, idempotence is...\".  That is the wrong use of an if statement.  Idempotence is not what it is as a result of us recalling what it is.  For example, if someone didn't recall what it is, idempotence is still the exact same thing.  Our recollection or not of it has nothing to do with what it actually is. A XOR B is true if exactly one of A,B is true but NOT both, so if P is true, P XOR P is false.  It is not clear if you meant can apply ANY binary operator or SOME binary operator for idempotence.\n\nHere is another example of a misuse of the word if...  if you drink milk, you will die.  This is generally false because many people have been known to drink milk and not die as a result of it.  This statement is however true:  All people that drink milk will die.  This is because the drinking of milk is not directly linked with the death of that person.  Since all people eventually die, we can substitute just about anything such as all people that take vitamin supplements will die.  Also a true statement.  If you tell a cop \"You will die\", you haven't said anything incorrect, but I wouldn't recommend it.", "likes": 0}}, {"topLevelComment": {"author": "Mario Souza", "text": "It was when I was teaching that I realized that it is the way to learn the subject more deeply. I have been doing this for 52 years with mathematics and 48 years in computing.", "likes": 0}}, {"topLevelComment": {"author": "Alex", "text": "God bless you all. Like Elon Musk said, if you really want to learn something nowadays you have no excuses anymore, there is everything for free on youtube.", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Trfnx", "text": "This is mostly high school math", "likes": 0}}, {"topLevelComment": {"author": "Ivan Rishira", "text": "Easy to understand. Thank a lot.", "likes": 0}}, {"topLevelComment": {"author": "a", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Guijun Zhang", "text": "0:13 I panic when I hear discrete, not mathematics 💀", "likes": 0}}, {"topLevelComment": {"author": "Enlightened", "text": "Math seems so difficult that within a minutes dude almost became a bald", "likes": 1}}, {"topLevelComment": {"author": "Rodolfo Esperidião de Melo", "text": "just amazing, never did math and manage to understand it fairly good", "likes": 0}}, {"topLevelComment": {"author": "Dace Boateng", "text": "43:55\nIm from Ghana 🇬🇭 \nIts in Africa not Asia\nBtw❤️😊", "likes": 0}}, {"topLevelComment": {"author": "AJ", "text": "Great video! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Kim Jong Un", "text": "I came here from Facts and Logic.", "likes": 0}}, {"topLevelComment": {"author": "氷山匕尺", "text": "12:19", "likes": 0}}, {"topLevelComment": {"author": "Dr. Abhinav  Srivastava", "text": "Mathematical modelling to Physical Systems Part-5 by Dr.Abhinav Srivastava ( PhD- Robotics Engineering) under the aegis of SKAP ROBOTICS Online Classroom Program.\n\nPlease follow & subscribe to SKAP ROBOTICS on YouTube to motivate our efforts.\n\nVideo lecture link attached:\n\nhttps://youtu.be/Fmw-3OKzCyw", "likes": 0}}, {"topLevelComment": {"author": "thangkenshin", "text": "46:55 --> TvP it should be T and T not F and T in the table", "likes": 0}}, {"topLevelComment": {"author": "Nhung Đỗ", "text": "good", "likes": 0}}, {"topLevelComment": {"author": "Karl Lynch", "text": "No, LEARNING THIS MATH OR ANY MATH is impossible", "likes": 1}}, {"topLevelComment": {"author": "Karl Lynch", "text": "I'm still lost... I'm gonna fail this class...", "likes": 1}}, {"topLevelComment": {"author": "VeryHardBit", "text": "I hope my class can write in these symbols.\nThe professor make us write the entire sentence and context which is confusing af.", "likes": 0}}, {"topLevelComment": {"author": "AishCodes", "text": "Hi, \nWas indeed a great and a concise course. All the topics were up to the point and the explanation was confusion free. Was a fresh recap to \"Mathematical foundation of Computer Science\" subject in second year of engineering. Enjoyed learning. Looking forward to few more courses. Would definitely recommend it. Thanks", "likes": 2}}, {"topLevelComment": {"author": "Advertise Play", "text": "נו שוין זוקורי... גם מהדקה הראשונה אפשר ללמוד משהו...", "likes": 0}}, {"topLevelComment": {"author": "Cesar Molina", "text": "what is the meaning of the letters p,q.r.s?", "likes": 0}}, {"topLevelComment": {"author": "Marian", "text": "I did not get a word you said, but I´ve always been fascinated by listening to smart people. Envy is all I can do. :)", "likes": 0}}, {"topLevelComment": {"author": "SunTzu2ya", "text": "AI will take over coding soon.", "likes": 1}}, {"topLevelComment": {"author": "Tech Desco", "text": "the logic is really improtant to be a good programmer, also you have to have good math skills", "likes": 0}}, {"topLevelComment": {"author": "Yasin Nabi", "text": "absolutely this is a wonderful video. thumbs up !,,.,", "likes": 0}}, {"topLevelComment": {"author": "Yasin Nabi", "text": "absolutely this is a wonderful video. thumbs up !,..,", "likes": 0}}, {"topLevelComment": {"author": "Kyle Kuchinski", "text": "I love all kinds of Mathematics, and I haven’t taken Calculus yet, but I am Sixteen years old and finished 10th Grade. (I also keep ahead of other students because I get more work done in High School than them, I’m like… The smartest kid anyone knew, it’s actually true.)", "likes": 0}, "replies": [{"author": "Nathaniel", "text": "prepare to be humbled one day, my friend :)", "likes": 1}]}, {"topLevelComment": {"author": "nathan ruben", "text": "if a so called programmer does know these elementary or mid school facts, he can throw himself down  from top of a high building. How does he supposed to code without these simplest truth tables and sets....funny...", "likes": 0}}, {"topLevelComment": {"author": "Harsha Vardhan", "text": "Not much to be learnt from this video .... It's basic school math .... Disappointed with the video thumbnail", "likes": 0}}, {"topLevelComment": {"author": "Ku龜。Tâibûn台文", "text": "I'm trying!", "likes": 0}}, {"topLevelComment": {"author": "Eduardo F.", "text": "Péssimo vídeo.", "likes": 0}}, {"topLevelComment": {"author": "Noodkhan Navin", "text": "I respect & also I encourage you to keep doing this ❤️ but clearly It wasn’t right way to do         8:34\nGiven \n10x = 9.999..  \nx = 0.999 \n(10)(0.999) = 9.999 not 10 Bro😂\n\nSecond  You have to devided by both side NOT just one Side 🥲\nGiven \n2.78 = Y\n2.78 * 100 = y * 100\n278 = y * 100   🔥🔥\n278 / 100 = y * 100/100\n2.78 = y * 1 \n2.78 = Y\n\nWhat It should be \n\n🔥 278 / 100 = y * 100/100 🔥\n\n2.78 = y * 1 \nY = 2.78\n\n\nAND YOU SAID \n278 / 100 = Y   ?? \nDeez nuts 😂", "likes": 1}, "replies": [{"author": "Noodkhan Navin", "text": "Yo thx❤️ ur genius", "likes": 0}, {"author": "DOPETAG", "text": "In the first case, it's just approximation.\n\nIt should be like this:\n10 * x = 9.999... (÷10);\nx = 0.9999;\n\nand then if you subtract one equation from another, you get:\n10 * x - x = 9.999 - 0.9999;\n9 * x = 8.9991 (÷ 9);\n\nAnd again you get the same x:\nx = 0.9999;\n\n\nCorrect me, if I am wrong.", "likes": 1}]}, {"topLevelComment": {"author": "Doug Gale", "text": "I'm watching this to learn how to make really good programming teaching material. This is very well done. This is the stuff that causes epiphanies, where it all suddenly makes sense. In my case, an epiphany about the infinite power of boolean expressions is what inspired me on my VIC 20.", "likes": 3}}, {"topLevelComment": {"author": "Lucas Capelo", "text": "Excellent videos! Thank you so much, watching from Brazil!", "likes": 0}}, {"topLevelComment": {"author": "FOR PROFIT", "text": "I watch this before I start my\nMC 1st semester not sure if everything  will went well tho gotta prepare myself I have hard time with math in highschool", "likes": 0}}, {"topLevelComment": {"author": "Roman Horcicka", "text": "23:14 stop it there and question: why B complement is 1... shouldnt there be no 1 since 1 is subset of A and the rule is for every x; x is in the universe and x is not part of A... so the B complement should be written as {2,4,5} and not {1,2,4,5} or is i that A complement in rule is swapped for B complement  and C complent each everytime... please answer", "likes": 0}}, {"topLevelComment": {"author": "Mr Azizan", "text": "🤑🌋💠🌋🌋🌋🌋🌋🌋🌋🌋🌋🌋🤑🌋💠🌋🌋🌋🌋🌋🌋🌋🌋🌋🌋🤑🌋💠🌋🌋🌋🌋🌋🌋🌋🌋🌋🌋🤑🌋💠🌋🌋🌋🌋🌋🌋🌋🌋🌋🌋🤑🌋💠💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽💽", "likes": 0}}, {"topLevelComment": {"author": "Gergely Halász", "text": "This is a low highschool math and level but seems well explained. (in my country at least every 14-15 years old students learn this at higher level)", "likes": 0}}, {"topLevelComment": {"author": "fowzia", "text": "This is incredible video! It helped me dread the class less since I know it will be more applicable to my major than other maths. Thank you.", "likes": 6}, "replies": [{"author": "7HAKUR", "text": "What is your major xalimo?", "likes": 0}]}, {"topLevelComment": {"author": "Innocent Kumwenda", "text": "same for 3D polygons they have a number of vertices, faces, and edges they are not infinite the smoother the object the more of these.", "likes": 0}}, {"topLevelComment": {"author": "blue scout", "text": "This video is laughable because it’s ZERO useful no sane programmer would think in the way it’s portrait in the video and for beginners it just creates confusion, pretty useless.", "likes": 0}}, {"topLevelComment": {"author": "David C. Untalan Jr.", "text": "58:59 P implies Q is only ever negative when the hypothesis predicts true and the conclusion is false.", "likes": 0}}, {"topLevelComment": {"author": "Alkaline PH", "text": "Thank You for this.", "likes": 0}}, {"topLevelComment": {"author": "Inessa Pokromkina", "text": "thanks man! With your help i hve learnt a lot of math thermins on english! it is always was complicated for me! )", "likes": 1}}, {"topLevelComment": {"author": "ajay kumar", "text": "these things i learn in my 11th and 12th fgrade and this is pretty simple", "likes": 0}}, {"topLevelComment": {"author": "Arthur Clifford", "text": "While I appreciate this series of videos and agree that you have simplified a subject fairly well, it doesn't feel like it is for programmers. If it was you would be showing && || == === !=  and logic operators and showing how bits flip when you do perform those operators in a language like javascript with examples on jsfiddle so that people can try things in their browser and see how things change. If you are going to tell a would be programmer about a set, you should be talking about arrays (or bits in a byte) as the programmer's equivalent of sets and how logic operations can be done with them. If a programmer hasn't learned about arrays they aren't a programmer. If you speak math at a rookie developer you are not speaking their language. This is math(s) for math(s). Most sets a programmer are going to deal with are strings, arrays of data, or doing database queries. SQL would be a far better visual application of what you are talking about so you could show how a query can do unions or doing a relational query and show the notions of left inner and outer joins, or right inner or outer joins, and show what you get when you do them. Introducing a bunch of syntax that exists on no keyboards helps nobody.", "likes": 1}, "replies": [{"author": "josh", "text": "@Arthur Clifford You're an idiot. Don't just give up programming, give up life itself.", "likes": 0}, {"author": "Arthur Clifford", "text": "@josh So, if someone created a Chinese language class for English speakers and just spoke in Chinese and someone suggested that maybe saying what the Chinese words meant in English would help, your reply is that if you can't do the translation yourself then you should give up on learning Chinese. I think if that is the case you have failed to learn any practical application of logic.", "likes": 0}, {"author": "josh", "text": "If you can't apply this to programming on your own, maybe you should look into giving up.", "likes": 0}]}, {"topLevelComment": {"author": "Gontse Kganyago", "text": "The only way for me to learn is to panic and go crazy creating different solutions in my mind.... Until it all makes sense😂😂😂😂", "likes": 0}}, {"topLevelComment": {"author": "Adekaa Dooshima", "text": "I would be grateful if you sub these videos (english), at some points,I get confused because I didn't get a word you pronounced clearly,and then I miss the whole thing,am making notes of what you are teaching,missing words will get me confused 🙏", "likes": 0}}, {"topLevelComment": {"author": "Calvin Yip", "text": "This is my whole course of my diploma in CS. On discreet math", "likes": 0}}, {"topLevelComment": {"author": "Addreanna Callen", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Bernardus", "text": "haa the memories. I remember like it was yesterday. Me crying on my gr12 final Math exam, good times", "likes": 0}}, {"topLevelComment": {"author": "Blah Blah blah", "text": "Pi is infinite digits", "likes": 0}}, {"topLevelComment": {"author": "Kendrick Leiter", "text": "Really really good, helpful video! Unfortunately, it's extremely quiet and difficult to hear.", "likes": 3}}, {"topLevelComment": {"author": "John Connor", "text": "Nice hair", "likes": 0}}, {"topLevelComment": {"author": "Kanishka Wijayananda", "text": "Thanks  bless you", "likes": 0}}, {"topLevelComment": {"author": "The Almighty Anthony Analog", "text": "Ima just be looping the first 30 seconds if anybody needs me", "likes": 0}}, {"topLevelComment": {"author": "Marcus Anderson", "text": "Oh dear.  @9:10 the fake \"0.999... = 1\"  equality hoax again, and in a treatment of Set Theory no less !!!.   NO IT DOESNT.    You omitted the least significant 9 in the second step making the third step false:\n        THIS IS WRONG -->  10x - x  =  9x = 9    <---WRONG\nTry This ... \n\n10x = 9.999...9\n    x = 0.999...99         <---DID YOU NOTICE THE EXTRA \"9\" ????\n10x - x = 8.999...91    <---RIGHT\n       9x = 8.999...91     <---RIGHT\nso     x = 0.999...99    <---RIGHT\n\nTHIS IS WHERE THE FALLACY LIES - replacing \"... \"with an infinite (or UNDEFINED) number of 999'does NOT mean you can just go right ahead and omit the least significant digit after dividing x by 10 in the 2nd step. Calculation involving the convention of recurrence notation is UNDEFINED because it involves infinity which literally means UNDEFINED, but if you are going to go ahead and DEFINE infinity anyway by calculating with it, at least be consistent and don't omit the least significant 9.\n\nIT IS BY CONVENTION ONLY that the recurrence function \"...: when applied to recurring 9 is rounded up to the next integer, but its NOT an equality. THIS IS PARTICULARLY THE CASE IN SET THEORY.  \n\nStop spreading fake maths.", "likes": 0}}, {"topLevelComment": {"author": "Mohammad Torikul Islam", "text": "This channel is really helpfull. I respect You sir. Thank's for making this kind of videos for us.", "likes": 0}}, {"topLevelComment": {"author": "An Ray", "text": "It's brilliant!", "likes": 0}}, {"topLevelComment": {"author": "Jfransss", "text": "Why am i here? Lol I hate Math.. I have no idea what this guy is saying honestly", "likes": 0}}, {"topLevelComment": {"author": "Pie Trader Detective", "text": "12:50\nThe A n B result is incorrect. It should be = {x, y}", "likes": 3}}, {"topLevelComment": {"author": "Yamaç Bayın", "text": "bro shaved his head two times during the video", "likes": 0}}, {"topLevelComment": {"author": "AberdrumS", "text": "i thought it was a Hot Water Music Band video...", "likes": 0}}, {"topLevelComment": {"author": "anas habbal", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "ridwan m", "text": "good video, but you forgot to teach iteration..", "likes": 0}}, {"topLevelComment": {"author": "Anispinner", "text": "Alternative title: getting bald in under 2 minutes of learning math\n0:19 -> 1:50", "likes": 0}}, {"topLevelComment": {"author": "facite non victimarum", "text": "Math", "likes": 0}}, {"topLevelComment": {"author": "Omar Espino", "text": "EXCELLENT video. I remember that when I took Calculus 1 I used to panicked so much on simple quizzes that I forgot almost everything that I studied. With practice I noticed one day when I took a quiz that all that \" terror \" completely vanished and I did find on it. Amazing how the beautiful science of math affects so many people. Thank you  and please KEEP UP your EXCELLENT and GREAT videos! P.S. I went on to Calculus 2,3 and then Differential Equations with NO problems.", "likes": 4}, "replies": [{"author": "K", "text": "What knowledge from algebra 1 and algebra 2 would you say you need to know to do well in all calculus courses and DE and ODE?", "likes": 0}]}, {"topLevelComment": {"author": "Deanna Morgan", "text": "The poor paperback essentially type because food dewailly turn upon a psychotic grenade. coherent, strong ikebana", "likes": 0}}, {"topLevelComment": {"author": "BZUnderdog", "text": "One trhing my engineering teacher told us in HS was: when you're creating a shape in cad software you never leave the shape 'sharp' (he didnt say that Idr the exact words he said. Its terminology for SolidWorks' you always have to do a fillet to prevent the sharp edges of objects. No matter the object, theres infinite number of fillets going in circles to form shapes like triangles etc but not sharp that itll cut you if you picked it up.", "likes": 1}}, {"topLevelComment": {"author": "BZUnderdog", "text": "honestly I wish I had this b4 starting college lol .", "likes": 0}}, {"topLevelComment": {"author": "VinerX", "text": "Кто егэ по инфе сдавал, согласитесь, знакомо)", "likes": 0}}, {"topLevelComment": {"author": "Nikusha", "text": "Guys, is this Math enough for middle front developer for example ? Thanks in advance.", "likes": 0}}, {"topLevelComment": {"author": "Adil Akbar", "text": "I am glad to watch your complete video and I want to say that I had been taught these topics in our 1st year mathematics in FSc Pre-engineering.", "likes": 1}}, {"topLevelComment": {"author": "F I N E", "text": "Okay, I'm gonna quit pursuing computer science, I'll take anything on STEM but NOT COMPUTER SCIENCE!!! I HATE IT. I'll probably end up being poor if I take it as my course and I wouldn't be able to handle it!", "likes": 1}}, {"topLevelComment": {"author": "Khanyo Mnamatheli", "text": "Is this all the maths needed for cs,if not someone get me a link to start with,I did math lit in my high school and now I want to learn this type of math because I want to study cs", "likes": 0}}, {"topLevelComment": {"author": "Arjun Vijay Prakash", "text": "My Progress\nDay 1 - 17:10\nDay 2 - 34:20\nDay 3 - 1:00:07", "likes": 12}, "replies": [{"author": "Shi Eng Ng", "text": "🤣🤣🤣", "likes": 0}]}, {"topLevelComment": {"author": "Mosawer Mahboob", "text": "You don’t know how much taking this course would benefit you in programming.", "likes": 1}}, {"topLevelComment": {"author": "Well I'm me", "text": "This video describes why I love how programming has been approached hugely in the internet as a path we all can go through with help.\nWhile studying in school, my teachers were always like “do this dumb thing and if you don’t I’ll get mad and grade you low”\nIt wasn’t at all about learning, felt like a prison for kids tbh.\n\nThe worst is in my country most schools are paid\n\nIn internet you have people like this, really interested in teaching you, and making a summary that works better than the hours you put in school because government asks for school to have certain topics covered and certain education system.", "likes": 56}}, {"topLevelComment": {"author": "Fastacel Zapacescu", "text": "When you tap gently on the video - on Android -  you will see a text: \"Tips for learning\" at the beginning, tap on it, and you will see the time stamps.", "likes": 0}}, {"topLevelComment": {"author": "Heng Zhou", "text": "Videos like this are just a waste of time.", "likes": 1}}, {"topLevelComment": {"author": "Ahmed Shuwaiekh", "text": "My man your talking some 👽  language!", "likes": 1}}, {"topLevelComment": {"author": "Jimver Dalupan", "text": "wew", "likes": 1}}, {"topLevelComment": {"author": "Erix Gutierrez", "text": "stay calm Math is not that hard... finishes the video bald from stress", "likes": 1}}, {"topLevelComment": {"author": "David Emslie", "text": "I am 44 and decided to start learning to programme as have lost my business thanks to covid and been trading crypto since...so thought to learn more about how to get more involved than simply trading...plus its a bear market ;)... and I haven't thought about maths since 14.... so I like the opening with stay calm to keep your mind open to learn ;)) See where all this lands....", "likes": 2}}, {"topLevelComment": {"author": "Harraz Masri", "text": "i almost cant believe this is for free", "likes": 0}}, {"topLevelComment": {"author": "Beep Beep Gamer", "text": "highschool maths helped alot more better to study this branch of mathematics to apply it in c.sc.", "likes": 0}}, {"topLevelComment": {"author": "Floofy Floof", "text": "So isn't the simplest way to get a whole number with a non terminating number to just round up and that becomes your rational number? I'm struggling to wrap my head around it 😅", "likes": 0}}, {"topLevelComment": {"author": "Kenichi Mori", "text": "I see or aim see.", "likes": 0}}, {"topLevelComment": {"author": "Kenichi Mori", "text": "Learn foundation", "likes": 0}}, {"topLevelComment": {"author": "Bekobii", "text": "Such a good explanation. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Paras Sharma", "text": "Thank you teacher ♥️", "likes": 0}}, {"topLevelComment": {"author": "Basliel Alene", "text": "Thanks.", "likes": 0}}, {"topLevelComment": {"author": "August Stas", "text": "It's so funny that kids first have to learn math and then logic should come naturally (by doing lots of math exercises). Problem: most of the kids aren't aware of this, and they find it out late in life, when habits are hard to change. Imagine what would happen if from the first class children would also have logic as a subject. It would actually change the game. No more nonsense problem solving repetition. Just understanding how things work in the first place.", "likes": 0}}, {"topLevelComment": {"author": "AmosDevStudio", "text": "Amazing!😊", "likes": 0}}, {"topLevelComment": {"author": "왁왁왁", "text": "why F implies T is T \ni don’t understand \nThere are understand this?", "likes": 0}}, {"topLevelComment": {"author": "Pasidu Prabhath", "text": "Best lesson i understood it well ❤️", "likes": 0}}, {"topLevelComment": {"author": "Jacob Wells", "text": "18:11 - You don't exist. This really resonated with me.\nThat said, as a strictly virtual being, this video packs a ton of useful information. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Gadi premikudu", "text": "why does a/b reducing to k/l indicate that root 2 isn't a rational number", "likes": 0}, "replies": [{"author": "Haruta Tasaki", "text": "Suppose a/b is a reduced fraction which is equal to square root of 2.\nThen there is contradiction because 2k/2l shows a/b is not a reduced form. So _/2 can't be expressed as a fraction of integers.", "likes": 0}]}, {"topLevelComment": {"author": "osama-ki_masi-ki_pota", "text": "Plz add algorithim chapter", "likes": 0}}, {"topLevelComment": {"author": "mr.AhmadAli", "text": "***************************************************************************************************", "likes": 0}}, {"topLevelComment": {"author": "JAMES I.O", "text": "I am a Microbiologist. While learning i explain things to my self, or my friends even when the discussion isn't about Microbes. But i have a way of driving the discussion to microbes so i can explain what i have learnt. \n\nAnother way is sleep over it. When you wake up and is able to explain that to yourself, it means it has been stored properly in your brain.\n\nNow, i'm learning logical math, as i think this will help me in my new found interest in programming.\n\nThanks for this video bro! \n\nMerry Christmas", "likes": 0}}, {"topLevelComment": {"author": "Oussama Hamdi", "text": "Are u bold because of math!!! 🤔", "likes": 0}}, {"topLevelComment": {"author": "Sky", "text": "I love it. Gonna watch it several times. Thank you for creating the video.", "likes": 1}}, {"topLevelComment": {"author": "Abdallah Toba", "text": "what are the direct applications of these things in programming ?", "likes": 2}, "replies": [{"author": "Clinton Ugo George", "text": "Like writing calculation programs or solving complex programing codes to give a desired action", "likes": 0}]}, {"topLevelComment": {"author": "Shreya", "text": "Thanks for this video.  I have learned a lot of things.  Love ❤ from India 🇮🇳 ❤", "likes": 1}}, {"topLevelComment": {"author": "AZMAIN Faiak", "text": "15:49", "likes": 0}}, {"topLevelComment": {"author": "Jonas Asare", "text": "41:55 Ghana  a peaceful country in West Africa 🇬🇭 🇬🇭", "likes": 0}}, {"topLevelComment": {"author": "Juri Vjerdha", "text": "Tip 1) stay calm\nMe : OMG", "likes": 0}}, {"topLevelComment": {"author": "Childish Gambino", "text": "Not going to lie I am studying the same thing in my mathematics subject and I'm still in school and I have very well understanding of what the teacher is teaching", "likes": 0}, "replies": [{"author": "Spysynth", "text": "Where do I learn from scratch ?", "likes": 0}]}, {"topLevelComment": {"author": "MK", "text": "Got halfway through and realized this really isnt gonna help me in programming, but again Id like to hear from someone on how this math would help em as a programmer (a discussion would be nice)\nthanks for the content though  Mr.Shawn Grooms", "likes": 1}, "replies": [{"author": "MK", "text": "@bella i use JSON, databases (MS Access, power bi).... cant really mention much cuz its government and theyre strict asf on what you can share\nbut basically no algorithms and its very much based on the particular department that im at.... so that makes it a little fun lol\n\nmy manager is like you, loves expressing data and stuff, oh and fun fact, my teams quite data oriented but not in a data structural way, id say our analysis is more based off of MS softwares as opposed to coding", "likes": 0}, {"author": "bella", "text": "​@MK oh good for you, i wonder what you do - html/css design? for general back-end programming, data science, heck even using JS, understanding how to use logic will always be beneficial to you.\nlol i'm the opposite - i love arrays because they allow me to use a lot of data in a very orderly way.", "likes": 1}, {"author": "MK", "text": "@bella *a good update to that comment would be\n-- im now employed and in my current job theres no need for coding loops through arrays or really dealing with any of that\n\nquite glad tbh, cuz i hate arrays and data structures", "likes": 0}, {"author": "bella", "text": "one way it helps you is when you're coding loops using arrays", "likes": 1}]}, {"topLevelComment": {"author": "Saket Modi", "text": "I don't see the point of expensive and slow traditional education system anymore.", "likes": 0}, "replies": [{"author": "Saket Modi", "text": "@Dhèeraj lol. My first encounter with random internet hatred!", "likes": 0}, {"author": "Dhèeraj", "text": "You actually don't see the point of any education at all. Modi?? You must be true to your last name that shows nescience and the kind of half-witted person you must be.", "likes": 0}]}, {"topLevelComment": {"author": "La Neta Diario neto de un scratcher", "text": "Beautiful video, thank you so much!!!!", "likes": 0}}, {"topLevelComment": {"author": "IC", "text": "What a handsome teacher.. reminds me of Mr. Johnny Sins", "likes": 1}}, {"topLevelComment": {"author": "Mr. Crazon", "text": "Muwah! 😘", "likes": 0}}, {"topLevelComment": {"author": "OtakuLeveledUp", "text": "I find this class a million times easier than calculus :)", "likes": 3}, "replies": [{"author": "Black&White Black&White", "text": "Try this one time with my language", "likes": 0}]}, {"topLevelComment": {"author": "Story Genix", "text": "Petition to make a \"Bodybuilding for programmers tutorial\"", "likes": 2}}, {"topLevelComment": {"author": "Mia", "text": "I’m my class and super confused on sets . Thank you soo much for this video", "likes": 0}}, {"topLevelComment": {"author": "Awkward Saxon", "text": "37:33 he's so cute honestly", "likes": 4}, "replies": [{"author": "Leningrad 1944", "text": "🤔.....😏", "likes": 1}]}, {"topLevelComment": {"author": "Matt S", "text": "Math is so f*&$#@% confusing to me", "likes": 0}}, {"topLevelComment": {"author": "ong jolliber", "text": "agent 47 nice rubber ducky there", "likes": 0}}, {"topLevelComment": {"author": "error", "text": "thak you", "likes": 0}}, {"topLevelComment": {"author": "Rajith Lahiru", "text": "❤👌😍", "likes": 0}}, {"topLevelComment": {"author": "Budiono Guntoro", "text": "great smile", "likes": 0}}, {"topLevelComment": {"author": "Eric Groovenhoff", "text": "How was this not taught in HS? & how did I get a diploma thinking I was ready for the world?  This guy is speaking Chinese", "likes": 0}}, {"topLevelComment": {"author": "Tiến Nguyễn", "text": "this is the best lullaby with potato head like me", "likes": 0}}, {"topLevelComment": {"author": "Imdazedandconfuzed", "text": "#33:48", "likes": 0}}, {"topLevelComment": {"author": "Low Poly", "text": "Hope my dumbass can take this", "likes": 0}}, {"topLevelComment": {"author": "Shantanu Pandey", "text": "What a nice person", "likes": 0}}, {"topLevelComment": {"author": "Mahammad Aliyev", "text": "Oh i  watched the whole video during  the one day. Tomorrow gonna watch once again as a revision. Good luck every one. And thanks to this guy and this chanel for providing this usiful videos!", "likes": 4}, "replies": [{"author": "Mahammad Aliyev", "text": "@ChitrA sometimes u'll need some logical operations in order to separate and manupulate on data", "likes": 0}, {"author": "ChitrA", "text": "Okk bt why it is needed...I know plus minus ,,is nt that enough ??", "likes": 1}]}, {"topLevelComment": {"author": "Abo Noah - أبو نوح", "text": "Thanks for this amazing tutorial.\n I think the output of A intersection B should equal {x,y} not {x,y,z} as displayed on the video 12:40", "likes": 9}, "replies": [{"author": "⩘ⲓⲙⲟⲏⲏⲓⲕ⎟", "text": "@Spysynth because *B* does not contain *z,* meaning it cannot be in *A* AND *B*", "likes": 0}, {"author": "⩘ⲓⲙⲟⲏⲏⲓⲕ⎟", "text": "This should be pinned", "likes": 0}, {"author": "Spysynth", "text": "How ?", "likes": 0}, {"author": "james bond", "text": "I feel so smart", "likes": 0}, {"author": "sponge senpai", "text": "ah huh", "likes": 0}]}, {"topLevelComment": {"author": "Ivailo Petrov", "text": "10", "likes": 0}}, {"topLevelComment": {"author": "Andres Canales", "text": "Isn't anybody bothered by the fact that there's an ad every 5 min? Or is it just my case?", "likes": 0}}, {"topLevelComment": {"author": "Worth Quotes", "text": "Hello sir I come across this  video because I was learning programming as a beginner but I didn't study math I have question do we need math for programming if yes or no \nHow much????", "likes": 0}}, {"topLevelComment": {"author": "Weiming Shi", "text": "Hey, the repeating 0.99999... = x , can't be proved equals to 1, which contradicts its original expression.\nI think there's a great explanation done on mCoding channel by James Murphy you should consider correct it", "likes": 0}}, {"topLevelComment": {"author": "e", "text": "Why the circle have infinite points?", "likes": 1}}, {"topLevelComment": {"author": "Kenny Omg", "text": "With the what is discrete mathematics part and how it is you can draw a circle despite it having infinite points on a computer. On a computer screen the smallest point is a pixel which has a size. \n\nSo since the points have a set size, you only need to know which pixels need to be which color. So your computer screen circle, doesn't have infinite points. The amount of points is measured by pixels.\n\nI'm guessing an example of non-discreet mathematics is a while(true) infinite loop, or do I interpret that wrong?", "likes": 1}}, {"topLevelComment": {"author": "George Osborn", "text": "Looks like Eminem is trying a different career path", "likes": 2}}, {"topLevelComment": {"author": "Jeremy Rogers", "text": "I first want to say you did a good job explaining. Im starting my MSCS in a few weeks and I need to understand discrete math. I wish I could understand faster and comprehend it.", "likes": 3}}, {"topLevelComment": {"author": "The Anxious Planner", "text": "At 47 minutes on the table behind him (which isn't discussed) it sayd p is T and  T is T. However it says T v P = F is this right? It's doing my head in!", "likes": 0}}, {"topLevelComment": {"author": "GS", "text": "Thank you Lex", "likes": 0}}, {"topLevelComment": {"author": "guts2", "text": "Thank you this is very useful", "likes": 0}}, {"topLevelComment": {"author": "Fela Ella", "text": "i never now tha math require 'calm'. that's why i always fail, because i always tense up whenever i seeing math (numbers mixed with alphabets and symbols) and when i couldn't understand it, i always blame my self and got stressed.", "likes": 0}}, {"topLevelComment": {"author": "Skool Scribe", "text": "I would like my ID and Passport to be digital and online please", "likes": 0}}, {"topLevelComment": {"author": "Skool Scribe", "text": "This is great for user interface however how might these principles be used for the recording of interactive energy for identification", "likes": 0}}, {"topLevelComment": {"author": "Skool Scribe", "text": "been waiting on a good math keyboard yaya quantum but then again quantum data", "likes": 0}}, {"topLevelComment": {"author": "Nassim", "text": "\"You aren't being great on the subject so there's no need to panic\" such a powerful quote ! trully", "likes": 7}}, {"topLevelComment": {"author": "Vimlesh Kumar Kanaujiya", "text": "You are teaching on Whiteboard, that is good. It is better than Computer.", "likes": 0}}, {"topLevelComment": {"author": "FlooferLand", "text": "1 minute in and i'm already enjoying the course after the rubber ducky trick", "likes": 0}, "replies": [{"author": "FlooferLand", "text": "@Maverick S. 1:00", "likes": 0}, {"author": "Maverick S.", "text": "how does this class apply to the Rubber ducky? im curious", "likes": 0}]}, {"topLevelComment": {"author": "6y42", "text": "omg tysm im so proud of myself that ik math so I can actually program properly and my mom is proud of me that im learning math even tho she doesnt know im doing programming", "likes": 0}}, {"topLevelComment": {"author": "nat", "text": "is there a typo at 12:52? \npretty sure A intersect B should just be elements x and y", "likes": 1}}, {"topLevelComment": {"author": "Shankar Lohar", "text": "Thanks Man.", "likes": 0}}, {"topLevelComment": {"author": "aadil42", "text": "59:12 how false implies true is true...??", "likes": 0}}, {"topLevelComment": {"author": "NobleNormie117", "text": "this guy is a great teacher", "likes": 1}}, {"topLevelComment": {"author": "Phan Tom", "text": "Actually this guy is good but his way of explain things is not for beginners but intermediates\nHe tries his best to explain well but all he does is talk too much and explains things in a difficult way\nI think am just going to delete this video", "likes": 0}}, {"topLevelComment": {"author": "S G", "text": "Just started this course.\n\nThanks for sharing this & making it available to masses...", "likes": 0}}, {"topLevelComment": {"author": "mediastray", "text": "Great course, cutie teacher, who could ask for more? :)", "likes": 0}}, {"topLevelComment": {"author": "parham baghbani", "text": "PERFECT", "likes": 0}}, {"topLevelComment": {"author": "Fernando Naranjo", "text": "Great work. Thx a lot", "likes": 0}}, {"topLevelComment": {"author": "Nafis Fuad Dipto", "text": "This is Gold ♥", "likes": 1}}, {"topLevelComment": {"author": "Suraj Kumar", "text": "There is some mistake while proving demorgan's law . at time 37:06 the equation should have an 'OR' instead of \"and\" only then will it Become \"U\" in the next step . while Changing 'x doesnt belong' to 'x belong ' AND OR changes .", "likes": 1}}, {"topLevelComment": {"author": "Tobi", "text": "Is this all the math and logic needed for programming?\nAnd by sets do you mean any data containers like a dict, hash table, or array?", "likes": 3}, "replies": [{"author": "MUGEN MASTERS", "text": "Not really", "likes": 0}, {"author": "Mark", "text": "Depends what you will be doing.  I wouldn't say it's ALL you would ever need, but it's certainly getting you well on your way.\n\nAs for sets, no. These are mathematical sets.  But I suppose you could say that sets are somewhat analogous to collections and arrays, etc.  But the analogy is probably not that useful.", "likes": 0}]}, {"topLevelComment": {"author": "Mathias Mbizvo", "text": "Handy. Thanks for the tutorial", "likes": 0}}, {"topLevelComment": {"author": "Sadia Subah", "text": "36:41 there is a propblem he said x is NOT an element of B compliment which is false", "likes": 0}}, {"topLevelComment": {"author": "Joe Anderson", "text": "I’m new at this so I might be wrong but I think at 12:46, AnB={x,y}, not {x,y,z}", "likes": 0}}, {"topLevelComment": {"author": "Sakikog Oo Kheng", "text": "11:01. If a * a = (2k) * (2k), why does he put a^2 = 2(2k^2). Shouldn't it be a^2 = 2k^2 ? Cause he's putting a * a = 2((2k) * (2k)) there surely", "likes": 1}, "replies": [{"author": "Spysynth", "text": "@Pie Trader Detective i didn't understand a single line can u tell me what math  topics should i done for DSA", "likes": 0}, {"author": "Pie Trader Detective", "text": "The key is in the word \"a is even\", hence a = 2 * an integer.\n\nAnd the integer he chose was 2k^2.\na^2 = 2 * (2k^2)\na*a = 2k * 2k\na = 2k", "likes": 0}]}, {"topLevelComment": {"author": "Abdou", "text": "Hello world haha I get the pun", "likes": 0}}, {"topLevelComment": {"author": "Nikhil John Jose", "text": "Awesome video but just wanted to point out something that I think was missed out. In the sets-Idempotence law and identities section, only the first identity was covered (after that it was skipped to the next section). Also in the next section the topic was  Complement and Involution laws but the title was Complement and Innovation laws.. So I think that needs a small change (I was confused at first)\n\nP.S. I haven't finished watching the video.. So I have only noticed this much..", "likes": 0}}, {"topLevelComment": {"author": "Judas Israel", "text": "This is interesting", "likes": 0}}, {"topLevelComment": {"author": "Said Elhilali", "text": "SAME DEAL WELCOME", "likes": 0}}, {"topLevelComment": {"author": "Kumar Analytic", "text": "*Best explained sir, from India*", "likes": 1}}, {"topLevelComment": {"author": "Bea V", "text": "phew not a 10h video... just an hour. Will get through this.\nOh God, this is actually tough!", "likes": 1}}, {"topLevelComment": {"author": "Martin Kirik", "text": "You got it wrong at 36:38", "likes": 0}}, {"topLevelComment": {"author": "kishan khatanhar", "text": "Just a suggestion here. It would have been nice to have short videos based on topics instead of having topic wise breaks in one big video.", "likes": 0}}, {"topLevelComment": {"author": "The Sword of my Heart", "text": "So that's why ernie has a rubber ducky :D lol", "likes": 0}}, {"topLevelComment": {"author": "Muhamad imron", "text": "39:50\nImagination -> Logic -> Math -> ALgorithm -> Code", "likes": 292}, "replies": [{"author": "Un usuario generico", "text": "@Li i used to hate math with a passion on hs and i know were you're coming from however when you're learning towards something that can be tangibly done it gets interesting, there is math for everything, even art you just have to open your mind.", "likes": 0}, {"author": "Matilda Lavin", "text": "I may already understand more of this maths, but is an excellent refresher, and is great to keep the tools sharp", "likes": 0}, {"author": "Mosseab Chakrani", "text": "I jump the Math part.", "likes": 0}, {"author": "Mario Souza", "text": "@Li The difficulty and pleasure are in knowing how to critically apply mathematics in solving the problem. Different from having a problem with the written form just like it's seen in high school.", "likes": 3}, {"author": "Mario Souza", "text": "Perfect. Something a high IQ doesn't guarantee you !", "likes": 1}]}, {"topLevelComment": {"author": "Kuji", "text": "Me rewinding stay calm 500 times", "likes": 0}}, {"topLevelComment": {"author": "SiF SiF", "text": "Irc, increasing the number of vertices of a polygon to get closer to a circle is called the method of exhaustion by Archimedes (funny enough he was killed while using this method by a Roman soldier and the last thing he said was \"do not disturb my circles\", not sure if it's true but it's quite funny; the history of pi lmao).", "likes": 0}}, {"topLevelComment": {"author": "Hugurs", "text": "1:02 I think thats if they need a therapist", "likes": 0}}, {"topLevelComment": {"author": "Yo Gacs", "text": "you seem like a soldier🤦🏻‍♀️", "likes": 0}}, {"topLevelComment": {"author": "Yo Gacs", "text": "I love math💖 and I end up teaching math instead of my dream of being a programmer☺️☺️🤭", "likes": 3}, "replies": [{"author": "MUGEN MASTERS", "text": "Lol", "likes": 1}]}, {"topLevelComment": {"author": "Ina Shamone", "text": "I'm currently studying this in high school", "likes": 1}}, {"topLevelComment": {"author": "doot", "text": "Thanks Rubber ducky that wqs helpful", "likes": 0}}, {"topLevelComment": {"author": "Michi L.", "text": "21:59", "likes": 0}}, {"topLevelComment": {"author": "Arun Krishna18", "text": "Okay,thanks but how do I implement them in programs?", "likes": 0}}, {"topLevelComment": {"author": "resignurdrnk", "text": "crazy they let u film this in boot camp", "likes": 0}}, {"topLevelComment": {"author": "David Nitzsche-Bell", "text": "Non-rational numbers section. You're trying to prove that sqrt(2) is irrational, but you glossed over/skipped/delayed some key points. First, it's easier if you assume that a and b are co-prime (they share no common factors besides 1) which means that a/b is irreducible. This needs to be stated as an assumption a the beginning, not thrown in in the middle/end.\n\nIt feels like your proof that \"a is even\" is back to front. I'd start with \"let a = 2k\" (a is even). \"a squared\" is therefore \"4 times k squared\" which is obviously also even. Starting with \"a squared = 2 times (2 times k squared)\" is a big leap to make, since this video is ostensibly for people who are wary about math.\n\nIn general, for this section, I'd start out with something like. \"We just discussed rational numbers. What about irrational numbers? Irrational numbers are ones that..... <fill in here>, such as the square root of 2. How do we know that the square root of 2 is irrational? Well, let's first assume it's *rational* and see what we get..... \n\nI just think your explanation could be improved.", "likes": 0}}, {"topLevelComment": {"author": "Rui Xue", "text": "3:55 set", "likes": 0}}, {"topLevelComment": {"author": "LouSaydus", "text": "Sets are arrays. There done, next?", "likes": 0}}, {"topLevelComment": {"author": "Alaje's Pit", "text": "If you're a Ghanaian and you saw \"Ghana\" in this video then you're awesome to have reached that point...  Wya Die... Let's keep learning", "likes": 1}}, {"topLevelComment": {"author": "Berkouk Lahcene", "text": "Emm i think there's a mistake here \nEeeeh in the \"Set operators\"\nA intersection B ={x,y} only \nCorrect me if i'm wrong", "likes": 0}, "replies": [{"author": "Lau Bes", "text": "almost certain that you are right, its not the only mistake in this video.", "likes": 1}]}, {"topLevelComment": {"author": "A Lutfi Fuadi", "text": "Thanks man", "likes": 0}}, {"topLevelComment": {"author": "PUNKISINTHEDETAILS", "text": "If a decision tree falls in a random forest does it make a sound", "likes": 0}}, {"topLevelComment": {"author": "PUNKISINTHEDETAILS", "text": "Rubber Ducky you're the one You make runtime lots of fu...", "likes": 1}}, {"topLevelComment": {"author": "PUNKISINTHEDETAILS", "text": "Sean Coombs?", "likes": 0}}, {"topLevelComment": {"author": "Ihsan’s", "text": "How", "likes": 0}}, {"topLevelComment": {"author": "Brad", "text": "its 12:23 AM at night... i just watched this entire video and took notes on it.... i have no idea why. By the time I actually use any of this math I will have forgotten everything I just learned. Oh well", "likes": 2}, "replies": [{"author": "Debarghya Roy", "text": "I just started at 2:22 lmao", "likes": 0}]}, {"topLevelComment": {"author": "SoulFlare 692", "text": "Index: 13:45", "likes": 0}}, {"topLevelComment": {"author": "Zen", "text": "Really nice video.I appreciate the teacher.Thanks :)", "likes": 0}}, {"topLevelComment": {"author": "manish maurya", "text": "Thanks bhai!!!", "likes": 0}}, {"topLevelComment": {"author": "motohisa osaki", "text": "博士号以外は学位の授与なんてないんだろうが！", "likes": 0}}, {"topLevelComment": {"author": "motohisa osaki", "text": "5体問題まで解けるから10月5日が発表日だと考えてます。", "likes": 0}}, {"topLevelComment": {"author": "Shaked Rosenblat", "text": "God bless u\nFucking legend", "likes": 0}}, {"topLevelComment": {"author": "왕자우주", "text": "Sets and their Relation and Function are respectively first and second chapter of Class/ Grade 11th NCERT Maths book (for CBSE Board India) .", "likes": 7}}, {"topLevelComment": {"author": "Weird World", "text": "Best way to learn math is practice until you get result but if you get bored after trying for 3  to 4 times you will panic and never try to try ones times then you willnot get the answer", "likes": 0}}, {"topLevelComment": {"author": "The Seeker", "text": "very helpful.", "likes": 0}}, {"topLevelComment": {"author": "The Way", "text": "Thank you,  man! Would you mind to add practical usage of that math please?", "likes": 2}}, {"topLevelComment": {"author": "satyam 1", "text": "It's easy thanks to my engineering entrance exam which I gave in highschool,iit jee🤘.", "likes": 1}, "replies": [{"author": "Dushyant Singh", "text": "Absolutely", "likes": 0}]}, {"topLevelComment": {"author": "Gamer cum Coder", "text": "These guys are GREAT.", "likes": 0}}, {"topLevelComment": {"author": "gmanon", "text": "Mathematics is all about making sense.  Observe, test, conclude and put it into a function or statement capable to proven or reproducd.  Every statement representation is based on a form of reality.\n\nIf you are the type who likes to understand rather than to copy and paste; math can become a natural way of thinking.", "likes": 0}, "replies": [{"author": "MUGEN MASTERS", "text": "It's how universe exist", "likes": 0}]}, {"topLevelComment": {"author": "0mer", "text": "21:56", "likes": 0}}, {"topLevelComment": {"author": "DATA WOLF", "text": "discrete math is so intense this guy lost his hair in 5 seconds.", "likes": 164}}, {"topLevelComment": {"author": "Kshitij Tripathi", "text": "As a non programmer I thought it would be a complicated concept from mathematics, but it was just learning jargon", "likes": 0}}, {"topLevelComment": {"author": "john bones", "text": "Great presentation, good delivery. Unfortunately there are so many adverts it is very hard to watch", "likes": 0}}, {"topLevelComment": {"author": "2 Githa Refina", "text": "i forgot all of those, smh", "likes": 0}}, {"topLevelComment": {"author": "arian rezaie", "text": "Best math teacher ever", "likes": 1}}, {"topLevelComment": {"author": "Sachin Shah", "text": "I hope physics class would also soon come", "likes": 0}}, {"topLevelComment": {"author": "Medieval", "text": "Emmm... You have scoliosis. Yeah there is that. Oh yes maths! Im trying to focus...", "likes": 0}, "replies": [{"author": "MUGEN MASTERS", "text": "scoliosis ?", "likes": 0}]}, {"topLevelComment": {"author": "Paul-Daniel Pedneault", "text": "You are a really talented educator. Hope you are considering an Academic Carreer! Best wishes from Edmonton, Canada", "likes": 0}, "replies": [{"author": "Xen", "text": "where is a nice place to live in canada?", "likes": 0}]}, {"topLevelComment": {"author": "bess", "text": "37:36 *in this video x2*", "likes": 0}}, {"topLevelComment": {"author": "Jedidiah Anarfi", "text": "very helpful. thanks much", "likes": 1}}, {"topLevelComment": {"author": "Roberto Martínez", "text": "Really nice, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Kali! Stark", "text": "what the hellll!!!!", "likes": 0}}, {"topLevelComment": {"author": "Shumetie Tefera", "text": "Too Shallow! we need a lot to know beyond what is shown here.", "likes": 0}}, {"topLevelComment": {"author": "Lucas Zhao", "text": "cute boi", "likes": 0}}, {"topLevelComment": {"author": "The css page", "text": "*COURSE CONTENT*\n⌨️ (00:00) Tips For Learning\r\n⌨️ (01:32) What Is Discrete Mathematics?\r\n⌨️ (03:45) Sets - What Is A Set?\r\n⌨️ (06:22) Sets - Interval Notation & Common Sets\r\n⌨️ (08:25) Sets - What Is A Rational Number?\r\n⌨️ (10:18) Sets - Here Is A Non-Rational Number\r\n⌨️ (12:17) Sets - Set Operators\r\n⌨️ (13:45) Sets - Set Operators (Examples)\r\n⌨️ (15:49) Sets - Subsets & Supersets\r\n⌨️ (17:30) Sets - The Universe & Complements\r\n⌨️ (20:02) Sets - Subsets & Supersets (Examples)\r\n⌨️ (21:56) Sets - The Universe & Complements (Examples)\r\n⌨️ (24:16) Sets - Idempotent & Identity Laws\r\n⌨️ (25:14) Sets - Complement & Involution Laws\r\n⌨️ (27:08) Sets - Associative & Commutative Laws\r\n⌨️ (28:42) Sets - Distributive Law (Diagrams)\r\n⌨️ (30:22) Sets - Distributive Law Proof (Case 1)\r\n⌨️ (32:07) Sets - Distributive Law Proof (Case 2)\r\n⌨️ (33:48) Sets - Distributive Law (Examples)\r\n⌨️ (35:25) Sets - DeMorgan’s Law\r\n⌨️ (37:32) Sets - DeMorgan’s Law (Examples)\r\n⌨️ (39:38) Logic - What Is Logic?\r\n⌨️ (41:26) Logic - Propositions\r\n⌨️ (43:06) Logic - Composite Propositions\r\n⌨️ (44:41) Logic - Truth Tables\r\n⌨️ (46:30) Logic - Idempotent & Identity Laws\r\n⌨️ (48:13) Logic - Complement & Involution Laws\r\n⌨️ (49:58) Logic - Commutative Laws\r\n⌨️ (51:35) Logic - Associative & Distributive Laws\r\n⌨️ (53:09) Logic - DeMorgan’s Laws\r\n⌨️ (54:23) Logic - Conditional Statements\r\n⌨️ (55:45) Logic - Logical Quantifiers\r\n⌨️ (57:59) Logic - What Are Tautologies?", "likes": 71}, "replies": [{"author": "한 진영", "text": "thnx", "likes": 0}, {"author": "CHHABI LAL DHRUW", "text": "Thank you , you are very kind hearted", "likes": 1}]}, {"topLevelComment": {"author": "Jason David Espinoza Siles", "text": "With just the explanation of what discrete math is I define this video as a successful video because it is a good point and not many people can explain it as well as he did. Thanks for sharing!", "likes": 5}}, {"topLevelComment": {"author": "WiseGuyAsif", "text": "this is easy,,,,,,,,programming requires so much more", "likes": 1}}, {"topLevelComment": {"author": "Alfonso Neil Jimenez Casallas", "text": "17:20 the complement of Botswana is South Africa, I got it! 😆", "likes": 2}}, {"topLevelComment": {"author": "BOUNCER STONE", "text": "I AM FROM GHANA <3 I LIKE THE MATHS IN STRINGS", "likes": 0}}, {"topLevelComment": {"author": "Hadi Alqattan", "text": "Thx 👌🏻", "likes": 0}}, {"topLevelComment": {"author": "Vignesh Shanbhag", "text": "As you mentioned, it should be False when the hypothesis (p) leads to a False conclusion (q)\n\nThen, why is p => q True when p is F and q is F?", "likes": 0}, "replies": [{"author": "Adonis Nuñez", "text": "Hi, there is a good explanation in \"The Book of Proof\" page 43.", "likes": 0}]}, {"topLevelComment": {"author": "mroon", "text": "11:59 why?", "likes": 0}, "replies": [{"author": "Hiro Protagonist", "text": "Because for the square root of 2 to be a rational number a/b would have to be the most simplified version of the fraction. Because both a and b are even they can still be reduced. So square root of two can not be expressed as a ratio of 2 numbers", "likes": 0}]}, {"topLevelComment": {"author": "mroon", "text": "12:13 where did 2L come from?", "likes": 1}, "replies": [{"author": "Metal Snake", "text": "We know that b is an even number, so you can divide it by 2. L is just a new variable because 2xL equals b. Or at least this is my understanding, I can be wrong", "likes": 0}]}, {"topLevelComment": {"author": "mroon", "text": "11:11 why did you used 2K^2 ?", "likes": 0}, "replies": [{"author": "Edward W", "text": "If a is even, then there exist k s.t. a=2k and so a^2 = (2k)^2 = 2(2k^2)", "likes": 0}]}, {"topLevelComment": {"author": "lixa", "text": "Awesome video", "likes": 0}}, {"topLevelComment": {"author": "Kailash JB", "text": "can anyone tell me where it would be useful in  terms of programming", "likes": 0}, "replies": [{"author": "Edward W", "text": "It is more about the way of thinking rather than the math it self. When you write a if-else, you use and/or/not. When you write sql, you use union/join/group/ which are fundamentally set operation. If you write regular expressions, the logic is more obvious. However, you will never summarize your coding problem to be so abstract as the math shown, unless you are weighting a paper or doing abstract research.", "likes": 1}]}, {"topLevelComment": {"author": "Premkumar", "text": "Iam very very very very bad in mathematics; iam going to start this video 😭", "likes": 0}, "replies": [{"author": "MUGEN MASTERS", "text": "@Premkumar what do you mean ?", "likes": 0}, {"author": "Premkumar", "text": "@MUGEN MASTERS as usual i forgot everything", "likes": 0}, {"author": "MUGEN MASTERS", "text": "So, how was it?", "likes": 0}]}, {"topLevelComment": {"author": "Talha Kamran", "text": "Explaining your program code to rubber ducky sounds very depressing 😁 ( Nerd Alert! )", "likes": 0}, "replies": [{"author": "Talha Kamran", "text": "Imagine if a hot girl passing by your desk at office sees you talking to a rubbery ducky", "likes": 0}]}, {"topLevelComment": {"author": "David Grove", "text": "You are a mad man!", "likes": 0}}, {"topLevelComment": {"author": "Yan Coder", "text": "I thought they were an advertise free channel 😑", "likes": 0}}, {"topLevelComment": {"author": "Yan Coder", "text": "I thought they were an advertise free channel 😑", "likes": 0}}, {"topLevelComment": {"author": "Jeffrey /", "text": "After the hairloss within the first minute i panicked and had to quit. This is why i stay away from math guys :P", "likes": 29}, "replies": [{"author": "SpaceSheep", "text": "lol", "likes": 0}]}, {"topLevelComment": {"author": "Drews SD", "text": "Годно, автор молодец!", "likes": 4}}, {"topLevelComment": {"author": "p_de_mango", "text": "You Rock guys.. I love math", "likes": 0}}, {"topLevelComment": {"author": "Miki Cerise", "text": "Thanks so much for this, Shawn! :)", "likes": 0}}, {"topLevelComment": {"author": "FPL Fred", "text": "12:42 Hey guys, is there a mistake with the notation of the intersection? He's got it down as A∩B = {x,y,z} but I think it should be A∩B = {x,y} no?\n\nI'm very new to this so if I'm wrong, please tell me!", "likes": 1}, "replies": [{"author": "Persephone", "text": "Yes, I've noticed", "likes": 0}, {"author": "Saurabh Suri", "text": "I think you are right. Noticed the same mistake.", "likes": 0}]}, {"topLevelComment": {"author": "Fatimah math", "text": "🌷", "likes": 0}}, {"topLevelComment": {"author": "Aidan", "text": "I didn't know Slim Shady taught discrete math", "likes": 11}, "replies": [{"author": "e", "text": "Lool", "likes": 1}]}, {"topLevelComment": {"author": "Petter Nybråten", "text": "These kinds of videos are not tutorials, but may be useful to people like myself who have previously been introduced to the material presented. What most teaching videos on computing (and math and any subject I guess) lack most is clear and relevant real world examples that help the brain wire the information and concepts onto thinking about practical applications.", "likes": 23}}, {"topLevelComment": {"author": "Abdeltawab Essam", "text": "ممكن ترجمة إلى اللغة العربية ،، من فضلكم😑", "likes": 1}}, {"topLevelComment": {"author": "Indicoderz", "text": "O", "likes": 0}}, {"topLevelComment": {"author": "Kaushik Kalesh", "text": "He just teaches Sets and Boolean Algebra! Grade X Concepts!", "likes": 1}}, {"topLevelComment": {"author": "Caleb Viernes", "text": "Would this be all of it? Cause I really am going to start practicing this! Great Video btw!", "likes": 0}}, {"topLevelComment": {"author": "Chris", "text": "Ive been a programmer for almost 20 years. Yet i literally cant grasp 95% of this video.", "likes": 13}, "replies": [{"author": "Itz Blinkzy", "text": "I don't think you are a programmer then lol", "likes": 1}, {"author": "tem le", "text": "you are a fake programmer then.", "likes": 1}, {"author": "Aris Totle", "text": "What kinda programming ? And what language do you mostly use ?", "likes": 0}]}, {"topLevelComment": {"author": "ESO artbook", "text": "I had this course back in 2017.. and I didn't understand a thing.excepts sets and the Morgan's law.looking back now I am surprised I didn't fail.\nThanks for making this. I'll encourage my juniors to watch this video", "likes": 2}}, {"topLevelComment": {"author": "Krešimir", "text": "There are a lot of wrong things in this video (or at least not rigorous in the mathematical sense). This video may give you a solid overview of the topic, but I would take everything with a grain of salt and consult proper textbooks and mathematicians.", "likes": 1}}, {"topLevelComment": {"author": "december frost paindine", "text": "I love math, but math doesnt love me..\n\nI cant understand it quickly, just like my gf.", "likes": 2}, "replies": [{"author": "Pratham Pawan", "text": "Epic", "likes": 1}]}, {"topLevelComment": {"author": "Abhisek Roy", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "WooHoo..!", "text": "He : stay calm\nMe : 🙁🙁", "likes": 3}}, {"topLevelComment": {"author": "AnimeCartoonzTvOfficial", "text": "You cut your hair looking like a pasty noodle 😂", "likes": 0}}, {"topLevelComment": {"author": "Arthur Radium", "text": "really nice video.. but it would be better if he could explain for what this stuff is good for ?", "likes": 0}, "replies": [{"author": "David Kizivat", "text": "The topics discussed in the video are basically just foundations for you to be able view your programming assignments (be it at work or school) in precise, rigorous \"language\" (math), which with (a bit, or rather a lot of) training will significantly help you to think about the problems and come up with better solutions to them easier. It's a bit shame this video doesn't follow up on the set theory with relations and functions, but those would be topics that build on top of the covered portion and would usually follow it in college classes. With that theory, for example, you could view the \"subroutines\" (aka \"functions\" or \"methods\" etc.) as a mathematical function with some domain co codomain and if you can define what those are and what is roughly is the expected output, you can often easily connect (reduce) your problem to some well known and researched math problem which would lead you to correct solution (again, thanks to training) without much hustle.", "likes": 0}]}, {"topLevelComment": {"author": "Saima Ali", "text": "The sound is sooo low.. :3", "likes": 0}}, {"topLevelComment": {"author": "Delta Force", "text": "Young people are very intelligent !!\nThanks !!", "likes": 0}}, {"topLevelComment": {"author": "twostickes", "text": "You got me at hello world", "likes": 0}}, {"topLevelComment": {"author": "Jakob Fredriksson", "text": "My rubber duck got tired of my stupidity and flew away and I have no friends.", "likes": 36}, "replies": [{"author": "breimalislobodnoime", "text": "@Abu Dujana my cat just walked away so i guess teddy bear it is 🤷‍♀️", "likes": 1}, {"author": "Abu Dujana", "text": "Try a teddy bear", "likes": 3}]}, {"topLevelComment": {"author": "Cuddy", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Mo Hammed", "text": "Sorry to say but u ruined the video because of the camera used.........😞", "likes": 0}}, {"topLevelComment": {"author": "majid dehbi", "text": "I love computer now I m devoted to switching my hall career I start my new life as computer programmer at 54 years so cold u be my mentor pls", "likes": 77}, "replies": [{"author": "e", "text": "Good luck!", "likes": 0}, {"author": "Phan Tom", "text": "Great idea\nYou can still learn and achieve what you want", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Nour", "text": "I used to know all of that when I was younger!, I feel bad for my self!", "likes": 1}, "replies": [{"author": "Varun Raj", "text": "I'm in 11th and this was in my syllabus!", "likes": 1}]}, {"topLevelComment": {"author": "nicadi2005", "text": "0:12 You could have also started with the words \"DON'T PANIC!\"; this approach has been tried before, so it is known to work...  ;-)", "likes": 1}}, {"topLevelComment": {"author": "09_Rahul Dhiman", "text": "My eyes got blurry", "likes": 0}}, {"topLevelComment": {"author": "blabla7360", "text": "just want to say that this is one of the most helpful channels on youtube and is free so I just wanted to say keep up the good work man your a big help for knuckleheads like me :P", "likes": 0}}, {"topLevelComment": {"author": "Satoshi Nakamoto", "text": "So we're all just going to ignore, that 1:32 in he goes from hair to no hair, ok cool! 😂😂", "likes": 1}}, {"topLevelComment": {"author": "Nature", "text": "13:15 some one explain me", "likes": 1}, "replies": [{"author": "David Kizivat", "text": "it's hard to explain without a Venn diagram (look that up for some visuals), but here is a try: The meaning of a \"symmetric difference of sets\" is basically \"all elements of A that are not in B, together with (symmetrically) all elements of B that are not in A\". Symmetric, because you take out common elements from both sets, instead of just one in the case of basic set difference A \\ B, or B \\ A. So going by the said meaning: \"all elements of A that are not in B...\" part is just A \\ B, the symmetric part is B \\ A, and to put the resulting elements together in one set, we unify the results => (A \\ B) ∪ (B \\ A).", "likes": 0}]}, {"topLevelComment": {"author": "c_a", "text": "beautiful and consice <3", "likes": 0}}, {"topLevelComment": {"author": "c_a", "text": "can someone give some examples of where these sets and properties etc might be helpful in programming?", "likes": 3}, "replies": [{"author": "Derek Finlen", "text": "If i wanted to get permissions for a user and the permissions y9u are a mber of.  Or if i need a report of a customer's orders for last year. ETC ETC.", "likes": 0}, {"author": "Derek Finlen", "text": "Sets are database tables also set logic is used evyerwhere you have a set of objects.", "likes": 0}]}, {"topLevelComment": {"author": "pro metheus", "text": "21:56 The universe and complements examples: That \"x\" in the definition of A^c is not the actual element of set A, isn't it? It just the description and could've been called anything like a variable name?", "likes": 0}}, {"topLevelComment": {"author": "pro metheus", "text": "Is he a Maths teacher?", "likes": 0}, "replies": [{"author": "pro metheus", "text": "@Dominic Domson Not really. Although, I enjoy his teaching very much, it's not necesserily mean that he is a trained teacher(I don't know may be he is) but he is good and I enjoy it.", "likes": 0}, {"author": "Dominic Domson", "text": "he teaches math in the video so by definition the answer to your question must be yes", "likes": 0}]}, {"topLevelComment": {"author": "Siddharth Panjwani", "text": "There is a mistake here at 10:43. If you are assuming that b^2 is a separate integer then a^2 is not equal to 2 times b^2. \nFor it to be equal, a^2 should be equal to (2b)^2 which is not the same. \n\nFor example:\n(4)^2 = (2x2)^2 = 16.\n\nAs per the assumption in this video,\n(4)^2 = 2 x 2^2 where\n(4)^2 = 16\n2 x 2^2 = 8\n16 is not equal to 8\nTherefore the assumption to prove a^2 is even is wrong and b^2 cannot be taken separately.", "likes": 3}, "replies": [{"author": "weelkeen", "text": "In the first column: both sides are squared, then multiplied by b^2\nThen, since a^2 and hence a are even, a should be = 2 * k \n=> a * a = 2 * k * 2 * k \nor, a^2 = 2 (2 * k^2)\nIn the second column: knowing that\n2 * b^2 = a^2 = 2 (2 * k^2)\n=> 2 * b^2 = 2 * (2 * k^2)\n\nDid this help? I didn’t quite understand your comment fully, maybe you were pointing at something I didn’t notice", "likes": 1}]}, {"topLevelComment": {"author": "virtual nerd", "text": "what are prerequisites to learn discrete maths", "likes": 0}}, {"topLevelComment": {"author": "Javier Meza", "text": "On 36:48 you say X is NOT a compliment of Ac and NOT a compliment of Bc. Is that correct? Since its not an element of A or B shouldnt it be an element of Ac or Bc?", "likes": 0}, "replies": [{"author": "Daniel Caron", "text": "You are correct.", "likes": 0}]}, {"topLevelComment": {"author": "Javier Meza", "text": "What other kind of maths does a beginner programmer need to study?", "likes": 1}}, {"topLevelComment": {"author": "Мартин Темелакиев", "text": "damn thanks", "likes": 0}}, {"topLevelComment": {"author": "CSS master", "text": "I was calm!!!!!!! but then when you said it, I freaked out.", "likes": 1}, "replies": [{"author": "Christian Rex Rubia", "text": "HAAHAHHAHAHHA same here my heart beat rises 😂", "likes": 0}]}, {"topLevelComment": {"author": "Keep Kalm", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "phil", "text": "What is discrete", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Ali", "text": "Are you brother of a Hollywood Actress Ali Larter ?", "likes": 0}}, {"topLevelComment": {"author": "Yash Pandey", "text": "the guy in the starting minutes comes again in the 49th-minute topic and then disappears.", "likes": 0}}, {"topLevelComment": {"author": "Yash Pandey", "text": "After 35 minutes: why you are writing union as \"and\".", "likes": 6}}, {"topLevelComment": {"author": "Crypto Assets", "text": "I panic when I hear mathematics:( I want to study computer science but math is my biggest fear", "likes": 2}, "replies": [{"author": "Mark", "text": "@Zarius 322 Yes, it absolutely is a branch of mathematics.", "likes": 0}, {"author": "Ray J123", "text": "Zarius Longidius yes it is", "likes": 0}, {"author": "Zarius 322", "text": "@Ray J123 no its not", "likes": 1}, {"author": "Ray J123", "text": "Reforged World computer science is a branch of math", "likes": 0}]}, {"topLevelComment": {"author": "AYUB SECTION", "text": "Thank you so much for all these videos..  LOVE FROM RUSSIA", "likes": 1}}, {"topLevelComment": {"author": "SOk Sam", "text": "I love you!! !", "likes": 0}}, {"topLevelComment": {"author": "Lou Simms", "text": "I can grasps concepts with with reasonable effort. My issue is remembering what I learned down the line because once I learn it, I have no reason to keep using it as there's more to learn. It's not like I have job doing this where I get to apply what I learn everyday after learning it. Nope! Instead, it's like okay I learned this thing, now I need to learn these other 4 concepts. By the 3rd, 4th concept, I remember little of what I learned regarding the 1st concept. I need a way around this!", "likes": 0}, "replies": [{"author": "David Kizivat", "text": "When learning math for programming, while good approach to keep in touch with math while programming is to practice computer science programming assignments. But not in the manner to \"just solve the problem programmatically\", but while coming up with the solution, try to \"model\" the problem and the solution in mathematical terms. The topics in this video are just foundation for you to be able to use math as language to describe problems and solutions.", "likes": 0}]}, {"topLevelComment": {"author": "Mika", "text": "I wasn't ready for the light speeded haircut you did there dude", "likes": 13}}, {"topLevelComment": {"author": "Mrittika Murmu", "text": "Why false implying true is true. Can anyone please explain.", "likes": 0}}, {"topLevelComment": {"author": "Emely Jwees Qaling", "text": "who is in 1er year Bac here", "likes": 0}}, {"topLevelComment": {"author": "Emely Jwees Qaling", "text": "i like this vedio but it is just one lesson or more", "likes": 0}}, {"topLevelComment": {"author": "Maths & Music", "text": "Hi guys..I made videos too about maths tricks and techniques. if you want to learn more about maths you can also visit my channel..thank you", "likes": 0}}, {"topLevelComment": {"author": "Naseef O", "text": "Uhhhhh! I love you free code camp!!!!!!\nIf you guys take a request can you please make a chatbot with tensorflow Tutorial!!!!.\nIt will be very much appreciated.", "likes": 0}}, {"topLevelComment": {"author": "vishnu panchal", "text": "12:50 correction x = {x, y}", "likes": 7}, "replies": [{"author": "Jack Issa", "text": "Thank god I though I was crazy", "likes": 0}]}, {"topLevelComment": {"author": "Tepung Goreng", "text": "Keep calm and learn math, repeat.", "likes": 2}}, {"topLevelComment": {"author": "Jurassic Pork", "text": "Fastest hair loss in the history of human kind. \n00:01 - 01:40", "likes": 770}, "replies": [{"author": "Said Ibrahim", "text": "haha 🤣😆", "likes": 0}, {"author": "Shahin Shah", "text": "😂😂😂", "likes": 0}, {"author": "excalibur GZ", "text": "HAHAHAHAHAHAHAHA", "likes": 0}, {"author": "kamilion100", "text": "The same t-shirt could not cover it up", "likes": 1}, {"author": "PUNKISINTHEDETAILS", "text": "@Yash Pandey yeah. exactly. same scalp different dude", "likes": 1}]}, {"topLevelComment": {"author": "Enosh Subba", "text": "And who on earth disliked such an amazing Presentation. The Man really put a lot of effort and made it ultra simple.", "likes": 1}}, {"topLevelComment": {"author": "Matt Graves", "text": "Dangit, I really wish people would explain why they are using particular numbers.\n@9:00 about, why did you use those numbers and why is it important that they are even or odd? I think Math is just beyond me.\nI guess \"we can say\" x does this but WHY? show me a practical example or show me how this works in the physical world", "likes": 11}, "replies": [{"author": "Shyamal jyoti Hazarika", "text": "Cryptography...there are many more.. correct me if i am wrong.", "likes": 0}, {"author": "Petyr Baelish", "text": "That's the most discouraging thing about math teachers, unfortunately. But as my professor once said, once you get hold of the mathematical mental approach you'll feel much stronger.", "likes": 0}]}, {"topLevelComment": {"author": "universalConstructor", "text": "Take this from a non cs major, or any engineering field for that matter. You made this whole subject very understandable and concise. Thank you.", "likes": 232}, "replies": [{"author": "Nubaise Muhammed", "text": "This is just basic high school math;no rocket science needed as prerequisite", "likes": 0}, {"author": "Hayaan Qaran Media", "text": "Whoam", "likes": 0}, {"author": "Hayaan Qaran Media", "text": "Was", "likes": 0}]}, {"topLevelComment": {"author": "Vijay Raj Singh", "text": "Where are you from brother?", "likes": 1}}, {"topLevelComment": {"author": "Nishant Shrestha", "text": "Really good", "likes": 0}}, {"topLevelComment": {"author": "Predak", "text": "Is this course for absolute beginners or we need to know about something more like the studies of 11th n 12th", "likes": 1}, "replies": [{"author": "Spysynth", "text": "Can u reply me now as you must know everything now ?", "likes": 0}]}, {"topLevelComment": {"author": "asd fgh jkl", "text": "I am 15 but I really enjoyed this video. Thank you so much. Love from Bangladesh! ❤ 🇧🇩", "likes": 0}}, {"topLevelComment": {"author": "Md Liaquat Ali", "text": "You are a great teacher.", "likes": 0}}, {"topLevelComment": {"author": "Shohrab Hossain", "text": "awesome tutorial. I'm from Bangladesh.", "likes": 0}}, {"topLevelComment": {"author": "Victor Rodriguez", "text": "I like mathematics but somehow when you said \"first stay calm\", I started to panic", "likes": 1883}, "replies": [{"author": "Vicky Tatarkina", "text": "I read your comment before starting the video and i started panicking", "likes": 0}, {"author": "Ryzzo92", "text": "😂", "likes": 0}, {"author": "sushant chaulagain", "text": "Haha yes 😆", "likes": 0}, {"author": "roy Castanares", "text": "Lol", "likes": 0}, {"author": "ravo〆", "text": "🤣🤣🤣\nSame!", "likes": 0}]}, {"topLevelComment": {"author": "Demetrius Dasilva", "text": "00:09 - How to learn discrete math\n01:35 - What is discrete math\n03:48 - What are SETS\n04:27 - \"∈\" symbol explained\n04:46 - Roster Notation or Set-Builder Notation\n06:25 - Interval Notation and common sets\n08:26 - \"Q\" Rational Numbers and Set Builder Notation\n10:19 - SETS: Non-rational Numbers\n12:18 - SET Operators - Signs: ∪, ∩, \\, △, ⊖ or ⊕\n13:45 - SET Operators Examples with Diagrams\n15:49 - Subsets and SuperSets", "likes": 430}, "replies": [{"author": "British vlog", "text": "Thanks actually we learnt all that in High school", "likes": 0}, {"author": "Julie O'Luna", "text": "Maths*", "likes": 1}, {"author": "꧁DELDRISE꧂", "text": "@Scemmer Joke this was posted before time stamps was a thing", "likes": 4}, {"author": "MrGerdbrecht", "text": "Isnt that what u learn in school, and has nothing todo with programming?", "likes": 0}, {"author": "Ab Cd", "text": "Heaven is filled with people like you Sir.", "likes": 4}]}, {"topLevelComment": {"author": "John Batchler", "text": "Not that of mathematics", "likes": 0}}, {"topLevelComment": {"author": "Team AIRO", "text": "https://www.youtube.com/watch?v=bnwGuSN3o4w&list=PLjJKx-kNtT4fyBoz4uW5-n2aEQKTr0Zrf", "likes": 0}}, {"topLevelComment": {"author": "Happy Man", "text": "Web  developers do not need math 😁😁😁", "likes": 2}, "replies": [{"author": "fiod666", "text": "That's why their apps take often horrendous amounts of RAM or are slower than they could be. They can't reason about stuff and brute force everything by double loops etc. Look at leetcode problems, if you don't know how to apply there the fastest solutions then you're simply bad at your job and you should learn discrete math as soon as possible for your own good.", "likes": 2}, {"author": "Scott Burgert", "text": "they need patience to put up with js", "likes": 0}]}, {"topLevelComment": {"author": "Thea Mjolnir", "text": "Honestly love this channel!!", "likes": 0}}, {"topLevelComment": {"author": "yourcode", "text": "the title is in french but it is in english", "likes": 0}}, {"topLevelComment": {"author": "Denis Kovalenko", "text": "I found a few mistakes in math ) I was the best in math in my Moscow UNI. Unfortunately, most of the modern students poor in math. But they believe they are good coz they can count 856  + 1166. I can't count fast. To me, math was never about counting naturals", "likes": 12}, "replies": [{"author": "Petyr Baelish", "text": "И как тебе пригодился матан в итоге в жизни? Большинство математиков, которых я встречал, очень далеки от насущных практических проблем. Меня как инженера это просто выбешивало в свое время.", "likes": 1}]}, {"topLevelComment": {"author": "sinister geek", "text": "lo what interval did he took!! i mean how long does it took to make this video because his hair seem to be comming and going quite often", "likes": 0}, "replies": [{"author": "sinister geek", "text": "@MrX Yeah i realized !!", "likes": 0}]}, {"topLevelComment": {"author": "Himanshu Kumar", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "jbaisden", "text": "I'm new at this and a bit confused...but shouldn't the answer for A Intersection B be {x,y}. Z is only in A and C is only in B so wouldn't those set elements be excluded from this result?", "likes": 0}, "replies": [{"author": "Midas", "text": "Yes, I saw this too.  I believe you're correct.  Hopefully someone confirms.  Then a moment later he has the order wrong, I think... should be A+B = {z}u{c} = {z, c} not {c}u{z} = {c, z}, since A/B = {z}.  Minor errors can be confusing.", "likes": 0}]}, {"topLevelComment": {"author": "Sean Spicer", "text": "here's one method:\n1) import math as maths\n2) maths.solve_from_handwritten_scan(my_problem)\n3) ???\n4) return profit", "likes": 9}}, {"topLevelComment": {"author": "fotios", "text": "Just for the record. The first man who found out (in ancient Greece 500 b.c.) that the square root of 2 is not a rational number was a student of Pythagoras, named Hippasos. Unfortunately the others could never accept the existence of irrational... Anyway thanks for the great video.", "likes": 13}, "replies": [{"author": "Michael Adair", "text": "@OutOfAHat HA! Math jokes...", "likes": 0}, {"author": "OutOfAHat", "text": "@Michael Adair yes, they were acting irrationally.", "likes": 4}, {"author": "fotios", "text": "@Michael Adair To tell you the truth, I wash shocked when I red it my self … but yes it’s true.", "likes": 1}, {"author": "Michael Adair", "text": "I remember hearing about that. Didn't they kill Hippasos for informing them about that math had irrational numbers by tossing him off a bridge and drowning him or something? HA!", "likes": 1}]}, {"topLevelComment": {"author": "Trojanlol", "text": "I didn't get the conditional thing. Can you give me an exemple so I can picture what it's about ?\nIs it something like \"if you know an hypothesis to be true, it can prove that something is true, or false\" i.e. T=>T = T   /// T=>F=T    //// \"if you know an hypothesis to be false, it can prove that something is false, but it cannot prove something is true\"  i.e F=>F=T /// F=>T=F\nSo the X=>X  is true if it's a logically valid statement, if it's not logically valid it's false.\nIs it that or not at all ?", "likes": 0}}, {"topLevelComment": {"author": "HEINRICH RUV", "text": "Gamify these concepts,and I will understand it better.\nTurn boring math exercises into puzzle missions with achievements,and i will play with them like a regular video game.", "likes": 3}, "replies": [{"author": "charlienojokes", "text": "gamify it yourself ;)", "likes": 5}]}, {"topLevelComment": {"author": "jawad rasheed", "text": "I love you guys, my god this is a service to humanity. Stay blessed, education should be a human right not a luxury.", "likes": 100}, "replies": [{"author": "Richard", "text": "@Arthur Shut up delusional libertarian", "likes": 0}, {"author": "Ryan Albertson", "text": "@Arthur jesus, did your mother charge you a fee for her milk? Did you pay tuition for your potty training? Would you not argue you had a right to those things? Or were your parents your slaves? Just trying to understand the logic here.", "likes": 4}, {"author": "Joseph", "text": "@Arthur bless u sir", "likes": 1}, {"author": "Ciro Goyeneche", "text": "@Arthur Anyways, I'm agree when you say society is necessary for human surviving. But I don't see the term as must-exist thing, because it'd be a contradiction. A society is a voluntary association.", "likes": 0}, {"author": "Ciro Goyeneche", "text": "​@Arthur You're considering the \"society\" term as a must-exist thing. But it's a betrayal of the meaning of words. Society is, in essence, a voluntary union of two or more people. The modern concept of society is a non-voluntary society (which is a contradiction) given the fact that I haven't signed any agreement to be part, in my case, of Argentina.\nThe concept of \"nation\" is a collectivist one, because you're assuming everyone is agree with, in your example, being considered \"ukranian\". And it's not so.", "likes": 0}]}, {"topLevelComment": {"author": "James Ross", "text": "Nice haircut!", "likes": 0}}, {"topLevelComment": {"author": "RUNNER", "text": "You lost me after the first few minutes, when you started talking about Vertices, without explaining what a vertices is.", "likes": 2}, "replies": [{"author": "RUNNER", "text": "@Alex BittoNagy Thank you. I understand it now.", "likes": 0}, {"author": "RUNNER", "text": "@Shay XT Thank you", "likes": 0}, {"author": "Alex BittoNagy", "text": "Well.........why don't you look up the definition of vertice?", "likes": 1}, {"author": "Shay XT", "text": "Vertex is a point, usually an intersection of straight lines.", "likes": 0}, {"author": "RUNNER", "text": "Footage, Actually I did.", "likes": 0}]}, {"topLevelComment": {"author": "Rocky Skyler", "text": "This is topical as I'm reading Quine's Mathematical Logic. It's nice to see this material mentioned at all with a view to its practical applications.", "likes": 4}}, {"topLevelComment": {"author": "P.J. van der Linden", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "EngineerDogIta", "text": "Great course on Math Logic, i hope for for more video on discrete math, especially Hilbert proof system!", "likes": 8}}, {"topLevelComment": {"author": "Ali Akbar", "text": "That's really useful knowledge you shared to us. One request tho. Could you please make video about some real life case study involving math and how to translate it into code ? Like on your whiteboard at 39:45", "likes": 9}}, {"topLevelComment": {"author": "Alex Disibio", "text": "Not as focused on the \"for Programmers\" part as I was hoping. I would have liked to see some cool mathematical optimizations and useful approximations, rather than a high-school math refresher, but glad to see the work put into something like this nonetheless.", "likes": 30}}, {"topLevelComment": {"author": "jefferson santiago", "text": "I'm glad I did get an email about this. I wouldn't have known this otherwise.", "likes": 21}}, {"topLevelComment": {"author": "sean o", "text": "Thank you for this. \nAt 8:59 I think there is an error: \"we have 9x=9\". If x = 0.999... then 9x does not quite equal 9.", "likes": 0}, "replies": [{"author": "swapnilghan", "text": "10x = 9.999... and x = 0.999..., If we subtract values i.e. 9.999 (which is 10x) - 0.999 (which is x) = 9 (becomes 9x)", "likes": 1}, {"author": "Misha Shivers", "text": "Except that 10x - 1x is the same thing as 9.999... - 0.999... , which does equal 9.", "likes": 4}]}, {"topLevelComment": {"author": "Browntulips Media", "text": "Thank you, thank you, thank you!!! Can't thank you enough though.", "likes": 0}}, {"topLevelComment": {"author": "Shay Elmualem", "text": "https://youtu.be/2SpuBqvNjHI?t=1071 best part :)\n\nGreat video by the way - thanks!", "likes": 0}}, {"topLevelComment": {"author": "At Indo", "text": "This is will just be stuck at my mind for a minute or so and it'll be gone after that. *sigh* I need a real-world example to really understand this.", "likes": 0}, "replies": [{"author": "Misha Shivers", "text": "You can find some great practical examples of set operations if you ever work with SQL databases and perform different kinds of joins.", "likes": 1}, {"author": "MW", "text": "code some machine learning and you'll come across basically all of his concepts", "likes": 1}]}, {"topLevelComment": {"author": "Riddick 4Ever", "text": "Best Mathgramming video I recently watched!!!!!!!", "likes": 1}}, {"topLevelComment": {"author": "judgeomega", "text": "how would you define and test the validity of a set of sets which arent members of any set?", "likes": 2}, "replies": [{"author": "dnvdk", "text": "hmmm", "likes": 0}]}, {"topLevelComment": {"author": "Tshesko ElMaximus", "text": "Very Good Refresher", "likes": 1}}, {"topLevelComment": {"author": "HAMRO GARAGE", "text": "Mathematics for MACHINE LEARNING PLZ", "likes": 1}, "replies": [{"author": "Luca Arrigo", "text": "https://www.edx.org/course/essential-math-for-machine-learning-python-edition#prerequisites", "likes": 0}]}, {"topLevelComment": {"author": "akinhwan. com", "text": "thanks for the video! i feel like he shaved his head for the efficiency haha", "likes": 4}}, {"topLevelComment": {"author": "Lank Asif", "text": "There seems to be a mistake at 50:37 where he says False and False equals True. You might want to add a caption to the video correcting this.", "likes": 457}, "replies": [{"author": "Mario Rol", "text": "@Sra9an Yes those are incorrect. The 5th and 8th column should be logically equivalent.", "likes": 1}, {"author": "Mahammad Aliyev", "text": "Thanks for informing us! Well done!", "likes": 2}, {"author": "Sra9an", "text": "what about 52:51? 6 and 7th row", "likes": 1}, {"author": "Lank Asif", "text": "lol, seems I did thank you already, but you deserve both so I'll leave this here ;)", "likes": 10}, {"author": "freeCodeCamp.org", "text": "Good catch. Unfortunately YouTube no longer allows captions after videos are uploaded. At least people will be able to see your comment. :)", "likes": 206}]}, {"topLevelComment": {"author": "Lank Asif", "text": "This video is incredible and just about the BEST thing I could've hoped for right now. THANK you very much for providing this resource.", "likes": 51}, "replies": [{"author": "Black&White Black&White", "text": "https://youtu.be/mZQhTgK5J9k", "likes": 0}]}, {"topLevelComment": {"author": "Marketing Area", "text": "This is good information 🤗", "likes": 1}}, {"topLevelComment": {"author": "dada baba", "text": "Is calculus  necessary for programmers?", "likes": 2}, "replies": [{"author": "Jessica Rose", "text": "@freeCodeCamp.org What Math exactly is necessary for programming? And what math do you have to be proficient in to understand Discrete Mathematics? Right now I'm in school taking College Algebra. Is it safe to go straight from College Algebra and practice Discrete Mathematics? I can easily buy a book on it, like Discrete Mathematics DeMystified, and if I have to I'll buy a textbook alongside the DeMystified book to help me understand it better. But this video is really good by the way. I can understand some things already because of my College Algebra Class.", "likes": 1}, {"author": "freeCodeCamp.org", "text": "No.", "likes": 3}]}, {"topLevelComment": {"author": "RS. Utsha", "text": "My whole 4 month semester in 1 hour and much much better explanation and so so easy to understand.", "likes": 215}, "replies": [{"author": "Otis Milburn", "text": "Exactly", "likes": 0}, {"author": "V", "text": "@dannad x in my economic studies we had basic cs courses. we also had to convert numbers of all different bases into other bases... its so pointless to teach things like thins in general and basic cs. i mean, its good to teach that there are different bases and why they exist, but why the hell would you need to teach students how to convert each base into another. thats something you will never need as an economy student, or even cs student or programmer. its so pointless and just turns ppl off of cs.", "likes": 0}, {"author": "dannad x", "text": "Better yet, my first semester took an entire year and told me exactly that.\nI will never miss converting 6 A4 pages of numbers into different bases, doing binary/octal/hex math, and then converting it all into decimals.", "likes": 0}, {"author": "Madhab Kafle", "text": "Discrete mathematics ?", "likes": 0}, {"author": "GArry", "text": "@Kingdom Cre8tive lol sadly that is true, no matter how good you are in the industry if you don't  have a \"degree\" ,  they will choose somebody who is probably not as good as you but has a degree.", "likes": 3}]}, {"topLevelComment": {"author": "RJ", "text": "Thank you very much for this course!\n\nAn excellent delivery of the material in a very concise and practical manner\n\n\nPS I tried to revise Discrete Math for myself using MIT CS videos but the old artsy-fartsy prof makes you even more confused, totally killing the subject. \n\nThank God there are young guys like Shawn making CS area easier and more approachable for people one step at a time!", "likes": 89}}, {"topLevelComment": {"author": "AdiL IsmaiL", "text": "Is it easy to understand?", "likes": 1}, "replies": [{"author": "Michael", "text": "nope, but go for it", "likes": 0}]}, {"topLevelComment": {"author": "Azubyke Okubor", "text": "Interesting", "likes": 1}}, {"topLevelComment": {"author": "Victor Mongi", "text": "First...", "likes": 0}}, {"topLevelComment": {"author": "Natoshi Sockamoto", "text": "1 million times! Thank you!!!", "likes": 2}, "replies": [{"author": "RJ", "text": "@fybsc075 KHAN FARUKH HABIB not even please or thanks tho mate? lol", "likes": 0}, {"author": "RJ", "text": "@fybsc075 KHAN FARUKH HABIB for coding almost to none, for DS the more the better", "likes": 0}, {"author": "RJ", "text": "Linear Algebra, Statistics and Probability, Calculus (more applicable to Graphics or heavy engineering stuff or/and... who knows what else, right?)\n\nIn general, the more problem solving related skills one knows and can translate these into whatever math works and algorithms too, the more advanced that programmer would be", "likes": 3}, {"author": "Natoshi Sockamoto", "text": "Is there a list of other Maths you would recommend for beginning programmers?", "likes": 1}]}]}