{"video": {"id": "312RhjfetP8", "title": "SQLite Database for Android - Full Course", "description": "Learn how to use an SQLite database in Android Studio. \n\nThis tutorial shows every step of programming a demo Android application that uses an SQLlite local database. You will learn how to create an SQLite local database on the Android device, configure new tables with the onCreate method, setup the columns and data types, extend the SQLiteHelper class, create CRUD methods in a DAO (Data Access Object) class, display results on a listview, and more.\n\n✏️ Course developed by Shad Sluiter. Check out his YouTube channel: https://www.youtube.com/user/shadsluiter\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H28M22S", "likes": "3902", "views": "169167"}, "comments": [{"topLevelComment": {"author": "Grass", "text": "better and more straighforward than my uni teacher, thanks a bunch", "likes": 0}}, {"topLevelComment": {"author": "日本帝皇孙笑川次郎", "text": "I am so glad that I found this video, the best teacher I found so far!", "likes": 0}}, {"topLevelComment": {"author": "Српски Добровољац", "text": "At 1:06:18, the professor uses a ternary operator, I would assume to demonstrate the syntax which may be unfamiliar to some people. To add a little bit of clarity on how Java types work, the == operator already returns a boolean value, so x == 1 already returns true or false, no ternary operator needed. While I'm sure the professor is aware, I'd just like to point it out for the people who are still learning Java.", "likes": 0}}, {"topLevelComment": {"author": "Oscar Renan", "text": "The records can have, in the same database, a url of the web image and make a listing, using a cardwiew with the records and associated image, looking for the image of the url to show next to each record ? answer so I can see doing this I'm in an internship and they asked me for an app with this and I can't find how to do it even in the manual, someone must have kept a secret about it. Not even andoid means how to do it lol", "likes": 0}}, {"topLevelComment": {"author": "Scopez", "text": "I don’t even listen to Nice tutorialm im just reading the comnts lmao", "likes": 0}}, {"topLevelComment": {"author": "Ibrahim Almesbahi", "text": "Hi Prof\r\nI am starter with android.\r\ni want to develop an app for sale prodects and i want the user to browse the products offline.\r\ni am using remote sql server and i know that i have to use Sqlite for offline work.\r\n\r\nmy difficulties on how to make sync between remote sql server and SQlite.\r\n\r\ncould   you please help me on this point", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "this is what i am trying to do..\ncreating an app that can refer data from a database..\nmeaning loaded from hard disk..\nnot from RAM", "likes": 0}, "replies": [{"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "\"primary key auto increment cannot be used with INTEGER\" i tried to use floating point and get this message in the logcat so how to do for floating point?", "likes": 0}, {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@57:02 i only have two files instead of three .db and .db-journal instead of 1.\".db\", 2. \" .db-shm\", and \"db-wal\"", "likes": 0}]}, {"topLevelComment": {"author": "Refik Jaija", "text": "Is it possible that when a checkbox for example is not checked instead of showing false to not show that entity at all.", "likes": 0}}, {"topLevelComment": {"author": "Alexandr Prodan", "text": "But if I'd like to keep the data in database how would I do that?\nBecause when I install the apk on the phone I get a completely empty database.\nPleas If someone knows, help me.", "likes": 0}}, {"topLevelComment": {"author": "Mirsad Hadzic", "text": "anyone did search method?", "likes": 0}}, {"topLevelComment": {"author": "Fla Mingo", "text": "Danke!", "likes": 1}}, {"topLevelComment": {"author": "Crimson Blue", "text": "this guy is good at teaching people.  very nice 🤗🤗", "likes": 0}}, {"topLevelComment": {"author": "code chaser", "text": "One of the best video on YouTube for android sqlite database..", "likes": 0}}, {"topLevelComment": {"author": "Visitante 123", "text": "ALGUÉM PODE EXPLICAR COMO GRAVAR UMA PALAVRA DE UMA FRASE EM NEGRITO OU BOLD? E DEPOIS FECHAR A ATIVIDADE E RECUPERAR ESTA MESMA PALAVRA EM NEGRITO OU BOLD? \n\nCANSADO DE VÍDEOS BÁSICOS.  NÃO CHAMA O PÚBLICO PARA CONFIAR NELE.", "likes": 0}}, {"topLevelComment": {"author": "William Selinder", "text": "What a great teacher! All understood, all worked well! Fantastic!!!", "likes": 1}}, {"topLevelComment": {"author": "Alisa Schu", "text": "Where can I find the video about Room that he is talking about at the end ?", "likes": 0}}, {"topLevelComment": {"author": "Lahiru Roshan", "text": "hey. how to change db location on the phone? can i save the db in sd card", "likes": 0}}, {"topLevelComment": {"author": "Wahid Kalo", "text": "Exclusive video that helped to understand where other videos failed\n\nGood job\nGOD bless", "likes": 0}}, {"topLevelComment": {"author": "Polygoodboy", "text": "TOP CLASS TEACHER!!! Thank you Sir!", "likes": 0}}, {"topLevelComment": {"author": "Ryan Baltazar", "text": "How can I insert the data in Custom ListView?", "likes": 0}}, {"topLevelComment": {"author": "coderLady", "text": "is sqlite meant for big android apps? if NO , what should I use as databasefor big android app that used a chat and other functionalities?", "likes": 0}}, {"topLevelComment": {"author": "mary ann pickleball", "text": "Great teaching style. I'm a newbie and so far this has helped tremendously. However, I've followed everything exactly and it was working just fine until I got to the last section about changing the View All button to show the list instead of the Toast msg. \"ArrayAdapter\" is yellowed out and now the app crashes when clicking \"view all\". Any idea why this would be the case? I'm running Bumblebee version.", "likes": 0}}, {"topLevelComment": {"author": "qpdbwvwdbqp🍔🍕", "text": "Amazing! It was very useful! Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Salty Pepper", "text": "i did everything the same as in the video,\nbut after some point that app stopped working as in:\nit does launch in android studio, it says that the app launched successfully,\nbut on my phone the app dosnt launch, like it crashes instantly,\nbut i have no idea what i did wrong.\ni checked the code and it seems to be exactly the same as in the video.", "likes": 0}}, {"topLevelComment": {"author": "Akun Formalitas", "text": "As a desktop programmer this video helps me so much to switch to android apps.", "likes": 0}}, {"topLevelComment": {"author": "Alwa", "text": "Thank you for all the quality content you produce. You probably contributed more than my teachers toward obtaining my degree.", "likes": 1}}, {"topLevelComment": {"author": "John Nguyen", "text": "at 26:46, the \"View All\" was add in tools:text lol", "likes": 0}}, {"topLevelComment": {"author": "Matelight Repetition", "text": "1:06:28 You can just use  cursol.getInt(3) == 1;  instead of   cursol.getInt(3) == 1 ? true : false;", "likes": 0}}, {"topLevelComment": {"author": "Dimitri Georgoudakis", "text": "Hey guys, first of all I would like to say that it was a very intuitive video. Thank you. Secondly, I did everything according to the video but the app crashed (probably when entering data into the database) Did anyone else experience this ?", "likes": 1}, "replies": [{"author": "Mirsad Hadzic", "text": "similar problem, had to make spaces inside commas when creating new table", "likes": 0}, {"author": "Dimitri Georgoudakis", "text": "@mary ann pickleball Hey Mary, so, my problem was at the point where we insert  the SQL  statement into the code . I had left out a comma or something and expected the debugger to pick up on it but it wasn't so it was just crashing .Either than that it worked fine for me. Try to check and compare your code line by line to the original code.", "likes": 0}, {"author": "mary ann pickleball", "text": "I did everything also. All was working until I got to the point of changing the View All button to show the list instead of the Toast msg. And as a newbie, trying to figure out what went wrong is very difficult.", "likes": 0}]}, {"topLevelComment": {"author": "Teja Balu", "text": "Awesome!", "likes": 0}}, {"topLevelComment": {"author": "Abou Titi", "text": "Thks so much 😊🙏🏼", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Anas Khairulnizam Only", "text": "Since \"Database\" is the Vocab then i am thinking of Android with Like a Cloud Storage in Backpack, but running it on Android? Or at least Viewing, then Powerbank and Solar Panel etc. Ways of Having Voltage. If we Explore on Adventure, Database Storage becomes Important is why, i imagine an Adventure in Future.", "likes": 0}, "replies": [{"author": "Muhammad Anas Khairulnizam Only", "text": "Database by Wifi, Bluetooth, if something like PSP(Ad-Hoc)? Or if just \"wired wireless\"(making wire wireless connection even if can connect by wire like L.A.N)?", "likes": 0}]}, {"topLevelComment": {"author": "Neeraj Ahlawat", "text": "Nice explanation", "likes": 0}}, {"topLevelComment": {"author": "Matthew B", "text": "How do we get those hints? I've found control + P, but that hint menu looks way better eg looking at 51:39", "likes": 0}}, {"topLevelComment": {"author": "HarderThanCalculus", "text": "great video, thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "ajie ewin", "text": "9:06 Part I - Layout\n18:59 Part II - Data Model\n22:35 Part III - Button Click Listeners\n32:36 Part IV - SQLite Open Helper Class\n41:27 Part V - Create New Tables with the OnCreate Method\n58:54 Part VI - Pull Data from Database (Select * From Table)\n1:12:31 Part VII - Set Data in a ListView\n1:20:07 Part VIII - Delete a Record\n1:26:46 Challenge", "likes": 16}}, {"topLevelComment": {"author": "PC Radwan", "text": "Thank you sir", "likes": 0}}, {"topLevelComment": {"author": "Brandon McHugh", "text": "This is amazing. I've been trying to figure out SQL databases but all other tutorials have been lackluster and confusing. This is the first one that has made sense. Thank you!!!", "likes": 2}}, {"topLevelComment": {"author": "Ronan Larkin", "text": "Normally I spend my time rifling through 10 minute videos but this was well worth taking the time to sit down and watch in full.\n\nThanks so much! Very helpful!", "likes": 1}}, {"topLevelComment": {"author": "黄驿淙", "text": "Wonderful. Best teacher I've ever seen on YouTube.", "likes": 1}}, {"topLevelComment": {"author": "Abdull Dgamseh", "text": "Where is the video about The ROOM databse", "likes": 0}}, {"topLevelComment": {"author": "Hussein Chahine", "text": "hello at 56:46 i couldnt find my file? is there anyone could help me to find the file that i created.Thanks", "likes": 0}}, {"topLevelComment": {"author": "Sports City", "text": "One of the best formal way to do this task.\nThank you..", "likes": 0}}, {"topLevelComment": {"author": "Lucas Araujo", "text": "The sql files will be stored on my app host?", "likes": 0}}, {"topLevelComment": {"author": "AttaUllah Shah", "text": "Hello, feeling lucky to found you. You are teaching so professionally like nothing is vague and the concept is also building. Please keep it up :)", "likes": 4}}, {"topLevelComment": {"author": "عبد الرحمن سالم", "text": "Thanks a lot!\nIt worked amazing", "likes": 0}}, {"topLevelComment": {"author": "CherryPoutine S", "text": "\"Context this and hope for the best\" oh yeah! 🤣", "likes": 0}}, {"topLevelComment": {"author": "Sabrina Feliz", "text": "Hello sir i used external database . In the emulator I know how to get the bd file but in the real phone there is not package of my application please can you help me to found the database in my phone.thanks", "likes": 0}}, {"topLevelComment": {"author": "khaled abdessamed", "text": "WOOOW😮😍", "likes": 0}}, {"topLevelComment": {"author": "Mehdi Hachimi", "text": "Awesome tutorial, thank you so much for this!", "likes": 1}}, {"topLevelComment": {"author": "Alban Marku", "text": "Very good video. Really like how you talk through your thought process when using classes that require inputs and making it clear what the current goal is.", "likes": 4}}, {"topLevelComment": {"author": "John Melody Me", "text": "Can I save video in SQLite?", "likes": 0}}, {"topLevelComment": {"author": "Umair Shaikh", "text": "👌👌👌", "likes": 1}}, {"topLevelComment": {"author": "Umair Shaikh", "text": "Mind blowing tutorial", "likes": 1}}, {"topLevelComment": {"author": "MrStickmanish", "text": "Great teacher and tutorial! One of the very few that don't rush things and show you exactly where you are in the code and why you are doing something. I actually laughed with voice on the context (this) part xD Even \"funny\" videos only make me blow air out of my nose but this was good! Thank you!", "likes": 3}}, {"topLevelComment": {"author": "hosein hoseiny", "text": "hi thanks due to your excellent video , but in btn_viewAll.setOnClickListener ((v) → {          how to write forward Arrow symbol ?", "likes": 0}}, {"topLevelComment": {"author": "Sam Rad", "text": "48:00", "likes": 0}}, {"topLevelComment": {"author": "Em Cường", "text": "PTIT", "likes": 0}}, {"topLevelComment": {"author": "Chandrakant Shrivastava", "text": "please provide the code in notepad", "likes": 1}}, {"topLevelComment": {"author": "Marc Godhoff", "text": "Thank you so much for this great video. Really told me alot of new stuff :-)", "likes": 0}}, {"topLevelComment": {"author": "Kunal", "text": "Thank you so much for providing such cool valuable content.", "likes": 1}}, {"topLevelComment": {"author": "EverythingisOk", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Manuel Abarca Crespo", "text": "1:06:08 is redundant, cursor.getInt(3) == 1 returns a boolean value, so there is no need to use ? operand. A great video in general, but for noobies that can be something hard ^^", "likes": 1}}, {"topLevelComment": {"author": "Benuka Punchihewa", "text": "Thank you very much. Great Video. Looking forward to watch awesome content like this.", "likes": 0}}, {"topLevelComment": {"author": "Carlo Fervil", "text": "56:30 To find location of the database", "likes": 0}}, {"topLevelComment": {"author": "Tania Martínez Villagómez", "text": "Thank you very much, your teaching skills are amazing. This is one of the best android tutorials I have ever seen.", "likes": 1}}, {"topLevelComment": {"author": "In Deep", "text": "thanks for tutorials <3", "likes": 0}}, {"topLevelComment": {"author": "Ahmed LShubaky", "text": "amazing , but i think ViewList btn feature is useless after enhance the code at the end :)", "likes": 0}}, {"topLevelComment": {"author": "raviteja reddy", "text": "5:00", "likes": 0}}, {"topLevelComment": {"author": "Тимур Жакупов", "text": "You are a great person. I needed it and I found it! So thankful for your job!!!", "likes": 2}}, {"topLevelComment": {"author": "Seph Arnaert", "text": "why does my whole databse get deleted when i click on one, i followed the whole tutorial and everything worked just fine until the delete one. I have the exact same code and no errors and can't find the problem. Can someone pls help me?", "likes": 1}}, {"topLevelComment": {"author": "EddyJaga", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "EddyJaga", "text": "Thank you for your time. It's great and understandable content. Much better than my lecturer 👩‍🏫 👨‍🏫 🧑‍🏫", "likes": 1}}, {"topLevelComment": {"author": "Jesus Ribeiro", "text": "Commenting so I can get back to it tomorrow. ( 58:47 ) Awesome tutorial so far!", "likes": 1}}, {"topLevelComment": {"author": "Berke Bircan", "text": "45:00", "likes": 0}}, {"topLevelComment": {"author": "amir chaka", "text": "thanks very much sir please can u show us how to remove CustomerModel from list view and share search and add image as well", "likes": 1}}, {"topLevelComment": {"author": "solomon jara", "text": "it is very important tutorial i appreciate u", "likes": 0}}, {"topLevelComment": {"author": "bashconsole", "text": "That felling when you watch this video with a cup of coffee having 23+ years of software development experience and understanding what is SQLite. Relaxed.", "likes": 0}}, {"topLevelComment": {"author": "Rapyd", "text": "thanks Sir at 16:14 for buttons you could use \"Chaining\"", "likes": 0}}, {"topLevelComment": {"author": "Melhem Hamade", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Aisling Gallagher", "text": "Very new to android apps and databases, my question is, if I follow what you have done in the above video, and leave out the delete function, can anyone update, add to the same database or is that strictly when you add to db, it only goes to your phone?  If I wanted to do a 'universal' db that anyone can add to it, what do I do?  Thank you, and also, great video, easy to follow.", "likes": 0}}, {"topLevelComment": {"author": "Burakcan Duzcan", "text": "meh, would be better if you showed the search as well.", "likes": 0}}, {"topLevelComment": {"author": "Burakcan Duzcan", "text": "44:20 \"Refactor -> Extract\" is now called  \"Refactor -> Introduce Constant\"", "likes": 41}, "replies": [{"author": "Definition SuperVillain", "text": "also works with 'ctrl + alt + c'", "likes": 1}]}, {"topLevelComment": {"author": "Jose Jayant", "text": "9:08 Layout\n18:51 Data Model\n22:34 Button Click Listeners\n32:37 SQLite Open Helper Class\n41:28 Create New Tables with onCreate Method\n58:44 SELECT * FROM table\n@ - Set Data In a ListView\n@ -  Delete a Record", "likes": 9}}, {"topLevelComment": {"author": "Dominik Kajba", "text": "Why I cant find \"ShowCustomersOnList()\" method?", "likes": 0}}, {"topLevelComment": {"author": "Elohim Alves", "text": "You explain everything you are doing, Excellent Professor!", "likes": 1}}, {"topLevelComment": {"author": "Samuel Mwacha", "text": "Hey Shad, so i was following your other video on SQLite database https://www.youtube.com/watch?v=hDSVInZ2JCs , run in to a problem at 55:16. My database would not create. and i have the same code.Am still stuck. Can you help. Would like to finish that application. Thanks am learning alot.", "likes": 1}}, {"topLevelComment": {"author": "Gurpreet Singh", "text": "At 26:41 because View All under tools namespace", "likes": 0}}, {"topLevelComment": {"author": "Zeker Iemand", "text": "Thank you very much for this video. It helped me a lot.", "likes": 0}}, {"topLevelComment": {"author": "Mohit Singh", "text": "Thank you again! I am liking it for the first time in my life. Thank you and you are the reason for it.", "likes": 2}}, {"topLevelComment": {"author": "Mohit Singh", "text": "Also, thank you for telling a good format to start, first naming references, then button listeners. My code was usually all over like a puzzle, when I complete a project, even I couldnt find the flow and I hated to come back to my own code.", "likes": 3}}, {"topLevelComment": {"author": "Mohit Singh", "text": "I always used try catch blocks to get out of error but never I have used it so efficiently. I used to write e.printstacktrace() blindly as I was taught and it was so meaningless lines to show as error message.", "likes": 0}}, {"topLevelComment": {"author": "Mohit Singh", "text": "Sir, who are you? I think I found god on earth! Thank you for making it so interesting to understand. Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Noah Bastola", "text": "I'm not usually one to comment on videos, but this is by far the best coding teacher I've ever seen on youtube. What I like most is that he shows you how to use the documentation as a guide for development, because no one has an encyclopedic knowledge base of code.", "likes": 53}, "replies": [{"author": "MOHAMED MIRE", "text": "because this is a university preffossor, not just a freelancer YouTubers. \nHe's trainined  prof.", "likes": 0}, {"author": "RX tech and trading", "text": "Yeah, hes beter than most of the cluster f@$%s out there...BUT. as good as he is, what pisses me off  about his tutorials is when he forgets to go into some essential details about the documentation and how different sections of it apply to different SDK versions or API levels", "likes": 0}]}, {"topLevelComment": {"author": "Pranesh Pyara Shrestha", "text": "Make videos on projects of android development", "likes": 0}}, {"topLevelComment": {"author": "Kevin Northam", "text": "Bing Thanks :D", "likes": 1}}, {"topLevelComment": {"author": "Parvizjon Hojiev", "text": "android studio has it's own database inspector", "likes": 2}}, {"topLevelComment": {"author": "kojofosu edue", "text": "Very detailed...i loved every bit of it. Thanks guys", "likes": 1}}, {"topLevelComment": {"author": "Renson Placino", "text": "I am running it in Pixel 3a API 29", "likes": 0}}, {"topLevelComment": {"author": "Renson Placino", "text": "My deleteOne function has a problem it keeps crashing whenever I attempt to delete something in my database though I follow all your instructions", "likes": 2}}, {"topLevelComment": {"author": "Bruno Ribeiro", "text": "8:38 - Layout\r\n18:20 - Data Model\r\n22:02 - Button Click Listeners\r\n32:07 - SQLite Open Helper Class\r\n40:58 - Create New Tables with onCreate Method\r\n58:25 - SELECT * FROM table\r\n1:12:00 - Set Data In a ListView\r\n1:19:37 -  Delete a Record", "likes": 174}, "replies": [{"author": "Blue Vale", "text": "Thanks for Time stamp!\n", "likes": 0}, {"author": "Salty Pepper", "text": "i know its been a year since you posted this comment.\nbut the app stops working for me at around 29:00 .\nin android studio it says that the app launched successfully, but on my phone it does NOT launch (yes i checked my spelling even redid the whole app from the instructions in the video step by step, twice now) i tried clearing the apps cache, uninstalling and reinstalling, but it does not work.\ni generally dont know why. \nplease help if you have the time.", "likes": 0}, {"author": "Warren Lucian", "text": "@Jay Robert you are welcome :)", "likes": 0}, {"author": "Jay Robert", "text": "@Warren Lucian it worked and I now got access to my account again. Im so happy:D\r\nThanks so much, you saved my account!", "likes": 0}, {"author": "Jay Robert", "text": "@Warren Lucian i really appreciate your reply. I found the site thru google and Im waiting for the hacking stuff atm.\nSeems to take quite some time so I will reply here later with my results.", "likes": 0}]}, {"topLevelComment": {"author": "KASalgado", "text": "Excellent tutorial. It has a very good focus in Code Standards like no other videos. Good job. Thanks.", "likes": 4}}, {"topLevelComment": {"author": "Jojo Gaul", "text": "Cool", "likes": 0}}, {"topLevelComment": {"author": "Mantis", "text": "Lol I thought his head was cut off. Great tutorial though. Cheers!", "likes": 1}}, {"topLevelComment": {"author": "Patricia Rodrigues", "text": "Great ! Thanks from Brazil!", "likes": 1}}, {"topLevelComment": {"author": "Victhor Nogaroli", "text": "PLEASE...\neven if I do not fill anything, it send the data, how can I do not accept if the fields are empty?\n\nI'm Brazilian, sorry for any mistake.", "likes": 3}, "replies": [{"author": "Manuel Abarca Crespo", "text": "Add NOT NULL after data type when creating the table", "likes": 0}]}, {"topLevelComment": {"author": "Tabassum Mansuri", "text": "Sir can u make one video on payroll management system with database connectivity. your concent are really amazing.I want to learn more...", "likes": 1}}, {"topLevelComment": {"author": "Simo Majola", "text": "Best Tutorial Ever !!!!!!!!!!!!!!!!!!!!!!!!!!", "likes": 1}}, {"topLevelComment": {"author": "Ivan Brezhniev", "text": "Very helpful! Thank you", "likes": 1}}, {"topLevelComment": {"author": "Vik Sintus", "text": "so many clever people on this planet, but not so many be able to share or deliver their knowledge to others like this one, thank you, sir", "likes": 7}}, {"topLevelComment": {"author": "justinfernald", "text": "Big fan of Professor Sluiter.", "likes": 1}}, {"topLevelComment": {"author": "Max Spiekermann", "text": "Why not Room??", "likes": 2}}, {"topLevelComment": {"author": "Kim Sing", "text": "I just binge watch freecodecamp, but I learn a lot.", "likes": 1}}, {"topLevelComment": {"author": "Keshav Arya", "text": "When will Rust course come?", "likes": 2}}, {"topLevelComment": {"author": "Elvis Ajes", "text": "Really nice tutorial format. Thank you, very clear explanations!", "likes": 5}}, {"topLevelComment": {"author": "Daddy Dagoth", "text": "I took his class when I attended GCU. He was great.", "likes": 9}}, {"topLevelComment": {"author": "Ritesh Verma YT", "text": "🤣  प्यार🤣  मोहब्बत🤣 सब 🤣धो का🤣 है  🤣 मुझको 🤣लाईक our  Subscribe🤣करो 🤣 bhot🤣अच्छा🤣 मौका 🤣है😋  Love you friends", "likes": 0}}, {"topLevelComment": {"author": "h.r.", "text": "Keep up the amazing work my friend!", "likes": 3}}, {"topLevelComment": {"author": "h.r.", "text": "T.h.a.n.k. y.o.u. 😁😁😁😁", "likes": 1}}, {"topLevelComment": {"author": "Dibyajyoti Parida", "text": "It would be very helpful if someone adds the timestamp🙂", "likes": 16}}, {"topLevelComment": {"author": "Timankartola", "text": "Love you freecodecamp", "likes": 2}}, {"topLevelComment": {"author": "Teyyihan Aksu", "text": "imagine not using Room in 2020", "likes": 7}}, {"topLevelComment": {"author": "MC Star", "text": "Just use Room database", "likes": 5}}, {"topLevelComment": {"author": "Oniii-Chan", "text": "WOw! today only I was told in class that we would start sqlite(in python) tomorrow and this appeared I hope this would be helpful for it 🤞🤞", "likes": 3}}, {"topLevelComment": {"author": "T O N Y S T A R K", "text": "Perfect time .", "likes": 1}}, {"topLevelComment": {"author": "Devs Like Us", "text": "Awesome", "likes": 1}}, {"topLevelComment": {"author": "Utkarsh Rastogi", "text": "Thank you sir, this will be of great help to me.", "likes": 2}}, {"topLevelComment": {"author": "yeasin Arafat", "text": "Excellent", "likes": 1}}, {"topLevelComment": {"author": "Ankit Chaurasiya", "text": "Great", "likes": 1}}, {"topLevelComment": {"author": "Bosco Bothelo", "text": "thank you sir, ..😇😇🔥🔥I,am a biotechnologist learning code", "likes": 2}}, {"topLevelComment": {"author": "Destiny", "text": "First view and comment", "likes": 4}, "replies": [{"author": "Xa xa", "text": "@Destiny oh good job I am also watching", "likes": 0}, {"author": "Destiny", "text": "@Xa xa no bro, I am watching this presently", "likes": 0}, {"author": "Xa xa", "text": "did you fully watch the video? didnt think so, now watch ig", "likes": 0}]}, {"topLevelComment": {"author": "Tom", "text": "If you are reading this God bless you and have a wonderful day and stay safe ❤️🥰", "likes": 14}, "replies": [{"author": "Daniel Florez", "text": "im not going to give you like but thanks :)", "likes": 0}, {"author": "Devs Like Us", "text": "Thank You 😊", "likes": 0}]}]}