{"video": {"id": "4deVCNJq3qc", "title": "Learn Vue.js - Full Course for Beginners - 2019", "description": "Learn to use Vue.js in this full tutorial course for beginners.\n🚨 NEW version of this course: https://youtu.be/FXpIoQ_rT_c\n\nVue.js is an open-source JavaScript framework for building user interfaces and single-page applications.\n\n💻 Code - Quiz App: https://github.com/gwenf/vue-quiz \n💻 Code - Pet App: https://github.com/gwenf/vue-adopt-pets\n\n⭐️ Contents ⭐️\n(0:32) Part 1:\n⌨️ The Vue Instance\n⌨️ Directives\n⌨️ Methods\n⌨️ Data-binding\n⌨️ Events\n⌨️ Filters\n⌨️ Computed Properties\n⌨️ Components\n⌨️ Component Lifecycle\n\n(35:33) Part 2:\n⌨️ Vue-cli\n⌨️ Vue devtools\n⌨️ Props & Slots\n⌨️ Making API calls\n⌨️ Vue-router\n⌨️ Vuex\n⌨️ Unit Testing\n⌨️ Recommended Resources\n\n⭐️ Links: ⭐️\n🔗 TheJaredWilcurt Twitch Channel: https://www.twitch.tv/thejaredwilcurt \n🔗 Sarah Drasner, Vue Animations: https://www.youtube.com/watch?v=LLnVLjpY6gE\n🔗 Views on Vue podcast: https://devchat.tv/views-on-vue/ \n🔗 State of Vue.js Report: https://www.monterail.com/state-of-vuejs-report\n\n✏ Course from Gwen Faraday. Check out her YouTube channel: https://www.youtube.com/channel/UCxA99Yr6P_tZF9_BgtMGAWA\n\n🐦 Gwen on Twitter: https://twitter.com/gwen_faraday \n📬 Email Gwen: gwenfaraday@pm.me\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org\n\nAnd subscribe for new videos on technology: https://youtube.com/subscription_center?add_user=freecodecamp", "duration": "PT2H58M58S", "likes": "13589", "views": "981367"}, "comments": [{"topLevelComment": {"author": "freeCodeCamp.org", "text": "🎉 There is an UPDATED version of this course from Faraday Academy: https://youtu.be/FXpIoQ_rT_c", "likes": 10}, "replies": [{"author": "NM", "text": "Do we need to complete this before heading to the updated one?", "likes": 0}, {"author": "Aaron", "text": "Thank you", "likes": 0}]}, {"topLevelComment": {"author": "REACT JS IS BEST", "text": "is This Vue 2  or Vue3  ?", "likes": 0}}, {"topLevelComment": {"author": "Taymoo Krumpli", "text": "Does not work anymore", "likes": 0}}, {"topLevelComment": {"author": "Taymoo Krumpli", "text": "Jsfiddle does not working for me", "likes": 0}}, {"topLevelComment": {"author": "Ferricity.", "text": "Can vue JS work with Tailwind css?", "likes": 0}}, {"topLevelComment": {"author": "Alex", "text": "I like your voice, your teaching way but in this particular video the audio was very low. Thanks for everything :)", "likes": 0}}, {"topLevelComment": {"author": "Coding For Beginners", "text": "https://www.youtube.com/watch?v=Vr6EckMhSFo&t=9s", "likes": 0}}, {"topLevelComment": {"author": "Zuza", "text": "Thank you very much for this tutorial! You really explained many things in a simple way and you have a really calm voice! It's super cool that You mentioned other people who code. I noticed that not so many people do this, but you did and it's so nice. You gave us more possibilities to learn with this! :)", "likes": 0}}, {"topLevelComment": {"author": "Taliskuji M", "text": "For myself: 43:11", "likes": 0}, "replies": [{"author": "Taliskuji M", "text": "2:44:54 almost there", "likes": 0}, {"author": "Taliskuji M", "text": "2:14:48", "likes": 0}, {"author": "Taliskuji M", "text": "1:49:58", "likes": 0}, {"author": "Taliskuji M", "text": "1:11:00", "likes": 0}, {"author": "Taliskuji M", "text": "59:29", "likes": 0}]}, {"topLevelComment": {"author": "Michael Kiger - Avian Web Hosting", "text": "Good example of Vue.js but I don't see it being  a 'full course' when it has no input or database to make the app/website fully functional. I would like to see more 'real world' tutorials that show apps that would be used in production. Apps that someone might pay a developer to 'develop'. Can we stop it with the 'Hello World' stuff that nobody would buy and do some mature marketable production apps?  I did look at the updated version... MUCH better! Seriously folks there have been ten thousand 'hello world' 'tutorials' past ten years. Let's consider that most adults don't live in a cartoon world and most developers no matter what level they are at want to create apps that someone would pay them to create. Apps that would actually be used in a real business. This means apps that have input with the front-end and connects to a database backend. Most of these 'tutorials' on YT are small pieces of apps that are not useful for much besides showing off on YT.", "likes": 1}}, {"topLevelComment": {"author": "Lucas Simoni", "text": "She is the chilliest teacher ever. I'd listen to this as ASMR to sleep and even relax . 🙌😂", "likes": 0}}, {"topLevelComment": {"author": "Sad Sad", "text": "I can't see my login form, the page is blank \nCan anyone help me out", "likes": 0}}, {"topLevelComment": {"author": "Vikks Vlog", "text": "please add chapters to this course", "likes": 0}}, {"topLevelComment": {"author": "Yakup Solmaz", "text": "Aynen oyle", "likes": 0}}, {"topLevelComment": {"author": "ayrton123", "text": "Hi Gwen. Would recommend you spend more time on the environment setup. No details about jsfiddle or how to load the vie library. This is a beginner course", "likes": 0}}, {"topLevelComment": {"author": "Imani Leemans", "text": "The cat index which will be purrrr index in the array.", "likes": 0}}, {"topLevelComment": {"author": "Younes Essaadani", "text": "can anyone help me when im trying to install vue on my laptop the cli told me that there is no npm command", "likes": 0}}, {"topLevelComment": {"author": "Smot Butterman", "text": "2:49:28 Oh no! I have to stop here. I can't watch anyone who uses spaces over tabs. /s", "likes": 0}, "replies": [{"author": "Itsfajtik", "text": "i cant watch anyone who uses tabs over spaces", "likes": 0}]}, {"topLevelComment": {"author": "Peter Hobor", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Marina Olhovsky", "text": "Very bad!  She doesn't explain clearly, I can understand because I have experience but she'd totally lose a complete novice!", "likes": 0}}, {"topLevelComment": {"author": "Dimaur", "text": "is this course still relevant with new version vue ?", "likes": 0}}, {"topLevelComment": {"author": "LuisB", "text": "2:36:47 I'm getting the following error \"state[species] is undefined\" when trying to submit\nEDIT: my problem was that I changed the names on :options for species under b-form-select for submitting the pet species.", "likes": 1}}, {"topLevelComment": {"author": "István Máté", "text": "Thank you very much for this tutorial :)", "likes": 0}}, {"topLevelComment": {"author": "Desk Solutions", "text": "properly, my firrst vue js video", "likes": 0}}, {"topLevelComment": {"author": "WhitePhoenix", "text": "Just to warn you she speaks really slowly, play this at 2x", "likes": 0}}, {"topLevelComment": {"author": "Joseph Chavala.", "text": "For some reasons sometimes i get the wrong correct answer after shuffling the answers!", "likes": 0}}, {"topLevelComment": {"author": "Henry Bortune", "text": "Free for 3 days on udemy website, search: Learn Laravel Vuejs from scratch - Build a TESLA web app. I have the coupon to make it free", "likes": 0}}, {"topLevelComment": {"author": "Mr Ben", "text": "If you want to learn how to build web applications in a short time, then i Highly recommend this course on Udemy, it really takes you from a beginner to a decent developer: \"learn laravel vuejs, build a tesla app\"", "likes": 0}, "replies": [{"author": "Mr Ben", "text": "@Pearls & Swine decent means not bad, mr smarty pants. I didn't even say Senior, not even intermediate level", "likes": 0}, {"author": "Pearls & Swine", "text": "No, just no.  There is NO video on earth that will take you from a \"beginer\" to a \"decent developer\".  That takes weeks/months of practice, learning, and understanding, even if you have a good grasp of JavaScript.  The whole \"DiZ ViD wIlL TaKe U fRuM a DiShWaShEr To A BiLlIaOnAiRe WoRlD cLaSs DeVelOpEr is a marketing tactic and nothing else\".", "likes": 0}]}, {"topLevelComment": {"author": "iqbal ibrahim", "text": "can anyone explain how to run part 1 without using jsfiddle?", "likes": 0}, "replies": [{"author": "iqbal ibrahim", "text": "@xmetrix lets say if I want to run vuejs without using vue-cli, do you know how?", "likes": 0}, {"author": "xmetrix", "text": "install vue locally. Ideally you'd be on linux and simply install nodejs, npm, and then npm i -g vue-cli to install the scaffolding tool, then vue create MyNewProject to create a skeleton framework to get started. follow the instructions provided (e.g.,  cd MyNewProject, npm install, npm run serve).", "likes": 0}]}, {"topLevelComment": {"author": "Iar De", "text": "The beginning was informative, but when she went to cli, she lost me.\nI didn't understand there from cli and on.", "likes": 0}}, {"topLevelComment": {"author": "Gunner", "text": "Excellent tutorial BUT please can you update this tutorial for VUE3?!", "likes": 0}}, {"topLevelComment": {"author": "Jos Blomsma", "text": "Thanks for NOT starting with creating a todo list and diving straight into it with CATS!", "likes": 0}}, {"topLevelComment": {"author": "Leo Plaw", "text": "40:40 A blue moon is when you have a second full moon in a calendar month, which happens infrequently, hence the use of the expression, \"once in a blue moon.\" It does not mean it never happens or that it is a fairytale.", "likes": 1}}, {"topLevelComment": {"author": "Andy Gyakobo", "text": "Mrs. you're an anel", "likes": 0}}, {"topLevelComment": {"author": "Leonardo Sasso", "text": "Thanks for this great course. I also like the fact that you like cats, and I can hear them in the background <3", "likes": 0}}, {"topLevelComment": {"author": "Surya Prakash Rathinasamy", "text": "Along with the content, I enjoy the sound of the Razer keyboard in the video", "likes": 0}}, {"topLevelComment": {"author": "Sidney Melo", "text": "Great tutorial! I have learned a lot!", "likes": 0}}, {"topLevelComment": {"author": "Rowehna Kori", "text": "The only thing I was not able to make work was importing and applying global sass styles to the app. No errors in console, they just do not work; they do not even show up by analyzing the element in the dev tool. Followed step by step, do not know what went wrong...", "likes": 2}}, {"topLevelComment": {"author": "Abhishek Ganesan", "text": "Great tutorial. It was very comprehensible. Keep up the great work! How do you design mocks? What software do you use?", "likes": 0}}, {"topLevelComment": {"author": "NiexZ CS:GO AND MORE", "text": "48:57 I don't get the gray part when I import the code in the QuestionBox.vue", "likes": 1}, "replies": [{"author": "Christina", "text": "I wrapped by App in bootstraps: <b-container>. \nAlso in my jumbotron i added the props fluid and bgvariant: <b-jumbotron fluid=\"sm\" bg-variant=\"light\" class=\"text-center\">", "likes": 0}, {"author": "NiexZ CS:GO AND MORE", "text": "The gray shade behind the text", "likes": 1}]}, {"topLevelComment": {"author": "Kevin Thomas", "text": "I like your style. I like it a lot", "likes": 0}}, {"topLevelComment": {"author": "Electronaota", "text": "I wasn't be sure what framework to use for frontend of my web app. But  I've   decided  to use vue because of this tutorial, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Kcireh", "text": "thank you for your contribution", "likes": 0}}, {"topLevelComment": {"author": "Hesham Shananah", "text": "Is the content in the course are still relevant or outdated?", "likes": 0}}, {"topLevelComment": {"author": "Mohit Gaur", "text": "Does anyone know how is she able to see the formatted JSON in the browser at 52:43 ? I want to see the data in the same way in my browser.", "likes": 0}}, {"topLevelComment": {"author": "Justin Haubrich", "text": "Is this tutorial for vue 2.0 or 3.0?", "likes": 0}}, {"topLevelComment": {"author": "Viking Prank", "text": "Thanks for the video, I'm learning vue for an internship in a few weeks. For some reason I'm stuck at the point where are trying to import the API questions, when I look at the data content of app with the vue dev tools, all I see is one undefined question. I'm looking into it now, but if anyone has a clue from where it could come from please help. The link I generated works in the browser so I don't get why vue can't import the data :)", "likes": 0}, "replies": [{"author": "Viking Prank", "text": "forgot the \"( )\" on the response.json lol", "likes": 0}]}, {"topLevelComment": {"author": "hamudirag", "text": "Is this course still valid today? It's two years old.", "likes": 0}}, {"topLevelComment": {"author": "Sachin Shilwal", "text": "Thats a lot of cats I heard in a single video ever", "likes": 1}}, {"topLevelComment": {"author": "Karin Prater", "text": "Your keyboard is too load. I had to stop watching.", "likes": 0}}, {"topLevelComment": {"author": "Yousha Mahmood", "text": "NOTE: Anyone using vue 4 to follow this tutorial will run into some problems with bootstrap-vue, as this is not yet supported by vue 4, maybe it will be released soon enough, but for now to follow this video it is advised to use the 3.1.1 version. while installing the cli just run npm i -g @vue/cli@3.1.1", "likes": 1}, "replies": [{"author": "Anthony Dei Medici", "text": "You saved me!", "likes": 0}, {"author": "Muhammed Bilal", "text": "Thanks dear so how far should i stick with vue cli 3.1.1 and vue 2?", "likes": 0}]}, {"topLevelComment": {"author": "Krishna Bala", "text": "Fantastic tutorial on Vue! Loved it. Thank you for putting it together. \nSome small issues: As others have pointed out \"Correct Index\" needed at \"1:31\" is discussed out of sequence at \"1:41\". \nAlso, shouldn't the v-for loop in the component QuestionBox be over this.shuffledAnswers rather than answers?\nAlso, loved the fact that you make errors, show us code inspection methods using dev-tools/inspect. It allows us to learn how to debug the code at the same time!\nOverall, it's a fantastically done tutorial!", "likes": 2}}, {"topLevelComment": {"author": "hoaxygen", "text": "\"undefinedy\" I cracked up. Amazing tutorial! Very useful, well-structured and explained. You're preparing me for my new job interview's challenge. 😎", "likes": 1}}, {"topLevelComment": {"author": "jewel bennett", "text": "Coders  comedian 's  jeez I must have PTS from the last 3 years.", "likes": 0}}, {"topLevelComment": {"author": "CARDBORED", "text": "People, do NOT use indented syntax (curly brace omitted) when you write styles, it's just asking for problems especially as you build larger more complex components or utilize BEM and media query nesting.  Most engineers are terrible at writing CSS/SCSS properly.", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Tausif", "text": "It is Vue 2 or Vue 3?", "likes": 0}}, {"topLevelComment": {"author": "Alif Suria", "text": "Why did i got unknown action type:addPet error", "likes": 0}}, {"topLevelComment": {"author": "coding husky", "text": "I swear I have to do this for every tutorial I go though... so for someone as unreasonable as me to do this under Windows 10; it's likely your adopt-pets app will fail to even create due to node-sass issues. Here's what I had to do to fix it:\n- install Python 3.9 and 2.7 for Windows (yes, both, no idea why because 2.7 is required)\n- set Windows environment variables to Python 2.7 (google it if you don't know how) and made sure my python  - - version command ran in node.js shell responded with 2.7\n- opened node.js shell as admin (won't work otherwise!) and ran: npm install node-sass\n- then ran:  npm install node-router\n- lastly, ran: npm config set python python2 \nOnly then was I able to create the project. Hope this helps someone.", "likes": 0}}, {"topLevelComment": {"author": "Timmy F", "text": "Outstanding video. Way better than other vue intros on youtube.", "likes": 0}}, {"topLevelComment": {"author": "Zufarbek Zaynutdinov", "text": "why it is giving  TypeError\nwhen i want to push new pet", "likes": 0}}, {"topLevelComment": {"author": "George Brotherston", "text": "Who is the instructor for this tutorial?  Amazing work, I really like how you explain each of the issues you dig into.  And you let your mistakes fly without editing and publishing only what works.  This helps me understand how to deal with issues that I will likely run into as I continue my journey.  This is a really nice \"real world\" tutorial that I am utilizing as I try to understand this new (I know *some* old-school 1990's Javascript) paradigm of front-end development.  Thank you again!", "likes": 0}}, {"topLevelComment": {"author": "Mamé", "text": "if you get error  at 1:03 try to refactor like that  <template slot=lead v-if=\"currentQuestion\"> because for very first time it is empty", "likes": 0}}, {"topLevelComment": {"author": "Krofz", "text": "this is a diamond in youtube ... Thank you!!", "likes": 1}}, {"topLevelComment": {"author": "Amir Sohel", "text": "1:32:41, here you forgot to update shuffled answer on DOM, in vue dev tool is working but you have not updated this on DOM", "likes": 0}}, {"topLevelComment": {"author": "Omar Hegazi", "text": "insane effort was put to this course , thank you Faraday so much", "likes": 1}}, {"topLevelComment": {"author": "Brendan F", "text": "One of the best tutorials of all time so far! No time wasted (except for when the filters segment was taught twice?). Pretty clear.", "likes": 0}}, {"topLevelComment": {"author": "Matheus Carregal", "text": "Thanks! Good video, vue seems such more simple right now.", "likes": 0}}, {"topLevelComment": {"author": "maks tarr", "text": "The editing error at 27:54 ends at 29:59", "likes": 0}}, {"topLevelComment": {"author": "Mahendra Nath", "text": "Thank you so much for the video I really enjoy the video, it precise, I was looking for vue.js to learn, luckily I found this, thank you so much, I really like it, I respect your effort for bringing this awesome video to us", "likes": 0}}, {"topLevelComment": {"author": "Sudalai Muthu S", "text": "love your tutorial", "likes": 0}}, {"topLevelComment": {"author": "Nam Nguyen Viet", "text": "2:27:00", "likes": 0}}, {"topLevelComment": {"author": "The last monkey", "text": "Hello Developer friends, please raise your hourly tariffs to 75 euro's an hour and stop being played by sly management. My last salary was equal to a municipal garden worker. So i gave up professional coding and just use it as a hobby now. Let them write their own damned code if they can.", "likes": 0}}, {"topLevelComment": {"author": "yayin", "text": "2:20:19 VUEx", "likes": 0}}, {"topLevelComment": {"author": "blueprintchris", "text": "Whyyyyyy are you using jsfiddle and not vscode or something? What do we need to install via npm etc?", "likes": 0}}, {"topLevelComment": {"author": "Beno Netto", "text": "Thank you Gwen! Awesome tutorial and explanations. Learn by doing is a great way to get all the small details and to see how it works. I did both tutorials, Vue is a simple and really cool framework.", "likes": 0}}, {"topLevelComment": {"author": "Roger Shih", "text": "Great course so far! I had to listen to 2:27:55 a few times to make sure I get all the relationships.", "likes": 0}}, {"topLevelComment": {"author": "Beinerth Chitiva Machado", "text": "This was VERY helpful Gwen, you're AWESOME!!!", "likes": 0}}, {"topLevelComment": {"author": "Alisher Xujanov", "text": "the git repo is not working", "likes": 0}}, {"topLevelComment": {"author": "Renato Novaes", "text": "Amazing content! Thank you so much for this. I have learned a lot.", "likes": 1}}, {"topLevelComment": {"author": "Romeo", "text": "The function answer class can be shortened a bit : \nanswerClass(ind) {\r\n  return !this.answered && this.selectedIndex === ind ? 'selectedItem' : \r\n  this.answered && this.correctIndex === ind ? 'correctAnswer' :\r\n  this.answered && this.selectedIndex === ind && this.correctIndex !== ind ? 'incorrectAnswer' : ''\r\n},", "likes": 0}}, {"topLevelComment": {"author": "San", "text": "This is really great, thought there are some edition problems or something, like in 1:41:00 you've ran the app before with that line on code", "likes": 0}}, {"topLevelComment": {"author": "Denis A", "text": "Thanks a lot for your awesome video!", "likes": 0}}, {"topLevelComment": {"author": "Cutie X", "text": "Thank you so much I loved it!! xxx", "likes": 0}}, {"topLevelComment": {"author": "0mer", "text": "35:38", "likes": 0}}, {"topLevelComment": {"author": "pedro matias", "text": "And also, you must change your 'for loop' in the <b-list-group-item> like so:\n <b-list-group-item \r\n                    <b-list-group-item \r\n\n                    v-for=\"(answer, index) in shuffledAnswers\" \r\n                    :key=\"index\"\r\n                    @click=\"selectedAnswer(index)\"\r\n                    :class=\"answerClass(index)\"\r\n                >\nOtherwise, you won't be able to see the correct order for your answers being displayed", "likes": 1}}, {"topLevelComment": {"author": "pedro matias", "text": "If anyone is having difficulty with 'correct_answer' at 1:32:04 it's because there's a missing piece on shuffleAnswers() function.\nJust add this to the end of your shuffleAnswers() { \n...\nthis.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer)\n}", "likes": 2}, "replies": [{"author": "pedro matias", "text": "Also, you have to add \"correctIndex: null\" to your data function (inside the return) in your QuestionBox.vue file", "likes": 1}]}, {"topLevelComment": {"author": "Henry As", "text": "hello i am henry from indonesia\r\nthank you for the course that was given that really helped me\r\nI want to ask what is the correct answer === api correct_answer?\r\nor maybe the ui in the answer list is randomized?\r\nI changed it to v-for = \"(shuffledAnswer, index) in shuffledAnswers\"\r\nthank you", "likes": 0}}, {"topLevelComment": {"author": "Arunan Sugunakumar", "text": "Great video. Superb material to learn Vue. But I am wondering whether I missed the Unit Test part, or was it not in the video?", "likes": 0}}, {"topLevelComment": {"author": "Justin", "text": "I know this is quite an old video, but I just wanted to thank you so much for this excellent tutorial. Web development in general is completely new to me, and I came to this video because I was trying to figure out how to build a web application using Vue.js and associated tools. \n\nI'll be honest,  the first couple times I watched this video I was pretty lost. However, I stuck with it, revisiting certain sections and playing in my browser at the same time. The things you were explaining just started making... sense? I definitely struggled in the beginning though. \n\nAnyway... you're awesome and thanks again", "likes": 0}}, {"topLevelComment": {"author": "Romeo", "text": "Thank you so much for the video, it's amazing that you can learn basics from scratch instead of building an app without proper understanding of what you're really doing. It would be great if you could use regular text editor like VS Code instead of online one but anyway great.", "likes": 0}}, {"topLevelComment": {"author": "Fei Zhang", "text": "https://click.dji.com/AHBLWm31Nm8fSZBzABVwrw?pm=link", "likes": 0}}, {"topLevelComment": {"author": "sikeplayz", "text": "I'm doing this on my iPad is that good?", "likes": 1}}, {"topLevelComment": {"author": "Benargee", "text": "Would be nice if this video had timestamps for every section.", "likes": 5}}, {"topLevelComment": {"author": "chri ram", "text": "Cats really shoudnt be pushed, not even onto arrays ^^", "likes": 1}}, {"topLevelComment": {"author": "Ndrs Lmpk", "text": "unfortunately the <cat-list /> filter command at 31:30 does not work for me. Does anybody know if there has been any updates that have been disabling that command?", "likes": 0}}, {"topLevelComment": {"author": "Hello World", "text": "This is gold !!! Very very nice !!!", "likes": 0}}, {"topLevelComment": {"author": "ABHISHEK ANAND", "text": "Hi \nHow i clear cache in vue js.\nCache is creating to much problem for me, somethime my function run or sometime not.\nI have to use private browse every time.\nPlz someone help me.", "likes": 0}}, {"topLevelComment": {"author": "Pepe Priest", "text": "Learned a lot from this, thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "Joe Rattz", "text": "Thanks for all the effort put into this.  I think there is an error in the Quiz application where you never actually render from the shuffledAnswers array and instead continue using the answers array.", "likes": 0}}, {"topLevelComment": {"author": "Gurleen Singh", "text": "1:00:00 getting &quote weired stuff", "likes": 0}}, {"topLevelComment": {"author": "Divya S", "text": "beautiful and simple explanation. loved the tutorial", "likes": 0}}, {"topLevelComment": {"author": "Ali", "text": "I think she loves cats.", "likes": 0}}, {"topLevelComment": {"author": "Mayank vora", "text": "It was an amazing tutorial and in just 3 hours all necessary concepts were covered. Really liked your work, Gwendolyn.", "likes": 1}}, {"topLevelComment": {"author": "AnRovik", "text": "Coming from React, this seems incredibly simple and easy to use. Good tutorial.", "likes": 0}, "replies": [{"author": "CARDBORED", "text": "As a full-time senior React developer, I agree. VUE is cake but React is more powerful for larger more complex web applications and has gotten much easier/simpler since they added Hooks.", "likes": 0}]}, {"topLevelComment": {"author": "mohamadreza salehi", "text": "thank you for example of cat", "likes": 0}}, {"topLevelComment": {"author": "AmirHossein Niroomand", "text": "a", "likes": 0}}, {"topLevelComment": {"author": "maheiano", "text": "This was super helpful and amazing! Thanks a lot! First time here!", "likes": 0}}, {"topLevelComment": {"author": "Denis A", "text": "I'm a Java backend developer, and now for me it's time to learn frontend side of developing. I start learning vanilla JavaScript, and I know a little about jQuery. I don't know about Angular, Node or React, it's only buzzwords for me. I decide to start learning from Vue.js, and your video I choose as first on my Vue learning. After using JS and jQery, I feel that Vue make things much more simpler.\nThanks for your video! Great explanation!", "likes": 1}}, {"topLevelComment": {"author": "Ozu", "text": "Is this still up to date?", "likes": 0}}, {"topLevelComment": {"author": "Nino P", "text": "This is fantastic, I am super grateful for this free course. Great tutorial ;)", "likes": 0}}, {"topLevelComment": {"author": "Info Simple", "text": "stopped at 24:54 just for knowing", "likes": 0}}, {"topLevelComment": {"author": "Pablo Navarro", "text": "Home form why isnt a component?", "likes": 0}}, {"topLevelComment": {"author": "Sugen", "text": "I do think while this is a good tutorial for practicing a working knowledge of Vuejs, I do think you have some instances where you don't really explain a lot of your work prior to some of the solutions you make. Take the correctIndex case at 1:32:00 you never covered what that object was prior to using it. You only do show this at 1:41:10 where you are color coding the correct answer from the incorrect answer. Not to mention that some of the errors you made while recording this video were pretty unnecessary and eat up a lot of time. I'm not sure if those mistakes were scripted in this video but its distracting nonetheless. Additionally in your early example about filters using jsfiddle, you basically rerecorded a section about filters twice without it really adding much to the discussion.\n\nI think your editing could use some work since the flow of this video is a hot mess for people who are relatively new to SPA", "likes": 3}}, {"topLevelComment": {"author": "Mohammad Nablo", "text": "Double muchtase syntax is my favorite syntax", "likes": 1}}, {"topLevelComment": {"author": "Sourav Das", "text": "I don't know why **component** is not working for me (not displayed in Webpage) as in at 33:00?", "likes": 0}}, {"topLevelComment": {"author": "gaatutube", "text": "Watching this full screen on a 17\" monitor.  Good content perhaps .... but .... fonts (when using the fiddle) is kinda small. Causes quite a bit of eye strain after some time.  If it was 1080p (instead of 720p), it might have been watchable for longer periods.", "likes": 0}}, {"topLevelComment": {"author": "yoan xristow", "text": "1:41:00: TBH I found it a little bit confusing, that first you`re using the \"correctIndex\", when you`re making the header counters active, and not showing creating it, but you`re doing it now.? I gues it`s a mistake from the edit. It`s chronologycally fucked up, you can even see that the \"increment\" prop isn`t even there.. I`m writing this dumb and annoying comment, because there are some newbies, which may get frustrated with this. Or in my case. Thank you!! Don`t get me wrong the crashcourse is pretty ncie. Keep the work.. You`re killing it", "likes": 0}}, {"topLevelComment": {"author": "Reese Armstrong", "text": "Hey add a 00:00 timestamp to enable jumplinks!", "likes": 0}}, {"topLevelComment": {"author": "amit agarwal", "text": "My only wish here is if you had used an EDITOR", "likes": 0}}, {"topLevelComment": {"author": "Abid D", "text": "Great Tutorial. Thank you :)", "likes": 0}}, {"topLevelComment": {"author": "Fajar Setiawan Siagian", "text": "thanks you for this awesome tutorial. now Im understanding and can learn from the documentation and other", "likes": 0}}, {"topLevelComment": {"author": "sudo13", "text": "1:11:48 When I set a value for it gives an error:\n\n\nParsing error: The keyword 'let' is reserved.\n\nerror: 'v-for' directives require that attribute value \n\nerror  Expected 'v-bind:key' directive to use the variables which are defined by the 'v-for' directive", "likes": 0}, "replies": [{"author": "Uzair Vawda", "text": "for v-for you have to bind to something. something like this v-for=\"answer in answers\" :key=\"answer\"", "likes": 0}, {"author": "LP4evah", "text": "Can you paste the code from that section you have? It's working for me. Maybe a typo?", "likes": 0}]}, {"topLevelComment": {"author": "Tim Wassmuth", "text": "Awesome tutorial, helped me in a project that requires Vue skills (worked with react before, so that helped). Great Video, thanks for sharing!", "likes": 0}}, {"topLevelComment": {"author": "Jordy Tshibangu", "text": "The best tuto i have taken so far \nABSOLUTELY LOVE IT", "likes": 1}}, {"topLevelComment": {"author": "Aleksandar Ivanov", "text": "I would love to see this tutorial updated for Vue 3", "likes": 0}}, {"topLevelComment": {"author": "Eric-Kasisto Woudenberg", "text": "Very nicely done Gwen! I loved how you dove right into coding without a huge preliminary buildup. Very helpful for getting me into Vue.js -- I've already been programming for years, this was just what I needed to engage with  the patterns that Vuejs programmers use.", "likes": 2}}, {"topLevelComment": {"author": "Arghore", "text": "Don't think 'beginners' is a good indication for this tuturial, seeing i'm a complete beginner and various things went WAY over my head (also a lot to take in, and a lot brought together at the same time). So probably *informed beginner*  is a bit more appropriate ... so i'm going to check a couple more short and crash courses and likely get back to this in the future...", "likes": 0}}, {"topLevelComment": {"author": "चोके AT भट्टी", "text": "1:50:02 for vuex and router", "likes": 0}}, {"topLevelComment": {"author": "A USER A LAST NAME", "text": "𝑯𝒊 𝑮𝒘𝒆𝒏𝒇, 𝒕𝒉𝒂𝒏𝒌 𝒚𝒐𝒖 𝒔𝒐 𝒎𝒖𝒄𝒉 𝟰𝒍𝒆𝒕 𝒖𝒔 𝒕𝒉𝒆 𝒔𝒓𝒄 𝒄𝒐𝒅𝒆 𝒂𝒕 𝟬𝟭:𝟰𝟵:𝟰𝟴, 𝒎𝒚 𝒃𝒓𝒂𝒊𝒏 𝒘𝒂𝒔 𝒋𝒖𝒔𝒕 𝒆𝒙𝒑𝒍𝒐𝒅𝒊𝒏𝒈 𝒍𝒐𝒍", "likes": 0}}, {"topLevelComment": {"author": "Михаил Подивилов", "text": "Much appreciated. Excellent tutorial. Learned a lot just in a first hour.", "likes": 0}}, {"topLevelComment": {"author": "Charlie", "text": "this[this.$route.params.species][this.$route.params.id] didn't work for me. it returned me an empty object. Can somebody please help?", "likes": 0}}, {"topLevelComment": {"author": "christin joseph", "text": "35:50 installing vue js", "likes": 0}}, {"topLevelComment": {"author": "motive ko", "text": "2020 / 09 / 01 -> if you install vue-cli, then its version will be 4.x.x, And if create vue app, its vue version will be 3.x and the bootstrap-vue will occurs error because of the vue version.   You should install vue-cli with command npm install -g @vue/cli@3.11.1 , same version of her. I spent 1 hour to fix this problem..", "likes": 1}, "replies": [{"author": "Nutzz", "text": "thanks for this, just a little correction: this is the right command to run npm install -g @vue/cli@3.1.1", "likes": 0}]}, {"topLevelComment": {"author": "Geanina-Cătălina Masgras", "text": "I notice at 1:29:00 that the answers are not shuffled. I think you need to change  v-for=\"(answer, index) in suffleAnswers\" in the template for list-group-item. \nIf someone is blocked maybe this will be useful. :)", "likes": 0}}, {"topLevelComment": {"author": "Gabriel Dupuis", "text": "at 56:40, I don't clearly understand how the code work.   How JsonData actually get the data from response?  \nVery good tutorial so far though I've learned a lot!", "likes": 0}}, {"topLevelComment": {"author": "Fandbrothers Indonesia", "text": "1:12:50", "likes": 0}}, {"topLevelComment": {"author": "Mariangel Rodriguez", "text": "This is the best video ever regarding Vue. I saw so many videos in English and Spanish, without a doubt and also by far this is the best. New subscriber, thumbs up, save the video, watch it again to take notes... the best 6 hours with Vue. Thank you so much to be so clear! I want more!!!!! Greetings from Uruguay", "likes": 2}}, {"topLevelComment": {"author": "Richard Anderson", "text": "This really helped me to get started with Vue.  Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Sardar Mohammad Fazlul Huq", "text": "I am getting: Error in render: \"TypeError: Invalid attempt to spread non-iterable instance.\nIn order to be iterable, non-array objects must have a [Symbol.iterator]() method.\"\n\nfound in\n\n---> <QuestionBox> at src/components/QuestionBox.vue\n       <App> at src/App.vue\n         <Root>\n\nwhen i try to loop answers. please reply with solutions.", "likes": 0}, "replies": [{"author": "Nicolas Lance", "text": "Ok, Actually I had a typo error in the code I copied : I typed this.currentQuestion.incorrectAnswers instead of incorrect_answers. \nSolved the issue...", "likes": 0}, {"author": "Nicolas Lance", "text": "I have the same issue... Still looking for the awnser... I do feel that I have exactly the same code however... Maybe not the same librairies ?", "likes": 0}]}, {"topLevelComment": {"author": "Hela", "text": "this channel offers great content, but seriously  3 hours without headlines. c'mon you can do better!", "likes": 0}}, {"topLevelComment": {"author": "Alin-Ștefan", "text": "This is amazing. I was always so scared of these libraries but Vue seems so simple. Thank you so much :)", "likes": 1}}, {"topLevelComment": {"author": "Lucas Dima", "text": "Use vue-cli version 3.1.1 for this awesome tutorial.\nnpm install -g @vue/cli@3.1.1\n\nFor some unknown reason bootstrap-vue and vue dev tools extension were not working with current version of vue-cli (which is by the time of this comment 4.1)\nI installed version 3.1.1 and everything started to work!", "likes": 2}}, {"topLevelComment": {"author": "Melchor Tenorio", "text": "Thank you for this video tutorial :D", "likes": 0}}, {"topLevelComment": {"author": "uzzal maharjan", "text": "Which is the fastest land animal ?? the answer must be chhetah .but the answer from the quiz app gives pronghorn antelope .", "likes": 0}}, {"topLevelComment": {"author": "kuki", "text": "you deserve 1000 thumbs! Very well abstracted and clearly great lecture for other framework users like me. (I used react before) Thanks again and hope you best.", "likes": 0}, "replies": [{"author": "Funny Bro", "text": "@IQUBE LOL", "likes": 0}, {"author": "IQUBE", "text": "1000 thumbs? Did u mean thumbs up?", "likes": 1}]}, {"topLevelComment": {"author": "Tharvinash Visvanathan", "text": "hi why it shows an error when I type => in my vs code. it shows ';' expected.Vetur(1005)", "likes": 0}}, {"topLevelComment": {"author": "Samirudin", "text": "it's hard to believe this is free. but, the fact that it is. thank you so much :)", "likes": 5}}, {"topLevelComment": {"author": "GamePharaoh", "text": "26:01 cat seems to like his new kitty name", "likes": 1}}, {"topLevelComment": {"author": "Mouzam Saleem", "text": "well explained. Good tutorial for Vue beginners", "likes": 0}}, {"topLevelComment": {"author": "ARUN PANNEERSELVAM", "text": "Very neat explanation for the beginners. Good approach.", "likes": 0}}, {"topLevelComment": {"author": "Shivam Kaushik", "text": "Vue is just too easy!", "likes": 0}}, {"topLevelComment": {"author": "Olimjon Allambergenov", "text": "Thanks it is great course", "likes": 0}}, {"topLevelComment": {"author": "Waqqas Akhter", "text": "For those who are getting incorrect answer even after selecting the correct one:\nReason: While shuffling answers the index of the correct answer is also shuffled. So we need to get the index of correct answer before Shuffling.\nMy code(it worked for me):\nshuffleAnswers() {\r\n                \r\n                let answers = [...this.currentQuestion.incorrect_answers, this.currentQuestion.correct_answer]\r\n                this.correctIndex = answers.indexOf(this.currentQuestion.correct_answer)\r\n                this.shuffledAnswers = _.shuffle(answers)\r\n//                this.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer)\r\n            }", "likes": 0}}, {"topLevelComment": {"author": "Mir Atif Ali", "text": "Excellent stuff!! Thanks a ton!! The way Vuex was explained for just phenomenal!! Thanks again! Loved it!", "likes": 0}}, {"topLevelComment": {"author": "Waqqas Akhter", "text": "The voice of OP is very low. Please make sure the voice is audible", "likes": 0}}, {"topLevelComment": {"author": "Debanjan Barman", "text": "Owo VUE seems simpler than React", "likes": 0}}, {"topLevelComment": {"author": "Peter Chow", "text": "Very informative! Vue is quite awesome", "likes": 0}}, {"topLevelComment": {"author": "Vishnu", "text": "while using v-if in the starting, though the count matches, the data in v-else is also displaying for me. May I know what's wrong with my code?\n\n<div id=\"root\">\n  <h1>\n    {{greet}}\n  </h1>\n  <input v-model=\"greet\">\n  <div v-if = \"count === 3\">\n  green\n  </div>\n  <div v-else-if=\"count === 2\">\n    Rambo\n  </div>\n  <div v-esle>\n    Red\n  </div>\n</div>\n\nI gave count as 2. then both Rambo and Red are displayed on my page.", "likes": 0}, "replies": [{"author": "Vishnu", "text": "@Doniyor Abduvokhidov my bad. Thanks for that.", "likes": 0}, {"author": "Doniyor Abduvokhidov", "text": "spelling mistake! you type v-esle not v-else", "likes": 1}]}, {"topLevelComment": {"author": "Sampurrna", "text": "Very Beautiful and wonderful explanation - Thanks to the instructor", "likes": 0}}, {"topLevelComment": {"author": "Climentescu", "text": "Thank you for this awesome video!", "likes": 0}}, {"topLevelComment": {"author": "Panajotis Rotondo", "text": "What can I say, I simply love you xD I've to push the Donate button asap!", "likes": 0}}, {"topLevelComment": {"author": "Dr. Gonzo", "text": "134 people react poorly .-P", "likes": 0}}, {"topLevelComment": {"author": "TrD Ngy", "text": "Thanks for your work! Could you please add time stamp for each of the sections in those two parts :-)", "likes": 0}}, {"topLevelComment": {"author": "Janani Senthilnathan", "text": "Hi I have a question I'm  new to vue.js\n\nRequirement is to enable(clickable) button if userstatus variable value is 'Not Registered(Active)' and if userstatus variable is  'Registered' then button is not clickable.\n\nExisting Code line : <button v:on:click=\"onvalidClick();\">\n\nI am trying to modify like this line:\n<button v:on:click=\"userStatus !== 'Registered' ?\"onvalidClick();\" : \" \">\n\nhow to make the button not clickable in the above conditional code line. Should it be  \" \" or null? \n\nIf userStatus is Registered then button should be disabled/ not clickable.", "likes": 0}}, {"topLevelComment": {"author": "马腾", "text": "really helpful. thx!", "likes": 0}}, {"topLevelComment": {"author": "DesignCode", "text": "Right at the 1:32:20....\nif (this.selectedIndex === this.correctIndex) {\n                isCorrect = true\n            }\nhow 'this.correctindex' getting value.\nI am stuck. And can't update the correct answers marking.\nAnyone please help me.\nThank you!", "likes": 0}}, {"topLevelComment": {"author": "DesignCode", "text": "Right at the 1:32:20....\n\nif (this.selectedIndex === this.correctIndex) {\n                isCorrect = true\n            }\n\nhow 'this.correctindex' getting value.\nI am stuck. And can't update the correct answers marking.\nAnyone please help me.\n\nThank you!", "likes": 0}}, {"topLevelComment": {"author": "Ivailo Petrov", "text": "1:23:00", "likes": 0}}, {"topLevelComment": {"author": "VAIBHAV BOROLE", "text": "<input type='text' data-name='c'>\n\nHow to get value of data-name attribute in vue on save button click? Hi can someone help me with this", "likes": 0}}, {"topLevelComment": {"author": "George Ikwegbu", "text": "This is an awesome straight to the point Video.", "likes": 0}}, {"topLevelComment": {"author": "Samuel Torres", "text": "Can you do a vue + laravel video?", "likes": 0}}, {"topLevelComment": {"author": "Shahidan Majid", "text": "Just finished it. Overall it was a good tutorial. I was able to follow along till the end. I come from Flutter so the experience is quite different in terms of the state management part.", "likes": 0}}, {"topLevelComment": {"author": "django wang", "text": "很棒的教程，谢谢你。 that is really good course,thank you.", "likes": 0}}, {"topLevelComment": {"author": "katsu yama", "text": "Is there her course list?\nI want to learn from her more.", "likes": 1}}, {"topLevelComment": {"author": "Abhijith CR", "text": "Good coder but bad teacher :(", "likes": 0}}, {"topLevelComment": {"author": "krishna kumar singh", "text": "very amazing tutorial gwen", "likes": 0}}, {"topLevelComment": {"author": "Ali Raza", "text": "slot wasn't working for me. So I looked it up and found out that it was updated. \nuse this syntax, v-slot:cell(name):data", "likes": 0}}, {"topLevelComment": {"author": "Human Kind", "text": "Am not getting code completion in .vue files in vscode... Anyone know how to achieve this??? Most extensions ive tried are only highlighting the syntax. When i type ( i don't immediately get the closing ) tag and its bothering me alot.", "likes": 0}}, {"topLevelComment": {"author": "Pedro Araujo", "text": "Great tutorial!\nto go to Vuex & Vue-router 1:50:00", "likes": 0}}, {"topLevelComment": {"author": "Diptangsu Goswami", "text": "1:19:25\nVue devtools won't update the variables by default if the DOM doesn't change. selectedIndex was not responsible for any changes in the page itself which is why Vue devtools wasn't showing real time updates with that variable.", "likes": 0}}, {"topLevelComment": {"author": "Rahul", "text": "The tutorial was precise for me", "likes": 0}}, {"topLevelComment": {"author": "Barny Estrel", "text": "is it really necessary for the vue component to have a name with dash (e.g. cat-list)? it is the only way for it to render in my case (name without dash won't appear). Good tutorial by the way. Thank you very much.", "likes": 0}}, {"topLevelComment": {"author": "Corti Beats", "text": "Because of this video (after a few weeks of searching and reading topics) I started learning Vue. Thank you!", "likes": 23}, "replies": [{"author": "Drk L", "text": "Same here. She is amazing. She explain all in a very simple way. My level of english is basic even so I can understand what she say so perfectly.", "likes": 0}]}, {"topLevelComment": {"author": "Bruno Henrique de Paula", "text": "1:28:20 Missing the \"correctIndex\" part:\ndata() {\n  return {\n    selectedIndex: null,\n    shuffledAnswers: [],\n    correctIndex: null\n  }\n}\n\nshuffleAnswers() {\n  let answers = [...this.currentQuestion.incorrect_answers, this.currentQuestion.correct_answer]\n  this.shuffledAnswers = _.shuffle(answers)\n  this.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer)\n}", "likes": 0}}, {"topLevelComment": {"author": "Bharat Kumar", "text": "Day 1 -  35:43 Thanks. Wanted to try Vue, so helpful", "likes": 0}}, {"topLevelComment": {"author": "mielto1993", "text": "When I am trying this tutorial on 59:17 i do not see <header> and <QuestionBox> I see <header> and <BContainer> , I am using chrome. Does anyone know what the problem might be ?", "likes": 1}}, {"topLevelComment": {"author": "Viktor Zahariev", "text": "She is a woman i cannot understand programming by a woman. Women CAN'T code!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Christopher Clemmons", "text": "Is anyone having issues with the currentQuestion.question being \"undefined\"? I am copying exactly what she is doing and I am getting error but it works. Don't want to run into any more issues in the future.", "likes": 0}}, {"topLevelComment": {"author": "Satyam Singh", "text": "24:50 Will come tomorrow to watch after this.", "likes": 0}}, {"topLevelComment": {"author": "brewed script", "text": "still no idea why to use it. isnt it enough to use ejs and backend things?", "likes": 0}}, {"topLevelComment": {"author": "timitrov csgo", "text": "great approach with the fiddling first to get a feel for the framework, thank you very much", "likes": 0}}, {"topLevelComment": {"author": "BrettB", "text": "Great video\nFYI to anyone having issues getting the links in the adopts-pets to work. Looks like boostrap-vue 2.15.0 broke something. I am not able to get <router-link> under <b-table> in Cats.vue and Dogs.vue to show links. I had to edit my package.json file and change from 2.15.0 to -> \"bootstrap-vue\": \"2.0.0-rc.14\". Then run a yarn install (or npm install).  \nI'm not sure what is causing it to fail in bootstrap-vue 2.15.0, but the old 2.0.0-rc.14 lets me continue with the tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Chaitra Neelagund", "text": "Hi. I am new to vue. I am not understanding why you have created watch method, and after creating it why you wrote shuffleAnswers() in methods? why can not you write in the watch method itself?", "likes": 0}}, {"topLevelComment": {"author": "Durgarao Ganta", "text": "Hi", "likes": 0}}, {"topLevelComment": {"author": "Oleksandr Savych", "text": "thanks for the course! could you please specify which tool did you use for ui prototyping?", "likes": 0}}, {"topLevelComment": {"author": "Shubham Goel", "text": "At 1:46:03 could not understand how (this.selectedIndex === index) restricts the selected item to turn red only red ?", "likes": 0}}, {"topLevelComment": {"author": "Jawad", "text": "if you ran npm run build or something, would all of the sass files compile into one or no?", "likes": 0}}, {"topLevelComment": {"author": "Sayeed Ahmed", "text": "Loved the tutorial so far!!\n1:28:56\nTo handling shuffling, we could use lodash.shuffle() on the original answers array itself within computed block.\nThat way, the answers on screen are already shuffled and we wouldn't need to go around explicitly shuffling downstream and then also handle the edge case of 1st question not shuffling..\nSomething like this..\n**********\ncomputed: {\r\n    answers() {\r\n      let answers = [...this.currentQuestion.incorrect_answers]\r\n      answers.push(this.currentQuestion.correct_answer)\r\n      answers = _.shuffle(answers)\r\n      return answers\r\n    }\r\n  },\n***********", "likes": 3}}, {"topLevelComment": {"author": "yvonnkr", "text": "awesome tutorial, cheers", "likes": 0}}, {"topLevelComment": {"author": "Sam Bass", "text": "Awesome Video! One of the best tutoring videos I have ever seen. So much knowledge in a short period of time, definitely a must see video!", "likes": 0}}, {"topLevelComment": {"author": "Mark W", "text": "1:41:29 should have been a clip that appear earlier, overall a very informative and detailed tutorial for me as an complete vue noob.", "likes": 9}, "replies": [{"author": "Jyan Alice", "text": "so glad I found this comment,. I thought it's just me who noticed it..", "likes": 0}]}, {"topLevelComment": {"author": "The Emax", "text": "thank for your video but.. Sorry this is not for begginers, but for whom Just know vuecli and the structure and just develop with vuecli.\nI followed copying , ok, vue is great, but for sure i cannot redo the code on my own.\nI always use C#, MVC and visual studio and it was really difficult to understand what you are doing and why, specially without explanations.\nYou assume someone just know everything.\nI really don’t understand the folder Project structure, why style is into pages and not separately and more.. which language you use? Typescript? Why sometimes use typescript and sometimes javascript? Why use in any pages import export default from.. what is??\nI’m getting older....", "likes": 0}, "replies": [{"author": "Haipeng Jiang", "text": "It is all Javascript here but with newer syntax, the import /export are ES6 features. I also found the 2nd part of the video (Adoption of Pets) is a bit harder to follow than the 1st part, as lots of ground is covered, there wasn't enough time to explain many important points in just < 3 hrs, like Vue.use and its purpose. But still a really great video, thanks a lot!!", "likes": 0}]}, {"topLevelComment": {"author": "Halvor Nafstad", "text": "If anyone else struggles with getting the right router link and index to the pets page around  2:14:55 , try changing <router-link :to=\"'/pets/dogs/${data.index}'\"> to <router-link :to=\"'/pets/dogs/' + data.index\">", "likes": 0}, "replies": [{"author": "Halvor Nafstad", "text": "@Haipeng Jiang Great! Thanks, I could'nt see that from the video.", "likes": 0}, {"author": "Haipeng Jiang", "text": "actually \"`/pets/dogs/${data.index}`\" works, it is backtick ` (ES6 string interpolation), instead of single quote '.", "likes": 1}]}, {"topLevelComment": {"author": "Haipeng Jiang", "text": "I'm not sure what I'm missing but, for the router link in cat names, I can't get it work with the same template code from the video (~2:08) <template slot=\"name\" slot-scope=\"data\"....I changed that to <template v-slot:cell(name)=\"data\"> then it works...", "likes": 1}, "replies": [{"author": "motive ko", "text": "me too..", "likes": 0}]}, {"topLevelComment": {"author": "Jawad", "text": "2:07:25 You should really edit that ip address out from protonvpn", "likes": 0}}, {"topLevelComment": {"author": "Jawad", "text": "1:47:27 Couldn't you just do:\n\t\t\tanswerClass(index) {\r\n\t\t\t\treturn [\r\n\t\t\t\t\t\t\t!this.answered && this.selectedIndex === index ? 'bg-primary text-white' :\r\n\t\t\t\t\t\t\tthis.answered && this.correctIndex === index ? 'bg-success text-white' :\r\n\t\t\t\t\t\t\tthis.answered && this.correctIndex !== index && this.selectedIndex === index ? 'bg-danger text-white' : ''\r\n\t\t\t\t\t\t];\r\n\t\t\t}", "likes": 0}}, {"topLevelComment": {"author": "BluStrikes", "text": "Hi, I've just completed the first 1 hr and 50 mins of (Learn Vue.js - Full Course for Beginners - 2019) and the application works just fine with buttons etc. However, I'm not sure if I've done something wrong but my application is giving wrong answers. One minute it would be the correct answer then I would answer that same question again and low and behold it would highlight an incorrect answer in 'green' and highlight the correct answer in red and this went on and on the more and played around with it. I was wondering if you have time, could you check 'your' application a few times to see if it too gives you a wrong answers. I am thinking it may have something to do with shuffling the answers, I'm not too sure. Thanks...", "likes": 0}, "replies": [{"author": "BluStrikes", "text": "Thanks you for your reply, I will check these parts you have described.", "likes": 0}, {"author": "Haipeng Jiang", "text": "This works fine for me. In Chrome Vue extention I can see the \"correctAnswers\" value of QuestionBox. As you know it is updated by the \"shuffleAnswers\" method. So either your \"correctAnswer\" is not updated properly, or there is some issue in function \"answerClass\", which determines the colors.", "likes": 0}]}, {"topLevelComment": {"author": "Craig Johnson", "text": "Glad so many had such a great experience.  However I learn by doing and not even 3 and a half minutes in the code doesn't work.  The rest of the video is useless to me as no matter how much I watch my mind is still stuck at 3:30 mins in wondering why it doesn't work.", "likes": 0}}, {"topLevelComment": {"author": "Samir", "text": "Amazing tutorial.   npm upgrade(d)  the git repository without a single error. 00 to 00:35: an introduction, 00:35 to 1:50 :the quiz app, 1:50 till end: the pet app.   Last minutes: a conclusion and resources. Excellent job done.", "likes": 0}}, {"topLevelComment": {"author": "Wovasteen Gova", "text": "This is how I started learning vue", "likes": 0}}, {"topLevelComment": {"author": "Ritten Brake", "text": "27:20 when I press \"ADD\"button , e.g. \"Hi\" , the above shows \"Hiy\" but the type box and after u press \"ADD\"button, it still shows \"Hi\" only , not \"Hiy\"", "likes": 3}, "replies": [{"author": "Arjun Dubey", "text": "Its because you're just altering what will be shown above the input box. Not the input to the add funtion", "likes": 0}]}, {"topLevelComment": {"author": "Kithinga", "text": "wonder woman. thank you so much for this tutorial.", "likes": 0}}, {"topLevelComment": {"author": "dejo095", "text": "For the life of me, I cant get that Next button to work, I did exactly same as her and for me its not working, it says that index is undefined in QuestionBox component", "likes": 0}, "replies": [{"author": "franco giova", "text": "Hey dejo! I think had the same issue as you, my mistake was here \n\nv-for=\"{ answer , index } in answers\"\n\nSo, needs to be wrapped with parenthesis, not curly braces.", "likes": 0}]}, {"topLevelComment": {"author": "dejo095", "text": "For anybody having issues with api at 59:00 not returning anything but error in console log. My problem was with mounted not being a function, so I had to mounted() { ...} instead of mounted: function () {...}", "likes": 5}, "replies": [{"author": "-", "text": "I believe this is a ES6 thing to make things easier.\n\nSo, yeah anyways check your IDE or npm packages version and capabilities before following a tutorial. 👍", "likes": 0}]}, {"topLevelComment": {"author": "Naresh Bhadke", "text": "Which Terminal theme are you running on ?  Looks cool !!! Nice Tutorial. Really enjoyed it.", "likes": 0}}, {"topLevelComment": {"author": "Ricardo Rodriguez", "text": "Thank you so much! Regards from México.", "likes": 0}}, {"topLevelComment": {"author": "Ana After Work", "text": "I loved this video! I also like the style how you talk, it is more comprehensible than the rest of tutorials that just repeat \"you get the drill\" and \"magic behind the scenes\" without really explaining things first. So thank you!!", "likes": 2}, "replies": [{"author": "Pearls & Swine", "text": "Traversey Media literally: watch me code and talk hastily aloud about the gist of what I am doing.\nAlso him: \"hopefully that made sense\"\n\nIf you have to \"hope\" that made sense every 2 minutes, then you're either not a good teacher or you're not a good developer.", "likes": 0}]}, {"topLevelComment": {"author": "Random At Once", "text": "1:29:56 \npersonal timestamp", "likes": 0}}, {"topLevelComment": {"author": "Mehmethan Yagci", "text": "anyone who can help me with this?\n\n\nThese dependencies were not found:\n\n\n\n* @data/cats in ./node_modules/cache-loader/dist/cjs.js??ref--12-0!./node_modules/babel-loader/lib!./node_modules/cache-loader/dist/cjs.js??ref--0-0!./node_modules/vue-loader/lib??vue-loader-options!./src/views/Cats.vue?vue&type=script&lang=js&\r\n* @data/dogs in ./node_modules/cache-loader/dist/cjs.js??ref--12-0!./node_modules/babel-loader/lib!./node_modules/cache-loader/dist/cjs.js??ref--0-0!./node_modules/vue-loader/lib??vue-loader-options!./src/views/Dogs.vue?vue&type=script&lang=js&", "likes": 0}}, {"topLevelComment": {"author": "Adebola Adeola", "text": "Vuex & Vue-Router @ 1:49:59", "likes": 1}}, {"topLevelComment": {"author": "Ajdin Sheki", "text": "Well done really!", "likes": 0}}, {"topLevelComment": {"author": "Chittaranjan Behera", "text": "Excellent!! Thank you for sharing your knowledge in a great step by step approach!!", "likes": 0}}, {"topLevelComment": {"author": "Jawad", "text": "Would you be able to use arrow functions instead of anonymous methods in the methods section?", "likes": 0}}, {"topLevelComment": {"author": "Lars Rye Jeppesen", "text": "So much \"magic\" and inconsistency in Vue. $route magically appears in components, as global variable, \"this\" references are midleading etc..  so messy imho.", "likes": 0}}, {"topLevelComment": {"author": "rey", "text": "Where is unit testing ?", "likes": 0}}, {"topLevelComment": {"author": "Lars Rye Jeppesen", "text": "Her voice is so soothing and nice", "likes": 8}, "replies": [{"author": "-", "text": "I know right... it's the main reason why I like this tutorial xD", "likes": 0}]}, {"topLevelComment": {"author": "Lars Rye Jeppesen", "text": "So totally like Angular just less powerful", "likes": 0}}, {"topLevelComment": {"author": "Abdul Kabir", "text": "Its a an amazing video but please try minimising the typing sound its quite annoying on earphones \n-ThankYou✌️", "likes": 1}, "replies": [{"author": "Lars Rye Jeppesen", "text": "No I like it", "likes": 0}]}, {"topLevelComment": {"author": "Shabbir Saifee", "text": "Loved the video. I am taking a udemy course too but it is so lengthy and even to explain simple things they take a long time. This is the best video to quickly start building apps with Vue.", "likes": 0}}, {"topLevelComment": {"author": "mobsean", "text": "Danger of confusion:  David Guetta and david.getters()", "likes": 0}}, {"topLevelComment": {"author": "aungwin han", "text": "thz so much ?!! still useful after a year.", "likes": 0}}, {"topLevelComment": {"author": "Alphy Gacheru", "text": "IS YOUR CODE NOT WORKING AFTER CREATING @click=\"submitAnswer\"  in the SUBMIT BUTTON the same way as hers???\n<<SOLUTION>> <<SOLUTION>><<SOLUTION>>\nThe sequence of this series is not correctly arranged!  When you get to (1:31:18) skip to (1:40:38 -1:43:01)  then go back to (1:31:18)  and continue otherwise your code won't work! \n\n\nYou'll notice in the submitAnswer function in the methods object she talks about if(this.selectedIndex === this.correctIndex) \nWhere does this.correctIndex come from??? You skip the video and that will be answered then you go back and continue with this AWESOME tutorial!\n\n\nAs a beginner I'm not sure if the explanation is clear. I hope it is and if not feel free to ask me to elaborate!", "likes": 0}}, {"topLevelComment": {"author": "vincent mikhael", "text": "Nice thank you", "likes": 0}}, {"topLevelComment": {"author": "Chris Carr", "text": "Great course!! How would a person render the HTML named code? Instead of having &quot; render \" instead.", "likes": 1}, "replies": [{"author": "Petar Bajic", "text": "unescape and JSON.parse didnt work for me, so in the end this line worked:\nthis.currentQuestion.question = this.currentQuestion.question.replace(/&quot;/g,'\"').replace(/&#039;/g,'\\'')", "likes": 0}]}, {"topLevelComment": {"author": "kimie126", "text": "I cracked the magic at 1:30:08, \nCTRL + /\nhighlighted text become double forward slash.\nomg im so genius.", "likes": 0}, "replies": [{"author": "kimie126", "text": "Tyler Lee that was 4 months ago. Now I even custom my own shortcut to make everything faster. 😂", "likes": 1}, {"author": "Tyler Lee", "text": "CTRL is the key to a lot of shortcuts, try combining it with arrow keys and back space. Tab completion is also a good one to understand.", "likes": 0}]}, {"topLevelComment": {"author": "Leandro Roggerone", "text": "awesome !!! you animals lover woman.", "likes": 0}}, {"topLevelComment": {"author": "George Andreas", "text": "I've made an Angular app to show in my portfolio and had the same problem, a variable was undefined until it got the value from a database, so it would always give me 3 errors because it couldn't render it on the dom before it would get the data from the database, and gave up on solving it. With your solution I fixed it and now I stopped getting the annoying 3 errors. Today is a great day.", "likes": 1}}, {"topLevelComment": {"author": "ItsBanjoM8", "text": "Thank you so much. There is an issue with the tutorial, it skips the correctIndex part out. Took me a lot of diagnosis to work out the issue, obviously quite a good learning experience but could scare away some people", "likes": 1}, "replies": [{"author": "Koning Florian", "text": "True, however you can skip ahead a couple of minutes and then see the correct code  in there", "likes": 0}]}, {"topLevelComment": {"author": "ajax333221", "text": "I can't appreciate enough when someone writes cleanly and knows some basic conventions and explains everything without skipping steps and saying \"this could also be written like this, this is equivalent to that\", thanks, it makes it so much better to understand.", "likes": 35}, "replies": [{"author": "Kristian Arcari Grau", "text": "3ev3eeeee3bbfeee3bebev33eeeb\n3v3\nB\nBevef3e 3b\n3fb3.e\n\nEev3v3hbe333be3evr3b3e333b", "likes": 0}]}, {"topLevelComment": {"author": "Satchmo W", "text": "26:02 to hear sweet kitty cat sounds 😌", "likes": 28}, "replies": [{"author": "Mihai Micsa", "text": "It happens several times during the tutorial, first I thought it was my cat :)", "likes": 0}]}, {"topLevelComment": {"author": "Andres Montoya", "text": "\"... return this.catName...\"\n\nMEOW\n\n\"... plus y\".", "likes": 0}}, {"topLevelComment": {"author": "dani2500d", "text": "Wow what an adventure I had learning from this tutorial!!! Really liked it :)", "likes": 0}}, {"topLevelComment": {"author": "Panom Apet", "text": "What is ur YouTube channel?", "likes": 0}}, {"topLevelComment": {"author": "aynur shauerman", "text": "Thank you for your lesson! Very helpful and understandable! And cats murrs in background so cute!", "likes": 0}}, {"topLevelComment": {"author": "R S", "text": "Hello There, I got this error          43:01\nAnyone solution plz!\n INFO  Starting development server...\r\n98% after emitting CopyPlugin\r\n\r\n ERROR  Failed to compile with 1 errors                                                                         \n\r\nThis relative module was not found:\r\n\r\n* ./components/HelloWorld.vue in ./node_modules/cache-loader/dist/cjs.js??ref--12-0!./node_modules/babel-loader/lib!./node_modules/cache-loader/dist/cjs.js??ref--0-0!./node_modules/vue-loader/lib??vue-loader-options!./src/App.vue?vue&type=script&lang=js&", "likes": 0}, "replies": [{"author": "Nusrat Aktar", "text": "@R S hello I am also facing same problem how did you solve it please can you tell me", "likes": 1}, {"author": "R S", "text": "@Adi I found the solution, Thanks anyway :)", "likes": 2}, {"author": "Adi", "text": "You need to replace path of HelloWorld.vue with your component path in import (App.vue)", "likes": 2}]}, {"topLevelComment": {"author": "prabhat", "text": "Thanks for this amazing tutorial. Good work, keep it up:)", "likes": 0}}, {"topLevelComment": {"author": "Kim Francis Corros", "text": "After watching this, I searched and applied for Vue Developer jobs. I got hired. So thank you for this. Really.", "likes": 0}}, {"topLevelComment": {"author": "Uladzimir Bondarau", "text": "When you read \"Carnivorous animal...\" in question one 1:03:30, as coronavirus", "likes": 0}}, {"topLevelComment": {"author": "Victor Willhuber", "text": "Haha, I was just thinking that I have never watch a videotutorial on programing made by a woman. NICE!", "likes": 5}}, {"topLevelComment": {"author": "Charging Krogan", "text": "As someone who has experience with Angular, I found this really useful. I think the pace might be a bit fast for someone who is completely new to JS frameworks, but you covered A LOT in 3 hours. Very impressive.", "likes": 3}}, {"topLevelComment": {"author": "aat karelse", "text": "perhaps split it up in more parts so you can get to the part you want need faster by clicking the time code  !", "likes": 0}}, {"topLevelComment": {"author": "Raymond Chen", "text": "Thank a lots , i can understand abiut fundamental and vue cli work very very thanks", "likes": 0}}, {"topLevelComment": {"author": "mm music", "text": "Reached to let's talk about \"custom components\" >>  min 30:00", "likes": 0}}, {"topLevelComment": {"author": "Ask Lecter", "text": "Obrigado por se inscrever no meu canal !", "likes": 0}}, {"topLevelComment": {"author": "CreatorSsumit", "text": "Vue js a framework for building light projects... But u say it is a library.. Are u mad", "likes": 0}}, {"topLevelComment": {"author": "Arpit Singh", "text": "Awesome Video, Thanx", "likes": 0}}, {"topLevelComment": {"author": "Xerxis", "text": "1:06:00 is it better to pass the method downwards like a prop or to emit the click event to app.vue?", "likes": 0}}, {"topLevelComment": {"author": "Ngalla Diouck", "text": "Very Good tutorial !! i watched once but was loste in the part two so i went watch more tutorials about the basics and vuex ...come bad and this tutorial was like putting all the pieces together !!!", "likes": 0}}, {"topLevelComment": {"author": "Vinni Rana", "text": "Thanks a ton! I'm an intermediate dev and the tutorial was very helpful for me.", "likes": 0}}, {"topLevelComment": {"author": "kombo lewis", "text": "watched looking for those dispatch calls", "likes": 0}}, {"topLevelComment": {"author": "Michael Scarn", "text": "720p? Really?", "likes": 0}}, {"topLevelComment": {"author": "Summer L", "text": "haha the sound of the keyboard typing is kinda distracting to the lesson but the tutorial is still nice.", "likes": 0}}, {"topLevelComment": {"author": "Lynn Yuhn", "text": "Anyone stuck around 2:05 creating html for Cats.vue - try <template slot=cell(name) instead of <template slot=\"name\"", "likes": 1}}, {"topLevelComment": {"author": "林子雋", "text": "What a thorough Vue tour! I really learn a lot from this tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Raiyan Hossain", "text": "Good tutorial to get a jumpstart with vue. I even kept a copy of the finished pets tutorial as material for future reference.", "likes": 0}}, {"topLevelComment": {"author": "Bob Hans", "text": "I get this error, I have looked through the whole quiz app part and I have looked at google for an answer. anyone else got this error? if so how did you solve it? in advance thank you \n\n\n$attrs is readonly.\r\n\r\nfound in\r\n\r\n---> <BLink>\r\n       <QuestionBox> at src/components/QuestionBox.vue\r\n         <App> at src/App.vue\r\n           <Root>\n\n\nand \n\n\n[Vue warn]: $listeners is readonly.\r\n\r\nfound in\r\n\r\n---> <BLink>\r\n       <QuestionBox> at src/components/QuestionBox.vue\r\n         <App> at src/App.vue\r\n           <Root>", "likes": 1}}, {"topLevelComment": {"author": "nas lam", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Lune DeFroid", "text": "Thank you, this is the best vue course online.", "likes": 0}}, {"topLevelComment": {"author": "scienceboy20814", "text": "I learned butterflies have 0 legs", "likes": 0}}, {"topLevelComment": {"author": "M.Abbas", "text": "Very Good Tutorial\nVery Easy to learn\nVery easy to understand\nNice tutorial\nVery good explanation\nMa'am thanks for making these types of tutorial for learning \nThank you so much", "likes": 0}}, {"topLevelComment": {"author": "Dr. Gonzo", "text": "I learned so much just in the first hour, thank you very much :-)", "likes": 0}}, {"topLevelComment": {"author": "吴自龙", "text": "Excuse me ，your mac  【smiling face】app is what？ thank you", "likes": 0}}, {"topLevelComment": {"author": "Éric Morneau", "text": "I should really do tutorials like this. It requires good knowledge and vulgarisation, possibly... but goddamnit, lecturers are so boring. It's a good tutorial, but I wanna sleep after 3 minutes.", "likes": 0}}, {"topLevelComment": {"author": "jedw", "text": "I was fine with all of this and then it go to 35 minute mark and everything just went out the window. Now I've got an app containing like 110 megs of dependencies, and files all over the place that I don't understand. I am lost! Why do we have to make these frameworks so damn complicated.", "likes": 0}}, {"topLevelComment": {"author": "Weasle", "text": "If at 31:37 it doenst work, make sure you put  your  template like this (note the  ' '  around it ): template: ' <ul><li>cat</li></ul> '", "likes": 15}, "replies": [{"author": "ahmed sefaw", "text": "@Bruce Zhang Thx  a lot  it worked for me now !", "likes": 0}, {"author": "Bruce Zhang", "text": "Thank you!", "likes": 0}, {"author": "mushymushy19", "text": "thx , was getting stuck there for a sec  !! :)", "likes": 0}, {"author": "CocoPalermo86", "text": "Thx, worked for me now! curious why it then worked on her site?", "likes": 0}]}, {"topLevelComment": {"author": "Siraj Nadwar", "text": "Very nice tutorial and thank you very much for this awesome hands on lab. I have a question though:\nAt minute 57:56, why does it have to return response.json(), can it do something like this.questions = response.json().results in the first then statement itself?", "likes": 0}}, {"topLevelComment": {"author": "Kido Bae", "text": "Thanks for your Great Tutorial.", "likes": 0}}, {"topLevelComment": {"author": "R N", "text": "My fav channel for learning new technologies", "likes": 0}}, {"topLevelComment": {"author": "Cristopher Caducoy", "text": "1:38 I am pretty sure I heard a cat. Sorry got distracted.", "likes": 0}}, {"topLevelComment": {"author": "Sarah", "text": "The sound is annoyingly low", "likes": 0}}, {"topLevelComment": {"author": "Luke Avedon", "text": "Great tutorial! Thank you so much!!!", "likes": 0}}, {"topLevelComment": {"author": "Thor-x86", "text": "Did you just disabled ads on JSFiddle??", "likes": 0}}, {"topLevelComment": {"author": "Joaquin Leon", "text": "I see you define global components inside the vue instance, but isnt that necessary only for local components?", "likes": 0}}, {"topLevelComment": {"author": "prashanth kumar", "text": "Good explanation and I really like the class. Great job!", "likes": 0}}, {"topLevelComment": {"author": "Анастасия Кушнир", "text": "Just wanted to thank you so much. This quick guide is very useful and really helped me to go through the Vue essentials within 3 hours of your theory and 2 hours on taking notes. Really helpful for those, who already knows, for instance, React and wants just to make some parallels between known technology and Vue. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Nabeel Tahir", "text": "Everything is going fine but in console error show\n[Vue warn]: Error in render: \"TypeError: Cannot read property 'question' of undefined\"\n\n\nfound in\n\n\n---> <QuestionBox> at src/components/QuestionBox.vue\n       <App> at src/App.vue\n         <Root>", "likes": 0}, "replies": [{"author": "jonathan silva", "text": "<QuestionBox\n      v-if=\"questions.length\"\n\n    />\n\nAdding this v-if in your QuestionBox will solve the problem", "likes": 0}]}, {"topLevelComment": {"author": "Oussama GHOUAGH", "text": "Thank you, I enjoyed learning the basics of VueJs and VueX with this tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Viktor D.", "text": "Had to lower the speed of video to 0.75 :). Good tutorial..", "likes": 0}}, {"topLevelComment": {"author": "Tayab Raza", "text": "Simple array shuffle\nvar array = ['hi', 'hello', 'hola'];\nvar newVal = 'new value';\narray.splice(Math.floor(Math.random() * array.length), 0, newVal)\nconsole.log(array);", "likes": 0}}, {"topLevelComment": {"author": "yackawaytube", "text": "Running \"vue create\" generates a directory (and subdirectories) with 24,255 files.  Why does a \"single page app\" require 24,255 files? Is the NPM model 1 big failure?  And talk about security hole.  How do I ensure that there is no virus in one of the 24,255 files?", "likes": 0}, "replies": [{"author": "Jesse \"Wazanator\" Culver", "text": "That is one of the main issues with npm. Unless you want to read through all the files or pass them through a static code analysis tool (which you have to trust is going to catch anything malicious) you are trusting that not only is the package you pulled in clean but any packages that package is pulling is clean and so and so forth. Which is why you should be very careful about what packages you decide you need.\n\n\nHowever this is a security issue for any package distribution network including any sources you have mounted in apt. You have to trust that there is enough people maintaining a package that nothing is going to slip through and if it does that it gets patched quickly.\n\n\nOf course you can take the same approach with npm as you can with apt and self host a registry for your organization and dedicate individuals to checking patches/packages and pushing them through to your registry manually after passing review. That is of course pretty expensive in terms of man hours if you are wanting to make sure your packages are relatively up to date.", "likes": 0}]}, {"topLevelComment": {"author": "calmeee", "text": "Very cool tutorial. Thank you. The only thing, that you left the bug in QuestionBox component. correctIndex variable is assigned in shuffleAnswers() method by index of correct answer from shuffledAnswers, when on layout you actually still showing answers array. So, correct answers will happen only if the indexes of an answer in both arrays are equal((", "likes": 0}}, {"topLevelComment": {"author": "Sankalpa", "text": "Awesome Tutorial!", "likes": 0}}, {"topLevelComment": {"author": "rbdragon", "text": "The 'correctIndex' variable is added in the 1:41:20 . Hope to help!", "likes": 3}, "replies": [{"author": "Pedro Dessbesell", "text": "THANK YOU!", "likes": 0}]}, {"topLevelComment": {"author": "CollMomo1", "text": "Thabk you for using the right words at the right time, thanks for the intellectual rigorness, thats refreshing !", "likes": 0}}, {"topLevelComment": {"author": "yugandhar pathi", "text": "Thanks a lot 👍 your help is really appreciated ...", "likes": 1}}, {"topLevelComment": {"author": "Milan Stojadinovic", "text": "best tutorial I ever seen. I didn't fall a sleep and I see every typing error you accidently did.", "likes": 0}}, {"topLevelComment": {"author": "rbdragon", "text": "I am getting an error when I try to declare the array to read the list in the JavaScript section:\n\n\nVue.component('cat-list', {\ntemplate:\n<ul> \n<li v-for=\"cat in cats\"> {{cat.name}}</li>\n</ul>\n})\n\n\nError: Expected an identifier instead saw '<'\nError:  Expected '}' to match '{' from line 1 and instead saw  ul\n\n\nDoes anyone know why JS is not recognizing the code if the configuration is exactly the same??", "likes": 0}, "replies": [{"author": "rbdragon", "text": "@Oleg Petrov great, thanks!", "likes": 0}, {"author": "Oleg Petrov", "text": "You must take markup in a sign ` (i do not know it's name)\n`<ul> <li v-for=\"cat in pcats\">{{ cat }}</li> </ul>`", "likes": 2}]}, {"topLevelComment": {"author": "SkullboyBZ", "text": "52:00 I fuking jumped", "likes": 0}}, {"topLevelComment": {"author": "Ray Panjaitan", "text": "Can anybody please tell me if this is Vue 1 or Vue 2?", "likes": 0}}, {"topLevelComment": {"author": "Marc One N.", "text": "Nice training video! Quick question: Instead of using API to get question and answer, we can still create a json file for it to avoid those special characters. Or is there anyway to avoid those special characters?", "likes": 1}}, {"topLevelComment": {"author": "Eduardo Oliveira", "text": "2:23:31 I'm stuck with that one. Have set @click=\"toggleShowPetForm\" but with not results. Not sure what's happening.", "likes": 0}, "replies": [{"author": "Wovasteen Gova", "text": "Hey Im having trouble creating the project folder for 1:50:42 could you create it for me and send it to me thinks.", "likes": 0}]}, {"topLevelComment": {"author": "Tu Trinh", "text": "Learned a lot. Thank you for making this video.", "likes": 0}}, {"topLevelComment": {"author": "Jack Mihov", "text": "Great Video, helped me a lot since I am new to Vue js! Only thing that I noticed was, that at 1:32:09 we could not see you adding line 75 due to a cut :)", "likes": 3}}, {"topLevelComment": {"author": "mohit bansal", "text": "at 1:32:03 You skipped over the part where you define and initialize this.correctindex", "likes": 18}, "replies": [{"author": "Dipesh Paudel", "text": "Exactly, I'm going through the same situation. Found that initialization of this.correctindex was explained at 1:41:01", "likes": 6}]}, {"topLevelComment": {"author": "JamesP", "text": "1:08:30 may have been useful to say you could have used:\ncurrentQuestion.?question\nGood tutorial tho", "likes": 0}}, {"topLevelComment": {"author": "Hussein.H", "text": "first time I see a girl giving online coding course and this is honestly Amazingg this is the best Vue course out theree I give you 5 start. keep going <3", "likes": 3}, "replies": [{"author": "Tyler Lee", "text": "There are a number of female coders at my company. They are really good in fact. I came here to also compliment the quality of the teaching, I immediately felt like it was hitting the points that i was interested in learning. A+.", "likes": 0}, {"author": "Wovasteen Gova", "text": "ya this is great", "likes": 0}]}, {"topLevelComment": {"author": "Jelovac Maglaj", "text": "This is definitly NOT for beginners, so.don't waste time watching this if u are a beginner. She knows this excellent, but doesn't have skills to.teach. She can be understood only by someone who already knows something about this.", "likes": 1}}, {"topLevelComment": {"author": "Cristian Gabriel", "text": "I giggle everytime she said mushtase", "likes": 0}, "replies": [{"author": "Lilo_Wonder", "text": "Lol", "likes": 0}]}, {"topLevelComment": {"author": "danangs57", "text": "i love youuuu", "likes": 0}}, {"topLevelComment": {"author": "Dan Cacovean", "text": "tks for tut!!!", "likes": 0}}, {"topLevelComment": {"author": "Mask Man", "text": "Thanks for the video, this one helps me review everythign about vuejs  !!!", "likes": 1}}, {"topLevelComment": {"author": "Henry Cheng", "text": "That you, outstanding introduction on VUE", "likes": 1}}, {"topLevelComment": {"author": "Page Petty", "text": "Will you please do a vid on implementing PayPal into a vue app???", "likes": 0}}, {"topLevelComment": {"author": "Jm Macatangay", "text": "Can you make a Full Video of Making a Dashboard with Vue?", "likes": 3}}, {"topLevelComment": {"author": "Mokonzi", "text": "Thank you so much! Just finished the quiz app tutorial. Added a lastQuestion variable to disable the next button after the last question of the quiz.\n\nAs for the difficulty of the tutorial (so far at least), if you already know React, you will understand many things very quickly (props, components, lifecycle methods, architecture)", "likes": 0}}, {"topLevelComment": {"author": "Abrar Zahin", "text": "you didn't mention getting the index of the correct answer inside the  shuffledAnswers() method.", "likes": 0}}, {"topLevelComment": {"author": "Spaphy", "text": "just a heads up for anyone else, the template code at 2:06:30 to render the link to the animal using the \"slots\" part of templates wouldnt render for me, and it turns out that the way to implement this has changed. I would closely follow the example on bootstrap-vue's site to keep up.", "likes": 0}}, {"topLevelComment": {"author": "Jason Khoon", "text": "correctIndex => 1:32:28   1:42:00", "likes": 0}}, {"topLevelComment": {"author": "Jozua Black", "text": "thank you so much, best of best.", "likes": 0}}, {"topLevelComment": {"author": "Anze Fajfar", "text": "Honestly, I am more of a dog person...", "likes": 0}}, {"topLevelComment": {"author": "ABC DEFG", "text": "Very nice tutorial, thank you for the good work. Helped me to get started with Vue!", "likes": 0}}, {"topLevelComment": {"author": "Malin Yamato", "text": "Question: I am looking for a GUI library such as Quasar, Vuitify, Element or perhaps BootstrapVue. It would help me a lot if you may tell me why you chose BootstrapVue.", "likes": 0}}, {"topLevelComment": {"author": "Malin Yamato", "text": "I am a server side developer with no Js libs, angular or react yet with some little Javascript experience. The course was kinda hard to understand at first, but after watching it 3 times I got it. Its hard to understand because things are far from being explicit.  Too much is magical with things between quotation marks \"\" that could be expressions and functions as well.  In languages I use such as Golang, C++ and Kotlin everything quoted are nothing else but strings. Thank you for a great lecture.", "likes": 0}}, {"topLevelComment": {"author": "The Unboxing Traveller", "text": "@ time 1:30:52 - The answers did't shuffled as expected.", "likes": 1}, "replies": [{"author": "Koning Florian", "text": "mak sure you have capital letters and spelling correct. also replace {{answer}} with {{shuffledAnswer}}", "likes": 0}]}, {"topLevelComment": {"author": "IJazwy", "text": "Good effort .. but I think its not simple for beginners", "likes": 0}}, {"topLevelComment": {"author": "Terrence Louis", "text": "correctIndex came out of thin air. maybe that part got edited out?", "likes": 5}}, {"topLevelComment": {"author": "Terrence Louis", "text": "Great video. Try chewing gum before you record - reduces the sound of \"mouth noises.\" (i know that sounds extremely particular but there are a lot of ppl like me out there than get really grossed out by it.)", "likes": 0}}, {"topLevelComment": {"author": "anwar hossen", "text": "Outstanding tutorial,amazing presentation. more want  to JS basic tutorial , Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Lucas Marques", "text": "As someone who doesnt really know anything about vue or js (a beginner if you would) your tutorial is very confusing, you often cut parts in the videos that had key information, like a variable being declared, and such, i wasted 10min just searching around the video as to where a certain variable was, because you declared it and in the editing you cut that part out, jesus.", "likes": 0}, "replies": [{"author": "Yoan Almonte", "text": "it is better that you have a basic understanding of js before trying vue.js. by the way, didn't have any problem at how she explained.", "likes": 0}]}, {"topLevelComment": {"author": "Zion", "text": "[Bookmark]\n1:49:58 Vuex Vue-Router", "likes": 0}}, {"topLevelComment": {"author": "Joe Hill", "text": "Why not keep your data immutable and map over your array and return a new one?", "likes": 0}}, {"topLevelComment": {"author": "Gilles Pothieu", "text": "Thanks a lot from France !\nYou helped me so much !\n\nMerci !", "likes": 0}}, {"topLevelComment": {"author": "Breno Moreira", "text": "Gwen! thank you a lot! i did it!!! i got a new job!! THANK YOU A LOT!!!!", "likes": 30}}, {"topLevelComment": {"author": "John Doe", "text": "4 minutes into the course and I already know I'm going to have a good trip. Your teaching is excellent. Keep it up!", "likes": 8}}, {"topLevelComment": {"author": "Adam Saher", "text": "\"I have loaded the library so I'm going to use it\" \nFFS if we knew how to load the library, we wouldn't be here.", "likes": 0}, "replies": [{"author": "Adam Saher", "text": "@Nipuna Sudharaka  Another bobs and vagene idiot. We are here because we googled looking for an answer. One day when you have toilets, you might understand.", "likes": 0}, {"author": "Nipuna Sudharaka", "text": "google it u dumbass", "likes": 2}]}, {"topLevelComment": {"author": "Kevin Nicholas", "text": "i think in the part 2, it's not for beginner T_T", "likes": 0}, "replies": [{"author": "Sycopath", "text": "It's a bit more advanced, sure. But if you watch it a couple more times, you'll realize that what she's doing isn't really that different what she did in the first part. \n\nThe main difference is that the HTML portion and the JS portion of JSFiddle are now in the same file (App.vue), while the Vue component portion is now in separate files (Header.vue and QuestionBox.vue). When you think of it like that, it becomes much easier.", "likes": 0}]}, {"topLevelComment": {"author": "jatasya 89", "text": "Awesome tutorial thank you very much", "likes": 0}}, {"topLevelComment": {"author": "Riza Khan", "text": "What in the world is that sound at 1:19:17.", "likes": 0}}, {"topLevelComment": {"author": "BukovTervicz", "text": "By FAR the best guide I've seen, and I went thru a lot of them last 2 days. Ty very much, really helpful!", "likes": 0}}, {"topLevelComment": {"author": "TJSA", "text": "For anyone stuck at 2:08 : Use <template v-slot:cell(name)=\"data\"> instead of <template slot=\"name\" slot-scope=\"data\">", "likes": 23}, "replies": [{"author": "Remco Volkers", "text": "can you change your timestamp to 02:08:00 so it's easier to find? thanks for the tip!", "likes": 2}, {"author": "Renato Cada", "text": "@Matt M slot-scope got deprecated. It's also better to read their official docs, they explained everything very well", "likes": 0}, {"author": "Jon Bingham", "text": "OMG Thank you!!!!", "likes": 0}, {"author": "Matt M", "text": "Thanks for that! Did the parameter syntax just change with a new version or something?", "likes": 0}, {"author": "SojournerInExile", "text": "3 months late I know, but thank you so much. I could not figure that out for the life of me.", "likes": 0}]}, {"topLevelComment": {"author": "oriano info", "text": "Nice explained", "likes": 0}}, {"topLevelComment": {"author": "SwissTrader", "text": "just excellent, thanks", "likes": 0}}, {"topLevelComment": {"author": "Sergi", "text": "For the cats/Dogs projects, I am using an API to get the data, where should I place the fetch function?  In the store.js file?", "likes": 0}}, {"topLevelComment": {"author": "CV", "text": "Hello !!!, I loved this excellent tutorial, well raised and updated above all, I hope you can help me with some code that I want to do, I have two components in the app. One is called <preload /> and the other is a < router-view> what I want to do show the <preload /> that is a page or component waiting, when the <router-view> has rendered it will be displayed and the <preload /> will close, placed the v- cloak [display: none] in the <router-view> and it works, but I don't know how to close the <preload />, someone has an idea of what it should do, thanks !!!!", "likes": 0}}, {"topLevelComment": {"author": "Kay", "text": "Hello there! Just have a concern that are we able to split up 1 vue component into separated files for Template, Scripts and Style?", "likes": 0}}, {"topLevelComment": {"author": "Mohammadali erfani", "text": "Every time I have a odd bug in work  2:09:01", "likes": 2}, "replies": [{"author": "TJSA", "text": "Bootstrapper-vue has been updated since the video came out. Use <template v-slot:cell(name)=\"data\"> instead of <template slot=\"name\" slot-scope=\"data\"> and it should work", "likes": 2}]}, {"topLevelComment": {"author": "Sk Rezwan", "text": "One of the best Vue crash course ever....😍", "likes": 0}}, {"topLevelComment": {"author": "Ali Abdulhussein", "text": "In template do you missing '####'? it should by '<ul>###</ul>'", "likes": 0}}, {"topLevelComment": {"author": "José Tuzinkievicz", "text": "I love pets, thanks for that!", "likes": 0}}, {"topLevelComment": {"author": "unbind all", "text": "##############\\quiz>npm install bootstrap-vue bootstrap\nnpm WARN bootstrap@4.3.1 requires a peer of jquery@1.9.1 - 3 but none is installed. You must install peer dependencies yourself.\nnpm WARN optional SKIPPING OPTIONAL DEPENDENCY: fsevents@1.2.9 (node_modules\\fsevents):\nnpm WARN optional SKIPPING OPTIONAL DEPENDENCY: Error: EPERM: operation not permitted, rename '##############\\quiz\\node_modules\\.staging\\fsevents-3f6401eb\\node_modules\\concat-map' -> '##############\\quiz\\node_modules\\.staging\\concat-map-70290f38'\n\nnpm ERR! path ##############\\quiz\\node_modules\\@nuxt\\opencollective\\node_modules\\consola\nnpm ERR! code ENOENT\nnpm ERR! errno -4058\nnpm ERR! syscall rename\nnpm ERR! enoent ENOENT: no such file or directory, rename '##############\\quiz\\node_modules\\@nuxt\\opencollective\\node_modules\\consola' -> '##############\\quiz\\node_modules\\@nuxt\\opencollective\\node_modules\\.consola.DELETE'\nnpm ERR! enoent This is related to npm not being able to find a file.\nnpm ERR! enoent\n\nnpm ERR! A complete log of this run can be found in:\nnpm ERR!     ##############\\AppData\\Roaming\\npm-cache\\_logs\\2019-09-15T01_37_59_190Z-debug.log\n\nso far i tried: npm cache verify, npm cache clear --force, adding consola folder that it talks about in error messages, adding .consola.DELETE folder, installing jquery(fails in a similar way). I never used this npm thing before so excuse me if im doing something stupid. I can install bootstrap in any other folder but the one with the project.", "likes": 0}}, {"topLevelComment": {"author": "Melly winsツ", "text": "This is my own take on the shuffling issue: i inserted the correct answer in a random position right from beginning when i was making the answers array like this :\nanswers:function(){\n            let answers= [...this.question.incorrect_answers];\n            function getRandomInt(max) {\n                    return Math.floor(Math.random() * Math.floor(max));\n                    }\n            answers.splice(getRandomInt(answers.length),0,this.question.correct_answer)\n            return answers\n            \n        }\nYou dont need a library or anything like this.Have a good day!", "likes": 28}, "replies": [{"author": "Skalippan Balippan", "text": "what about one line: this.answers.sort(() => 0.5 - Math.random())", "likes": 3}]}, {"topLevelComment": {"author": "Hossein Hariri", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Mehmet Emin", "text": "Great Course, I loved it. Thank you :)", "likes": 1}}, {"topLevelComment": {"author": "Vinícius Xavier", "text": "Hey Gwen, how did you setup your environment to read sass files? It doesn't format well here. I tried some extensions, but it doesn't look to work.", "likes": 0}}, {"topLevelComment": {"author": "Sebsen", "text": "Great tutorial. for all stuck at 1:30:50. you need to add:\n\nthis.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer) ------- at shuffleAnswer \ncorrectIndex: null ------ at data() \n\nyou can see it in her git repo 👍", "likes": 6}, "replies": [{"author": "Zakiy Hisam", "text": "thanks for the help bro!", "likes": 0}, {"author": "Aman Gupta", "text": "Thank 's", "likes": 0}, {"author": "Codersbite", "text": "@Kosti it would be so nice to have a tutorial which is showing everything from A to Z with best practices but i dont think its possible. And many things are changing everyday. U know any good tutorial laravel vue full stack?", "likes": 0}, {"author": "Kosti", "text": "Thanks anyways", "likes": 0}, {"author": "Kosti", "text": "I know I know, it's been a while since I finished it completely, fixed it on my own", "likes": 1}]}, {"topLevelComment": {"author": "Harrison Greeves", "text": "If you want the next button to be disabled before you press submit you can do the following: \n\n\n\n<b-button \n   @click=\"next\" \n   variant=\"success\"\n   :disabled=\"selectedIndex === null || !answered\"\n   >Next\n</b-button>\n\n\nThe same as the submit button except you use \"!answered\" instead of \"answered\".", "likes": 1}}, {"topLevelComment": {"author": "Josh", "text": "How to change it to index starts with 1 instead of 0?", "likes": 0}}, {"topLevelComment": {"author": "Josh", "text": "Newbie question: In this use case of creating a quiz, does it provide the answers to the user if they have Vue Dev Tools?", "likes": 1}, "replies": [{"author": "Joshua Sellin", "text": "Yes, this is not a secure quiz (not intended to be). In fact the answer could be found with the regular dev tools. The data from the api is pulled on the client side.", "likes": 0}]}, {"topLevelComment": {"author": "ranu sharma", "text": "Hi. I am a beginner in Vue JS and have just started this course. Could you please tell how to preload the Vue library in Visual studio (1:40)? Thanks", "likes": 0}, "replies": [{"author": "Wovasteen Gova", "text": "Sorry If someone hasn't replied yet. Open the Extensions view (Ctrl+Shift+X) and search on 'live preview' or 'html preview' . Reply if you need more help.", "likes": 0}]}, {"topLevelComment": {"author": "Jimwi Chen", "text": "hi", "likes": 0}}, {"topLevelComment": {"author": "Frédéric HAUGUEL", "text": "It's really a bad idea to create a so long video.", "likes": 0}}, {"topLevelComment": {"author": "joshua Pchumba", "text": "Very professional and easy to understand", "likes": 0}}, {"topLevelComment": {"author": "Basavaraj Sabarad", "text": "i liked your work. please make advanced tutorial too.", "likes": 0}}, {"topLevelComment": {"author": "Bigman74066", "text": "I like the way you make \"mistakes\" to show what happens if you do stuff \"wrong\". It immediately answers a lot of \"what if...\" questions I might have had. Good job!", "likes": 15}, "replies": [{"author": "Wovasteen Gova", "text": "Ya same", "likes": 0}, {"author": "Faraday Academy", "text": "Thank you!", "likes": 0}, {"author": "Malin Yamato", "text": "I agree,,,  it should be part of everyone lecture to have some bugs and explain about how things work while fixing them.", "likes": 2}]}, {"topLevelComment": {"author": "Sandesh Pokharel", "text": "is semicolon not required in vue I have the habit of giving it .. does it have any effect ?", "likes": 0}}, {"topLevelComment": {"author": "stellamagical", "text": "Thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "Atif Afsar", "text": "I really learnt a lot from your tutorial. Very well explained. Thank you", "likes": 0}}, {"topLevelComment": {"author": "אדם פרי", "text": "1:50:00 Vuex & Vue-Router", "likes": 1}}, {"topLevelComment": {"author": "The KonaX", "text": "holly shhhhh. who else notice repeat between 24-30", "likes": 0}}, {"topLevelComment": {"author": "Anais Urlichs", "text": "She has the Brave browser!! Go crypto <3", "likes": 1}, "replies": [{"author": "Juan Guerra", "text": "Do you use it? I've never heard about it before", "likes": 0}]}, {"topLevelComment": {"author": "Poker Face", "text": "just awesome! So much info in such a short and packed video!", "likes": 0}}, {"topLevelComment": {"author": "אדם פרי", "text": "the BEST as always!", "likes": 0}}, {"topLevelComment": {"author": "lee h.", "text": "Very good explanation, style and great 'deep dive' into the subject.", "likes": 1}}, {"topLevelComment": {"author": "António Rito Silva", "text": "Very good tutorial! Thanks. Do you have the code of the example in a public repository?", "likes": 0}}, {"topLevelComment": {"author": "kyungsik jeung", "text": "Even if I click the app component,component instance(question) is not showing up in Vue DevTools. Has anyone experienced this problem?", "likes": 0}, "replies": [{"author": "kyungsik jeung", "text": "fixed it. chrome://extensions > Allow access to file URLs then restart chrome", "likes": 0}]}, {"topLevelComment": {"author": "Pinyin Xingming", "text": "please how can i add filter search to that table.", "likes": 0}}, {"topLevelComment": {"author": "lionelricky", "text": "Thank you for this, I learned alot! Great job!", "likes": 0}}, {"topLevelComment": {"author": "Jean Brunel Jean Joseph", "text": "Quand tout le monde est arrivé au bout de son travail, je commenced à peine le mien (Frank Gehry)", "likes": 0}}, {"topLevelComment": {"author": "aeamaea", "text": "May I suggest you use an external microphone for future screencasts because having to listen through continuous pounding on the keyboard is rather distracting. Thanks for making the content available though.", "likes": 0}}, {"topLevelComment": {"author": "Chenru Yan", "text": "First of all, great video. Just noticed that you past functions as props to the child component, but I had read it at several places that people saying it is an anti-pattern. Vue recommends using events instead.", "likes": 3}}, {"topLevelComment": {"author": "Nguyễn Văn Trung", "text": "Can you up your source code in here ? thanks", "likes": 0}}, {"topLevelComment": {"author": "Holly Robertson", "text": "You are amazing! Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Pradeep Poonia", "text": "How amazing it is to have a surname 'Faraday'", "likes": 1}}, {"topLevelComment": {"author": "Pro Gamer", "text": "Can I build mobile apps with vue js?", "likes": 0}, "replies": [{"author": "Adam", "text": "Yup .. with NativeScript-Vue", "likes": 1}]}, {"topLevelComment": {"author": "SHELLAC85", "text": "After I did the lodash bit, I got this error: \"This dependency was not found:\n\n\n* bootstrap/dist/css/bootstrap.css in ./src/main.js\"\n\n\nAnyone know why?", "likes": 0}, "replies": [{"author": "SHELLAC85", "text": "Fixed it with npm install. Just in case anyone else has that problem!", "likes": 2}]}, {"topLevelComment": {"author": "Craig Hoover", "text": "Kudos for making the videos easy to follow but what problem is being solved using VueJS that can't be solved using regular Javascript and HTML?", "likes": 0}, "replies": [{"author": "ugh__chicken", "text": "I want to say nothing. VueJs essentially just creates a faster workflow if you learn the framework. It's better for organization if you follow the style guide. Also if you are working with a team who knows the framework, It would be easy for them to follow the code to see what it is doing rather than having to spend the time learning your personal methods of completing actions with standard Javascript and HTML.", "likes": 0}]}, {"topLevelComment": {"author": "Sonu Warsi", "text": "Thanks!  for good tutorials", "likes": 0}}, {"topLevelComment": {"author": "Vince lombardo", "text": "What a fantastic tutorial, thank you very much learnt so much in such a short time, I would like to see in another tutorial, maybe hooking up to a firestore database or any other database which you think compliments vue, thanks again for your time and effort putting this together", "likes": 0}, "replies": [{"author": "DMash", "text": "You could check out CJ coding garden. He does a lot of those in his channel", "likes": 0}]}, {"topLevelComment": {"author": "Rochel Bayla", "text": "this is an awesome tutorial", "likes": 0}, "replies": [{"author": "Rochel Bayla", "text": "except i had to veer off on my own/couldnt keep up after downloading bootstrap vue which looked helpful. kept getting the error \"postcss config file not found\" and i was unsuccessful unfortunately in fixing it argh", "likes": 0}]}, {"topLevelComment": {"author": "Ken Skversky", "text": "Excellent tutorial", "likes": 0}}, {"topLevelComment": {"author": "佐藤海翔", "text": "I have a question:\n\nQ: Is Vue.js platform safe? I mean is made in \"China\". Am a total newbie toward this platform; while it seems nice on the outside, I did like to ask for the Voice of the  actually regular or Veteran who use this platform for development.\n\nHopefully I can get a insight from you all. might actually give me some idea. it will be great to know.", "likes": 1}, "replies": [{"author": "佐藤海翔", "text": "@ugh__chicken i see.\nnot really sure why not react.js; but it's a great info.\n\nis much appreciated.", "likes": 1}]}, {"topLevelComment": {"author": "Ivan Castellanos", "text": "TIP: Set the playback speed to 1.75 to save some time, you can still understand everything she says, even at 2.0 is fairly understandable.", "likes": 0}}, {"topLevelComment": {"author": "Kaan", "text": "In 38:40 there is a \n\n\n<noscript>\r\n      <strong>We're sorry but quiz doesn't work properly without JavaScript enabled. Please enable it to continue.</strong>\r\n    </noscript>  in index.html  .......... Is it an error? How to fix it?", "likes": 0}}, {"topLevelComment": {"author": "Waleed Mubarik", "text": "Elegant and simple way of teaching in beautiful voice. easy to understand \"Nice\".", "likes": 0}}, {"topLevelComment": {"author": "Kellen O'Donnell", "text": "Around 1:40:00 your code is all over the place. In one scene you have a line of code there, in the next its not there. This can make it very confusing..", "likes": 0}}, {"topLevelComment": {"author": "Marcus James Reed", "text": "Something is wrong with the code on the quiz application. The correct answer is wrong many times. \n\n1:49:29\n\n\nFor instance, the fastest land animal should be cheetah but it shows the correct answer as the pronghorn.\n\nPlease advise.", "likes": 0}, "replies": [{"author": "張家銓", "text": "You need to change your answer which is in the answers for loop to shuffledAnswers.", "likes": 0}]}, {"topLevelComment": {"author": "Nándor Szűcs", "text": "did i hear a cat in the background at 25:44 ?", "likes": 25}, "replies": [{"author": "YellowYoshi", "text": "came out of the computer", "likes": 0}, {"author": "Lilo_Wonder", "text": "@Sayeed Ahmed 🤣🤣🤣🤣", "likes": 1}, {"author": "Sayeed Ahmed", "text": "Didn't you notice she's a cat lady with all the kittyfying examples in the beginning :)", "likes": 1}, {"author": "Jeremy Moritz", "text": "Yes!  and another cat meowing at 26:03", "likes": 2}]}, {"topLevelComment": {"author": "vishwajeet singh chauhan", "text": "awesome! thanks", "likes": 0}}, {"topLevelComment": {"author": "pz dev", "text": "a little quiet", "likes": 0}}, {"topLevelComment": {"author": "Vakt Thayalan", "text": "Tor Browser :P", "likes": 0}}, {"topLevelComment": {"author": "Cai Shang-Hao", "text": "thanks!", "likes": 0}}, {"topLevelComment": {"author": "André Martins", "text": "awesome!! thank you! :)", "likes": 0}}, {"topLevelComment": {"author": "Travis", "text": "Thanks for the content, appreciate it.", "likes": 0}}, {"topLevelComment": {"author": "Dominykas Murauskas", "text": "Speaking of quiz app, I might have missed this but I believe you should have disabled \"Next\" button if the question hasn't been answered yet. At the moment it is possible to go through all the questions where counter doesn't update and it gets stuck once question 10 is reached.", "likes": 0}}, {"topLevelComment": {"author": "Rael G.C.", "text": "God, I'm so glad to find a direct-to-the-point tutorial. Tutorials today are broken in so many pieces, which is hard to keep focused. And filled with too many \"awesome\", \"your hello-word is so great\" exercises... Subscribed!", "likes": 1}}, {"topLevelComment": {"author": "DAU", "text": "Did she cover unit testing? Didn't see it. Anyways awesome tutorial!", "likes": 1}, "replies": [{"author": "Craig Hoover", "text": "touche", "likes": 0}]}, {"topLevelComment": {"author": "OghamTheBold", "text": "I leapt in - my greeting wasn't set - I needed - window.addEventListener(\"load\", function(event) {  My Code Here  });", "likes": 0}}, {"topLevelComment": {"author": "waffeln", "text": "good video so far, but i'm pretty sure there's an editing error at 27:54, where you teach about filters which is a segment that was already in the video before", "likes": 156}, "replies": [{"author": "Z.R. Cai", "text": "@Frédéric Chopin Same", "likes": 0}, {"author": "btm1", "text": "@Frédéric Chopin lol me too, I had to rewind", "likes": 0}, {"author": "Albert Kelemen", "text": "@Francisco Ibañez III Deja Vue*", "likes": 1}, {"author": "Alessandro Conti", "text": "I was really confused cause she also made the same mistakes twice XD like putting \"filters\" without the \"s\"", "likes": 0}, {"author": "Aman Verma", "text": "@Ritten Brake that's because you are just  rendering the value using kittiffy function and not actually changing the variable data", "likes": 1}]}, {"topLevelComment": {"author": "Dan", "text": "Best Vue video!", "likes": 0}}, {"topLevelComment": {"author": "John White", "text": "[Vue warn]: Failed to mount component: template or render function not defined.\n\n\nfound in\n\n\n---> <Header> at src/components/Header.vue\n       <App> at src/App.vue\n         <Root>\nWhy, please explain. In additional components, a code is corrected by video, but the run will be the empty list.", "likes": 3}}, {"topLevelComment": {"author": "Jonecir Souza", "text": "Hello, very nice tutorial. Around 1:04 I'm getting this error message, though the app seems to be working properly.\nvue.runtime.esm.js?2b0e:619 [Vue warn]: Error in render: \"TypeError: Cannot read property 'question' of undefined\"\n\n\nfound in\n\n\n---> <QuestionBox> at src/components/QuestionBox.vue\n       <App> at src/App.vue\n         <Root>", "likes": 0}, "replies": [{"author": "Jonecir Souza", "text": "Never mind, that was covered just a few min later.", "likes": 0}]}, {"topLevelComment": {"author": "phee3D", "text": "my god, vue seems so much simpler than reactjs.", "likes": 96}, "replies": [{"author": "CARDBORED", "text": "React is way better, anytime I have to work on a VUE project I cringe.", "likes": 0}, {"author": "Ricardo Lau", "text": "Really? I came from Flutter and I feel Vue a little bit verbose, I choose Vue because I heard it was the easiest between the 3 main js frameworks", "likes": 0}, {"author": "nazou nounou", "text": "I literalh agree !!!", "likes": 0}, {"author": "Cs Braves", "text": "no framework is perfect... react is hard but worth your time... you learn react... which made react native easy... then boom!!!! you can build IOS Android TV apps everything... ;)", "likes": 0}, {"author": "phee3D", "text": "@aleaallee a moment of silence for all those professional JavaScript developers who spent hours building custom e-commerce solutions. And you know that was just an example.  I'm sorry I won't be replying further, your way of looking things is way different than how I look at things and this argument is not going to be useful for anybody.", "likes": 0}]}, {"topLevelComment": {"author": "khalil ebrhaim", "text": "the truth .. I bought lots of Udemy (all of them at a certain point of time)  courses as well and some of them where good but they where very long in length and therefore impractical for  me .. and I really hope you can do  any project that includes multi-level  access roles, thanks for the awesome   video and all the best", "likes": 34}, "replies": [{"author": "Nevin Kuser", "text": "I'm on one right now that really has a lot of unnecessary bs.", "likes": 0}]}, {"topLevelComment": {"author": "Marcos Esqueda", "text": "What's mean \" immediate: true\"? I don't know what is this. 1:30:00", "likes": 0}, "replies": [{"author": "Craig Hoover", "text": "Processes data immediately before the first data change.  Should be a default IMHO", "likes": 0}]}, {"topLevelComment": {"author": "soduno", "text": "26:01 - perfect context. Return this.catName - Meeow", "likes": 2}, "replies": [{"author": "Rafał Dydkiem Machał", "text": "soduno 🐱😂", "likes": 0}]}, {"topLevelComment": {"author": "JeanAlesiagain3", "text": "This is absolutely crazy. It's basically another Angular. I'll stick with react's one way flow of information and no two way data binding nightmares", "likes": 0}, "replies": [{"author": "Craig Hoover", "text": "Vue is better though, it has a cooler name and isn't owned by Google :-) (I hate all web frameworks)", "likes": 0}, {"author": "Ian Daniel", "text": "vuex", "likes": 0}]}, {"topLevelComment": {"author": "Kelvin Tran", "text": "You never mentioned about the coorectIndex but it shows in your code. Anyone new to Vue would not be able to get that total correct number updated because your video completely left out mentioning correctIndex", "likes": 0}, "replies": [{"author": "Kelvin Tran", "text": "Ok I am able to get the correct number updated correctly by adding \"correctIndex: null\" to the data() of QuestionBox.vue, returning this.shuffledAnswers instead of answers in answers() of the \"computed\" property and adding this.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer); below this.shuffledAnswers = _.shuffle(answers) in shuffleAnswers() of methods:", "likes": 0}]}, {"topLevelComment": {"author": "Sofi Stoyanova", "text": "How do you deploy the project? Why build folder is missing", "likes": 0}, "replies": [{"author": "Sofi Stoyanova", "text": "@ericallen123 nope, doesnt work. when i upload the dist folder on my server, doesnt load. it stays white window and anythng doesnt load", "likes": 0}, {"author": "ericallen123", "text": "You copy everything in dist folder to the root of website", "likes": 0}, {"author": "Sofi Stoyanova", "text": "@ericallen123  and then how do u upload it to the server?", "likes": 0}, {"author": "ericallen123", "text": "npm run build", "likes": 0}]}, {"topLevelComment": {"author": "WillyZanardo", "text": "I only whatched half an hour and I already like this because of the cats lol", "likes": 42}}, {"topLevelComment": {"author": "yewwowduck", "text": "I found this to be pretty good overall.  Popped in here since I'd only touched Vue at my last job, but only via reverse engineering, never comprehension.  There's a clip inserted explaining Filters that happens after Filters were initially explained.", "likes": 0}}, {"topLevelComment": {"author": "Malai Cristian", "text": "At 2:09:10, where do we get \"data\" from? My head is exploding :D", "likes": 1}, "replies": [{"author": "AB Fredo Gaming", "text": "i think data is predefined keyword. And whatever value you pass the value in the previous tab (i.e  <b-table striped hover :items=\"cats\">) it will take data from that.", "likes": 0}]}, {"topLevelComment": {"author": "Lootster", "text": "Thanks for the great video! I notice there's an editing error so not sure if anyone notices it too. There's a duplicate at 22:24 and 27:37 Both showing the same \"filters\" method =)", "likes": 6}}, {"topLevelComment": {"author": "Brett Guillory", "text": "I don't understand some weirdness with regards to naming some stuff. I named my cat list component \"catList\" and it wouldn't render until I changed the html object to <cat-list /> instead of <catList>. \n\nNvm: I just found it in the Vue guide:\nhttps://vuejs.org/v2/guide/components-registration.html#Name-Casing\nNames of components have to either follow \"kebab-case\" or \"PascalCase\". I would have to make the component either \"cat-list\" or \"CatList\", but not \"catList\". Does anyone know why this is? It seems like a weird arbitrary limitation.", "likes": 2}}, {"topLevelComment": {"author": "Marky Twain", "text": "if anyone has the problem that after 1:37:00 ur app doesnt show the number of correct, then add the following code in ur shuffleAnswers function:\n\nthis.correctIndex = this.shuffledAnswers.indexOf(this.currentQuestion.correct_answer)", "likes": 1}, "replies": [{"author": "Marky Twain", "text": "or u can watch couple of minutes more and then its actually added ... just not on time ...", "likes": 0}]}, {"topLevelComment": {"author": "Josekell", "text": "This video is the best I've seen about explaining Vue, and I've seen a lot. Great for both beginners and people that wants to review some topics. Thank you so much!", "likes": 6}}, {"topLevelComment": {"author": "Slan", "text": "dont forget to change your for loop array from answers to shuffledAnswers otherwise the dom is showing the wrong correct answers", "likes": 10}, "replies": [{"author": "Mokonzi", "text": "yes! thank you", "likes": 0}, {"author": "Rich", "text": "Thanks for the tip. Now it makes sense why numCorrect wasn't incrementing.", "likes": 0}]}, {"topLevelComment": {"author": "Slan", "text": "did you use _.shuffle on the clips? because there are a lot of out of order clips", "likes": 1}}, {"topLevelComment": {"author": "Faust", "text": "Vue.component - глобальная регистрация компонента\nЗачем тогда прописывать его в components?\nМожет, я что то не правильно делаю. Но я использую первый случай для глобальных компонентов (интпутов, аватаров и т.д.), а второй - для компонентов, которые будут использоваться только в конкретном месте", "likes": 0}}, {"topLevelComment": {"author": "Ankush Banik", "text": "I am getting an error what should I do?? \nWorking thread \nDependencies not found", "likes": 0}, "replies": [{"author": "Craig Hoover", "text": "Take a class on programming instead of watching silly Youtube videos", "likes": 0}, {"author": "Faust", "text": "Not enough information. What is your development stage?", "likes": 1}]}, {"topLevelComment": {"author": "Phạm Huy", "text": "thanks you", "likes": 0}}, {"topLevelComment": {"author": "Peter Reginald", "text": "2:24:00 vuex pattern\n2:24:15 call action to call mutation to update state\n2:33:30 mapActions to methods and mapState to computed", "likes": 7}}, {"topLevelComment": {"author": "X Dev", "text": "When will the VueJS 3 come?", "likes": 0}, "replies": [{"author": "Craig Hoover", "text": "When you learn to write vanilla Javascript and fully understand closures, IIFE, usage of let vs const and the different Promise vs async patterns that you can use without considering even using a frontend framework :-)", "likes": 0}]}, {"topLevelComment": {"author": "Faustin Daté", "text": "I recommend this tutorial to everyone who asks me how to get started with Vue.", "likes": 28}, "replies": [{"author": "Faustin Daté", "text": "@Wayne C  If you have taken a look at react, then I believe you could jump right in. Whatever else you may need you'll figure it out on the way.", "likes": 1}, {"author": "Wayne C", "text": "I’m still fairly new to programming and have done a few things in react, is there anything you would recommend I learn before doing this course?", "likes": 0}]}, {"topLevelComment": {"author": "Ionel Ionell", "text": "Nicely presented, Gwen!! Your work gets to be used very well ;)", "likes": 1}}, {"topLevelComment": {"author": "underscoresandspaces", "text": "Thanks for the course. I learned a lot.\n\n\nAt the end I could not get the total number of cats to update when I added a cat   {{ getAllCats.length }}. The total number of pets updated but not the number of cats. Probably something to do with the filter method in getters.js?", "likes": 1}, "replies": [{"author": "Kaori Miyanishi", "text": "Hallo I have stucked the same point. Does someone find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Affandes", "text": "I made tutorial Avengers Endgame, Thanos snap effects on Google\n\nhttps://youtu.be/KqUAQp-9EQA", "likes": 0}}, {"topLevelComment": {"author": "Hiếu Nguyễn", "text": "Good tutorial. Thanks Author!", "likes": 0}}, {"topLevelComment": {"author": "Moneymaker 2.0", "text": "how do i add video capabilities to vue. Like be able to watch videos that I have on my PC on my vue application?", "likes": 0}}, {"topLevelComment": {"author": "Music Vista", "text": "We expect more than this from you.....keep it up...I want you to advice me what to learn react or vue??????", "likes": 0}, "replies": [{"author": "Faraday Academy", "text": "I have used and taught both and I think they are both good. React is generally a more hirable skillset (unless you live in China where Vue is more popular). I do like Vue better because I think it's much easier to teach and it's a very well designed, simple library. You can build amazing modern web apps with both of them.", "likes": 0}]}, {"topLevelComment": {"author": "active247", "text": "Thankyou for this awesome tutorial.. waiting for more videos... Thanks..", "likes": 0}}, {"topLevelComment": {"author": "Amer Rashed", "text": "Awesome. You deeply covered most of vuejs features. This is probably for intermediate to advanced vuejs developer!!", "likes": 0}}, {"topLevelComment": {"author": "Frank", "text": "A nice collection of often useful examples done in Vue.js  https://vuejsexamples.com/", "likes": 0}}, {"topLevelComment": {"author": "Oussama", "text": "Anyone seen she's using Adblocker and JSFiddle's polite request to disable it? Hahaha, very nice course though.", "likes": 0}}, {"topLevelComment": {"author": "Auzep", "text": "Frameworks have really made front-end 10x more difficult.", "likes": 22}, "replies": [{"author": "Cole Drain", "text": "@Craig Hoover Even the bare-metal has bare-metal..", "likes": 0}, {"author": "Katherine Wolfe", "text": "I don't think so, I've been programming in js since nearly the beginning and I love the abstraction of Vue.", "likes": 0}, {"author": "Craig Hoover", "text": "Frameworks are just abstraction layers for noobs so they feel empowered to call themselves programmers and steal all the good paying jobs because they know the \"latest\" technology.  How about those that know the bare-metal technology?", "likes": 1}, {"author": "Its Layk", "text": "Benjamin Akely Component is simply just a piece of reusable code.", "likes": 0}, {"author": "Ben A", "text": "what even is a component? a dom element?", "likes": 0}]}, {"topLevelComment": {"author": "sam ashtar", "text": "Great Video, but the clips are slightly out of order, like when you added the correctIndex, it randomly popped up into the code without you saying anything.", "likes": 37}, "replies": [{"author": "Tobechukwu Alozie", "text": "@Kevin Ford check the git repo in the description box", "likes": 0}, {"author": "Kevin Ford", "text": "I feel like this is where I'm stuck, and I'm not finding the error", "likes": 0}, {"author": "Cesar Barahona", "text": "me too", "likes": 0}, {"author": "Ritcher Teofilo", "text": "noticed that too", "likes": 2}, {"author": "Videogames Videogames Videogames", "text": "this had me confused for 20 minutes", "likes": 6}]}, {"topLevelComment": {"author": "Santanu Biswas", "text": "numCount is not working, in the line if (this.selectedindex === this.correctIndex) I don't know from where you are getting value of this.correctIndex. If I print in console then the value of this.correctIndex is UNDEFINED", "likes": 0}, "replies": [{"author": "Santanu Biswas", "text": "@sam ashtar yes u r right, it's out of order", "likes": 1}, {"author": "Santanu Biswas", "text": "@mdj thank you, I have added this after looking the script from github. And it's working", "likes": 0}, {"author": "sam ashtar", "text": "the clips in this video are out of order, youll see later in the vid she adds it", "likes": 1}, {"author": "mdj", "text": "Inside QuestionBox.vue > data() > add:\ncorrectIndex: null\nAnd inside QuestionBox.vue > methods > shuffleAnswers() add:\nthis.correctIndex = this.shufledAnswers.indexOf(this.currentQuestion.correct_answer);", "likes": 0}]}, {"topLevelComment": {"author": "Kelly Leaveck", "text": "Thank you. This is awesome!", "likes": 0}}, {"topLevelComment": {"author": "Mehdi Rifi", "text": "Really great tuto , thanks fo the effort", "likes": 0}}, {"topLevelComment": {"author": "Phaniraj K", "text": "Please help I'm getting Vue warn]: Error in mounted hook: \"TypeError: this[this.$route.params.species] is undefined\"", "likes": 1}, "replies": [{"author": "SpeedlPN", "text": "I think the problem is the way you declared the route variable", "likes": 1}]}, {"topLevelComment": {"author": "raghavendra mesta", "text": "@Coding With Gwen - really appreciate your time and effort you spend in making this video, this is really helpful. Thanks !", "likes": 0}}, {"topLevelComment": {"author": "George Smith", "text": "can somebody explain to me what is the advantage of using bootstrap-vue over plain bootstrap?", "likes": 0}}, {"topLevelComment": {"author": "Vladimir", "text": "I learned JavaScript and now I want to learn some framework. I don't understand what this tutorial is all about. Am I watching some simple project written in Vue instead of how Vue actually works???", "likes": 0}, "replies": [{"author": "Vikas Poonia", "text": "Go to the official docs if you want to know how it actually works. This is an introductory course for Vue.", "likes": 0}]}, {"topLevelComment": {"author": "Inverser Pro", "text": "thank you!", "likes": 0}}, {"topLevelComment": {"author": "James Swansburg", "text": "Hi Gwen, this is probably the best video I have watched on Vue. As a novice, the small things trip me up, like the newer Javascript shortcuts and Vue shortcuts, which fly past you in most tutorials. You may want to consider making a companion \"Cheat Sheet\" with all the little side \"tidbits\", that you nicely sprinkle throughout the talk. Thank you!", "likes": 4}}, {"topLevelComment": {"author": "SuperMichielv", "text": "Thanks for this very nice video. One remark at 1:06:27 when clicking on the next button. The reason the next question does not show is not the fact that the currentQuestion is not available (that gives indeed an initial render error) but the fact that initially the button had a href=\"#\" which masks the @click=\"next\".", "likes": 1}}, {"topLevelComment": {"author": "Rob Bradley", "text": "Imagine not using codepen.io in 2019.", "likes": 1}}, {"topLevelComment": {"author": "Code on Mars", "text": "Can we create micro-frontend using vue.js", "likes": 0}}, {"topLevelComment": {"author": "Code on Mars", "text": "I want to stick to custom elements in plain javascript. Frameworks will come and go", "likes": 1}, "replies": [{"author": "Philip Alexander Hassialis", "text": "A noble aspiration but one that cannot work in today's climate, neither in user browser capabilities in a global scale nor in the ability to move from a web page to binary code, either via Electron or with more exotic native solutions (e.g. ReactXP). Additionally, all these frameworks give faster options for rudimentary stuff e.g. having a 2 way binding between a variable and an input value.", "likes": 0}]}, {"topLevelComment": {"author": "Reza Fisher", "text": "So for a lot of the videos on the channel there is tutorials on freeCodeCamp site. So I am just wondering, should i start with the site then come to the videos? For example, should I do the HTML course on the site first or watch one of the videos first? Also which place would I get the most information?\n\n\nI will be posting this comment on other videos to maximize answers.", "likes": 0}}, {"topLevelComment": {"author": "Alexandru Trandafir", "text": "Great turorial!", "likes": 0}}, {"topLevelComment": {"author": "nicolas aguilar", "text": "Hi, Thank you for this awesome course about VueJs, I learned a lot about it, but if you allow me to say something about the exercise of the Quiz App, this has a problem with the correct answers, that if you check the correct answer that the app show is not the real correct answer, I solved and I want to share my solution but I think I did more than its needed, can someone check a left an opinion of that.\n\n\nthis is my solution: https://github.com/nicolas-camacho/fcc-vue", "likes": 8}, "replies": [{"author": "omotosho israel", "text": "just change the answers variable in the template to shuffledAnswers bro and you're good to go. its a little bug.", "likes": 3}]}, {"topLevelComment": {"author": "maycusa", "text": "Vetur not working for me. How do I fix it? I already googled it and searched on stack overflow but nothing.\"export default\" is not formatting. I'm in the adopt-pets project. Second time I have abandoned a vue project. One was from a udemy class and same thing happened, vetur didn't format \"export default. Would appreciate any tips on how to solve this.", "likes": 0}}, {"topLevelComment": {"author": "Robert Kras", "text": "Fantastic job with this video. I hope to see more. Great job.", "likes": 6}}, {"topLevelComment": {"author": "maycusa", "text": "I am following along. I like that when something is not working, you proceed to seek a solution and find it. What I would like to know is how that is almost instinctive with you. I've learned JS but still to this day after a year, simply copy paste.  When does it happen for anyone to simply code for a solution from memory or skill?", "likes": 0}, "replies": [{"author": "Jormungandr", "text": "You should never copy paste. Write the code yourself and change things to explore the concepts (you'll make mistakes and that's ok, try your best to read the error messages and correct the issue, if you still can't find the mistake, google the error, if that fails seek help in stackoverflow). The rest comes with practice.", "likes": 0}]}, {"topLevelComment": {"author": "Rajath", "text": "I have been wondering about the integration of vuejs to with django. In any of the vuejs videos hardly does anyone speak of or explain about the functionalities of backend with vue.\n\nFor beginners like us it's really confusing. For example - vue already has a vue router and say we can even perform firebase within Vue. Now the question arises why/where does backend come into. If these videos can give insights to backend part a bit , it'll be fantastic. Gwen, what do you think about vuejs & django working as full stack ?", "likes": 4}, "replies": [{"author": "Riyad", "text": "I was thinking the exact same thing... I hope someone can share their input regarding this", "likes": 0}]}, {"topLevelComment": {"author": "Valentin Kaelin", "text": "I have finally finished your course, thanks a lot! I was waiting for a motivation to start learning Vue for months now and you juste gave me one with this video! I hope to see more of this :)", "likes": 11}}, {"topLevelComment": {"author": "MoreCodes", "text": "Very useful. Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Johnny", "text": "love the tutorial but it's very slow... \nPro tip: set playback speed to 1.25 to save 45mins of your prescious time ;)", "likes": 1}, "replies": [{"author": "tazman5001", "text": "\"pro tip\"? trying to look like an expert on the internet lolz", "likes": 0}]}, {"topLevelComment": {"author": "Dennis Allard", "text": "You jump into it without providing context. So you assume knowledge of jsfiddle.net. And when you say that you had pre-loaded the view library you do not explain how to do that or where you obtain the library or what the library is for. So it would be better to explain some set up issues before you \"jump right into it\".", "likes": 1}, "replies": [{"author": "Howard Pautz", "text": "@sam ashtar yes and also, @Dennis Allard, all you really need to do is look at the Fiddle screen for a few minutes and, as @denniszenanywhere mentions, you'll see a list of the frameworks and libraries. Just looking at that list is a lesson in itself. Pop open a bottle of Old Bordeaux, pop open JSFiddle, dive in and have fun !", "likes": 1}, {"author": "sam ashtar", "text": "There is too much to explain, you cannot fit in one video, explaining jsfiddle is irrelevant to the point of this specific video. You can't possibly expect her to segue and explain every little tool she is using, if this video is too advanced, then start with vanilla javascript and html and study the docs of any tool you aren't familiar with.", "likes": 1}, {"author": "maycusa", "text": "Yes, JSFiddle is easy to use from the get go. When you open it, you see 4 grid boxes. It says on top left --html, on top right, CSS, on bottom left, the language or framework you will use and on bottom right, the result. You simply press on Play RUN and you get result. Just don't forget to save.", "likes": 1}, {"author": "Howard Pautz", "text": "Hi Dennis, jumping in to say that JSFiddle is really easy to use - pretty much self-explanatory.  If you go there and follow the same steps Gwen did initially, it will work. (I tried replicating that before I replied to you to make sure.)  JSFiddle has been around a while and is very mature and extremely user friendly. It's a great way to learn stuff without risk of damaging anything. Try it, you'll like it! - H", "likes": 4}]}, {"topLevelComment": {"author": "nguyen huy", "text": "more project VueJS, pleaseeeeeeeeeee :(", "likes": 1}, "replies": [{"author": "Code on Mars", "text": "Check custom elements in javascript", "likes": 0}]}, {"topLevelComment": {"author": "Myles Gmail", "text": "Thx I tweeted this n posted it on LinkedIn!", "likes": 3}}, {"topLevelComment": {"author": "dragonhunter250utub", "text": "That's a nice keyboard you are using. Which one is it 🤔", "likes": 0}, "replies": [{"author": "Faraday Academy", "text": "I used a Das keyboard with soft brown switches for about half the video but I felt like it was too loud so I switched to my laptop keyboard for the second half.", "likes": 3}]}, {"topLevelComment": {"author": "Muhaimin Sarker", "text": "I hope that FreeCodeCamp can maybe put out a tutorial for Bootstrap...", "likes": 2}, "replies": [{"author": "Austin 316", "text": "Youtube already has enough tutorials on bootstrap, check it out", "likes": 0}]}, {"topLevelComment": {"author": "finder", "text": "I dont know javascript. But can i learn it??", "likes": 1}, "replies": [{"author": "Faraday Academy", "text": "You should check out the chanllenges on freecodecamp.org. It takes you through JavaScript step-by-step. There is also this video if you prefer: https://www.youtube.com/watch?v=PkZNo7MFNFg", "likes": 2}]}, {"topLevelComment": {"author": "ibrohim gariskeras", "text": "Is this vue js 2 ? i am new in this framework.", "likes": 0}, "replies": [{"author": "Faraday Academy", "text": "Yes, this is version 2.", "likes": 1}]}, {"topLevelComment": {"author": "gertjan van der meij", "text": "PHYTON !", "likes": 0}}, {"topLevelComment": {"author": "Moneymaker 2.0", "text": "So this is all done before which date? The reason why I ask is that you are using VUE Version 3.1.1 and I am doing it with VUE Version 3.5.1 and the bootstrap version that you show at 43:26 is v2.0.0-rc.13 but the version that I found going to the bootstrap website is v2.0.0-rc.15 . Also the reason why I ask is that I am new to VUE and the type of work that it does or covers or its area. I don't know what the right term/word is but I am new to it. I have already done the tutorial or crash course that \rTraversy Media created in this link: https://youtu.be/Wy9q22isx3U .That went into some detail. I was still confused on some things and wanted another tutorial that I could watch that teaches it another away or gives a different example. So thats how I found this video. So I was just wondering by my question above about the date that this was recorded or made does it effect these new versions that I am using or no.  Also if you could put in the description or somewhere in the beginning that the versions used may be different than what is out their currently or something sort of like that. Because in my opinion, as a learner, seeing that this video was published or released on youtube on March 19, 2019 and when you are watching it seeing that they are using VUE Version 3.1.1 and bootstrap v2.0.0-rc.13 when me as the learner is using VUE Version 3.5.1 and bootstrap v2.0.0-rc.15. Thats a 0.4.0 version difference for VUE and a v0.0.0-rc.02 difference for bootstrap it makes me wonder if some of whats talked about in here will be different than what is actually out their. I still finished the video and it was very helpful with part 1 and explaining vue a bit better and clarifying some of my questions but part 2 made it a bit more harder as a learner because of the version difference and the documentation done on the current version than what version you used. That was about my only question and the concern behind it. \n\n\nI do not intend to be offensive or disrespect the creator of the video at all. I only tried to word my question and concerns in the best way possible but I sometimes can't express it in the right terms or words. I spent about 1hour on doing this comment after watching the video.", "likes": 0}, "replies": [{"author": "Moneymaker 2.0", "text": "@Faraday Academy k ty", "likes": 0}, {"author": "Faraday Academy", "text": "Hey. I started working on this at the end of last year so the first app I built (https://github.com/gwenf/vue-quiz) is using Vue-cli version 3.1 as you mentioned. The second app is using version 3.5 so it's almost up to date with the current version. You will not see a difference for learning Vue basics; both versions give you the same functionality I described in the video. The Vue bootstrap components I used will also work in both versions.", "likes": 1}]}, {"topLevelComment": {"author": "fth dmr", "text": "Love you so much guys", "likes": 1}}, {"topLevelComment": {"author": "Faraday Academy", "text": "Hi everyone! Thanks for watching my video. I hope you learned something. If you have feedback for me, please reply to this or get in touch.", "likes": 1056}, "replies": [{"author": "Julian Amir", "text": "you all probably dont care at all but does someone know of a method to log back into an Instagram account..?\nI stupidly lost my password. I love any help you can give me.", "likes": 0}, {"author": "Fernando Mota", "text": "Hi Faraday, what vscode extensions u used for Vue?", "likes": 0}, {"author": "Krishna Bala", "text": "Fantastic tutorial on Vue! Loved it. Thank you for putting it together. \nSome small issues: As others have pointed out \"Correct Index\" needed at \"1:31\" is discussed out of sequence at \"1:41\". Also, v-for loop in the QuestionBox component loop over shuffledAnswers instead of answers. I see it corrected on your github site. Thank you for sharing that code. \nIn fact, I particularly liked the fact that you make errors and show us how to debug the code by inspecting them in the browser using dev-tools. That's really helpful too and makes you think about what you are doing. \nOverall, it's a fantastically done tutorial!", "likes": 1}, {"author": "yayin", "text": "Please do more tutorial, I love your voice, so calm", "likes": 0}, {"author": "justice mashu", "text": "@Douten thank you,i think you are one of the very few who practiced the tutorial,i noticed the same issues", "likes": 0}]}, {"topLevelComment": {"author": "akshay kumar", "text": "Can anyone help me for development of lie detector application.?", "likes": 0}}, {"topLevelComment": {"author": "Host Promo", "text": "Part 2 is exactly what I am looking for.  Vue is a game changer, I built my app in it and am loving it.  RIP jquery 😂", "likes": 29}, "replies": [{"author": "Taiker96Q", "text": "@Ben A In the past", "likes": 1}, {"author": "Ben A", "text": "jquery: king of the web", "likes": 2}]}, {"topLevelComment": {"author": "Antonio García Marín", "text": "What javascript video recommend before this vue course?", "likes": 0}, "replies": [{"author": "Code on Mars", "text": "Don't go for learning about frameworks. Stick to javascript basics and can also explore about custom elements", "likes": 0}, {"author": "Faraday Academy", "text": "freeCodeCamp has an intro to JavaScript video to get you through all of the basics: https://www.youtube.com/watch?v=PkZNo7MFNFg", "likes": 2}]}, {"topLevelComment": {"author": "Raihan MDS Iqbal", "text": "Please. Please develop courses on c programming algorithms and datastructutes", "likes": 5}}, {"topLevelComment": {"author": "Dmitry Lubla", "text": "0 dislikes challenge starts", "likes": 2}}, {"topLevelComment": {"author": "Shovon Das", "text": "I will start watching after sometimes", "likes": 0}}, {"topLevelComment": {"author": "StellarStoic", "text": "Finally Vue 🙌 Thanks 👌", "likes": 7}, "replies": [{"author": "Code on Mars", "text": "You can also checkout about custom elements in javascript.", "likes": 0}]}, {"topLevelComment": {"author": "Wazir Ahmed", "text": "Thanks a lot for this course!", "likes": 2}}, {"topLevelComment": {"author": "Mr.Heart007", "text": "So good", "likes": 1}}, {"topLevelComment": {"author": "Saurabh Singh", "text": "Please make these Vedio in Hindi language", "likes": 0}, "replies": [{"author": "Howard Pautz", "text": "If nothing else, record the English audio, play it back into a text-to-speech program, then run the text through Google Translate.  You'll end up with something like this: :)) यदि और कुछ नहीं, अंग्रेजी ऑडियो रिकॉर्ड करें, इसे पाठ से भाषण कार्यक्रम में वापस चलाएं, तो Google अनुवाद के माध्यम से पाठ को चलाएं।", "likes": 0}, {"author": "Surjith Sudhakaran", "text": "@saurabh I was able to find a few vue js courses on YouTube in Hindi and Tamil.", "likes": 0}, {"author": "Christopher Boyd", "text": "Maybe wait for google to complete closed captioning? then see if Hindi is an option", "likes": 1}, {"author": "Saurabh Singh", "text": "@Wanna Learn Everyday please suggest a way how I can understand the vedio . Is there any way to convert English vedio to Hindi", "likes": 0}, {"author": "Wanna Learn Everyday", "text": "They don't understand hindi👉 and English is an universal language so it is better to make videos in english language so most people can understand this video all over the world.", "likes": 2}]}, {"topLevelComment": {"author": "ruzny ahamed", "text": "Thanks a lot\nIt would pretty helpful I believe!", "likes": 4}}, {"topLevelComment": {"author": "saurabh", "text": "Thank you very much!!!!!!", "likes": 3}}]}