{"video": {"id": "5cU1ILGy6dM", "title": "Binary Search Tree - Beau teaches JavaScript", "description": "A binary search tree is a tree data structure with only two branches for every node. Learn how to implement a binary search tree in JavaScript ES6!\n\n💻 Code: http://codepen.io/beaucarnes/pen/ryKvEQ?editors=0011\n\n🔗 Info: https://en.wikipedia.org/wiki/Binary_search_tree\n\n🐦 Beau Carnes on Twitter: https://twitter.com/carnesbeau\n\n⭐JavaScript Playlists⭐\n▶JavaScript Basics: https://www.youtube.com/playlist?list=PLWKjhJtqVAbk2qRZtWSzCIN38JC_NdhW5\n▶Data Structures and Algorithms: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkso-IbgiiP48n-O-JQA9PJ\n▶Design Patterns: https://www.youtube.com/playlist?list=PLWKjhJtqVAbnZtkAI3BqcYxKnfWn_C704\n▶ES6: https://www.youtube.com/playlist?list=PLWKjhJtqVAbljtmmeS0c-CEl2LdE-eR_F\n▶Clean Code: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkK24EaPurzMq0-kw5U9pJh\n\n-\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nRead great tech articles at https://medium.freecodecamp.com", "duration": "PT13M34S", "likes": "1567", "views": "96801"}, "comments": [{"topLevelComment": {"author": "Daniel Sanchez", "text": "hi just some questions :D, why data is 23 and why in 5:25 23 it says that is null when in the graphic obviously appears?, im new in all this about nodeTrees.", "likes": 0}}, {"topLevelComment": {"author": "Eslam", "text": "love it, thanks so much", "likes": 0}}, {"topLevelComment": {"author": "some", "text": "what happens is the left sub node after the right sub node is lower than the left node??? for example instead of 1 it was a 2, and instead of 4 you had a 1. Then you would be replacing 3 for one which would have two children greater than itself.", "likes": 0}}, {"topLevelComment": {"author": "some", "text": "can you explain in one video what would be the real life applications for it?", "likes": 0}}, {"topLevelComment": {"author": "Timothy Lefkowitz", "text": "THANK YOU", "likes": 0}}, {"topLevelComment": {"author": "Augusto S", "text": "jesus christ.. slow down a bit. You speak like if you are in a hurry", "likes": 1}}, {"topLevelComment": {"author": "Aldwin Samano", "text": "Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "リンゴ酢", "text": "A balanced binary tree, also referred to as a height-balanced binary tree, is defined as a binary tree in which the height of the left and right subtree of any node differ by not more than 1.", "likes": 0}}, {"topLevelComment": {"author": "Victor Von Doom", "text": "wat about 17 number that you were about to delete , theres no right node  with left child so what should i do in such a case", "likes": 0}}, {"topLevelComment": {"author": "D B", "text": "I had to slow down the video because you speak too fast to follow the code while you explain it. The explanation was really clear. Thanks.", "likes": 1}}, {"topLevelComment": {"author": "Satish kumar", "text": "thanks so much", "likes": 0}}, {"topLevelComment": {"author": "Raj Banna Sa", "text": "Thank you so much sir ❤️", "likes": 0}}, {"topLevelComment": {"author": "Marshall Trimble", "text": "Can we all appreciate how well he went over this and well he tried to make sure that the depth of this was covered along with walking the viewer through a journey of creating a mental map and understanding of a BST.", "likes": 12}}, {"topLevelComment": {"author": "Biikaaa.", "text": "wwhat if the note down there also has children?", "likes": 0}}, {"topLevelComment": {"author": "Emmanuel Amoako", "text": "thank you, I enjoy your teaching. You good!!", "likes": 0}}, {"topLevelComment": {"author": "Yogesh Sharma", "text": "Because of diagrammatically explanation it cleared all my doubts..\nThank you so much for this amazing idea of teaching 🙌", "likes": 1}}, {"topLevelComment": {"author": "Sejin Majnaric", "text": "Thanks a lot, Beau! :)", "likes": 0}}, {"topLevelComment": {"author": "Thoại Lý", "text": "I'm wondering if there are any built-in BST classes in JavaScript because I don't want to implement the tree every time I want to use it", "likes": 1}, "replies": [{"author": "Charles Lamb", "text": "Would probably be cool, but perhaps abstraction is required for something like a Bst. \n\nOtherwise people would inevitably have complaints about the way it is implemented in Javascript natively.\n\nPreference creates conflict.\n\nSolution: just write it once the way you like it, then push to your github/bitbucket.\n\nThen reuse whenever necessary =)", "likes": 0}]}, {"topLevelComment": {"author": "Mathias Salome", "text": "The implementation example you showed just flicked on the switch! oh those wasted hours tearing my hair out, Why oh why didn't my instructors just give us a damned clear example??", "likes": 1}}, {"topLevelComment": {"author": "raha", "text": "Can someone explain why are we setting the value of this.root to the return value of removeNode() ?", "likes": 0}, "replies": [{"author": "anil kumar d", "text": "Basically it's a recursive function... So once removal of a node is done it will return you complete modified tree which is pointed to root..check stack trace to see it... If you inspect root, it is nothing but the modified tree..", "likes": 0}, {"author": "SSDEMILOVATIC", "text": "I thought the same thing, I console logged it and  I don’t see why we need to assign it to this.root.", "likes": 0}]}, {"topLevelComment": {"author": "Constantin", "text": "`if (node.left === null) { ... } else if (node.left !== null) {...}. We can remove the 2nd if statement.   \nI think that `if (!node.left) {...} else {...}`  is more readable", "likes": 0}, "replies": [{"author": "patrick mwangi", "text": "What if node.value = 0; Zero also returns false and it would cause issues.", "likes": 2}]}, {"topLevelComment": {"author": "Doon's Sunshine", "text": "Clear Explanation", "likes": 0}}, {"topLevelComment": {"author": "xerxius", "text": "Very well explained !\n\nHere is the shorter version of add function if anybody wants a terse code\n\nadd(data, node = this.root) {\r\n   if (this.root === null) this.root = new Node(data);\r\n   else if (node === null) return new Node(data);\r\n   else if (data === node.data) return; \r\n   else if (data < node.data) node.left = this.add(data, node.left) || node.left;\r\n   else node.right = this.add(data, node.right) || node.right;\r\n}", "likes": 0}}, {"topLevelComment": {"author": "emura qhan", "text": "Thank you so much! :\"", "likes": 0}}, {"topLevelComment": {"author": "jumpman23nith", "text": "What if you want to remove a node but its right node doesn't have a left child? Which node will take the place of the node to be removed? Just wanted to confirm my guess.. It is going to be the right node?", "likes": 1}, "replies": [{"author": "SSDEMILOVATIC", "text": "Yup that’s correct.. You can even test it in the console,", "likes": 0}]}, {"topLevelComment": {"author": "Rowan Olson", "text": "Thank you! was struggling with this.", "likes": 0}}, {"topLevelComment": {"author": "Amin Kedir", "text": "is there any way to donate to this guy? i mean i pay for shitty subscriptions already, it's nice knowing your money is going to someone who deserves it for once.", "likes": 0}}, {"topLevelComment": {"author": "Jo Ris", "text": "Hi, thanks for the materials. Is there any reason for not implementing isPresent() recursively in your exemple ?", "likes": 0}}, {"topLevelComment": {"author": "Vishnu Umakanthan", "text": "Thanks a Lot, man..really appreciate the effort you took.", "likes": 1}}, {"topLevelComment": {"author": "Jorge Chinchilla", "text": "thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "MyALPHAguy", "text": "What is this tree for? When am I going to use it?", "likes": 4}, "replies": [{"author": "John Smith", "text": "Technical interviews and school. Aside from that, not much in the work place.", "likes": 1}]}, {"topLevelComment": {"author": "mo swilam", "text": "Thanks for the upload, in my opinion, I think it could have been better and more clear if you built it from scratch while explaining step by step, coz I think a lot of people got a bit overwhelmed when they saw that bunch of code the first moment of the video. but thanks again anyway..", "likes": 9}, "replies": [{"author": "Pi St", "text": "You're right that it feels a little overwhelming, but after the first example you see its not actually very complicated. Just lots of decision-making with ifs. \nI think Its better this way - you watch his explanations AND THEN you try to build YOUR OWN tree and see if it checks out with his", "likes": 1}]}, {"topLevelComment": {"author": "beqa sirbiladze", "text": "4:23 23 left child is 19 and not right", "likes": 6}}, {"topLevelComment": {"author": "Mote Zart", "text": "Is there something weird with the add function on the codepen link? It doesn't seem to have a closing bracket. Maybe it's just me but bst.add(10), for example returns null.\n**Not sure why, but prob seems gone now.", "likes": 0}}, {"topLevelComment": {"author": "Ganpat Kakar", "text": "Thank you for providing such a valuable data structure tutorial, but i have one point about binary search data :-\n1. How we can make this binary search tree as a sorted binary search tree.\nLets say i want to insert this data :-\nbst.add(50);\nbst.add(23);\nbst.add(72);\nbst.add(67);\nbst.add(55);\nbst.add(62);\n\nAfter adding this data my data structure will look like this :- \n{\n    data:50\n    left: {\n        data:23,\n        left:null,\n        right:null\n    }\n    right: {\n        data:72,\n        left:{\n            data:67,\n            left:{\n                data:55, \n                left:null,\n            right:{\n                    data: 62,\n                    left:null,\n                    right:null\n                }\n            }\n        }\n    }\n}\n\nBut As you can see this data structure is not correctly sorted for a sorted binary search tree.\nAs i came to this conclusion that, first we need to sort our inserting data then only our binary tree can be sorted.", "likes": 0}, "replies": [{"author": "lucasJRS", "text": "how come that is not a sorter binary tree? All the nodes left from 50 are minor (just 23) and all at right are bigger (72, and then 67, 55 and 62 are less than 72).", "likes": 0}]}, {"topLevelComment": {"author": "maves9", "text": "tree ? its more like roots", "likes": 1}}, {"topLevelComment": {"author": "Adrianne Kelly", "text": "This was great! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "suyash gautam", "text": "thank you! Finally understood node insertion in BST after watching your video!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Bryan G", "text": "Thank You so much. Your data structure videos have made the difference for me in cs fundamentals.", "likes": 0}}, {"topLevelComment": {"author": "Dmitry Akentyev", "text": "add(data) code is horrible! Just put first if(node===null) inside searchTree() and you can remove half of  \"else if\" EASY", "likes": 1}}, {"topLevelComment": {"author": "atsepa", "text": "In the final example is 4 the root ?? Is the root the first value you add always??", "likes": 0}, "replies": [{"author": "atsepa", "text": "after rewatching .... yes the first element added will be the root", "likes": 0}]}, {"topLevelComment": {"author": "Alberto Ferreira", "text": "You talk too fast.", "likes": 15}, "replies": [{"author": "Ulric Van statter", "text": "You just gotta study up more bro.", "likes": 1}, {"author": "Jessé Poiatti", "text": "You complain too much (don't take it personal, just using the same style you've used in your reply).", "likes": 4}, {"author": "Tigran Petrossian", "text": "Grades no worries. You’ll get a full refund.", "likes": 3}]}, {"topLevelComment": {"author": "Jay P", "text": "Cool. Another tip is to try and use while loops instead of recursion for better performance. One way to do this is to say while(node), check your cases, set the node equal to the left or right child. The while loop will terminate on null. This is done for the findMin, findMax functions but not for the add function. As an exercise, see if you can rewrite the add function using a while loop instead.", "likes": 1}, "replies": [{"author": "some", "text": "can you do remove without recursion tho?", "likes": 0}]}, {"topLevelComment": {"author": "petrolhead88", "text": "You should provide exercises if you post only theory, it is almost useless.\nWhy you won't write some problems and publish it as a PDF?.", "likes": 0}, "replies": [{"author": "petrolhead88", "text": "Great! Thanks for the info.", "likes": 0}, {"author": "freeCodeCamp.org", "text": "Your in luck! Most of these videos align with exercises on the beta freeCodeCamp curriculum. There are 10 interactive challenges based on Binary Search Trees. Here is the first one: http://beta.freecodecamp.com/en/challenges/coding-interview-data-structure-questions/find-the-minimum-and-maximum-value-in-a-binary-search-tree", "likes": 5}]}, {"topLevelComment": {"author": "Rick Mottola", "text": "Awesome video and explanation.", "likes": 0}}, {"topLevelComment": {"author": "Adrian Grozavu", "text": "The audio quality could be better, but otherwise I'm liking it", "likes": 1}}, {"topLevelComment": {"author": "jugz", "text": "Clear and detailed way of explaining BST, thanks! Amused by the way you say \"root\" :-)", "likes": 3}, "replies": [{"author": "CST1992", "text": "Why amused? It's the perfectly accurate pronunciation of the word.", "likes": 0}]}, {"topLevelComment": {"author": "ermal gashi", "text": "Thank you, loved the way you approached the subject, and it all clicked in for me. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "piperxy", "text": "Yes, What Dusan Marsa said, some real life examples please?", "likes": 1}, "replies": [{"author": "piperxy", "text": "Appreciated!", "likes": 0}, {"author": "Isamar", "text": "Check my reply to Dusan. :)", "likes": 1}]}, {"topLevelComment": {"author": "Dušan Marsa", "text": "Good tutorial, but where i can use it in JavaScript? What is it good for? Some reallife examples? :) Thanks", "likes": 8}, "replies": [{"author": "night owl", "text": "Folders and sub folders", "likes": 0}, {"author": "Manoj Singh", "text": "What you are saying is correct. But usually the data would be in a database and to check if a username or email is taken we can query the database table using a key column which we can index in a db and hence the search would be really fast. Correct me If I am wrong.", "likes": 2}, {"author": "JustBanter", "text": "BSTs have many applications,  they are used in a lot of languages' search implementations such as maps or sets. They naturally retain the order in which you insert them. \n\nEfficient search, in-order forward/backwards traversal from any given element, predecessor /successor element search, range searches, and max /min queries, with the added benefit of efficient inserts and deletes. With a self-balancing binary search tree (BST), all of the above run in logarithmic time.\n\nA real life application: \n\"Each IP packet sent by an Internet host is stamped with a 16-bit id that must be unique for that source-destination pair. Linux kernel uses an AVL tree(height balanced)(a self balancing BST) indexed by IP address. Hashing would be faster, but want to avoid an attacker sending IP packets with worst-case inputs.\"\nsource http://web.stanford.edu/~blp/papers/libavl-abstract.pdf\n\nThey are a reasonable alternative to a hash tables in critical systems because they do not have the vulnerability of someone potentially figuring out your hashing algorithm and then sending a large amount of data that creates collisions. see collision attack:\nhttps://learncryptography.com/hash-functions/hash-collision-attack", "likes": 3}, {"author": "Dušan Marsa", "text": "Ok thanks, :) help a lot. And to author, you can add some real life tips for this types of videos. It helps a lot to understand what is going on :) thx", "likes": 7}, {"author": "David", "text": "Dušan Marsa yep JS can alphabetize by doing comparisons. \"AZ\" > \"AA\" === true. You can use this to have a fast binary search for the given string value.", "likes": 4}]}]}