{"video": {"id": "5GYr1L0wMxg", "publishedAt": "2018-09-14T15:00:00Z", "title": "Deep Learning for Developers", "description": "Deep Learning has become the hottest topic in the IT industry: a week hardly goes by without a new breakthrough. In this talk, we’ll give you a tour of the state of the art: through code-level demos based on Open Source libraries like Apache MXNet or Keras, we’ll demonstrate advanced models based on CNN, GAN and LSTM architectures, which solve complex problems such as image detection, image generation and machine translation. \n\nWe’ll also show how to customize models on your own data set and how to use them in your own applications. Last but not least, you’ll learn how to deploy these models in production with just a few lines of code thanks to Amazon SageMaker.\n\nTalk by Julien Simon at Devoxx Poland 2018.\n\nThanks to Devoxx for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT56M31S", "likes": "172", "views": "6484"}, "comments": [{"topLevelComment": {"id": "UgzscKqG4aN5CO_MQ-t4AaABAg", "publishedAt": "2018-10-01T17:42:58Z", "author": "Hannah Humphreys", "text": "Power BI A-Z: Hands-On Power BI Training For Data Science!\n\n> Connect Microsoft Power BI to data sources\n> Create Barcharts\n> Create Waterfall Diagrams\n\nhttp://bit.ly/2O32TkB", "likes": 1}}, {"topLevelComment": {"id": "UgzwUin7Z_tkV4Rpgw54AaABAg", "publishedAt": "2018-09-18T13:05:38Z", "author": "Hannah Humphreys", "text": "AI & Big Data Expo North America releases Two New Big Data Conference Tracks to complement AI Focus\n\n#AI #Expo #California\n\nhttp://bit.ly/2MjeNTf", "likes": 1}}, {"topLevelComment": {"id": "UgwSFLvZoyfbC2wxLT94AaABAg", "publishedAt": "2018-09-16T08:52:31Z", "author": "WhiskeyEchoBravo", "text": "Greetings from LDZ PL ;) <3 FreCodeCamp.org", "likes": 0}}, {"topLevelComment": {"id": "UgwK4uQH3yykhiooNc54AaABAg", "publishedAt": "2018-09-14T16:19:04Z", "author": "Royal Queen", "text": "👍👍✌", "likes": 1}}]}