{"video": {"id": "6g4O5UOH304", "title": "TensorFlow 2.0 Crash Course", "description": "Learn how to use TensorFlow 2.0 in this crash course for beginners. This course will demonstrate how to create neural networks with Python and TensorFlow 2.0. \n\nIf you want a more comprehensive TensorFlow 2.0 course, check out this 7 hour course: https://youtu.be/tPYj3fFJGjk\n\n🎥 Course created by Tech with Tim. Check out his YouTube channel: https://www.youtube.com/channel/UC4JX40jDee_tINbkjycV4Sg\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) What is a Neural Network?\n⌨️ (0:26:34) How to load & look at data\n⌨️ (0:39:38) How to create a model\n⌨️ (0:56:48) How to use the model to make predictions\n⌨️ (1:07:11) Text Classification (part 1)\n⌨️ (1:28:37) What is an Embedding Layer? Text Classification (part 2)\n⌨️ (1:42:30) How to train the model - Text Classification (part 3)\n⌨️ (1:52:35) How to saving & loading models - Text Classification (part 4)\n⌨️ (2:07:09) How to install TensorFlow GPU on Linux\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://www.freecodecamp.org/news", "duration": "PT2H13M17S", "likes": "10596", "views": "483161"}, "comments": [{"topLevelComment": {"author": "freeCodeCamp.org", "text": "If you want to learn even more about TensorFlow, check out this 7-hour course: https://www.youtube.com/watch?v=tPYj3fFJGjk", "likes": 27}, "replies": [{"author": "Python Programmer", "text": "is anyone getting this error? \n\n\nFailed to load the native TensorFlow runtime.", "likes": 0}, {"author": "Python Programmer", "text": "am i the only one getting an error?", "likes": 0}, {"author": "Saurabh S", "text": "@strong gun longer one has machine learning, deep learning, and reinforcement learning video parts.. however this one is only deep learning with videos on image classification and text classification", "likes": 5}, {"author": "strong gun", "text": "Which one is better?\n\n\nShould I watch this first or the other one?", "likes": 0}]}, {"topLevelComment": {"author": "patja production", "text": "1:19:26", "likes": 0}}, {"topLevelComment": {"author": "Gleb", "text": "Hoped see not-api tensorflow. Well, good tutorial for begginers, ty!", "likes": 0}}, {"topLevelComment": {"author": "agentstona", "text": "DONT   WATCH THIS TUTORIAL FIRST   ELSE  YOU WILL CONFUSE THE CRAP out of your self ................  come back and watch this tutorial when you  have watched 5 tf tutorials from else where ...", "likes": 0}}, {"topLevelComment": {"author": "NaN", "text": "My biggest problem with the TensorFlow guidelines is that there is no direct instruction on how to use your own data. The official TensorFlow guidelines do not clearly address all the requirements. I have also wondered why, for example, it is made so difficult to convert text into a TensorFlow-compatible data format.\r\n\r\nThe official TensorFlow guidelines say \"load CSV data\" is a good example. The first section is really clear and simple when measuring the size of a clam or whatever it is. In the second section explaining the survivors of the Titanic the data conversion to a format suitable for TensorFlow is a pain in the ass. Why hasn't TensorFlow done anything to alleviate this.", "likes": 0}}, {"topLevelComment": {"author": "Shippy", "text": "Great tutorial! One question about the globalaveragepooling layer. After embedding we are actually taking the average of the embedding features over all the word vectors and not the average of every individual vector? Say we have 2 words in a sentence that we want to predict the sentiment of: \"Very nice\" -> [1,1,1,1], [2,2,2,2] -> 2 words, 2 word vectors with 4 embedding features (contexts). The correct way is to take the average over these vectors so the lower dimensional output is [1.5, 1.5, 1.5, 1.5], that we then pass to the dense layer. And the incorrect way is to output a 2 dimensional vector averaging the 2 vectors individually -> output: [1, 2]? Just averaging every word vector individually and passing every single one in a new vector doesn't make sense to me and would just throw away the context.", "likes": 0}}, {"topLevelComment": {"author": "Pankaj Chand", "text": "Does this course teach Keras in Tensorflow, or pure Tensorflow only?", "likes": 0}}, {"topLevelComment": {"author": "Alex", "text": "I feel like this was a Keras tutorial", "likes": 0}}, {"topLevelComment": {"author": "Amir Taghavy", "text": "Thanks for making this insightful video. One quick question, when flattening the data, shouldn't we expect 28 by 28 by 3 values for each image given that each pixel is represented by three RGB values?", "likes": 0}, "replies": [{"author": "Rotten Radish", "text": "No because grayscale images are represented as just one value. Theoretically you're right, since the RGB value is (x, x, x), but it is often stored as just x.", "likes": 0}]}, {"topLevelComment": {"author": "George Ognyanov", "text": "Correct me if I'm wrong but I think each neuron (each layer to be precise) has 1 bias parameter, rather than 4 as in the example above.", "likes": 0}}, {"topLevelComment": {"author": "raj", "text": "Must watch for basics of TensorFlow. Good Tutorial", "likes": 0}}, {"topLevelComment": {"author": "raj", "text": "37:53 its not the RGB values. They are the values obtained after using back propagation and adding biases. Its like conversion of images of T-shirt into a matrix that a computer can understand and then compare that matrix.", "likes": 0}}, {"topLevelComment": {"author": "raj", "text": "Tf tutorial starts at 26:37", "likes": 1}}, {"topLevelComment": {"author": "HackerCop", "text": "Just use Jupyter notebook then you don't have to keep re-training the model everytime you want to run the code.", "likes": 0}}, {"topLevelComment": {"author": "ABTheCoder", "text": "any one clear me about this error ::: index out range", "likes": 0}}, {"topLevelComment": {"author": "ABTheCoder", "text": "i have doubt why they give me the error they say me every :::: index out of range", "likes": 0}}, {"topLevelComment": {"author": "Ehsan Saraee", "text": "Love every minute of this video!great tutorial!thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "القارئ إبراهيم بشار", "text": "This line keeps throwing errors\n\n\nfitModel = model.fit(x_train, y_train, epochs=40, batch_size=512, validation_data=(x_val, y_val), verbose=1)", "likes": 1}}, {"topLevelComment": {"author": "Jonas Strabel", "text": "For everyone who as problems installing the pip package, its only for python versions up to 3.8. If you are running python 3.9 or higher install the alpha version of the pip package", "likes": 0}}, {"topLevelComment": {"author": "Виталий Б.", "text": "Super clear, easy to follow explanations, THANKS!", "likes": 0}}, {"topLevelComment": {"author": "shaimaa mohamed", "text": "Hi, thanks for this course, But we want source code", "likes": 0}}, {"topLevelComment": {"author": "forevertheuni", "text": "can't trust anything a guy using a windows computer says for this.", "likes": 0}}, {"topLevelComment": {"author": "Seppl", "text": "how is it shrinking the data to devide by the max value? you get a lot of dezimal numbers...", "likes": 0}}, {"topLevelComment": {"author": "Ragavan Ramadurai", "text": "how did you choose 128 neurons for hidden layers ?", "likes": 0}}, {"topLevelComment": {"author": "IvanVoid", "text": "wow this tf tutorial actually keras tutorial, kinda misleading =(", "likes": 0}}, {"topLevelComment": {"author": "CPlusPlusGoddess", "text": "dont you want to evaluate your fit_model rather than your model?", "likes": 0}}, {"topLevelComment": {"author": "Aedal Daniel", "text": "We're at shella ka deulim metric abullah equals and bibbidi babbidi is why put them together ? and you've got booty babbdi boo x plus y equals y, x equals zero", "likes": 0}}, {"topLevelComment": {"author": "Ajay S Patil", "text": "plt.title(\"Prediction \" + class_names[np.argmax(prediction[i])]), I am getting index Out of range error, can you please help??", "likes": 0}, "replies": [{"author": "Mateusz Adamek", "text": "I have the same error\n\nedit:\nI find the problem, My class_names is too short, i forgot rewrite one clothes, check your class_names", "likes": 0}]}, {"topLevelComment": {"author": "Mikey Stories", "text": "i accidently create skynet..", "likes": 0}}, {"topLevelComment": {"author": "Sarthak Bobde", "text": "ValueError: Input arrays should have the same number of samples as target arrays. Found 60000 input samples and 10000 target samples.\r\n I am getting this error.. an someone help me", "likes": 1}}, {"topLevelComment": {"author": "l0stdest1ny", "text": "The white background burns my eye", "likes": 0}}, {"topLevelComment": {"author": "Shashwat Kwatra", "text": "idk why its predicting \"tshirt \" in all the cases with a accuracy of 0.1018", "likes": 0}, "replies": [{"author": "Shashwat Kwatra", "text": "@Swarup Bhattarai nope, still not working, its just giving me the accuracy of 99 and then 100 in the other 3 epochs, its still predicting tshirt even after changing the values in the for loop", "likes": 0}, {"author": "Swarup Bhattarai", "text": "Compare your looping part with his and see", "likes": 0}]}, {"topLevelComment": {"author": "Alessio Sangalli", "text": "So cool to find a video on this subject where the teacher does not have a heavy accent", "likes": 0}}, {"topLevelComment": {"author": "dato nefaridze", "text": "Is this TensorFlow or  Keras?", "likes": 0}}, {"topLevelComment": {"author": "Chizzle Mo", "text": "(x2 + y2 − 1)3 − x2y3 = 0", "likes": 0}}, {"topLevelComment": {"author": "Shantanu Agrawal", "text": "Nice content and explanation, thanks for the video", "likes": 0}, "replies": [{"author": "Shantanu Agrawal", "text": "Why is the length of predict object in test classification code is 250?\nLike, we have our last layer as a dense layer with 1 neuron, which is using the sigmoid activation function.", "likes": 0}, {"author": "Shantanu Agrawal", "text": "Can someone please clear out some of my doubts or explain these differences in my outputs?\nI am working in Jupyter Notebook\nI got these differences in my output as compared with yours, based on the same code as yours.\nI got around 2.2k datasets to work with, and the speed of the processing was around 2ms/step (Is it due to Jupyter environment?)\nHence, for epoch=5:\nMy accuracy ranged from 0.62 to 0.69 and testing accuracy was around 0.63, but with great difference in loss value, that was 92 for me.\nSimilarly, when that model was again trained for epoch=10: accuracy ranged from 0.83 to 0.86 and final testing acc was 0.70 and loss value was around 88, but in the video, it was in 0.92 range.", "likes": 0}]}, {"topLevelComment": {"author": "Subrat Pattanaik", "text": "1:47:14 - The verbose parameter is a simple debugging tool which prints the status of epochs while the model is being trained. In the case, verbose=1 displays the epoch number with a little decoration. Please feel free to correct if any and add more info.", "likes": 13}, "replies": [{"author": "das sad", "text": "your're right. You can use verbose to track model's progress, if you dont want to see it's learning process you can switch it off. verbose = 0 - you see absolute no progress, just when training is finished program will go on, verbose = 2 - you'll see which epoch is already trained, verbose = 1 you'll see number of epoch (for example Epoch 11/100), progress bar in %, and some parameters (loss function, and accuracy).", "likes": 0}]}, {"topLevelComment": {"author": "Vinay Patil", "text": "At 1:05:25 you mentioned if we need to make predictions on a single image from the dataset we just need to put [test_images[7]] instead of test_images.\ncorrection:\nprediction = model.predict(np.array([test_images[7]]))\nwe need to pass a NumPy array to the model else one would run into this error:\nValueError: Input 0 of layer dense is incompatible with the layer: expected axis -1 of input shape to have value 784 but received input with shape [None, 28]", "likes": 2}}, {"topLevelComment": {"author": "Sam Raeburn", "text": "Best tensorflow tutorial ive ever seen, thanks for this one!", "likes": 1}, "replies": [{"author": "Ayush yadav", "text": "have yopu completed the course ?? How was it?", "likes": 0}]}, {"topLevelComment": {"author": "Srinivas Yerraguntla", "text": "Great video. Very informative. I tried to follow along and created a model in google colab. My training and testing sizes are 60,000 and 10,000 respectively. However,  when the model is being trained, below where it says Epoch 1/5... it shows a total of 1875, whereas in the video tutorial it shows 60,000. Can someone please explain to me why my model is only taking 1875 images as input instead of 60,000. I have checked my training and testing sizes and they are 60,000 and 10,000 respectively. But later it shows to be 1875", "likes": 0}}, {"topLevelComment": {"author": "Syed Yawar Ali Shah", "text": "class_names is not working .. it says 'class_names' is not defined...what should I do?", "likes": 0}}, {"topLevelComment": {"author": "Luisgui Pizaña", "text": "Great crash course", "likes": 0}}, {"topLevelComment": {"author": "Azizul Hakim", "text": "He became my favorite by saying he doesn't know what Verbose is.", "likes": 20}, "replies": [{"author": "CPlusPlusGoddess", "text": "that comment gave me less confidence in him", "likes": 0}]}, {"topLevelComment": {"author": "Rory", "text": "Surprise power-move at 1:20:59 .... typing 'cmd' inside a Windows Explorer search bar to launch CMD in that directory.  I never knew that!", "likes": 0}}, {"topLevelComment": {"author": "shiyan", "text": "great tutorial, btw, what is this text editor?.", "likes": 0}}, {"topLevelComment": {"author": "wanabenerd", "text": "amazing video thanks!", "likes": 0}}, {"topLevelComment": {"author": "BlueCombPL", "text": "There is Radeon-compatible version of Tensorflow, called tensorflow-rocm :)", "likes": 1}, "replies": [{"author": "Bengt Lüers", "text": "@BlueCombPL Yes, TF-ROCm runs on gfx 803, too. It is however buggy to a point, where I say it does not work.", "likes": 0}, {"author": "BlueCombPL", "text": "@Bengt Lüers I've made it to run on RX 570. Nothing special.", "likes": 0}, {"author": "Bengt Lüers", "text": "It really only works on Vegas, but yes, it exists and works okay.", "likes": 0}]}, {"topLevelComment": {"author": "Ahaan Pandya", "text": "1:08:31", "likes": 0}}, {"topLevelComment": {"author": "Theoretical Physics", "text": "If you don't feel like going through an installation process rn, just use google colab, it has numpy, pandas, matplotlib, and tensorflow already available to use.", "likes": 0}}, {"topLevelComment": {"author": "Smit Barve", "text": "For those facing problems installing TensorFlow and other libraries I recommend using Google Colab as it already has all the required libraries per-installed.👍", "likes": 0}}, {"topLevelComment": {"author": "Persious Proficy", "text": "What chair is that?", "likes": 0}}, {"topLevelComment": {"author": "Bilal", "text": "There is any information about notebook of this video. Can you add the notebook too??", "likes": 0}}, {"topLevelComment": {"author": "KyrSt", "text": "what a nonsense video. It doesn't even touch tensorflow. this is a keras crash course. Either your title is a clickbait or you don't understand the difference", "likes": 0}}, {"topLevelComment": {"author": "uelude", "text": "Nicely done.  Would be great to see new door handles.", "likes": 0}}, {"topLevelComment": {"author": "achmed20", "text": "thx a ton, i finaly understood the basics :)", "likes": 0}}, {"topLevelComment": {"author": "Sari Al-Hiari", "text": "@1:43:00  you dont quite understand this", "likes": 0}}, {"topLevelComment": {"author": "Sarveswara Reddy Boreddy", "text": "Best tutorial on neural networks", "likes": 0}}, {"topLevelComment": {"author": "Thomas P George", "text": "Thank you so much for this!!   :D", "likes": 0}}, {"topLevelComment": {"author": "Nightmare", "text": "Each epoch only trains on 30 examples, resulting in a terrible 49% accuracy. I'm positive that my code is the same as yours.", "likes": 0}}, {"topLevelComment": {"author": "FotY", "text": "I get many ======== after all epochs have run", "likes": 0}}, {"topLevelComment": {"author": "elghark", "text": "Definitely the worst tutorial seen so far in freeCodeCamp.", "likes": 0}}, {"topLevelComment": {"author": "Marcin Ziajkowski", "text": "Can i use input_shape(width,height,3) for rgb picture?", "likes": 0}}, {"topLevelComment": {"author": "Kieran Lyons", "text": "Seems like a copy and paste exercise, at times Tim doesn't seem to know why things are done.", "likes": 0}}, {"topLevelComment": {"author": "Humayun Nasir", "text": "Very Poor tutorial", "likes": 0}}, {"topLevelComment": {"author": "Christine Deepa", "text": "Determine the output by what? In case the output gives the value that you will never get. Will all the inputs be destroyed. And your output be accepted as your failure. That's the truth. Network is not worth. Criminal activity is going on with arrogance. Get out of here. It's not good to violate human being. Get criminals out as criminal. Only that's important.", "likes": 0}}, {"topLevelComment": {"author": "Krunal", "text": "Hey Tim, I have only one question. Since you called the dataset \"imdb\", I really want to know where it is actually stored. So far, I knew I had to download it. But where does it download from and where is it stored in my storage? Doing great work !!!", "likes": 0}}, {"topLevelComment": {"author": "Malhar K", "text": "Amazing Video", "likes": 0}}, {"topLevelComment": {"author": "Jace", "text": "Great video! (The better replacement is using regex)", "likes": 0}}, {"topLevelComment": {"author": "Juan Guarin", "text": "Thank you for this tutorial, very nice. One note, on 37:50 255 would be white.", "likes": 0}}, {"topLevelComment": {"author": "Sherif Badawii", "text": "When you divide your data by the max value, you are essentially \"normalizing\" it. \"Shrinking it\" or more appropriately quantizing the data is a different process involving reducing the number of significant bits and the quantization step.", "likes": 0}}, {"topLevelComment": {"author": "Matthew Li", "text": "Thank you very much your video is so helpful", "likes": 0}}, {"topLevelComment": {"author": "Gharbi Krayem", "text": "it would be great to show us how to install tensorflow step by step on windows. i couldnt figure it out , the guide on tensorflow website is awful", "likes": 0}}, {"topLevelComment": {"author": "Joseph Cohen", "text": "how do you add the lion king data???", "likes": 0}}, {"topLevelComment": {"author": "Joseph Cohen", "text": "Anyone have trouble running their notebook once you updated vocab to 88k?", "likes": 0}}, {"topLevelComment": {"author": "Joseph Cohen", "text": "How do you pick input layers shape? (the one that gets flattened early on).", "likes": 0}}, {"topLevelComment": {"author": "Star", "text": "This comment section seems so fishy. Bunch of repeated comments.", "likes": 2}, "replies": [{"author": "Alexander Heer", "text": "This comment section seems so fishy. Bunch of repeated comments.", "likes": 1}, {"author": "GaryChap", "text": "This comment section seems so fishy. Bunch of repeated comments.", "likes": 1}]}, {"topLevelComment": {"author": "Ernie A", "text": "Very well done tutorial.  Nice intro to TF and Neural Networks with some quick and easy to follow examples.  So much to learn!", "likes": 0}}, {"topLevelComment": {"author": "Arjun Alwe", "text": "For some odd reason, my IMDb model predicts numbers that aren't 1 or 0 (i.e  0.9999, 0.23538295, etc, etc.). This isn't a problem, however, I noticed Tim's model always outputted either a 1 or 0 and was just wondering if something is wrong with my model.", "likes": 1}}, {"topLevelComment": {"author": "Heritage Homes", "text": "Thanks for taking time and explaining this concepts with example. it helps many beginners. I teach advanced statistics  and this details will help many people to understand fundamentals. nice job.", "likes": 0}}, {"topLevelComment": {"author": "Ernie A", "text": "Whats with all the fake comments?  So many of them say the exact same thing.", "likes": 1}, "replies": [{"author": "Arjun Alwe", "text": "freecodecamp is up to something", "likes": 1}, {"author": "Arjun Alwe", "text": "Yeah I know!", "likes": 1}]}, {"topLevelComment": {"author": "Chenghao Chen", "text": "Thank you for the great video!! \nI have a quick question.\n1:40:46 from the GlobalAveragePooling1D to the next Dense layer, should it be fully connected?", "likes": 0}}, {"topLevelComment": {"author": "ThickSkins", "text": "How does the predicted class know which class it belongs to without even mapping class_names list?", "likes": 0}}, {"topLevelComment": {"author": "Elliot Friesen", "text": "FOR ANYONE WHO CANT DOWNLOAD TENSOR FLOW please do these steps it took me hours to figure out\n1.if it doesn’t work uninstall ALL versions of python and and andacanda, including ALL files related to it\n\n2. Reinstall and anaconda and set to be in path when the installer shows up \n\n3. then just open your command prompt not the anaconda one then your done", "likes": 0}}, {"topLevelComment": {"author": "Elliot Friesen", "text": "Great videoooooo\nUr so goodddd\nU should make daily vids", "likes": 0}}, {"topLevelComment": {"author": "Pape", "text": "By far (!) the best video i have found for beginners in neural networks. And i viewed a lot. Love it!\nWhat killed me is the writing of numbers from the bottom to the top. Never seen writing numbers that way.", "likes": 0}}, {"topLevelComment": {"author": "Okafor Zuruoke", "text": "verbose is just an interface showing the appearance of the model training progress. setting verbose=1 sets a different visual style and so on", "likes": 0}}, {"topLevelComment": {"author": "Lachlan O'Flynn", "text": "🥺\nI'm excited to learn this with Tim! He taught me Java thoroughly!", "likes": 0}}, {"topLevelComment": {"author": "super man", "text": "Help me how to use neural network for chatbot using python and reinforcement learning", "likes": 0}}, {"topLevelComment": {"author": "Jorge Guberte", "text": "If i run the model on jupyter notebook i get about 1.98 loss and 0.25 accuracy but if i just run the exact same code locally using a prompt then the loss and accuracy become similar to what the video shows. That's interesting.\nRunning on colab also gives similar results to the video, so my guess is that jupyter notebook somehow limits something\nedit: i restarted everything and now loss and accuracy are normal on jupyter notebook. weird.", "likes": 0}}, {"topLevelComment": {"author": "A1anG0r", "text": "For 10 times 784, does it mean we have 10 degree of weight for each pixel? why it should be 10 in decimal? for choosing 128 = 2^7, does it have any meaning for the hidden layer?", "likes": 0}}, {"topLevelComment": {"author": "A1anG0r", "text": "Hello, how do we know the image pixel is 28x28? and should there be 256 numbers instead of 255 numbers, as it is from 0 to 255, where there is 2^8 numbers.", "likes": 0}}, {"topLevelComment": {"author": "Homer", "text": "I'm  shocked  at what a small amount of code it takes to do this. You should buy sublime text if you're gonna use it so much you cheapskate!", "likes": 0}}, {"topLevelComment": {"author": "LANNA SOUZA", "text": "What about the cross entropy loss function? (23:05)\n2:07 maybe chatbot? Yes bro pls.. My pathetic try to make it +1 for NN chatbot", "likes": 0}}, {"topLevelComment": {"author": "psanyi0042", "text": "Umm what? this guy doesn't know what IMDB is? He is using image recognition and he is not sure that a grayscale image is pixels ranging from 0-255?", "likes": 0}}, {"topLevelComment": {"author": "julio ontiveros", "text": "i have high school math and i understook what an activation function is so is very well explained!", "likes": 0}}, {"topLevelComment": {"author": "Lee Przybylski", "text": "What about the cross entropy loss function? (23:05)", "likes": 0}}, {"topLevelComment": {"author": "Zaphod Beeblebrox", "text": "I haven't watched this. How good is it for beginners?", "likes": 0}}, {"topLevelComment": {"author": "digvijay Raut", "text": "Can you please make a video on handwriting recognition ?", "likes": 0}}, {"topLevelComment": {"author": "Neelanjan Manna", "text": "Great tutorial so far, just a quick correction that the sigmoid activation function ranges between 0 and 1. What you had drawn was actually the tanh activation function, that ranges between -1 and 1. Cheers!", "likes": 56}, "replies": [{"author": "Seyal", "text": "Correct, I just came to write that", "likes": 4}]}, {"topLevelComment": {"author": "Nhi Mong", "text": "Was using google collab to implement this tutorial. Thank you for the great content.\nI'm excited to learn this with Tim! He taught me Java thoroughly!", "likes": 0}, "replies": [{"author": "Kids Free", "text": "Who is botting?", "likes": 1}]}, {"topLevelComment": {"author": "Jim Babb", "text": "I spent 3days to watch and figure out the basic theory behind this tutorial, thank you very much~!\n2:07 maybe chatbot? Yes bro pls.. My pathetic try to make it +1 for NN chatbot", "likes": 0}}, {"topLevelComment": {"author": "Brother Lui", "text": "The explanation of bias at 12:06 and the formula is totally wrong. NOT every weight has a bias value! Each layer has one, in his formula that could be v0=1 with weight w0.", "likes": 0}}, {"topLevelComment": {"author": "qk", "text": "1:44:27 bookmark", "likes": 0}}, {"topLevelComment": {"author": "Valfredo De Matteis", "text": "thank you very much man, I'm a philosophy student who's trying to find a way in understing AI, that's hard but  videos like this are a HUGE help, thank you very much, keep it up", "likes": 0}}, {"topLevelComment": {"author": "bubbles grappling", "text": "at 11:58 is i the index of the input neuron?", "likes": 0}}, {"topLevelComment": {"author": "bubbles grappling", "text": "this video is waaayyyy better than a course that i actually paid for. Stupid me", "likes": 0}}, {"topLevelComment": {"author": "D. Rodriguez Alpha", "text": "2:07 maybe chatbot? Yes bro pls.. My pathetic try to make it +1 for NN chatbot\nWas using google collab to implement this tutorial. Thank you for the great content.", "likes": 0}}, {"topLevelComment": {"author": "Flayy", "text": "funny. i failed on installing. ERROR: Could not find a version that satisfies the requirement tensorflow==2.0.0-alpha0 (from versions: none)\r\nERROR: No matching distribution found for tensorflow==2.0.0-alpha0", "likes": 1}}, {"topLevelComment": {"author": "agha saad", "text": "2hours...i learned it in 5 minutes lol 😁😁😁😂😂", "likes": 0}}, {"topLevelComment": {"author": "Nails H", "text": "Took me 2 hours to install tensorflow properly due to several wrong python installs in my PATH on Mac OS.\nHelp yourself and go with venv/virtualenv/pipenv for easy setup.", "likes": 7}}, {"topLevelComment": {"author": "Dongyu Wu", "text": "1:05:36 adding value here will get error msg... I think the better way can be substituting i value in the for loop to any specific value you want to test instead of using loop.", "likes": 0}}, {"topLevelComment": {"author": "Christian", "text": "Tensorflow is super slow on my computer. I have an Intel® Core™ i5-5300U CPU @ 2.30GHz × 4 and an Intel® HD Graphics 5500 (Broadwell GT2). I installed the non-GPU based version because I don't have an Nvidia card. One epoch takes around 30s. Anything I am doing wrong?", "likes": 0}}, {"topLevelComment": {"author": "Jun Huang", "text": "how do you define the hidden layers node of 128? why is 128?", "likes": 0}}, {"topLevelComment": {"author": "C .F", "text": "Hey😵 you have an error 1:43:11 ,it will make you get this message: \"the model cannot be compiled because it has no \"loss\" to optimize\", 😂 disable the 😈autocorrect function 😈.\n\nHey😵😱  again the 😈autocorrect function 😈 is having fun here too 1:48:18, he doesn't want to help you😂, I think my \"evaluate\" time was worth😂\n\nBut very good tutorial for Text Classification, 👍🏼👏🏻💯👍🏼", "likes": 1}}, {"topLevelComment": {"author": "Vikramaditya Mathur", "text": "Great lecture. Thank you !", "likes": 1}}, {"topLevelComment": {"author": "Chisom Odimmegwa", "text": "Your're not explaining enough, it's supposed to be for beginners bruh.", "likes": 0}}, {"topLevelComment": {"author": "Debmalya Mitra", "text": "Excellent video but I think next time you should use jupyter notebook then you wouldn't need to train every time", "likes": 0}}, {"topLevelComment": {"author": "A B", "text": "Great job! Is there like a Part 2 video for new example modeling? Or is this the only video?", "likes": 2}}, {"topLevelComment": {"author": "Benjamin Chen", "text": "Did I just hear this man say he didn't know what imdb was? Or did he just not know the acronym", "likes": 0}, "replies": [{"author": "Delyar Tabatabai", "text": "@Benjamin Chen  yeah that was surprising", "likes": 0}, {"author": "Benjamin Chen", "text": "@Delyar Tabatabai no he says he doesn't know what IMDb is at 1:10:29", "likes": 0}, {"author": "Delyar Tabatabai", "text": "He said IDLE", "likes": 0}]}, {"topLevelComment": {"author": "VISHESH 18BCY10115", "text": "Input arrays should have the same number of samples as target arrays. Found 60000 input samples and 10000 target samples.\n\nerror is coming help", "likes": 3}}, {"topLevelComment": {"author": "Live Free", "text": "If training the model takes longer than expected, just run the cmd.exe or python.exe or Spyder or whatever you use using graphics processor. Just right click on the file in the location and click \"Run with graphics processor\" in Windows 10 and use the non-integrated one.", "likes": 0}}, {"topLevelComment": {"author": "Prithivi K", "text": "Great video! Batch size is for parallel training GPUs..", "likes": 0}}, {"topLevelComment": {"author": "suraj thallapalli", "text": "Hey Tim, I enjoyed this tutorial. I have a doubt. In the text classification why wasn't nltk used to remove the stopwords and the words that doesn't make sense like 'the'. That might still improve the accuarcy. Could you please correct me if i am wrong ?", "likes": 1}}, {"topLevelComment": {"author": "James H", "text": "Awesome video. Thank you. Now I feel ready to dive in with a book I picked up", "likes": 0}}, {"topLevelComment": {"author": "C .F", "text": "Yeah! I handle to run this tutorial with >>PyCharm +Anaconda{Py3.7, TF2.0.0}+offline data<<< getting almost the same result of 1:04:52 👍🏼💯 , 😱 I notice that \"Prediction\" always returns 'T-shirt/top and \"Actual\" returns the correct item name😅.   \n😂NEW UPDATE: removing the lines (13,14) in 38:18 , the program is working fantastic 💯💫 \"Prediction\" and \"Actual\" are returning the right item names. 😎I tested it with \"epochs=10 with range(10)\nAnyway!👍🏼very cool tutorial Tim😃.thanks a lot👍🏼", "likes": 1}}, {"topLevelComment": {"author": "International Scholar HW", "text": "Good 👍", "likes": 0}}, {"topLevelComment": {"author": "P S", "text": "Make a video onc graph neural networks", "likes": 0}}, {"topLevelComment": {"author": "Extreme Titan2", "text": "54:36 When I run I get this error: Session keyword arguments are not support during eager execution. You passed: {'metric': ['accuracy']} pls help", "likes": 0}, "replies": [{"author": "Extreme Titan2", "text": "@Diego Ligtenberg Hi, thank you, but I'm afraid that isn't the case for me. Thank you for trying to help though, much appreciated!", "likes": 0}, {"author": "Diego Ligtenberg", "text": "he typed \"Loss\" with a capital L and it should be a loswer case l     =)", "likes": 1}]}, {"topLevelComment": {"author": "Nilesh Arnaiya", "text": "Very clear explanation and engaging.. Also people do not like 'daataa' it's data", "likes": 0}}, {"topLevelComment": {"author": "Do Lin", "text": "56:27 Training acc marginally larger than the val acc indicates that a high variance problem, and extends the training epochs doesn't sound like a good idea. Tricks as regularizations, dropout or just reduce the number of parameters should be work.", "likes": 0}}, {"topLevelComment": {"author": "woosal1337", "text": "do you have the source code of these projects?", "likes": 0}}, {"topLevelComment": {"author": "shubham singh", "text": "Hey guys even after installing tensorflow I am getting this error \"Failed to load the native TensorFlow runtime.\" I don't know how to fix this can anyone help me in this issue.", "likes": 1}, "replies": [{"author": "Tushar S J", "text": "Bro create a environment and in that environment install tensor flow (works if u r using anaconda )", "likes": 0}]}, {"topLevelComment": {"author": "Amit kehri", "text": "Hats off to you dude. Crystal clear everything .", "likes": 0}}, {"topLevelComment": {"author": "Claudia Westby", "text": "amazing tutorial but may help to use jupyter notebooks so that you don't have to run the whole code in the command line every time and can just run block by block :)", "likes": 0}}, {"topLevelComment": {"author": "Slawomir Gontarek", "text": "Hello, You can make comments to code?", "likes": 0}}, {"topLevelComment": {"author": "Kylen Williams", "text": "Love those gloves, where'd you get them?", "likes": 0}, "replies": [{"author": "Utkarsh Sharma", "text": "Bharat vihar , kakrola", "likes": 0}]}, {"topLevelComment": {"author": "Niranjan Behera", "text": "how to use tf.keras.layers.RNN?", "likes": 0}}, {"topLevelComment": {"author": "Nick", "text": "awesome job mate", "likes": 0}}, {"topLevelComment": {"author": "mli", "text": "i am 13 years old and don't speak and understand very much englisch, but i am now watching the video at 25 min and i have understand how neural networks work and every thing else expect the activation function, thanks", "likes": 0}}, {"topLevelComment": {"author": "Saurabh Laloraya", "text": "very helpful ...thanks", "likes": 0}}, {"topLevelComment": {"author": "Hossam Alzomor", "text": "tensorflow information starts at min 26", "likes": 0}}, {"topLevelComment": {"author": "julio Velazquez", "text": "Does anyone knows why am i getting 10% of accuracy with the same script? In the fashion database", "likes": 0}}, {"topLevelComment": {"author": "Ivan Chan", "text": "Hi Tim thanks a lot for the tutorial.\nI'm trying to save the model via typing exactly the same as you did here.\nHowever, after executing the code, I just can't find the model.h5 file anywhere in my laptop. (I'm using a mac here, and there's no error message after executing the code). Is this something you can help?", "likes": 1}}, {"topLevelComment": {"author": "Benjamín Serra", "text": "for those who are having problem with the predict method, replace it with predict_classes:\nmodel.predict_classes([test_review])", "likes": 5}, "replies": [{"author": "Ruvik Perera", "text": "Bro you saved me....thanks", "likes": 1}]}, {"topLevelComment": {"author": "Richard W", "text": "Wanna see the step by step video tech how to train a machine learning model!", "likes": 0}}, {"topLevelComment": {"author": "isaac mandell-seaver", "text": "54:26", "likes": 0}}, {"topLevelComment": {"author": "Prasanta Pradhan", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Walid Sadak", "text": "THANK YOU <3", "likes": 0}}, {"topLevelComment": {"author": "KIRAN MACHERLA", "text": "Hi, when I try to run the imshow() stuff you are teaching at around 39 mins, I am facing this error:\nname '_warn_for_nonsequence' is not defined\ncan you please tell me what to do for its rectification?\nThank You", "likes": 0}}, {"topLevelComment": {"author": "Kevvvy Kim", "text": "Also, tensorflow 2.0 is eager executed by default and guarantees faster computation than tensorflow 1.x", "likes": 0}}, {"topLevelComment": {"author": "Kevvvy Kim", "text": "Thumbs down because this is an explanation for Tensorflow 1.x where you have to explicitly create a computational graph and its operations. In tensorflow 2.0, you can use tf.function for autograph generation and this is why i came here to learn about= to learn about tensorflow 2.0 not about how to use tensorflow 1.x basics", "likes": 0}}, {"topLevelComment": {"author": "isaac mandell-seaver", "text": "27:12", "likes": 0}}, {"topLevelComment": {"author": "Chad Goldsworthy", "text": "why do you flip the key/values in the dictionary afterwards? why not just create the dictionary with the correct arrangement in the first place? like:\nword_index = {(v+3): k for k, v in word_index.items()}\ninstead of:\nword_index = {k: (v+3) for k, v in word_index.items()}", "likes": 0}, "replies": [{"author": "Kimeg", "text": "It's just a personal preference thing. Everything can be correct AND incorrect.", "likes": 0}]}, {"topLevelComment": {"author": "arnob chowdhury", "text": "1:27:00 text classification", "likes": 0}}, {"topLevelComment": {"author": "Sam Walter", "text": "how do you create the recommended direction (8:43)", "likes": 1}}, {"topLevelComment": {"author": "Азамат Алмазбеков", "text": "Object Detection neural network would be good for learning", "likes": 0}}, {"topLevelComment": {"author": "A I.", "text": "Best tutorial I've ever seen, learned so much about neural networks.", "likes": 0}}, {"topLevelComment": {"author": "Kaison Toro", "text": "hey if i wanted to have the model predict new pictures of clothes, (like say i took a picture of a shirt off google or something) how would i go about doing that", "likes": 0}}, {"topLevelComment": {"author": "OpenGeo Lab", "text": "In an grayscale image 0 is black and 255 is white", "likes": 0}}, {"topLevelComment": {"author": "JM", "text": "I would guess that your bad writing is not due to the table, it's your glove, isn't gay enough, u must buy a gayer glove to show off.", "likes": 0}}, {"topLevelComment": {"author": "Shobhit Srivastava", "text": "Hi Tim...i am  getting incorrect output for  movie review usecase, for  same =>data[0]\nPrediction: [1.2742441e-12]\r\nActual 0\nCan you suggest what could be the issue?", "likes": 0}}, {"topLevelComment": {"author": "The Eagle’s Eye", "text": "255 is white and 0 is black is the correct mapping of color if it is greyscale image and not vice versa. If color image, the 3 numbers will be in each pixel (height x weight); each number of those 3 represents intensity of one color each(rgb is the default order used in Matplotlib. OpenCV converts in a different order ie., bgr)\nIf doubt still exists run this code in python ide after importing numpy as np and matplotlib.pyplot as plt and try changing values of red, green and blue variables\n\n\nred, green, blue = 255,255,0 ; rgb = (red, green, blue); pixel = 1*[1*rgb]; breadth, height = 25, 25;\nimage = np.array(height*[breadth*pixel]);plt.imshow(image);plt.show();", "likes": 0}}, {"topLevelComment": {"author": "K", "text": "Is this tutorial outdated?", "likes": 0}, "replies": [{"author": "Pᴀɴᴛʜᴇʀs Dᴏᴏᴍᴇʀ.", "text": "no, itd all work even with older versions of tensorflow iirc. you might have to tweak some things since this wasnt made using the final release, but the general gist will be the same", "likes": 0}]}, {"topLevelComment": {"author": "Krishna", "text": "Hi \nThanks for amazing stuff \nAnd specifically layers u explained is amazing in part 1 of tutorial \n\nspecially i am looking for building model and matrix shape \n\nBut could u please explain it for new test set\n\n\nActually i was trying for an audio classifier from a tutorial in youtube\nBut for prediction they used same training dataset , but when i m trying with some new dataset \n\nIt is showing error \n\n\" Error when checking input : expected conv2d_1_input  to have shape (9,12,1) but got array  witj shape of (6,12,1)  \"\n\nSo could u please explain how to  shape  new input dataset in our prection part ??", "likes": 0}}, {"topLevelComment": {"author": "Anudeep K", "text": "I don't understand why we use 10000 in embedding layer", "likes": 0}}, {"topLevelComment": {"author": "MRKIO", "text": "50:15 hmm i wonder what it does", "likes": 0}}, {"topLevelComment": {"author": ":Hoax -", "text": "Hey, i really learn from your videos, can you make a tutorial for tensorflow js? specifically for a recommendation system", "likes": 0}}, {"topLevelComment": {"author": "akshay jaryal", "text": "Can you please explain the fruits 360 dataset using tensorflow 2.0", "likes": 0}}, {"topLevelComment": {"author": "Jason Lewis", "text": "Somebody has probably already answered this but \"verbose\" means descriptive. If your were to enable the verbose property on an object it would normally give a lot more details about something, whether that is debug information or just printing output. Also Great Video Tim! I am a big fan of the tutorials on cutting edge technology as they are difficult to find elsewhere :) Keep up the great work", "likes": 0}}, {"topLevelComment": {"author": "Rohith Dsouza", "text": "39:30 - Isn't decimal representation of numbers harder to work with over integer representation of number for a computer?\n(32 bit floating point vs 8 bit integer)", "likes": 3}, "replies": [{"author": "Dar Cos", "text": "On the gpu (cuda) there is no penalty for single precision vs int. Fp16s are also available", "likes": 1}, {"author": "osxs333 __", "text": "scaling the features is common practice when creating models for machine learning, you can kind of think of it as having the data sit close together for the model to make more accurate decisions. In some cases you can work with models that take in a variety of features that all operate on different scales, so you will use Standardization to create more effective models.", "likes": 0}]}, {"topLevelComment": {"author": "Justin Guerrero", "text": "You can avoid downgrading numpy by changing you pickle value to True in the IMDB file located in your keras packages.\nline 85 in the file change to this  with np.load(path, allow_pickle=True) as f:", "likes": 0}}, {"topLevelComment": {"author": "doktor mo", "text": "1:50:29 print(\"Prediction: \" +str(predict[0])) - variable predict is an array with 250 elements, why did you use first one (index zero) to evaluate prediction of NN?", "likes": 0}, "replies": [{"author": "doktor mo", "text": "@Lynnlo but, predict[] has the values of validation for each of 250 words, if someone wrote negative critics with only one positive word the max(predict[]) will be equal ~1 which is then characterised as positive critics?", "likes": 0}, {"author": "Lynnlo", "text": "It's an example normally you'll run a a for i in predict function to find the highest value.", "likes": 0}]}, {"topLevelComment": {"author": "Crypto Rootz", "text": "you lost me at 1:04:05 bro.....", "likes": 0}}, {"topLevelComment": {"author": "alper kılıç", "text": "The seat looks comfortable.", "likes": 1}}, {"topLevelComment": {"author": "Doc", "text": "To answer your question at 1:47:25 , verbose is an optional argument which can be used to report more information about an operation in your program", "likes": 0}}, {"topLevelComment": {"author": "Amber Purrington", "text": "WHY 2 HOURS", "likes": 0}}, {"topLevelComment": {"author": "Fangaming Facts", "text": "I sit in the exact same chair you do :v", "likes": 0}}, {"topLevelComment": {"author": "Heisenberg", "text": "Took me hours to figure this out:\nIf training the model takes really long, this might be the fix:\nDon't use IDLE to run the Code. Just use CMD/Terminal.", "likes": 6}}, {"topLevelComment": {"author": "OSCAR CHAVOYA-ACEVES", "text": "When you are working with a single neuron, like at the beginning of your video, you have only one bias term. It makes no sense to have one per connection. Your excitation function should have been \\sum_{i=1}^4 { w_i \\cdot  v_i } + b. This neuron requires five parameters instead of eight.", "likes": 7}, "replies": [{"author": "Azizul Hakim", "text": "I was looking for this comment", "likes": 0}, {"author": "OSCAR CHAVOYA-ACEVES", "text": "@LimitedWard You have a bias term per node in the hidden and output layers.", "likes": 0}, {"author": "LimitedWard", "text": "Thank you for pointing that out. I was really confused by that math for a bit. So I'm assuming you'd have 1 bias per node in the output layer?", "likes": 0}]}, {"topLevelComment": {"author": "Fagner Feitosa", "text": "Why you don't use notebooks instead aways to run entire code ? nice tutorial ;)", "likes": 0}}, {"topLevelComment": {"author": "ARIF WAQAS", "text": "Speed 1.5x", "likes": 1}}, {"topLevelComment": {"author": "piccamix", "text": "thanks so much dawg, helped me out with my AI assignment, you da man!", "likes": 0}}, {"topLevelComment": {"author": "Łukasz Ungier", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Michael Melnychuk", "text": "Thanks for your video. I really appreciate the simplicity of your explanations and your humility is refreshing! Will watch more.", "likes": 0}}, {"topLevelComment": {"author": "Kartik Mishra", "text": "what is 16 in embedding layer?", "likes": 1}}, {"topLevelComment": {"author": "谢凯泉", "text": "Why prediction[0] shows ackle boot, should it be  prediction[9]?", "likes": 0}}, {"topLevelComment": {"author": "Mahdi Heidarpoor", "text": "the best video for start, its better if you can make another video for more advanced nn works with ts2...", "likes": 0}}, {"topLevelComment": {"author": "pola w", "text": "Well explained.", "likes": 0}}, {"topLevelComment": {"author": "RoadSurfer Official", "text": "Got caught up for two hours and finally found out that python 3.8 is incompatible, get the 3.7 64 bit version", "likes": 12}, "replies": [{"author": "C .F", "text": "RoadSurfer Official 👏🏻🐣", "likes": 0}, {"author": "Heisenberg", "text": "@Daniel Wohlgemuth bist du deutsch und hast du evtl Interesse daran \"zusammen zu lernen\" ?", "likes": 0}, {"author": "Daniel Wohlgemuth", "text": "had the same problem, thanks", "likes": 0}, {"author": "Heisenberg", "text": "thank you", "likes": 0}]}, {"topLevelComment": {"author": "kiran dev", "text": "I am a vfx artist I know basic python damn this is beautiful and also damn hard 😳😳😳", "likes": 1}}, {"topLevelComment": {"author": "Photography Maniac", "text": "😷😶😶😶", "likes": 0}, "replies": [{"author": "kiran dev", "text": "Headache??ah?", "likes": 0}]}, {"topLevelComment": {"author": "Debajyoti Majumder", "text": "I took a 11 week course from coursera in ML to learn Neural Network\nTim: LOL", "likes": 19}, "replies": [{"author": "Lucy Gaming", "text": "Well the Andrew NG's course is great too, but I feel you can learn the math behind it from 3blue1brown's playlist. And also this course is specifically intro to tensorflow and Deep learning and isn't as detailed as Coursera's MOOC.", "likes": 0}, {"author": "Ross Valentine", "text": "How does it compare to this 2 hour course? I would be so interested to know! :) Thank you", "likes": 1}]}, {"topLevelComment": {"author": "Light", "text": "Why we need gpu version? Any upper hand?", "likes": 0}}, {"topLevelComment": {"author": "tjfush", "text": "nice tutorials .... one thing: \"Ubuntu\" is pronounced phonetically...", "likes": 0}}, {"topLevelComment": {"author": "Phillip Otey", "text": "Was expecting what is different from tensorflow 1.0.", "likes": 0}}, {"topLevelComment": {"author": "Phillip Otey", "text": "I see you don't know the calculus very well, but you have your sigmoid function down. You're correct that it does help to know the math. I tend to think of it as a bunch of graphs...", "likes": 0}}, {"topLevelComment": {"author": "Neil Anthony", "text": "very good.", "likes": 0}}, {"topLevelComment": {"author": "MrVishyG", "text": "What's \"dil\", the fourth input neuron @14:00", "likes": 0}, "replies": [{"author": "B T", "text": "recommended direction - for more, just see the video around @8:40", "likes": 0}]}, {"topLevelComment": {"author": "plekkchand", "text": "The universal greeting has become \"Hey guys\".", "likes": 0}}, {"topLevelComment": {"author": "johnpopo2", "text": "Tim man, please stop demonstrating your sloppiness.\nThe review text contains the string _work of art.\"The Lion King\" gets_ (no space between . and \" -- 2nd / 3rd sentence) . You're blindly replacing full stops and quotation marks with an empty string and doing so you create the word *artThe* that is not part of the original review text.", "likes": 1}, "replies": [{"author": "Yash Khurana", "text": "you're right. i absolutely love Tim but this tutorial is a little unprofessional.", "likes": 0}]}, {"topLevelComment": {"author": "Prasad Desai", "text": "Sir, which ide are you using, please tell.", "likes": 0}, "replies": [{"author": "Prasad Desai", "text": "@Me, a black racist  Ok Sir... Thanks for your response and for such a great video...🙏🙏🙏", "likes": 0}]}, {"topLevelComment": {"author": "johnpopo2", "text": "Never seen this level of sloppiness in any coding tutorial", "likes": 0}}, {"topLevelComment": {"author": "johnpopo2", "text": "Your sloppy typing makes me cringe !", "likes": 1}}, {"topLevelComment": {"author": "vikhyat kumeria", "text": "plz update name of video its keras tutorial with tensorflow as backend only not tensorflow tutorial", "likes": 0}}, {"topLevelComment": {"author": "Ben Hudelson", "text": "Hey Tim, great content so far. I would recommend in future videos to reduce the point size on your pen so that your handwriting is a little clearer. Thanks for putting this together. Very well constructed explanations.", "likes": 22}}, {"topLevelComment": {"author": "Mike C", "text": "you explain this better then most college professors do and it doesn't cost me my future in student loans", "likes": 0}}, {"topLevelComment": {"author": "Mike C", "text": "kids a wizard", "likes": 0}}, {"topLevelComment": {"author": "tehdreamer", "text": "How come you can still see the image even though you changed 255 RGB values to 0-1 range? Does the matplotlib convert it back again?", "likes": 1}, "replies": [{"author": "Whine dine", "text": "good point, i was wondering that aswel", "likes": 0}]}, {"topLevelComment": {"author": "Chase", "text": "This was super helpful, thanks!", "likes": 0}}, {"topLevelComment": {"author": "DJE98", "text": "1:19:30 He prints the codes from the train_data[0], but presents the string results from test_data[0]. So there's a mismatch. Hopefully, it's helpful.", "likes": 29}}, {"topLevelComment": {"author": "Jermaine ken", "text": "Was using google collab to implement this tutorial. Thank you for the great content.", "likes": 5}}, {"topLevelComment": {"author": "code2xpert", "text": "Very nice explanation of neural netwiorks and using the same to predict the fashion mnist. This makes a lot of sense to me, thanks for this.", "likes": 0}}, {"topLevelComment": {"author": "neeraj chintala", "text": "I'm stuck here, please help\n\n---------------------------------------------------------------------------\r\nTypeError                                 Traceback (most recent call last)\r\n<ipython-input-16-5ec784ca1449> in <module>()\r\n      9 word_index[\"UNUSED\"] = 3\r\n     10 \r\n---> 11 reverse_word_index = dict([(value, key) for (key, value) in word_index.items()])\r\n     12 '''\r\n     13 def decode_review(text):\r\n\r\nTypeError: unhashable type: 'set'", "likes": 0}, "replies": [{"author": "Anthony Darter", "text": "Ran into the same error. Any solutions?", "likes": 0}, {"author": "Shekhar", "text": "may be line number 9 should be this -> word_index[\"<UNUSED>\"] = 3", "likes": 0}]}, {"topLevelComment": {"author": "Something", "text": "Hey Tim! My end results after the epochs gets converted into huge amount of equal to signs(===). I cant read the accuracy or loss but it shows no error. Can you tell where i m going wrong?", "likes": 1}, "replies": [{"author": "S Rajith", "text": "wait for it to finish and itll show the output", "likes": 0}, {"author": "Something", "text": "@techwithtim", "likes": 0}]}, {"topLevelComment": {"author": "Leaper", "text": "This guy clearly has no idea about Tensorflow or Neural networks at all. It almost seems as if he is reciting from another tutorial in which the creator also didn't understand either of the two.", "likes": 3}}, {"topLevelComment": {"author": "Рипсиме Арутюнян", "text": "The tanh function belongs to [-1:1]. Sigmoid activation function is [0:1].", "likes": 2}, "replies": [{"author": "xd", "text": "hot", "likes": 0}]}, {"topLevelComment": {"author": "doktor mo", "text": "few beers and speed 1.5, Amen.", "likes": 0}}, {"topLevelComment": {"author": "Bhupen Sinha", "text": "Sigmoid function converts input to a range of  -1 and 1 ... No I guess", "likes": 2}, "replies": [{"author": "Kenneth Mundt", "text": "Sigmoid converts to 0 - 1", "likes": 0}]}, {"topLevelComment": {"author": "Bhupen Sinha", "text": "Are u sure biases are gir each of weights ? I knew these are added to nodes as intercept ...Clarify pls", "likes": 0}}, {"topLevelComment": {"author": "Shangyun Lv", "text": "When shifting the word index by 3 and add the special token into the dictionary for \"<PAD>\" and \"<START>\" and so on, the whole system will have a mismatch of words, because such shift is not made to the data accordingly.", "likes": 0}}, {"topLevelComment": {"author": "Vikranth Chandrashekhar", "text": "Misguiding, clickbaity title. Please change it to \"keras tutorial\"", "likes": 4}, "replies": [{"author": "Vikranth Chandrashekhar", "text": "@Александар Станковић it is a high level api of tensorflow. There is much more to tensorflow than just keras. Apparently all internet educators seem to teach only keras.", "likes": 0}, {"author": "Александар Станковић", "text": "So, it isn't TensorFlow?", "likes": 0}]}, {"topLevelComment": {"author": "TET _", "text": "Thanks for that Review as å tutorial and the preps and effort in Ur workspace. It took me just å little to catch the nearby and parental prints in tensor, which came from cran-R as spss clone. Now as New Tool for the unforseeanable..... Thx and Rock on 🤘", "likes": 0}}, {"topLevelComment": {"author": "Jordan Shackelford", "text": "way less boring than andrew ng", "likes": 0}}, {"topLevelComment": {"author": "Edward C", "text": "thank you so much ! i was just tired of the indian tutorials. you just made my next few days", "likes": 2}}, {"topLevelComment": {"author": "Kyde", "text": "Followed your code line by line. Awesome Tutorial  🔥. Am getting an error though in the Text Classification :\n`ValueError: A target array with shape (15000, 250) was passed for an output of shape \r\n(None, 1) while using as loss `binary_crossentropy`. This loss expects targets to have the same shape as the output.`\nIt would also be great if you could provide your code online.", "likes": 6}, "replies": [{"author": "Yasmine Guemouria", "text": "same problem here", "likes": 3}]}, {"topLevelComment": {"author": "Darren M", "text": "Imagine what happens when pairing Neural Networks with quantum computers. Would it create real intelligence?", "likes": 0}}, {"topLevelComment": {"author": "YewVasyen", "text": "May I know hot to get to know the way we make the data loads in just like (train_images , train_labels)... = data.loads_data(). Can't I just make only one term to load the data in?", "likes": 0}, "replies": [{"author": "Shyam Nehru", "text": "U split it as images and labels ie labels are the features that is the names of the classes that contain the images", "likes": 0}]}, {"topLevelComment": {"author": "Ali akbar", "text": "love you man.  really a good teacher.", "likes": 0}}, {"topLevelComment": {"author": "Shawn Liu", "text": "Newbie in almost every aspects in what is said in this video. Took me a whole day to get to 35:10. Had issues (1). downloading python. The correct version is python3.6.1 for tensorflow 2.0.0, to avoid \"from google.protobuf.pyext import _message\r\nImportError: DLL load failed: The specified procedure could not be found.\" errors, (2). Tensorflow 2.0.0, not 2.0.0alpha0, to avoid many many many \"future warnings\" (3). \"Cache entry deserialization failed, entry ignored\", solved by opening command prompt as administrator! (4). many typo error from my own fault. Almost given up. Using windows10 pro, CPU, intel64. I know the problem relates to my special settings, but might happen to other new users. This is a great video for beginners, thou.", "likes": 1}}, {"topLevelComment": {"author": "Pranav Dave", "text": "0 is black and 255 is white", "likes": 0}}, {"topLevelComment": {"author": "Mosy Right", "text": "Excellent! Thank you", "likes": 0}}, {"topLevelComment": {"author": "sebastian de la Vega", "text": "Wow great job, i will be starting soon with my tensorflow experience... i want to build a german chatbot for my robot... maybe check it out on instagram @contactnavarra", "likes": 0}}, {"topLevelComment": {"author": "Akshay Jayakumar", "text": "Sum of squared differences", "likes": 0}}, {"topLevelComment": {"author": "Oleksandr Lazariev", "text": "bro, this is not about tf 2.0 tutorial. it's more about keras and ML. this code would work on tf 1.X.", "likes": 0}}, {"topLevelComment": {"author": "Nikhil Kumar Jha", "text": "Thanks for sharing this informative tutorial. Big like (y)", "likes": 0}}, {"topLevelComment": {"author": "Rajesh Somasundaram", "text": "It was a great first half session (I watched till that point). How do we tell our neural network output neurons (output1 to output9) to predict the specific labels. For ex: output 1 neuron should predict the output of Trouser. Where do we really mention that?", "likes": 1}, "replies": [{"author": "gaurav sharma", "text": "y labels represent the actual output.", "likes": 0}]}, {"topLevelComment": {"author": "Alok Ranjan Sanga", "text": "please make video on faster RCNN with python", "likes": 0}}, {"topLevelComment": {"author": "Tauseef Nawaz", "text": "Why we are not use sk learn model for train_test_split or label encoder in this model?", "likes": 0}}, {"topLevelComment": {"author": "Joe Liu", "text": "can you show what you did with tensonflow-gpu? thanks", "likes": 0}}, {"topLevelComment": {"author": "Pavan Kumar", "text": "Can I create a tensorflow input datapipeline with some databases as backend. Most of the resources have either .tfrecord or .csv.", "likes": 3}}, {"topLevelComment": {"author": "jabri mohamed", "text": "verbose is telling the TensorFlow to show the execution per epoch .. if verbose=0 then nothing is shown .. 1 is by default I guess ( [===]) and 2 will show u Epoch 1/40 .. Epoch 2/40 etc", "likes": 0}}, {"topLevelComment": {"author": "James Parsons", "text": "Great explanation of the activation function.", "likes": 0}}, {"topLevelComment": {"author": "Jamius Siam", "text": "verbose=1 essentially tells TensorFlow to output logs instead of doing it quietly.", "likes": 0}}, {"topLevelComment": {"author": "Koceila Cherfouh", "text": "Hey, I tried both of the examples of the image classifier and the text review classifier, and I was getting considerably lower accuracy. Do you have any idea why that is?  for example, I could only achieve 50% accuracy with the text review classifier, even though I tried to play with the epochs number and the size of the training data. I am a little confused?", "likes": 0}, "replies": [{"author": "Xynos Tasos", "text": "I had the same problem. While copy-pasting the lines on keras.preprocessing.sequence etc etc inside the parentheses on \"test_data\" line I forgot to change  the argument from \"train_data\" to \"test_data\"", "likes": 0}]}, {"topLevelComment": {"author": "Koceila Cherfouh", "text": "This tutorial is well put together. I was looking to learn more about neural nets and TensorFlow. this is perfect for a beginner in the field.", "likes": 8}}, {"topLevelComment": {"author": "Mirunan Pirabaharan", "text": "54:30 i'm stuck with this error\n\n\nTypeError: The added layer must be an instance of class Layer. Found: {<tensorflow.python.keras.layers.core.Dense object at 0x000001930A7BDE10>, <tensorflow.python.keras.layers.core.Dense object at 0x000001930A7BDB38>, <tensorflow.python.keras.layers.core.Flatten object at 0x0000019309F255C0>}", "likes": 2}, "replies": [{"author": "mot795", "text": "me too", "likes": 0}]}, {"topLevelComment": {"author": "Tim Chandler 🥚", "text": "Month old and already outdated.", "likes": 0}, "replies": [{"author": "Narendra K R", "text": "Hey what is updated ? is it something new with tensorflow 2.0 ?", "likes": 0}]}, {"topLevelComment": {"author": "Chris Field", "text": "This is incredible. I'm an hour in, and I feel like I've learned more practical application in this video than I have in all of the other ML research I've done combined.", "likes": 1}}, {"topLevelComment": {"author": "Suhel Chakraborty", "text": "Say test_labels[7] is 9 or something. But the output should be a 10 element array, given that is a 10-neuron layer. So my question is, when the model is being trained with the images and labels, how does a number correspond to that element in the 10-element array?", "likes": 0}}, {"topLevelComment": {"author": "Anime Lover John", "text": "1:02:00", "likes": 0}}, {"topLevelComment": {"author": "Wojtek", "text": "1:27:54 I am confused as to why you use the sigmoid function for the last layer? as I understand you want it to be mapped from 0 - 1 but doesn't sigmoid function map values from -1  -  1? I also can't really understand what is the point of giving \"averaging\" layer the \"rectified linear unit\" function if it just averages the vectors? does it average them and then confine them within the range of the function?", "likes": 0}, "replies": [{"author": "Dilan Boskan", "text": "google what sigmoid is...", "likes": 0}]}, {"topLevelComment": {"author": "Takashi Futada", "text": "Great tutorial. Thanks. You might want to use Jupyter with Visual Studio Code, so you don't need to run from the beginning every time.", "likes": 0}}, {"topLevelComment": {"author": "Chinmay Gharat", "text": "I thought it was about tensorflo, but it was all about keras.", "likes": 0}}, {"topLevelComment": {"author": "Joro", "text": "Surprisingly well done tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Arik", "text": "I'm new to python, but I don't see how normalizing the data \"shrinks\" the data. Python may not have explicit types, but underneath, it's still just a conversion of a short to a float right? That would result in turning 2 bytes into 4, so actually enlarging your data.", "likes": 0}}, {"topLevelComment": {"author": "Ben Evans", "text": "From the top comments, I couldn't see but verbose means how much detail the program goes into, verbose is used a ton in linux commands so check them out!", "likes": 0}}, {"topLevelComment": {"author": "Arik", "text": "For anyone new to python and tensorflow, if you're having issues with installing tensorflow on windows 10, two recommendations I have are \n1) look for and remove all pre-installed versions of python\n2) use python 3.6 \nAll my headaches went away after doing that", "likes": 32}, "replies": [{"author": "Chisom Odimmegwa", "text": "@Arnav Mehta i think so but not sure. All i knw is dat d python version should b 64 bit", "likes": 0}, {"author": "Arnav Mehta", "text": "@Chisom Odimmegwa i mean that tensorflow doesn't works on 32 bit python na??? So i should upgrade my windows", "likes": 0}, {"author": "Chisom Odimmegwa", "text": "@Arnav Mehta should work", "likes": 0}, {"author": "Arnav Mehta", "text": "@Chisom Odimmegwa 3.7 64 bit available??", "likes": 0}, {"author": "Swayam Jaiswal", "text": "@Miran Ahmed I m still facing problem,  can you tell me how did you installed", "likes": 0}]}, {"topLevelComment": {"author": "yo lo", "text": "How old are you?", "likes": 0}}, {"topLevelComment": {"author": "Fktu diablo", "text": "Nothing learned about tensorflow a 2.0", "likes": 0}}, {"topLevelComment": {"author": "Sean Yonathan", "text": "what IDE do u use? looked good...\nnc vid by the way\nedit: is it an IDE or a console? i'm new in this...", "likes": 0}, "replies": [{"author": "Sean Yonathan", "text": "@Chiril Cugureanu thank youu very much for the help. I'll look into it.", "likes": 0}, {"author": "Chiril Cugureanu", "text": "It is Sublime Text, a text editor", "likes": 0}, {"author": "Chiril Cugureanu", "text": "It is Sublime Text", "likes": 0}]}, {"topLevelComment": {"author": "LIGHTNING OMEGA 2 636", "text": "Shut up you're stupid", "likes": 0}}, {"topLevelComment": {"author": "Zoheb Siddiqui", "text": "Snake example is not that upto the mark you should have given something else.", "likes": 0}}, {"topLevelComment": {"author": "陳冠霖", "text": "In load and look data part, how to import a data from my own computer?", "likes": 0}, "replies": [{"author": "Shyam Nehru", "text": "You can just mention the directory path of your data for visualization and preprocessing.If it is images split it as test and train and read the images using cv2.imread.Then  preprocess the images and train your model.", "likes": 0}]}, {"topLevelComment": {"author": "Jamie | Email Marketing Specialist", "text": "(0:00:00) What is a Neural Network?\n(0:26:34) How to load & look at data\n(0:39:38) How to create a model\n(0:56:48) How to use the model to make predictions\n(1:07:11) Text Classification (part 1)\n(1:28:37) What is an Embedding Layer? Text Classification (part 2)\n(1:42:30) How to train the model - Text Classification (part 3)\n(1:52:35) How to saving & loading models - Text Classification (part 4)\n(2:07:09) How to install TensorFlow GPU on Linux", "likes": 3}}, {"topLevelComment": {"author": "isi_ko 404", "text": "Hey can somebody help me? My \"Review-Model\" has in the epochs 100% accuracy but when i test it only has about 50%. Does somebody know whats the problem?", "likes": 0}, "replies": [{"author": "MrBananaFarm", "text": "@Xynos Tasos Love you! ❤", "likes": 0}, {"author": "Xynos Tasos", "text": "I had the same problem. While copy-pasting the lines on keras.preprocessing.sequence etc etc inside the parentheses on \"test_data\" line I forgot to change  the argument from \"train_data\" to \"test_data\"", "likes": 1}, {"author": "MrIsmi2u", "text": "It is over fit problem...\n\nAdd more variance data... And retrain...", "likes": 0}]}, {"topLevelComment": {"author": "Alex Omø Agerholm", "text": "In the last example I do not get one output (prediction) but I get one per line in the review - What did I do wrong - the code is a loop through lines?", "likes": 0}}, {"topLevelComment": {"author": "irfnrdh", "text": "speed 2, ok", "likes": 0}}, {"topLevelComment": {"author": "R N", "text": "Just wow wow wow super excited", "likes": 0}}, {"topLevelComment": {"author": "Егор Ступников", "text": "imshow is not working in matplotlib anymore", "likes": 0}}, {"topLevelComment": {"author": "Starship987", "text": "for the length of the reviews i used\n\n\nfor i in range(len(test_data)):\n    sum = sum+len(test_data[i])\nprint(sum/len(test_data))\n\n\nto simply calculate the average length, the average review is 230 words long i think thats a good limit", "likes": 1}, "replies": [{"author": "Recursive Triforce", "text": "Whenever you write something like...\n\nfor index in range(len(something)):\n     print(something[i])\n\n...just use...\n\nfor element in something:\n     print(element)", "likes": 1}, {"author": "Recursive Triforce", "text": "Shorter and more pythonic:\n\ns = sum(len(i) for i in test_data)\nprint(s/len(test_data))", "likes": 1}]}, {"topLevelComment": {"author": "Arun Ramachandran", "text": "Can you please explain the cmap and the load_data() you used in keras, actually I'm new to machine learning.", "likes": 0}, "replies": [{"author": "Shyam Nehru", "text": "Load_data is used to download the datasets and store as train and test", "likes": 0}]}, {"topLevelComment": {"author": "Uldis Valainis", "text": "I have error: ValueError: A target array with shape (15000, 250) was passed for an output of shape (None, 1) while using as loss `binary_crossentropy`. This loss expects targets to have the same shape as the output.\nEverything is exactly as yours, how to fix this?", "likes": 0}, "replies": [{"author": "Yasmine Guemouria", "text": "@Uldis Valainis I know... I've been struggling for 2 months to get everything to work together for a school project but don't lose hope!! Good luck", "likes": 0}, {"author": "Uldis Valainis", "text": "@Yasmine Guemouria I found only more problems. The programms and frameworks you need for these projects are amazingly complicated. Numpy one version newer? Nothing works. Tensorflow released new update? Nothing works. Its amazing how they made everything non compatible. Its truly amazing.", "likes": 0}, {"author": "Yasmine Guemouria", "text": "did you find a solution for this please?", "likes": 0}]}, {"topLevelComment": {"author": "deg harbi", "text": "just work on a jupyter notebook", "likes": 0}}, {"topLevelComment": {"author": "John Keating", "text": "I spent 3days to watch and figure out the basic theory behind this tutorial, thank you very much~!", "likes": 4}}, {"topLevelComment": {"author": "Ganesha Kolar", "text": "sir what is adam optimizer can anyone brief me about that", "likes": 1}, "replies": [{"author": "Cyprien Ricque", "text": "It is all about gradient descent. When gradient descent is done without an optimizer (like adam) you have a risk which is : \"end in a local minimum\". Thanks to optimizer like Adam, differents methods are use to minimize the cost function and find the \"real\" minimum of your cost function. If you don't know what is gradient descent check out the channel StatQuest with Josh which is awesome", "likes": 0}]}, {"topLevelComment": {"author": "Toluwani Amos", "text": "Thank you so much Tim! \nAs a beginner into tensorflow and machine learning, you were so excellent and helped me grasp the basic tips!  Thank you again!! 😀", "likes": 2}}, {"topLevelComment": {"author": "Muhammad Faran", "text": "why we've 128 hidden layers?", "likes": 1}, "replies": [{"author": "B T", "text": "@Menghok Heak it's not a fixed thing (just like so many things in ML!) - should be around 10-20% of your input layers (which I think was 784 in the case) - hence 128(why, because hey, why not - 128 sounds like a good 2 to the power of 7, multiple). On a serious note, it's just ballpark number, change it to, say, 108 and see how it is different for you", "likes": 0}, {"author": "Menghok Heak", "text": "a little correction, it is \"128 neurons in the 2nd layer\" not 128 layers. However, i also have this question too, why 128 neurons? how to define the number of neuron in each layer?", "likes": 3}]}, {"topLevelComment": {"author": "Payton Z.", "text": "mine isn't working shoot", "likes": 0}}, {"topLevelComment": {"author": "Alex Stone", "text": "Make a chatbot :D", "likes": 0}}, {"topLevelComment": {"author": "Joshy-poo", "text": "if you want the longest length for the text classifier tut it's 2697 or use the code bellow\n\n\nlongest_length = 0;\r\njoinedlist = train_data + test_data\r\n\r\nfor i in joinedlist:\r\n    if len(joinedlist[i]) > longest_length:\r\n        longest_length = len(joinedlist[i])", "likes": 0}}, {"topLevelComment": {"author": "cALiBr0", "text": "quincy larson brought me here", "likes": 2}}, {"topLevelComment": {"author": "A K Shiwakoti", "text": "Lists and Arrays are very different data structures in the way they work during runtime. Lists are mutable objects, that is, one can add, replace, remove an element in a list whereas Arrays are immutable objects, that is, one cannot change data elements once an array has been created (you can delete the array entirely however). Lists can contain multiple types of data elements in multiple combinations, such as, a list inside a list inside a list, an array inside a nested list, a tuple, a dictionary, a string, an integer, a float, a timestamp, etc., whereas an Array must have all data elements of the same type. There are of course many other differences.", "likes": 1}}, {"topLevelComment": {"author": "Jeremy Demers", "text": "Anyone getting the following error? model.add(keras.layers.Embedding(1, activation='sigmoid'))\r\nTypeError: __init__() missing 1 required positional argument: 'output_dim'", "likes": 0}}, {"topLevelComment": {"author": "Kratio", "text": "Why is shrinking down the 255 rgb values to between 0 and 1 any better ? Isnt it still gonna have the same range of values to account for all the colours, so it doesnt really make a difference right... ?", "likes": 0}}, {"topLevelComment": {"author": "Kratio", "text": "I wish it was clear which version of python supports which version of tensorflow...", "likes": 0}}, {"topLevelComment": {"author": "Sadam Abbasi", "text": "Next series ---->ChatBot", "likes": 0}}, {"topLevelComment": {"author": "SuperDonElio", "text": "Flattening the input leads to a loss in information in the sense that geometrical dependencies are not retrievable. Usally this is solved by a convolutional layer (which is commonly used in image recognition). There is nothing wrong with choosing a simpler example in a tutorial but imo you should not give the impression that this is normal. \nIn addition lists and arrays are not interchangeable since they are different data structures.", "likes": 1}}, {"topLevelComment": {"author": "S D", "text": "Make object detection tutor..!", "likes": 0}}, {"topLevelComment": {"author": "Aman Singh", "text": "In the imdb example , when I call model.fit(), I get the following error - \n\n\nValueError: Failed to convert a NumPy array to a Tensor (Unsupported object type list)\n\n\nAnyone else got this?", "likes": 0}, "replies": [{"author": "Aman Singh", "text": "@Jeremy Demers I have numpy==1.16.1 installed on my system . I believe this point was either covered in the lecture or I read somewhere so I already did that. If there is any other workaround which I could try, please let me know. Thanks !", "likes": 0}, {"author": "Jeremy Demers", "text": "You need to have numpy==1.16.1 installed. Newer versions cause issues", "likes": 0}]}, {"topLevelComment": {"author": "Wurstfinger1337", "text": "He looks like this weird ass guy from the Netflix Scream series.", "likes": 0}}, {"topLevelComment": {"author": "saikumar reddy Atluri", "text": "Thanks for this series we need more series of videos on tensorflow 2.0", "likes": 1}}, {"topLevelComment": {"author": "Mohan J", "text": "please allow adds on this channel , it worth.", "likes": 0}}, {"topLevelComment": {"author": "Andrew Tate", "text": "2:07 maybe chatbot? Yes bro pls.. My pathetic try to make it +1 for NN chatbot", "likes": 15}}, {"topLevelComment": {"author": "scarFacë", "text": "Guys, please suggest me best resources to develop a chatbot for restaurant using tensorflow and nltk. Please help me out. I really need your help. Thank you", "likes": 1}}, {"topLevelComment": {"author": "Aaron Aben Danan", "text": "Amazing tuto :D\n1:50:27 - Why do you  put \"predict[0]\" and not \"predict\"? Why do we have a shape of the predict variable equal to 250?", "likes": 4}, "replies": [{"author": "srinivasan srivathsan", "text": "@Fabian Tan it shouldn't be predict[0] right rather it should be print(predict) since we are finding out whether sentence as a whole is having positive reviews or not .\n\n\nbut it prints size of 250 values instead of single value.\n\n\ncan u elobrate a bit more ?", "likes": 0}, {"author": "Fabian Tan", "text": "it should be this way\npredict = model.predict(test_data)\nprint(\" Prediction: \", predict[0])\nprint(\" Actual: \", test_labels[0])", "likes": 0}, {"author": "Fabian Tan", "text": "@Doc  Here, predict[0] will only predict on the first item of the sentence/list. However, in this example, we are supposed to predict the class for the entire sentence whether it is positive or negative review, and not the individual token", "likes": 0}, {"author": "Doc", "text": "the variable \"predict\" is a list so predict[0] is the first item in this list. This is what you want to predict the label on.", "likes": 2}, {"author": "Yu Liu", "text": "I have the same question, can somebody answer?", "likes": 0}]}, {"topLevelComment": {"author": "TheDeadSource", "text": "A lot of people are asking what versions of python and windows can be used to run TensorFlow 2.0. I've dug into this for you all. A lot of info is from the official site, some is from github issues and published articles regarding TF 2.0, so at the time of writing this should be accurate information.\n\nFirst, operating systems. TF 2.0 was tested and is officially supported on the following *64-bit* systems:\n * Windows 7 or later.\n * Ubuntu 16.04 or later.\n * macOS 10.12.6 (Sierra) or later - note that these versions do not offer GPU support.\n * Raspbian 9.0 or later.\n\nPython versions that are currently supported are:\n * Python 3.6 (but NOT Python 3.7, despite its recent release.)\n * Python 2.7.", "likes": 1}}, {"topLevelComment": {"author": "Seeker44", "text": "What are prerequisites? Please mention it for all videos", "likes": 1}}, {"topLevelComment": {"author": "fgarnold", "text": "Fwiw:  Sigmoid is not one specific function, but a class of functions that plot roughly as a flattened S.  Not all map to a range of (-1,1).  The most commonly used sigmoid is the 'logistic function' which maps to (0,1) - good for feeding into probability distributions.  The activation function used in this video could be a hyperbolic tangent, an error function, etc.  A visit to the Sigmoid function page on Wikipedia might be helpful.", "likes": 0}}, {"topLevelComment": {"author": "woah far out", "text": "Is anyone else getting thousands of \"======================================\" signs from the terminal on the model.evaluate?", "likes": 4}, "replies": [{"author": "Julian Brookstone", "text": "Yup. No idea why..", "likes": 0}, {"author": "Pablo De Nadai", "text": "Console outputs \"TypeError: cannot unpack non-iterable numpy.float64 object\" - did you find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "Bryan Chen", "text": "is it possible to build an autoencoder on a RNN/attention with an embedding layer?", "likes": 0}}, {"topLevelComment": {"author": "Bryan Chen", "text": "very good tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Zheng Tzer Lee", "text": "Recommendation system", "likes": 1}, "replies": [{"author": "Jig Saw", "text": "Linux", "likes": 0}]}, {"topLevelComment": {"author": "Nive Yoga", "text": "I love you!", "likes": 0}}, {"topLevelComment": {"author": "Ritu Kumar", "text": "Great tutorial!", "likes": 1}}, {"topLevelComment": {"author": "Sajjad Dehghani", "text": "Great explanation, thanks", "likes": 0}}, {"topLevelComment": {"author": "Regele IONESCU", "text": "According to many estimates, the human brain contains around 100 billion neurons (give or take a few billion)", "likes": 0}}, {"topLevelComment": {"author": "Chris Hawkes", "text": "Nice video!  I'm trying to get into machine learning but I hate how it requires and NVIDIA graphics card.   Even a Macbook can't get enough performance out of the box for it.  I feel like there must be some other way.", "likes": 5}, "replies": [{"author": "ach maliki", "text": "@Mahesh Thapa yeah i agree with this, u can use g colab", "likes": 0}, {"author": "Mahesh Thapa", "text": "Chris Hawkes can use google colab", "likes": 0}]}, {"topLevelComment": {"author": "Amaan Durrani", "text": "You can save your model like this and reuse it to save your time.\n\nmodel.save('abc.h5')\r\nmodel = keras.models.load_model('abc.h5')", "likes": 4}}, {"topLevelComment": {"author": "Amaan Durrani", "text": "Why dont you save your model instead of running epochs again n again.", "likes": 0}}, {"topLevelComment": {"author": "scarlet", "text": "How do you know everything?", "likes": 0}}, {"topLevelComment": {"author": "Rahul Mishra", "text": "At 18:30  you explained about sigmoid function but Its hyperbolic tangent function or tanh", "likes": 0}}, {"topLevelComment": {"author": "Seku Drame", "text": "Thanks freecodecamp, you guys have no idea how this stuff mean to people like me... Forever grateful \nBrilliant instructor 👌🏿🙏🏿🙏🏿🙏🏿", "likes": 11}}, {"topLevelComment": {"author": "Álvaro Sánchez", "text": "19:25\nThis is not the sigmoid function as you say in the video. This is the hyperbolic tangent. The sigmoid function maps any value between 0 and 1, not between -1 and 1.", "likes": 21}, "replies": [{"author": "Khalid M", "text": "​@Álvaro Sánchez Wikipedia says it's a sigmoid function:\n\"Sigmoid functions most often show a return value (y axis) in the range 0 to 1. Another commonly used range is from −1 to 1.\"\nI believe it is called the 'Gauss error function\". However, I believe that hyberbolic tangent is also sigmoidal.", "likes": 0}, {"author": "AstroTibs", "text": "​@Álvaro Sánchez As I learn more about this topic, I've discovered that \"sigmoid\" is just the common term used in this field to refer to the logistic. It's like how astronomers use \"metal\" to refer to any element that's not H or He—both cases are correct as long as one understands that they're specialized.", "likes": 3}, {"author": "Álvaro Sánchez", "text": "​@AstroTibs it depends. Some texts use the term sigmoid function as a synonym for logistic function. But it's also true that when you say \"a sigmoid function\" (as he says in the video) you could be referring to a family of functions (as you are saying). So it is true that my criticism is wrong from that point of view. I hadn't seen it from that point of view. Thanks for make me notice it.", "likes": 1}, {"author": "AstroTibs", "text": "Sigmoid is a _category_ of function. The hyberbolic tangent is a sigmoid function. So is the logistic function, which is the one you're assuming he's referring to.", "likes": 2}, {"author": "NL", "text": "Just for the people who may have been confused", "likes": 0}]}, {"topLevelComment": {"author": "Ezz iOO", "text": "Sir i am 17 years old and I have alot interest in programming even i do codings which mostly crashed and i have dropped out of my regular college to pursue a career in machine learning i discovered ur channel and now i am confused how to take start please guide me if u receive my comment and which language should i go through first. Thank You", "likes": 0}, "replies": [{"author": "Ezz iOO", "text": "@onimaru0612 thank u i`ve started python through the videos of this channel and glad to have a proper guide will try to get in touch with u guys until my newbie level ends.. Thank u once again", "likes": 0}, {"author": "onimaru0612", "text": "This is the era of python, so you should start with it. Then, after finishing newbie level (you will know it in your heart), start doing some numpy, control multi dimension array. When you have some numpy, you can easily learn pandas and matplotlib. At that time you are ready for machine learning, do some sklearn, then dive into deep learning. You can learn some data crawling or web making between that progress, but aim to deep learning and AI, never forget it.", "likes": 0}]}, {"topLevelComment": {"author": "Joan Solé Roig", "text": "I have a question, when I open python 3 it does not say i am in c:/user and so on... and therefore i can not move through folders or anything. What should I do?", "likes": 0}}, {"topLevelComment": {"author": "Erik Uden", "text": "*For all the people who have trouble installing TensorFlow via Pip even though virtialization is enabled:*\n\nIf you have Anaconda installed you can *only* install via Pip if you use Anaconda Prompt! Otherwise it won't work! This is very important I've spend hours figuring this out!", "likes": 108}, "replies": [{"author": "M. Oktoluqman Fakhrianto", "text": "To make sure anaconda install tensorflow with python 3.7, you create you environment with\nconda create -n tf python=3.7 jupyter tensorflow\nit works for me.", "likes": 0}, {"author": "Douglas Trevino", "text": "@Kid Pog 3D If you are running Anaconda you don't have to downgrade. Create your conda virtual environment as I said above and set the version level like Sanson Rifi pointed out. Conda venv allows multiple python installations to coexist on the same platform without interfering with each other or the default system installation.", "likes": 0}, {"author": "Kid Pog 3D", "text": "1: install pthon 3.7 (not 3..8 bcz it wont work)\n2. if you run 3.8 then uninstall or downgrade\n3. install pip trough their website (google how to do it)\n4. make sure your libs folder is in Windows /.. PATH (you can also google this)\n\nI ran into all of these things before i even could start to install tensorflow", "likes": 0}, {"author": "Douglas Trevino", "text": "Sanson Rifi is correct. On my system, it defaulted to 3.8 but depending on your installation the conda install might try to install an earlier version and it won't work. If you are not sure about your existing setup, set the python version for the installation.", "likes": 0}, {"author": "Sanson Rifi", "text": "Douglas Trevino That worked for me too. Do also remember to set your python version to 3.7 max, as TF is not compatible with v3.8", "likes": 1}]}, {"topLevelComment": {"author": "Chris Jordan", "text": "Hi folks\nWho can help me I building website \nHome -services -about- contact\nIn service is a table button indeed 45 services must show in table button.\nI will appreciate your help\nThanks", "likes": 0}}, {"topLevelComment": {"author": "Jordan Moore", "text": "I'm excited to learn this with Tim! He taught me Java thoroughly!", "likes": 19}}, {"topLevelComment": {"author": "Vasyl Pavlus", "text": "Can I run TensorFlow 2.0 (or any other version) on Win 7x86 / Python 3.7? Thanks.", "likes": 1}, "replies": [{"author": "Recursive Triforce", "text": "Probably...\n\nPlease don't use Windows 7!", "likes": 1}]}, {"topLevelComment": {"author": "Arun CM", "text": "Nice video. Can you create a video on AI chatbot, which can be integrated to a web page", "likes": 3}}, {"topLevelComment": {"author": "Sumit Verma", "text": "related to \n\nfinance please please .....", "likes": 0}}, {"topLevelComment": {"author": "鳖载着理发店", "text": "excited about your tutorial！！！！", "likes": 0}}, {"topLevelComment": {"author": "Colin Rey", "text": "Best beginner tutorial on entire Youtube!! Thank you so much! Very good explained.", "likes": 0}}, {"topLevelComment": {"author": "Jim Boli", "text": "Python legends (continue the list):\n   - Tech With Tim\n   - Sentdex\n   - Siraj Raval", "likes": 8}, "replies": [{"author": "Kiran Shah", "text": "@ggvvv I am totally agree with you", "likes": 0}, {"author": "ggvvv", "text": "Siraj is fake. He is clueless about pretty much everything he talks about. Somebody else prepares the work and he just presents it.", "likes": 4}, {"author": "Roland Löchli", "text": "Mike Dane", "likes": 0}, {"author": "Ahbar Ahad", "text": "sentdex tops the list", "likes": 0}, {"author": "Sifundo Mhlungu", "text": "Dr chuck(python for everybody)", "likes": 1}]}, {"topLevelComment": {"author": "Ford", "text": "Thank you", "likes": 1}}, {"topLevelComment": {"author": "Maor Yatskan", "text": "at 00:37:00 255 represents white and 0 represents black.\nGreat video! keep it up.", "likes": 2}}, {"topLevelComment": {"author": "TOBA TEK SINGH", "text": "Great video for coding", "likes": 0}}, {"topLevelComment": {"author": "d Maisnam", "text": "Hey a small suggestion. When you provide the timeline of topics in the description, plz make them clickable for easier and faster access", "likes": 0}, "replies": [{"author": "Matthew W", "text": "+1 for the ‘plz’, but when you’re requesting an additional feature for your convenience, it doesn’t hurt to show a little gratitude for what has already been provided or a preemptive ‘thank you’ for what you want. Thank you.    - the ‘Please & Thank You Police’", "likes": 0}]}, {"topLevelComment": {"author": "Chowa C", "text": "please do in image classification series", "likes": 1}}, {"topLevelComment": {"author": "Pixel", "text": "PyTorch *CoughCough*", "likes": 0}}, {"topLevelComment": {"author": "Thomas Goodwin", "text": "Thank you. Your explanations often cover basic ground glossed over in ... just about every other ai tutorial I've seen. btw .. verbose is the opposite of quiet, say. everything. Leave nothing unsaid. Opoligies if this explanation is both too late and perhaps too.. errr.. verbose.  Further pendantic utterences as required, and so forth and so on..", "likes": 0}}, {"topLevelComment": {"author": "moa moa", "text": "Very good video ....", "likes": 0}}, {"topLevelComment": {"author": "Maratimus Lion", "text": "*Thank you so much*", "likes": 0}}, {"topLevelComment": {"author": "Jose Ortiz", "text": "Oooo awesome man! I literally just saw a video from your main channel I'm assuming! Awesome content my friend. Im trying to familiarize myself with the AI community on YouTube. Have a good one!😃👍", "likes": 1}}, {"topLevelComment": {"author": "Nishant Singh", "text": "Thank You FreeCodeCamp you people know what I want . I was just about to give ₹15000 for learning this this .\nThanks I love you❤😄", "likes": 13}}, {"topLevelComment": {"author": "WASD", "text": "what is the sketch program called", "likes": 0}, "replies": [{"author": "Owen Page", "text": "It's the windows inking program", "likes": 1}]}, {"topLevelComment": {"author": "Wolf Rage", "text": "Excellent video, well done", "likes": 0}}, {"topLevelComment": {"author": "Case White", "text": "cool maybe i can use it to work through cicada 3301", "likes": 1}}, {"topLevelComment": {"author": "gaddafi M", "text": "⭐ course contents ⭐\n(0:00:00) what is a Neural Network?\n(0:26:34) Loading & Looking at Data\n(0:39:38) creating a model\n(0:56:48) using the model to make predictions\n(1:07:11) Text Classification p1\n(1:28:37) what is an Embedding Layer? Text Classification P2\n(1:42:30) Training the model - Text classification P3\n(1:52:35) saving & Loading Models - Text Classification 4\n(2:07:09) How to install Tensorflow GPU on Linux\n--\n\nLearn to code for free and get a developer job:", "likes": 315}, "replies": [{"author": "arpita", "text": "I hate u.. i also came up with that.", "likes": 0}, {"author": "average c# hater", "text": "WOW WOW You copied the description.", "likes": 0}, {"author": "Fairuz A N", "text": "thanks dude!!", "likes": 0}, {"author": "Saravana Kumar", "text": "Thanks you", "likes": 1}, {"author": "az chen", "text": "Well, ppl can click on the timestamps here, so I think it is kind of useful.", "likes": 3}]}, {"topLevelComment": {"author": "Tech With Tim", "text": "Hope you guys liked it! If you want more machine learning and AI tutorials check out my channel 🔥", "likes": 343}, "replies": [{"author": "mcmormus", "text": "Liked it  a lot. But!... Too long. Could you please Split the future videos in smaller parts? I don’t have the time and the concentration to follow you for the hole time. Would be much easier if we could come back and watch the next video.", "likes": 0}, {"author": "droidprogrammer646", "text": "Hey tim please change the first function you demonstrated as tanh rather than sigmoid. Because sigmoid maps from 0-1 and tanh maps from -1 to 1.", "likes": 0}, {"author": "Eksno", "text": "@Roman Roman Thanks", "likes": 0}, {"author": "Roman Roman", "text": "@Dale Jones try to use \"pip install tensorflow\", now 2.0.0 is stable version", "likes": 0}, {"author": "Sefater Gbashi", "text": "This was so very useful to me! I really appreciate your time, efforts and generosity. God bless you!", "likes": 0}]}, {"topLevelComment": {"author": "Carl", "text": "Unfiring?", "likes": 1}}, {"topLevelComment": {"author": "Himanshu Verma", "text": "Please explain MNIST data set??", "likes": 0}, "replies": [{"author": "Jose Ortiz", "text": "The MNIST database (Modified National Institute of Standards and Technology database) is a large database of handwritten digits. I believe there are 60,000 samples each with labels that tell you what number it really is. Its pretty much used as the \"Hello World\" of Deep Learning. I'm creating a video on it on my channel soon. Check it out 😊👍", "likes": 2}]}, {"topLevelComment": {"author": "Samran Uppal", "text": "TIM <3", "likes": 0}}, {"topLevelComment": {"author": "hilty", "text": "Full Machine Learning For Finance - Quantitative Trading for Beginners (2019) PLEASE!!!", "likes": 18}, "replies": [{"author": "Justice Gugu", "text": "@AlexCell33 What are the steps to learn machine learning for finance?", "likes": 0}, {"author": "AlexCell33", "text": "You don’t need machine learning, just basic regression and statistical models. Oh yeah, and tens of thousands of dollars a month in obscure and alpha generating data feeds. Or co locate a server at a stock exchange and front run the guys running the models.", "likes": 1}]}, {"topLevelComment": {"author": "Hemanth Kotagiri", "text": "Oh man, Thank you so much, Tim! I also follow your channel!", "likes": 0}}, {"topLevelComment": {"author": "Kamal Pandey", "text": "Thanks for the video. How to calculate error in the text classification one. How can we split the dataset in test train validation one. Do all of those contains the label? and how to test the model on new different datasets. I am new to this subject.", "likes": 0}}, {"topLevelComment": {"author": "Trialing God", "text": "this is the best tentorflow tutorial hand down", "likes": 0}}, {"topLevelComment": {"author": "Mr. Tech Guy", "text": "Thank you sooooo much for this tutorial!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Alphabet", "text": "Convolutional Neural Network", "likes": 0}}, {"topLevelComment": {"author": "Programming with Peter", "text": "Pretty neat, tensor flow grow so much", "likes": 0}}, {"topLevelComment": {"author": "JAVAAID - Coding Interview Preparation", "text": "Nice video", "likes": 0}, "replies": [{"author": "JAVAAID - Coding Interview Preparation", "text": "@Narendra Reddy YarramreddyYarramreddy sure.", "likes": 0}, {"author": "Narendra Reddy Yarramreddy", "text": "@JAVAAID - Coding Interview Preparation Yes, keep your good work going...", "likes": 0}, {"author": "JAVAAID - Coding Interview Preparation", "text": "@Narendra Reddy Yarramreddy is it?..sounds interesting.\nWe should always learn from each other.\nKeep learning, keep coding..!!", "likes": 0}, {"author": "Narendra Reddy Yarramreddy", "text": "LOL! pretty surprised, just seen a video on your channel 2 hours ago.", "likes": 0}]}, {"topLevelComment": {"author": "Usman", "text": "2nd", "likes": 0}, "replies": [{"author": "Cat4-7", "text": "4th is you", "likes": 0}]}, {"topLevelComment": {"author": "Bhuvanesh s.k", "text": "When will this be added to Conda...? 😭 Can't wait....", "likes": 5}, "replies": [{"author": "C .F", "text": "Erik Uden ...to work offline😂 .. 🐣It works fantastically perfect😎", "likes": 0}, {"author": "Erik Uden", "text": "Why would you need conda if you have Google colab?", "likes": 0}]}, {"topLevelComment": {"author": "Debojyoti Chakraborty", "text": "great content.", "likes": 1}}]}