{"video": {"id": "74NW-84BqbA", "title": "Data Structures For Python Developers (w/ Flask) - Course", "description": "Learn about basic data structure concepts by building a Flask API with Python.\n\n💻 Code: https://github.com/selikapro/FlaskDS\n\n✏️ Course created by Georgio Tunson. Check out his channel: https://www.youtube.com/channel/UC5UgemAz061hkjTFHOfxNpg\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Intro\n⌨️ (0:01:02) Install Python & Flask\n⌨️ (0:06:05) Database Setup & API Skeleton\n⌨️ (0:20:22) Install Database Browser\n⌨️ (0:29:51) Linked List\n⌨️ (0:33:04) Install Postman\n⌨️ (1:31:35) Hash Table\n⌨️ (2:06:35) Binary Search Tree\n⌨️ (2:40:12) Stacks and Queues\n\nLinks for installing necessary dependencies:\n🔗 Python Install: https://www.python.org/\n🔗 Flask Install: https://flask.palletsprojects.com/en/1.1.x/installation/\n🔗 Flask-SQLAlchemy: https://flask-sqlalchemy.palletsprojects.com/en/2.x/\n🔗 Sqlite3 DB Browser: https://sqlitebrowser.org/dl/\n🔗 Postman Install: https://www.postman.com/downloads/\n🔗 Dummy Data Script: https://github.com/selikapro/FlaskDS/blob/master/generate_dummy_data.py\n\nVideo Resources:\n🔗 Binary Search Explained: https://www.youtube.com/watch?v=UQ1_sQ0_E8M\n🔗 Recursion Explained: https://www.youtube.com/watch?v=LrQjMY0eWC0\n\nGeorgio's Links:\n🔗 Twitter: https://twitter.com/selikapro\n🔗 Instagram: https://www.instagram.com/selikapro\n\n🎉 Thanks to our Champion supporters:\n👾 Otis Morgan\n👾 DeezMaster\n👾 Katia Moran \n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT3H13M21S", "likes": "6300", "views": "284487"}, "comments": [{"topLevelComment": {"author": "kaushik pilligundla", "text": "RuntimeError: Working outside of application context.\n\nThis typically means that you attempted to use functionality that needed\nthe current application. To solve this, set up an application context\nwith app.app_context(). See the documentation for more information.\n\ndb.create_all() won't work for me,  I see this error. Can someone help?", "likes": 0}}, {"topLevelComment": {"author": "maxhauler", "text": "Anyone else use Pyenv? I only use Pyenv. In a given month I need to use 2 or 3 different versions of Python and maybe 6-8 VEs. Pyenv is the only way to do it right.", "likes": 0}}, {"topLevelComment": {"author": "Cristian Medina", "text": "At 1:31:05, does anybody have this error? sqlalchemy.orm.exc.UnmappedInstanceError: Class 'builtins.NoneType' is not mapped\nI did add in my code the \"cascade\" thing but it looks like it doesn't have to do with it.", "likes": 0}, "replies": [{"author": "Cristian Medina", "text": "It was a silly mistake. I was trying to delete some user that was no longer in the DB.", "likes": 0}]}, {"topLevelComment": {"author": "Sarah", "text": "Georgio, this is just beautiful. You are a treasure, sir. Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Chat +¹⁹⁰⁹⁵²⁹¹¹⁷¹ en whatspp", "text": "☝️👆👆\nGracias al contacto en la parte superior por ayudarme a hackear la cuenta de mi compañero infiel.", "likes": 1}}, {"topLevelComment": {"author": "Chat +¹⁹⁰⁹⁵²⁹¹¹⁷¹ en whatspp", "text": "☝️👆👆\nGracias al contacto en la parte superior por ayudarme a hackear la cuenta de mi compañero infiel.", "likes": 1}}, {"topLevelComment": {"author": "Parth Shroff", "text": "For the search method in the binary search tree why do we compare the data in the base case as well as left/right node in the if else statement?", "likes": 0}}, {"topLevelComment": {"author": "Total coding", "text": "Really good content❤. just take a momement and appreciate him. ¯\\_(ツ)_/¯ lol! Really good content❤. just take a momement and appreciate him.", "likes": 0}}, {"topLevelComment": {"author": "Brian Whitehurst", "text": "when i go to run server.py i don't receive any errors but i also do not get:\n\"Serving Flask app \"server\"(lazy loading)\nEnvironment: production\ndebug Mode: On\n \netc...\n\nso i don't have the IP to copy and paste into Postman.  Any tips?\ni am using VS Code", "likes": 0}}, {"topLevelComment": {"author": "j n sound", "text": "খুব সুন্দর একটা ভিডিও", "likes": 0}}, {"topLevelComment": {"author": "Elliot Duncan", "text": "stuck at 21:34. when I enter \"db.create_all()\" I get an error: \"sqlalchemy.exc.NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:sqlite3\". what do I do?", "likes": 0}, "replies": [{"author": "Spark", "text": "Same here let me know if you solved it", "likes": 0}]}, {"topLevelComment": {"author": "Diego Avendaño Hernandez", "text": "One of the best videos for learning data structures", "likes": 1}}, {"topLevelComment": {"author": "mohamed martini", "text": "Demos about mid-level skills should not start from installing Python. If you don't have Python installed and you don't even know how to install it, chances are you don't know what data structures or flask are, and your're not gonna watch this video.\n\nJust a friendly note.", "likes": 1}}, {"topLevelComment": {"author": "Emmanuel Constant", "text": "freecodecamp Data Engineering video? possibility?", "likes": 0}}, {"topLevelComment": {"author": "Bithi Bithi", "text": "Wonderful vedio.", "likes": 0}}, {"topLevelComment": {"author": "e learn", "text": "at 7:13 you mentioned about taking a look in Flask object, I am using VS code, how do I check that?", "likes": 1}, "replies": [{"author": "Spark", "text": "Put your cursor on Flask instance and press F12 button.", "likes": 0}]}, {"topLevelComment": {"author": "zaorojunior kolie", "text": "comment faire un don? c'est grave que je parviens à assimiler ces ours de data", "likes": 0}}, {"topLevelComment": {"author": "Pravat Palo", "text": "Comment", "likes": 0}}, {"topLevelComment": {"author": "The Mission Podcast", "text": "i absolutly adore how easy this is to follow if you're on windows", "likes": 0}}, {"topLevelComment": {"author": "sam Arbid", "text": "insert_at_end func should check if the last node is not None other wise you will get an error!\nit should be like that:\n\n    def insert_at_end(self, data):\r\n        if self.head is None:\r\n            return\r self.insert_beginning(data)\n\n        if self.last_node is None:\r\n            node = self.head\r\n            while node.next_node:\r\n                node = node.next_node\r\n            node.next_node = Node(data, None)\r\n            self.last_node = node.next_node\r\n        self.last_node = self.last_node.next_node", "likes": 0}}, {"topLevelComment": {"author": "Joshua Marcano", "text": "Postman refuses to open for me. Seems to be a common issue for windows and Linux. I'm going to have to use web version because I don't have all day to deal with it. Thanks for this video", "likes": 0}}, {"topLevelComment": {"author": "Joshua Marcano", "text": "What plug-in are you using to view docs in vim?  Use Shift-K but my docs don't appear the same as yours", "likes": 2}}, {"topLevelComment": {"author": "plepleple", "text": "why don't you use ___str___ or ___repr___ in your classes? in linked list example there would be no need to run any loop to print all nodes when printing linkedList obj :)", "likes": 0}}, {"topLevelComment": {"author": "TOTN CSE", "text": "Awesome. Very clear explanation. I liked the consistent tone throughout and how neatly everything was organised.", "likes": 0}}, {"topLevelComment": {"author": "Anthony McClay", "text": "Thank you for showing an implementation of LinkedList through Data Structures, but ....\n\nAs an Technical Architect or Development lead, \nI would never ask a programmer to implement a Linked List Sort, Bubble Sort or any sort algorithm..  So much easier to use a Collections Library to execute sort.  chances are they handle out-of-memory conditions for large Datasets.  \n\nIs the goal is too sort, chances are the sorting in the Database, even SQLLite, will have a better \"memory and other resource:, faster implementation of sorting.\n\neven if it requires research and education, it should product a better implementation.", "likes": 0}}, {"topLevelComment": {"author": "Anthony McClay", "text": "Thank you for showing an implementation of LinkedList through Data Structures, but ....\n\nAs an Technical Architect or Development lead, \nI would never ask a programmer to implement a Linked List Sort, Bubble Sort or any sort algorithm..  So much easier to use a Collections Library to execute sort.  chances are they handle out-of-memory conditions for large Datasets.  \n\nIs the goal is too sort, chances are the sorting in the Database, even SQLLite, will have a better \"memory and other resource:, faster implementation of sorting.\n\neven if it requires research and education, it should product a better implementation.", "likes": 1}, "replies": [{"author": "Claudio Panone", "text": "As an amateur programmer I agree on that, i was looking for that comment actually", "likes": 0}]}, {"topLevelComment": {"author": "#暗号通貨 ジャスミー 仮想通貨【投資家の投資・副業大学】", "text": "Pay attention, wonderful every day", "likes": 1}}, {"topLevelComment": {"author": "Wai Ho Choy", "text": "Does this also work for \"_search_recursive\"? I let the recursion go all the way down to None, which meant an additional node to check, but less IF statements\n\n  def _search_recursive(self, blog_post_id, node):\n        # base case: if node is None, return false\n        if node is None:\n            return False\n\n        node_id = node.data[\"id\"]\n\n        # on match, return node.data\n        if int(blog_post_id) == int(node_id):\n            return node.data\n\n        # if target id < current_node.data.id, search left\n        if (blog_post_id < node_id):\n            return self._search_recursive(blog_post_id, node.left)\n\n        # if target id > current_node.data.id, search right\n        if (blog_post_id > node_id):\n            return self._search_recursive(blog_post_id, node.right)", "likes": 0}}, {"topLevelComment": {"author": "Toshiro Nifume", "text": "I am doing CS50 and your course helped me a lot to visualize these data structures and see them in action. Great content! Thx", "likes": 4}}, {"topLevelComment": {"author": "Colm Sweeney", "text": "Does anybody know why I might be getting a \"TypeError: 'NoneType' object is not subscriptable\" when I try to create a blog post? There seems to be something wrong with the add_key_value function but I wrote it the same way as in the video.", "likes": 0}, "replies": [{"author": "Colm Sweeney", "text": "My error was in postman the body was being sent in as text and not JSON. Will leave this here in case anyone has the same issue.", "likes": 0}]}, {"topLevelComment": {"author": "charles selrachski", "text": "so like in nim this would be like 1000 times faster?", "likes": 0}}, {"topLevelComment": {"author": "សេង ហ៊ាង", "text": "អរគុណ", "likes": 0}}, {"topLevelComment": {"author": "Siddharth Kshirsagar", "text": "this is one of the best course for DSA thanks..", "likes": 0}}, {"topLevelComment": {"author": "Tube X", "text": "there are some books like the data structures and its application and how can you see inside how to use data structure with your applications", "likes": 0}}, {"topLevelComment": {"author": "Sotiri Georgiou", "text": "Such an underrated course.. its brilliant!", "likes": 0}}, {"topLevelComment": {"author": "Philippe Verdy", "text": "Please add a note that your \"custom_hash\" function is completely dysfunctional, with a severe statistic overponderation on the LAST character(s) of ANY key. This occurs because you multiply by ord(i), which is the byte value of the last scanned character: imagine this last byte is a big-enough power of 2, when you multiply by it, and then take the \"modulo table_size\"; if this table_size is a power of 2, you always get 0 in the final hash (which means that all these keys will fill the collision list on the 1st bucket of the hash table, which then degenerates into a single long linked list, and so you loose ALL the interest of hash tables in terms of CPU time)! So your example function is mostly hashing only the end of strings (it has many more collisions for very different contents of the beginning of input key strings than there are collisions for the same variations at end of input key strings).\n\nThe same happens for EVERY table_size value, when it can be a multiple of a byte value. Note also that the byte value 0 of characters found in keys will cancell all accumulated hash value from the beginin of the string (independantly of the content and length of this start of string).\n\nIn a course about hash tables, the \"custom hashing function\" MUST respect a flattened distribution of its output bits, for every possible table size (see Knuth for modular hashing functions): every implementer of hash tables MUST learn how to build CORRECT hashing functions... this was not your case, sorry, but please don't tell others to imitate when you did!\n\nHERE IS THE FIX: Instead of multiplying by ord(i) in function custom_hash, you MUST multiply by a large enough ODD integer constant, and preferably a prime, so that it cannot be a multiple of table_size (e.g. 8171=largest 13-bit prime, 16301=largest 14-bit prime, 32707=largest 15-bit prime): this will lways work with any table_size lower than this prime constant (and will work very well for hashing series of bytes of variable length, like text strings). Many simple examples in Java, C or C++ just use one of 17, 67, 127, 129 or 257 as the prime multiplier for their simple modular hashing function. [Multiplying by integer constants of the form (2^n-1) or (2^n+1) is very simple to compute on the most modest CPUs without an efficient multiplication instruction and without any \"barrel-shifter\", just by using a few integer additions]. In all cases, using a good constant multiplier will even be FASTER then your code using a variable multiplier.\n\n\r\nAs well a good string hashing function should use the total length of the source string as one of its input [if this requires scanning the string, like in C/C++ null-terminated strings used by str*() functions in the classic C library, just hash bytes and count them until you find the terminating null byte, then use the count as an additional value to add to the result, before it is truncated to modulo the table_size; but you may terminate the scan early by only scanning and hashing the first 256 bytes at most for practical cases, to limit the time to compute the hash on very large keys, such as the binary contents of files like images, or videos, but in general those files should have already metadata containing a strong enough hash should as SHA1 or SHA256].\n\nNote that hashing string can even be faster by reading groups of bytes into single 32-bit or 64-bit integer value before adding this value to the hash and multiplying the result it by the prime constant (this saves the cost of multiplications, which may be slower than packing group of bytes into a 32-bit or 34-bit value, possibly accelerated when all strings are allocated in blocks allocated on 32-bit or 64-bit address boundaries, and when their allocated buffer always includes extra \"ward\" null bytes stored at end of the allocated memory, instead of having any odd buffer sizes, in order to avoid memory access exceptions when reading a few bytes past the end of buffers: these ward bytes must however be initialized to zeroes, and may eventually be protected against write accesses after their initialization, if there's ever some hardware support for it).\n\nHash tables in default simple implementations used in C++ standard libraries, Java, .Net/CLI, PHP, Lua, Python, Lisp... all use a Knuth modular algorithm by multiplying by a good prime (\"good primes\" should be fixed-width integer constants having roughly the same number of bits set to \"1\" as the number of bits set to \"0\", considering also that the least significant bit is necessarily a \"1\", because all primes larger than 2 are necessarily odd integers).\n\nyou may use more flattened distributions using secure digests, including MD5 or SHA1 (even if they are deprecated for strong security usages, in favor of SHA2 algorithms like SHA256, SHA384, SHA512), but at the price of being a slower to compute (even if there are good implementations in most OSes and libraries, already using accelerated instructions of CPUs or GPUs); some CPUs also include their own accelerated digest-computing instructions (which may use something else than modular arithmetic based on additions/multiplication of integers, e.g. using products of polynoms, or accelerated FFT transforms, or one of the common computing or bit-shuffling passes used in wellknown security digests: computing a strong hash of arbitrarily long strings is also highly parallelizable, e.g. by using a good \"MAC\" function for recombining partial hashes computed in parallel from different segments of the input text, which is then processed in a Merkle tree)...\r\n\r\n\nThanks for this correction!", "likes": 5}, "replies": [{"author": "Patrick McDermott", "text": "this response taught me quite a lot, and I can see why you would need/should to use a constant odd prime number for the multiplication of ord, I appreciate the time you took to type it all out.", "likes": 0}]}, {"topLevelComment": {"author": "Citizen Of Earth", "text": "Thanks! Legends.", "likes": 0}}, {"topLevelComment": {"author": "Emad Tayefeh", "text": "Ver practical, please make more like this and thank you!", "likes": 0}}, {"topLevelComment": {"author": "Bug Hunter", "text": "02:36:29 We dont have to check {  if node.left.data[\"id\"] == blog_post_id  } or {  if node.right.data[\"id\"] == blog_post_id  }. Because when we call node.left or node.right recursively it is checked at the first condition as it is the main node of that function.", "likes": 1}, "replies": [{"author": "A k", "text": "ah yes, he finds that error a bit later at 02:38:56", "likes": 0}, {"author": "A k", "text": "yeah, I think we should instead check if node.left is None or not before accessing node.left.data", "likes": 0}]}, {"topLevelComment": {"author": "Kenichi Mori", "text": "Windows ready Flask 3/4", "likes": 0}}, {"topLevelComment": {"author": "Kenichi Mori", "text": "assignment.", "likes": 0}}, {"topLevelComment": {"author": "ThePaulCraft", "text": "I cant follow, because you are typing too fast", "likes": 0}}, {"topLevelComment": {"author": "Ram Sundar", "text": "This channel deserves billion subscribers", "likes": 0}}, {"topLevelComment": {"author": "Stefan Milicic", "text": "Aren't you creating two nodes at the beggining if seld.head is None, since you are not putting an \"else\" statement?", "likes": 0}}, {"topLevelComment": {"author": "Thịnh Phạm", "text": "So useful. Thanks and hope you make more video like this.", "likes": 0}}, {"topLevelComment": {"author": "Jitesh Kale", "text": "my blog_post table is not getting polulated with faker only user tables gets the data.\ncan someone help?", "likes": 0}, "replies": [{"author": "Jitesh Kale", "text": "got it missing db.session.comit opps", "likes": 0}]}, {"topLevelComment": {"author": "Rahul Chauhan", "text": "This tutorial would had been lot faster if you were using VScode instead of command line vim", "likes": 2}}, {"topLevelComment": {"author": "Carlos Jr", "text": "\"My name is Giovanni Giorgio, but everybody calls me Giorgio\"\n\nI could not help it xD", "likes": 15}}, {"topLevelComment": {"author": "Korudo", "text": "This is so well explained with practical examples. Top-tier tutorial. Thanks!", "likes": 1}}, {"topLevelComment": {"author": "Nate", "text": "wow this is gold.", "likes": 1}}, {"topLevelComment": {"author": "Abdirahman Yasin", "text": "This is such an amazing course. It opened my eyes on how to actually use data structures in real life taught. Very rare resource and I have successfully completed it. Thank you.", "likes": 4}}, {"topLevelComment": {"author": "Christian Orner", "text": "Should there not be a \"return\" in the insert_beginning function after the if condition? Otherwise, we insert the first node twice", "likes": 1}, "replies": [{"author": "Travis Pickle", "text": "i saw this too.. it was annoying me.. 😂", "likes": 0}]}, {"topLevelComment": {"author": "Valentin Fontanger", "text": "I have a question : Do we use a BST to store all blog posts because it's taking o(log(n)) to find a specific post instead of o(n) eventually ? Please, feel free to correct me :)", "likes": 0}, "replies": [{"author": "A k", "text": "I mean we already spent O(n) time to create that BST in the first place (and we create it every time we search, as far as I understand). So, we spend O(n) + O(log(n)) = O(n) time anyway. This is just demonstration of BST in edu purposes", "likes": 0}]}, {"topLevelComment": {"author": "theNurhusni", "text": "Hope there'll be something like this but for algorithms.", "likes": 0}}, {"topLevelComment": {"author": "Kantan Coding", "text": "Thank you Beau and freeCodeCamp for having me on your channel! I hope that this video is helpful to you all! \n\nFor those wondering how I configure my terminal, I use iTerm2 + zsh + oh-my-zsh. If you are into customizing things like I am you’ll love these :)\nFor those wondering about my vim setup, I just made a tutorial on how to clone my .vimrc and install the necessary dependencies on my channel (link in the description).\nThe repo with my .vimrc is linked in the description of the above mentioned video as well. Hope it helps!", "likes": 24}, "replies": [{"author": "Stefan .P", "text": "Thanks for the tutorial. Very helpful and great visualisations. Good thing I could pause and rewind the video, that was jam packed with so much information!", "likes": 0}]}, {"topLevelComment": {"author": "GWiz Academy", "text": "Just Amazing, you guys made this so simple to grasp", "likes": 1}}, {"topLevelComment": {"author": "Akhil Bhardwaj", "text": "++respect for coding in Vim", "likes": 2}}, {"topLevelComment": {"author": "S Kh", "text": "I hope nobody will do such things on production.", "likes": 0}}, {"topLevelComment": {"author": "Zain Jadoon", "text": "could you share your dotfiles", "likes": 0}}, {"topLevelComment": {"author": "Keerthana.S. Bidare", "text": "How to install sqlite3 on windows", "likes": 0}}, {"topLevelComment": {"author": "RISHABH SINGH 17SCSE101597", "text": "how do you guys complete this course like making notes while watchin this or practice hand to hand or complete the video in one time ???", "likes": 1}, "replies": [{"author": "Faizan Usmani", "text": "Keep following the instructor and keep writing the code on computer simultaneously also make notes on paper.", "likes": 0}, {"author": "RISHABH SINGH 17SCSE101597", "text": "@Mohamed Reda Loukhnati  thank you so much for your reply . :)", "likes": 1}, {"author": "RISHABH SINGH 17SCSE101597", "text": "@Enrique Ferreira  thank you so much for your reply . :)", "likes": 0}, {"author": "Mohamed Reda Loukhnati", "text": "I type alongside, and make a LOT of comments. when you finish the video try to create the project again and whenever you're stuck check what you typed. The need to actually type code, to struggle remembering it and having to read through past code again solidifies those concepts for me.", "likes": 1}, {"author": "Enrique Ferreira", "text": "with this 3 ways, I learn a lot just copying and after pondering about, but also making notes is very good and learning with different media will be good to your brain and your studies", "likes": 1}]}, {"topLevelComment": {"author": "Mohamed Mehdi Gara", "text": "21:30 I got the following error: Traceback (most recent call last):\r\n  File \"<stdin>\", line 1, in <module>\r\nNameError: name 'db' is not defined", "likes": 1}, "replies": [{"author": "Rahul Chauhan", "text": "from flask_sqlachemy import SQLAlchemy\n\n# after initiating app instance\n\ndb = SQLAlchemy(app)", "likes": 1}]}, {"topLevelComment": {"author": "Manoj Baishya", "text": "Hi ​@selikapro, thanks for the tutorial! A few comments:\n\n1. In the *linked_list.LinkedList()* class, instead of *get_user_by_id()*, a *search()* function with a *match()* callback (defined in the server that returns True and False) will decouple the server code from the implementation. That way we can make the *LinkedList()* completely generic.\n2. In the *hash_table.HashTable()* class, I think a good idea will be to compose the *self.hash_table* array as an array of the above linked-list code and leverage it inside the *insert()* and *search()* method to avoid duplication. With *insert_at_end()* and *search()* from linked list already at hand, it might simplify the hash table implementation. I am still reading up on hash functions, so no comments on that :P\n3. The Stack and Queue classes can inherit LinkedList directly. If we implement an additional *remove_head()* function in the LinkedList class, then the Stack interface will simply become *push()* -> *insert_beginning()* and *pop()* -> *remove_head()*. Similarly for Queue, *enqueue()* -> *insert_at_end()* and *dequeue()* -> *remove_head()*. I guess that will reduce code and also explain nice properties of inheritance.\n4. In *binary_search_tree.BinarySearchTree()*, I think we can make the mother *insert()* and *search()* functions directly recursive without auxiliary functions and also some steps can be eliminated since the terminal condition you defined already takes care of insertion or returning. My attempt: https://raw.githubusercontent.com/manojbaishya/FlaskAPIdemo/development/src/flaskapidemo/binary_search_tree.py\n5. I suppose a good way to illustrate the Queue usage is to have an endpoint insert multiple blogposts for a single user, with the payload transferred as an array of objects.\n\nI guess that in a real-world website, our boss will tell us to use SQL queries on the database engine directly to do insertions and deletions instead of implementing our own data structures (which will significantly simplify the design). Nevertheless, this is an excellent tutorial and removes some of the abstractnesses of data structures concepts in general.\n\nOne idea might be to add more classes to the model to learn database design and use the routes to understand SQL queries.\n\nOn Tooling: If using VS Code, everything in this video can be done within the editor:\n\n1. SQLTools: https://marketplace.visualstudio.com/items?itemName=mtxr.sqltools and SQLite driver: https://marketplace.visualstudio.com/items?itemName=mtxr.sqltools-driver-sqlite\n  \n2. Thunder Client for API requests: https://marketplace.visualstudio.com/items?itemName=rangav.vscode-thunder-client\n  \n3. Visualising the data model: https://marketplace.visualstudio.com/items?itemName=hediet.vscode-drawio\n  \n4. Poetry for virtual environments and dependency management: https://python-poetry.org/\n\nMy code: github.com/manojbaishya/FlaskAPIdemo\n\nThanks, and hope you are safe!", "likes": 7}, "replies": [{"author": "Khalifa said", "text": "dude thats awesome still watching the tutorial", "likes": 0}]}, {"topLevelComment": {"author": "Sujeet Kumar", "text": "Please one video on CUDA C", "likes": 0}}, {"topLevelComment": {"author": "magOS", "text": "I recommend you to figure out what the classes are before following this tutorial.", "likes": 1}}, {"topLevelComment": {"author": "Ujjwal Biswas", "text": "This tutorial is gem!\nwhere can i get those dotfiles for vim and terminal hope you are using zsh(ohmyzsh)", "likes": 0}}, {"topLevelComment": {"author": "Oğuzhan", "text": "Hello, I am getting this error when I delete a record. \"AttributeError: 'NoneType' object has no attribute 'class_'\"", "likes": 0}}, {"topLevelComment": {"author": "theonlycatonice", "text": "1:09:21 the insert_beginning method seems wrong - it duplicates the first node added at the beginning\n(empty list, insert_beginning)\nNone\r\ndata1 -> data1 ->  None\n\nIf you place the last 2 lines under the else after the if it works as expected\n(empty list, insert_beginning)\nNone\r\ndata1 ->  None", "likes": 7}, "replies": [{"author": "Akash Chauhan", "text": "I was just looking at the comments if anybody has noticed that or m missing something here!", "likes": 0}, {"author": "Jayant", "text": "yeah you are right. I faced the same issue, either you add an else statement for last two lines or put a return in the end of if statement.", "likes": 2}]}, {"topLevelComment": {"author": "Sreejish Nair", "text": "Can you guys create a full course on Selenium using python", "likes": 1}}, {"topLevelComment": {"author": "Ropeboyo - Full streams and assorted lunacy", "text": "BASED guy using vim. Will follow this one on vim too, been trying to get rid of vscode for a while now", "likes": 0}, "replies": [{"author": "Pritom Hazarika", "text": "well, vim is amazing, but why do you want to get rid of VS code. VS code have an extension called thunder client where you can test the routes from the vs code itself. you don't have to install and open postman.", "likes": 0}]}, {"topLevelComment": {"author": "Symere", "text": "thanks for this", "likes": 0}}, {"topLevelComment": {"author": "phalyce Enima", "text": "I'm getting \"TypeError: Object of type Node is not JSON serializable\" when using Postman to request the \"get_all_users_descending\" route, anyone else? using python 3.8", "likes": 0}, "replies": [{"author": "Kantan Coding", "text": "@phalyce Enima no problem :)", "likes": 0}, {"author": "phalyce Enima", "text": "@Kantan Coding you're absolutely right... Thanks a bunch ! Was pulling my hair out !", "likes": 0}, {"author": "Kantan Coding", "text": "It sounds to me like in the to_list method you are appending node instead of node.data. Check the line of code that says l.append(node.data) and make sure it’s not l.append(node)", "likes": 0}]}, {"topLevelComment": {"author": "yogeerama", "text": "I can only say \"Thank you\". This video means a lot to me", "likes": 4}}, {"topLevelComment": {"author": "Aleksandr Goliak", "text": "great video! what plugin or hotkeys you're using to show the definition in python libs?", "likes": 0}}, {"topLevelComment": {"author": "Looney Toons", "text": "hi if any body have and error ::\nsqlalchemy.exc.OperationalError: (sqlite3.OperationalError) database is locked   \nin my case (Fedora) because the DB browser", "likes": 0}}, {"topLevelComment": {"author": "Mostafizur Rahman", "text": "Can you please make video on Ajex, Json and wordpress rest api?\nThat would be much helpful.", "likes": 0}}, {"topLevelComment": {"author": "Shivam", "text": "somebody please help me with that wrapper function at 12:35 , I googled but documentation is going over my head!", "likes": 0}}, {"topLevelComment": {"author": "Aakash Bakhle", "text": "Your vim looks amazing. Do you have a gist or something for vim config?", "likes": 5}, "replies": [{"author": "Kantan Coding", "text": "@Karthick Aravindan I just made a tutorial on how to clone my .vimrc and install the necessary dependencies on my channel. Hope it helps!", "likes": 3}, {"author": "Karthick Aravindan", "text": "@Kantan Coding  if can do quick setup tutorial video for vim it will great. I am searching for good vim setup for my Mac.", "likes": 1}, {"author": "Kantan Coding", "text": "For my vim setup and how I’m accessing the python module definitions and how my auto-completion is working, I’m using coc.nvim to go to definition. And the definitions for the modules that you install are usually located in /lib/python/site-packages in your Python folder(I’m not sure for Windows, sorry). I’m also using jedi for auto-completion for Python. As for the vim theme, I am using vim-monokai-tasty in this video. I switch between that and gruvbox. Sorry, I tried to post this comment earlier to answer people's questions about my setup but YouTube keeps removing my comment.", "likes": 9}]}, {"topLevelComment": {"author": "Pranjal Ruhela", "text": "where is he looking up for definitions by the way like is there a file or something bundled?", "likes": 0}, "replies": [{"author": "Kantan Coding", "text": "I’m using coc.nvim to go to definition. And the definitions for the modules that you install are usually located in /lib/python/site-packages in your Python folder(I’m not sure for Windows, sorry). I’m also using jedi for auto-completion for Python.", "likes": 1}, {"author": "J Lee", "text": "If you downloaded the flask via venv pip, it should be in your local flask directory as app.py", "likes": 1}]}, {"topLevelComment": {"author": "Pranjal Ruhela", "text": "Can we get a pdf or short summary type thing so that we dont need to watch again and like a revison ...", "likes": 0}}, {"topLevelComment": {"author": "Pranjal Ruhela", "text": "I absolutely was losing my mind but 20 miutes in .. I  started loving it i am still at 20 minutes ...", "likes": 2}}, {"topLevelComment": {"author": "Arnel j", "text": "Side note: how you customize your Terminal? its so nice to look at. Thanks in advance Selikapro", "likes": 0}, "replies": [{"author": "Kantan Coding", "text": "I use iTerm2 + zsh + oh-my-zsh. If you are really into customizing things like I am you'll love these :)", "likes": 1}]}, {"topLevelComment": {"author": "theonlycatonice", "text": "I'm running on windows and it seems bin is called scripts just fyi", "likes": 0}}, {"topLevelComment": {"author": "Prodipto Karmakar", "text": "Awesome 🔥", "likes": 0}}, {"topLevelComment": {"author": "theonlycatonice", "text": "Literally this came out after I had been following a Udemy course on Python for around a week now - PERFECT!", "likes": 4}}, {"topLevelComment": {"author": "xenkashyap", "text": "we need more tutorials like these about some algorithms which we implement during development", "likes": 21}}, {"topLevelComment": {"author": "Jhonathan Martini", "text": "when i'll be a founder of an it company i'll donate 1M $ to freecodecamp cuz i'm learning programming for free while other spends thousands of dollars on universities, private engineering schools and not even compared to this high level courses :)", "likes": 0}}, {"topLevelComment": {"author": "Fco Javi", "text": "Don’t know how I found myself here but I’ll go with it 🤷🏽‍♂️", "likes": 0}}, {"topLevelComment": {"author": "everton zp", "text": "I genuinely wish I could watch this class on my smartphone. Unfortunately nobody creating programming content seems to care about their mobile audience. A little bigger font size would make all the difference. Useless video for mobile audience.", "likes": 1}, "replies": [{"author": "everton zp", "text": "@Kevin Zehnder As my text says, I didn't say I wanted to follow along with practicing. I said I like to watch some programing videos sometimes on mobile to use my spare time to watch something useful. Unfortunately some programming videos are unwatchable on mobile. Why is that so difficult to understand.", "likes": 0}, {"author": "Kevin Zehnder", "text": "And programmers care deeply about mobile audiences lmao this is a ridiculous critique of this video", "likes": 0}, {"author": "Kevin Zehnder", "text": "@everton zp if you’re trying to build flask apps from your phone you’re gonna have a lot of bad days. Can fit a square peg in a round hole. Either get some glasses or a monitor but you aren’t gonna develop apis from your iPhone pal", "likes": 0}, {"author": "everton zp", "text": "@Orf1az I frequently use my spare time to watch programming videos, from mobile, from anywhere, even when I don't have a proper computer setup to follow along. I think many people do the same as well", "likes": 0}, {"author": "Orf1az", "text": "How will people watching from mobile will be benefited from it? Aren't you supposed to practice alongside watching?", "likes": 1}]}, {"topLevelComment": {"author": "Larry Priest", "text": "to much opus pocus", "likes": 0}}, {"topLevelComment": {"author": "John Wig", "text": "Come on i can't keep liking all ur videos! 🤣", "likes": 1}}, {"topLevelComment": {"author": "Phago", "text": "I need to create integrate a classifier with an unitary request in a webservice. The principle is that this webservice (API REST) will take every parameters of my database as input. Can you tell me if that video can help me to do that ?", "likes": 0}}, {"topLevelComment": {"author": "Joseph Attwood", "text": "Thank you for this!", "likes": 0}}, {"topLevelComment": {"author": "Alexandru Cardas", "text": "The sound of the keyboard is extremely annoying", "likes": 4}, "replies": [{"author": "Kevin Zehnder", "text": "Shut up ya dunce, this guy spent probably weeks making this. Quit ur bitching", "likes": 0}]}, {"topLevelComment": {"author": "18_0202 Alfajri Asnan Kusuma", "text": "How did you access the definition of flask classes? I always wondering i want read the doc or the class it self so i know how it works.", "likes": 0}, "replies": [{"author": "Mohamed Reda Loukhnati", "text": "Go To Definition option in VS Code, shortcut is F12", "likes": 0}, {"author": "AnyoneSwordfish", "text": "Open the app.py file in the Flask package", "likes": 2}]}, {"topLevelComment": {"author": "FLASHBAO", "text": "Oh my God! Thank You so much! I needed this so much!", "likes": 0}}, {"topLevelComment": {"author": "AnyoneSwordfish", "text": "Currently learning Python and I was just learning data structures and wanting to build an API with Flask. This course is came at a perfect time!", "likes": 13}, "replies": [{"author": "Thann SokKhen", "text": "@IDK haha", "likes": 0}, {"author": "IDK", "text": "I thought you said currently leaving python. Lol", "likes": 2}]}, {"topLevelComment": {"author": "Gaurish Agrawal", "text": "So many people commenting....but how many of you actually even watch the video?", "likes": 0}}, {"topLevelComment": {"author": "ayush singh", "text": "Sir please bring a course of data structures and algorithms in python", "likes": 4}}, {"topLevelComment": {"author": "Ayman Cassim", "text": "How does my man Georgio has only 140 Subs. Yo guys lets help him!!", "likes": 2}}, {"topLevelComment": {"author": "Access Code", "text": "Is Flask non blocking? Tornado is a lot better than Flask and is non-blocking I/O", "likes": 0}}, {"topLevelComment": {"author": "CSpencerND", "text": "Where can I learn to configure my terminal like this?", "likes": 1}, "replies": [{"author": "Hemanth Kotagiri", "text": "Use zsh with alacritty. Thats why I use. Also, go with nvim if you want to learn vim. I use alacritty+zsh+nvim+Tmux. Can't live without these.", "likes": 0}]}, {"topLevelComment": {"author": "Abdulla Shafi", "text": "But What's about Django ?", "likes": 0}}, {"topLevelComment": {"author": "Neil Lunavat", "text": "I LOVE FREECODECAMP!", "likes": 2}}, {"topLevelComment": {"author": "Soumyajit Dey", "text": "My god a perfect course!", "likes": 0}}, {"topLevelComment": {"author": "Cricri", "text": "What? Only 3 hours? Is that what you call a YouTube Short?", "likes": 0}}, {"topLevelComment": {"author": "HoseaBr", "text": "And it uses python...🔥❤❤", "likes": 0}}, {"topLevelComment": {"author": "Yash Dixit", "text": "IS THERE SOMETHING LIKE THIS FOR C++? LIKE BUILD SOMETHING USING DATA STRUCTURES IN C++?", "likes": 1}, "replies": [{"author": "Pranjal Ruhela", "text": "why would you use c++ competitive coding?", "likes": 0}]}, {"topLevelComment": {"author": "5 1", "text": "goated", "likes": 4}}, {"topLevelComment": {"author": "Parmeet", "text": "I can follow same project but use django instead of Flask will this work ???", "likes": 2}, "replies": [{"author": "Pratyush", "text": "Yes it will", "likes": 0}]}, {"topLevelComment": {"author": "Henok Negesse", "text": "I am henok negesse from Africa,Ethiopia I graduated electrical and computer engineering. But i want study computer programming aboard what shall I do?", "likes": 0}}, {"topLevelComment": {"author": "Kennito De Van Gavani", "text": "FCC 🔥 🔥 🔥 🔥 🔥", "likes": 1}}, {"topLevelComment": {"author": "Sudhama Jayanthi", "text": "Lol these guys are commenting even before watching!", "likes": 0}}, {"topLevelComment": {"author": "DepressedAndDank", "text": "Its so rare to find a course on data structures that actually teaches you how to use them. Thank you!", "likes": 158}, "replies": [{"author": "Yamamoto Isoroku", "text": "and is not an indian!", "likes": 1}, {"author": "Playonce", "text": "i swear bruv", "likes": 0}, {"author": "Ilham Aji", "text": "@Vathsan bvb", "likes": 1}, {"author": "Ilham Aji", "text": "Bbcb  cbcb", "likes": 0}, {"author": "Marek Goc", "text": "@Anakin Roberto mam Dgt", "likes": 0}]}, {"topLevelComment": {"author": "Amar Kumar", "text": "Plzzz upload full data structures on python", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "This course uses Python: https://www.youtube.com/watch?v=8hly31xKli0", "likes": 1}]}, {"topLevelComment": {"author": "Alaz Tetik", "text": "FreeCodeCamp 👏💐🎉", "likes": 3}}, {"topLevelComment": {"author": "anu Tyagi", "text": "Thanks for the help...", "likes": 0}}, {"topLevelComment": {"author": "Daniel Mar Quintana", "text": "Second, \nThank u freeCodeCamp !", "likes": 0}}, {"topLevelComment": {"author": "cricketcrazy437", "text": "Awesome !!", "likes": 0}}, {"topLevelComment": {"author": "Sa Do", "text": "First by accident lol", "likes": 2}}, {"topLevelComment": {"author": "Oualid", "text": "Thank you Sir .", "likes": 0}}, {"topLevelComment": {"author": "羊喵", "text": "first", "likes": 0}}, {"topLevelComment": {"author": "Joris LIMONIER", "text": "First", "likes": 0}}]}