{"video": {"id": "7b-1qWvQdqY", "title": "Angular 4 Project Setup with Webpack", "description": "A complete tutorial on setting up a highly scalable and configurable Angular 4 project with Webpack. Learn how to optimize your web development throughput with this project configuration! \n\n⭐ Video Outline ⭐\n\n⌨  Intro: 0:00\n⌨  Project Setup (Boiler Plate), and an intro to TypeScript: 0:32\n⌨  Angular Setup: 5:48\n⌨  Webpack Configuration (Webpack Common): 8:34\n⌨  Webpack Dev and Prod Config: 9:07\n⌨  Running the App: 32:32\n⌨  Webpack Test Config: 35:05\n⌨  AOT Build: 38:19\n\n🔗  Github Repo: https://github.com/Bigless27/Angular-webpack-starter\n\nVideo by Jordan Lesson.\nContact: Jordantreylesson@gmail.com\n\n-\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT46M8S", "likes": "138", "views": "15038"}, "comments": [{"topLevelComment": {"author": "Lord Sebastian", "text": "I see angular I press dislike", "likes": 0}}, {"topLevelComment": {"author": "Konstantin Tkalenko", "text": "enviroment... ENVIRONMENT!!!\nFile Name - it two different words. Why the hell \"Filename\".\nWhat the hell happening with developers, people who are supposed to be smart and intelligent???", "likes": 0}}, {"topLevelComment": {"author": "Durgesh Yadav", "text": "Awesome description especially aot stuff", "likes": 0}}, {"topLevelComment": {"author": "FrontEnd Miracle", "text": "Great work with the video outline. I wish every youtube tutorial would show one.", "likes": 0}}, {"topLevelComment": {"author": "Krishnan Shankarasubramanian", "text": "hi, can i get the source or this demo from any github to start my ang pjt ?", "likes": 0}}, {"topLevelComment": {"author": "Saurabh Verma", "text": "i found it amazing", "likes": 1}}, {"topLevelComment": {"author": "RAJ JAISWAL", "text": "Hi how to use webpack config with scss and angular 5. pls create a sample on gihub and link here.", "likes": 1}}, {"topLevelComment": {"author": "Face Bundy", "text": "Can you migrate the CommonsChunkPlugin to webpack 4? this plugin was deprecated and was replaced by SplitChunks", "likes": 0}}, {"topLevelComment": {"author": "Sergey Diachenko", "text": "CSS background-image not working in this Webpack config", "likes": 0}}, {"topLevelComment": {"author": "Johan Roug", "text": "hi. This is great. how can I use SCSS in this project ?", "likes": 0}}, {"topLevelComment": {"author": "Eric Lesniewski", "text": "In order to get this to work, I had to add the following to the tsconfig.json files: \n\n\"typeRoots\": [\n            \"node_modules/@types\"\n          ]\n\nThis is probably not the forum to put requests out there, but I am having difficulty with the npm run webpack-prod command line syntax.  I had to add --config config/webpack.prod.js to the end of the command in order to get this to work.  It completes, with errors:\n\nERROR in chunk app [initial]\nwebpack.prod.js\nConflict: Multiple assets emit to the same filename webpack.prod.js\n\nERROR in chunk polyfills [entry]\nwebpack.prod.js\nConflict: Multiple assets emit to the same filename webpack.prod.js\n\nI have found a suggestion to include the copy-webpack-plugin from (have not tried this myself, yet):\nhttps://github.com/webpack-contrib/copy-webpack-plugin\n\nHas anyone run into this problem and/or tried a solution. Thanks.  Nice work on this video.", "likes": 0}, "replies": [{"author": "Lesson on Coding", "text": "Hey Eric!\n\nPlease open up an issue on the Github repo and I'll be sure to get to it ASAP.\n\nrepo: https://github.com/Bigless27/Angular-webpack-starter\n\nthx,\nLesson on Coding", "likes": 0}]}, {"topLevelComment": {"author": "Dev N", "text": "why didn't you use angular cli?", "likes": 2}, "replies": [{"author": "walid shouman", "text": "There's also a guide here https://codeburst.io/customizing-angular-cli-6-build-an-alternative-to-ng-eject-a48304cd3b21 for extending the webpack config, which requires a minimal understanding of webpack and its integration with angular.", "likes": 0}, {"author": "walid shouman", "text": "I came here due to this issue (https://github.com/angular/angular-cli/issues/1656). \nConfiguring webpack is a must for some cases (ie: zmq + electron + angular).", "likes": 0}, {"author": "Scott Berry", "text": "Creating your own setup is very informative and actually helps reduce the number of dependencies, also if you learn more about CLIs you can then build it for other things, I find tutorials on setups to be very useful, I'd rather know how things work, than rely on \"magic\".", "likes": 0}, {"author": "Arvee -", "text": "actually this is dope and at several places u would feel like you could configure web pack", "likes": 1}, {"author": "Lesson on Coding", "text": "I wanted to give a more in-depth understanding of the project structure. I personally would not recommend building a production app until you fully understand the architecture. When you start development it could be really costly to have to go back and add things or find out certain things that you had in your project can't be customized. Also, the Angular CLI dev's don't want you configuring their webpack config files anyway. See this issue https://github.com/angular/angular-cli/issues/1656", "likes": 0}]}, {"topLevelComment": {"author": "Harshit Pant", "text": "You are the first guy I have seen that is using serif font in text editor instead of monospace. BTW very nice video.", "likes": 4}, "replies": [{"author": "Lesson on Coding", "text": "Harshit Pant haha you're not the first one to mention that. Glad you enjoyed the video!", "likes": 0}]}]}