{"video": {"id": "8hb9UIxqjRI", "title": "FCC Computer Basics 11: IP Addresses", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\nThe Internet, part 1: IP Addresses.\n  Every device has an IP address.\n  IP addresses are assigned based on location, and are vital for the internet to work.\n  We're going to talk about the Internet: Part 1, How the Internet Works.\n  To know how the internet works, we're going to talk first about IP addresses.\n  You may be familliar with the fact that each of your devices has its own IP address, just like a house or an apartment has its own address.\n  The internet can't deliver data to a device unless it has an IP address.\n  Not only does your device have one, but so does the modem, the router, and every step along the way, which we'll get to later.\n  IP addresses are determined based on location, starting with 5 big international regions.\n  Moving from left to right, the numbers mean something specific about your location.\n  This number isn't specific enough that you could call 911, give them your IP address, and have them know where you live.\n  However, it is specific enough that you could google \\Where's the best ice cream near me\\ and google could give you information close to your location.\n  This is done using your IP address.", "duration": "PT1M13S", "likes": "256", "views": "25253"}, "comments": [{"topLevelComment": {"id": "UgjcaS4CGmO0ZngCoAEC", "publishedAt": "2016-07-25T11:47:42Z", "author": "Vlad Imir", "text": "i like how your videos are short and straight to the point very concise", "likes": 6}}, {"topLevelComment": {"id": "Ugj4bRr8R0Lh3XgCoAEC", "publishedAt": "2016-07-05T16:02:37Z", "author": "Tyson Hauke", "text": "nice subtle change of location there", "likes": 9}, "replies": [{"id": "Ugj4bRr8R0Lh3XgCoAEC.8FxabJzJhsx8WSJ2-fBclv", "publishedAt": "2017-08-19T15:58:22Z", "author": "Courd Headman", "text": "And the hair cut.", "likes": 1}]}]}