{"video": {"id": "8wMKq7HvbKw", "title": "Build 5 Dapps on the Ethereum Blockchain - Beginner Tutorial", "description": "Learn Ethereum Dapp in this full tutorial for beginners. This course teaches how to build decentralized applications on the Ethereum Blockchain. We are going to build 5 Ethereum Dapps. For each of them, we will:\n- Develop smart contracts\n- Test smart contracts\n- Build a web frontend to interact with the smart contract\n\nThe course covers:\n- The architecture of Dapps\n- Solidity, the programming language for Ethereum smart contract\n- Remix, the online IDE for Solidity\n- Truffle, the framework for Solidity smart contracts\n- Ganache, the local development Blockchain\n- Web3, the JS library to integrate a Dapp frontend\n- Metamask, the Ethereum wallet used by most Dapps (browser extension)\n- Deployment to public testnet (Ropsten) and mainnet, using Infura API\n\nRequirements:\n- NodeJS v10\n- Works on both Windows, Linux and Mac\n\n💻 Code: https://github.com/jklepatch/eattheblocks/tree/master/dapp-30\n\nRegister to the FREE mini-course \"become a blockchain developer\" on eattheblocks.com to learn how to get a remote blockchain job making 100k.\n\nFor more tutorials on Ethereum Dapps, Solidity smart contracts, check out the EatTheBlocks channel: https://www.youtube.com/c/eattheblocks\n\nWhile this is a stand-alone course, it is part of Dapp 30, a course where we build 30 Ethereum Dapps so that you can learn Ethereum Dapps / Solidity AND build your portfolio to get a job as Blockchain developer: \nhttps://eattheblocks-pro.teachable.com/p/dapp-30\n\n⭐️ Course Contents ⭐️\nDapp 1 - Simple smart contract\n⌨️ 8:22: Smart contract: Intro to Solidity, Remix, Deploying contract on Remix\n⌨️ 21:09: Tests - Introduction to Truffle and tests\n⌨️ 32:03: Frontend - Architecture of Ethereum Dapp / integration with smart contract, ABI, intro to Web3\n\nDapp 2 - Helloworld\n⌨️ 57:18: Smart contract - Solidity read-only functions, Interacting with functions in Remix\n⌨️ 1:07:28: Tests - Testing a smart contract function with Truffle\n⌨️ 1:12:33: Frontend - Interacting with a smart contract function from frontend, with Web3\n\nDapp 3 - Simple storage\n⌨️ 1:24:00: Smart contract - Solidity functions that can modify smart contract data (in transaction)\n⌨️ 1:41:53: Tests - Test (transaction) smart contract functions with Truffle\n⌨️ 1:45:27: Frontend - Sending transactions from frontend, with Web3\n\nDapp 4 - Complex storage\n⌨️ 2:04:05: Smart contract - Solidity Arrays (adding element, read single element, read all elements and get length) \n⌨️ 2:14:37: Tests - Testing Solidity arrays with Truffle, introduction to the BN.js library to deal with Solidity numbers\n⌨️ 2:26:54: Frontend - Using Webpack / ES6 for Dapp frontend, Intro to (new) Metamask and integration with frontend\n\nDapp 5 - Crud\n⌨️ 3:06:51: Smart contract - create, read update and delete data in Solidity\n⌨️ 3:31:33: Tests - How to tests Solidity errors with Truffle (require, revert...)\n⌨️ 3:47:25: Frontend - Deployment on public testnet (Ropsten) and Mainnet with Infura\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT4H49M4S", "likes": "4216", "views": "149488"}, "comments": [{"topLevelComment": {"author": "humayun kabir", "text": "npm install -D truffle-hdwallet-provider failing in my case at 4:22", "likes": 0}}, {"topLevelComment": {"author": "Samyar", "text": "Well honestly, truffle part was complicated, and I didn't understand anything. Is there any course for truffle ?", "likes": 0}}, {"topLevelComment": {"author": "REZAZI MOHAMED ABDESSAMED", "text": "For those who run truffle test and nothing happened, try the following:\n-Re-mirgrate all the migration: truffle migrate --rest\n-Complie the contracts: truffle compile\n-If you are using Ganache, make sure to copy the network ID, the url, port inside truffle.config.json, inside networks object.\nThen, you are ready to type: truffle test(or sometimes it asks for sudo: sudo truffle test)", "likes": 0}}, {"topLevelComment": {"author": "Mahendra Nath", "text": "Thank you so much for the video ❤️👍🏼🎉⭐🙏", "likes": 0}}, {"topLevelComment": {"author": "asrar", "text": "I dunno but his accent is giving me anxiety", "likes": 1}}, {"topLevelComment": {"author": "new born", "text": "Sir web3 has changed can we get updated lessons. Thanking you", "likes": 0}}, {"topLevelComment": {"author": "PictoMaster8", "text": "I have question what is playground and", "likes": 0}}, {"topLevelComment": {"author": "Sohail Saha", "text": "One of the best tutorials out there that thoroughly explains all the steps, and progresses very methodically! Thanks for this!", "likes": 4}}, {"topLevelComment": {"author": "Vivian Obakpolor", "text": "Having issues with the compiling", "likes": 1}}, {"topLevelComment": {"author": "Atharva Agarwal", "text": "one question in day 1 you use which software", "likes": 0}}, {"topLevelComment": {"author": "Bahauddin Chihste", "text": "Please, add English subtitles to this tutorial! It will helps a lot of people including me.", "likes": 4}}, {"topLevelComment": {"author": "BuiQuangTuan", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "MrTactics26", "text": "37 mins in…", "likes": 0}}, {"topLevelComment": {"author": "Apinan Yogaratnam", "text": "love the intro!!!", "likes": 0}}, {"topLevelComment": {"author": "crypto rajan", "text": "Unbelievable .. https://youtu.be/g0cSpJaz6JE", "likes": 0}}, {"topLevelComment": {"author": "Swaestation", "text": "at 21 minutes WHAT IDE are you using?????? I have tried Command Prompt but your commands do not line up properly", "likes": 0}}, {"topLevelComment": {"author": "M Younas", "text": "I followed you step by step however at the end when deploying to ropsten it's not working with me show this error message: \"Migrations\" could not deploy due to insufficient funds. how can I solve this issue?", "likes": 0}}, {"topLevelComment": {"author": "tv app", "text": "Awesome!", "likes": 1}}, {"topLevelComment": {"author": "Waverider 2005", "text": "bre im completelly fucked this too much for me", "likes": 0}}, {"topLevelComment": {"author": "Robert Veres", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "PETSandPAWS", "text": "I love it man.\nThank you", "likes": 0}}, {"topLevelComment": {"author": "Subhasish Das", "text": "The intro XD", "likes": 0}}, {"topLevelComment": {"author": "KAMAL K", "text": "lol intro", "likes": 0}}, {"topLevelComment": {"author": "냐옹헌터", "text": "4:12:01\nbookmark", "likes": 0}}, {"topLevelComment": {"author": "Andrew Dzula", "text": "What command prompt is he using?", "likes": 0}}, {"topLevelComment": {"author": "Ragib Shahariar Ayon", "text": "After struggling for few months I stumped upon this tutorial just before starting a project!! Thanks a lot :D you are the best!", "likes": 2}}, {"topLevelComment": {"author": "Prakhar Agarwal", "text": "Need subtitles", "likes": 0}}, {"topLevelComment": {"author": "Mourinho Fring", "text": "when i try to run the tests in the first video i run into \"artifacts not defined\"", "likes": 0}}, {"topLevelComment": {"author": "javier gomez", "text": "these videos are 1000x better with this in the background https://www.youtube.com/watch?v=XPXM47rhFwY", "likes": 0}}, {"topLevelComment": {"author": "chetan raj", "text": "When I am running the test it always shows 0 passing and nothing else", "likes": 0}}, {"topLevelComment": {"author": "Marcelly Torres", "text": "I still see cryptocurrency as one of the best digital investment and I totally love the technology when it comes to the largest crypto asset Bitcoin  As a trader, I have been able to understand that there are two sides when it comes to crypto and everyone has their opinions when it comes to choosing sides, though i am not kicking against Hodlin, but I see it as an old and odd strategy to make profit of the market as when the market goes bearish investors/traders loses their investment which is always painful, when you can take advantage of the market by involving in day trading or copying trade alert from a professional trader that understand the market and use strategy to generate signals daily to make profit, to grow your portfolio as i have been doing with Mr Kristin crypto Expert. for the past 5 weeks and i have been able to trade to grow my initial 0.8 btc to 6.8 btc which you will rethink and see that trading is better/profitable.. Mr Kristin crypto Expert. daily signals are very accurate and always yields a great positive return on investment. \r\n\r\nKristin crypto Expert. can be contacted via Tele gram @kristincryptoworld", "likes": 5}, "replies": [{"author": "James Wilson", "text": "Hello Kristin a friend told me about you and i'm ready to invest with you cause i have seen the good work you have done in the life of my friend Eric", "likes": 0}, {"author": "SEDEVFRED", "text": "I m here to say a big thank you to Kristin for opening my eyes to see the light to the new platform to invest in", "likes": 0}, {"author": "Roland leelobphal", "text": "I stopped  panicking about bitcoin price ever since i started using his strategy, Either way, we are all winners! If BTC goes up, we profit. If BTC goes down, we re-accumulate. It is a win-win for us with his program", "likes": 0}, {"author": "jammyman999", "text": "After a long search for a professional trader with consistency matched with good profit, Mr kristincryptoexpert has proven himself to be one of the best around the world with his amazing trading skills.", "likes": 0}, {"author": "Steven Hodo", "text": "If the world had more people like kristincryptoexpert, it would be a better place. You do make a difference in the crypto space", "likes": 0}]}, {"topLevelComment": {"author": "Ravi Shankar", "text": "Can anyone help me with this error I get when trying to use the bigNumber library?\nTypeError: result.toNumber is not a function\nTypeError: result.toNumber is not a function\nTypeError: rawIds.map is not a function\nTypeError: result.toNumber is not a function\nSorry if this is due to some trivial error. I am new to javascript.", "likes": 0}}, {"topLevelComment": {"author": "Sidharthviz", "text": "can someone please describe me the tools he used its really confusing for me.", "likes": 1}}, {"topLevelComment": {"author": "slookify", "text": "should be easy to use this for BSC right?\nno way I will code something for the fee-chain", "likes": 0}}, {"topLevelComment": {"author": "V", "text": "Folder structure is different, truffle test does not work.", "likes": 0}, "replies": [{"author": "ayman khan", "text": "same issue", "likes": 0}]}, {"topLevelComment": {"author": "Nidiganti Vijay", "text": "In create function you have given nextId it is showing error for me\nUndeclared identifier can you help out???", "likes": 0}}, {"topLevelComment": {"author": "aromax504", "text": "Why is the return type of a get() is memory when it is returning back a storage variable ?", "likes": 0}}, {"topLevelComment": {"author": "Rushikesh Wadkar", "text": "🤣🤣😊🤣", "likes": 0}}, {"topLevelComment": {"author": "nicomal", "text": "Thumbs up for the mastering Bitcoin book at the back", "likes": 0}}, {"topLevelComment": {"author": "nicomal", "text": "44 seconds in an almost five hour video: this is the best blockchain tutorial everrrrr!", "likes": 11}}, {"topLevelComment": {"author": "Paul Fleischer-Djoleto", "text": "I just started watching but trust me he is great!", "likes": 1}}, {"topLevelComment": {"author": "bramoala", "text": "I liked this video 22 seconds in. Lmao what a fucking intro", "likes": 0}}, {"topLevelComment": {"author": "Neighbourhood Coder", "text": "why on earth you use Vim??", "likes": 0}}, {"topLevelComment": {"author": "Tensorflw", "text": "Here we go Solidarity!", "likes": 1}}, {"topLevelComment": {"author": "Atishay Sharma BHU9", "text": "I'm having an error in console when I run the server in browser that ' cannot load web3.js.map' and output is not as expected...pls help::", "likes": 1}, "replies": [{"author": "Ethan Srads", "text": "Hey i have the same error. Did you succeed ? It would be a great help for me", "likes": 0}]}, {"topLevelComment": {"author": "F D", "text": "lol best intro", "likes": 0}}, {"topLevelComment": {"author": "Shlomi Golubev", "text": "funny guy, positive attitude", "likes": 0}}, {"topLevelComment": {"author": "barkin özdemir", "text": "Thank you very much wanna do a startup \nhttps://peer-website.de/\nhope to learn from your video how we can build our own dapp", "likes": 0}}, {"topLevelComment": {"author": "Diego R", "text": "The timestamps in the description cannot be clicked.", "likes": 0}}, {"topLevelComment": {"author": "Daweb Schools - Brasil", "text": "The course is very confusing, why moving from one app to another? Why would you create an empty contract and then start another one just to make a hello world instead of adding things to the first contract? \n\nAlso, you start with Remix then just move to truffle. What's the point? \n\nIn Day2-Hello-World app many people are having problems with the callback of the hello method call and no answer has been provided.", "likes": 0}, "replies": [{"author": "ALMIRANTE 2356", "text": "I have an issue with that method, appears ' JSON response: \"\"  ' in the console of the webpage, searching on web said than testrcp must be running but i dont understand how o whats the command for do that\n\nFor chance, do you know?\n\nEdit: I found it how make it run, but still nothing changes, in the webpage the data is not deployed :(", "likes": 0}]}, {"topLevelComment": {"author": "Anon Decen", "text": "Why we need to specify memory location for complex types? Ain't the fn() parametere by default in \"memory\" ?", "likes": 0}, "replies": [{"author": "Kozie", "text": "There's no default in newer solidity versions. You need to specify it", "likes": 0}]}, {"topLevelComment": {"author": "Rotimi Tobi", "text": "All thank to* fin.tech7* his a best bitcoin miner with his help am able to recover my wallet back and I invested $1000 get $4000 in return with 5 day after reaching him out on Instagram.", "likes": 0}}, {"topLevelComment": {"author": "LukeWarmLaps", "text": "what is a decent terminal to use for windows?", "likes": 0}}, {"topLevelComment": {"author": "Frank Compston", "text": "Scoping that rockwool in the background and realizing we are the same person, albeit you're far more intelligent  than I :)", "likes": 0}}, {"topLevelComment": {"author": "Deepak Kumar", "text": "23:50 ran truffle init command in same directrory in which i installed truffle by mistake. what should i do now.Please help", "likes": 0}}, {"topLevelComment": {"author": "斐思空間 Fei`s Space", "text": "LOL. I love his humor. Cool man!", "likes": 1}}, {"topLevelComment": {"author": "Jim He", "text": "Interesting tutorial! You can make your own dApp like this: \r\nhttps://amazing-hopper-c05e25.netlify.app/", "likes": 0}}, {"topLevelComment": {"author": "KUJA", "text": "why do you guide is through your repo  on your screen that's different from what you have us clone? very confusing.", "likes": 0}}, {"topLevelComment": {"author": "Farhan Farooq", "text": "what do you mean by CRUD Dapp? I thought blockchain only supports create and read, but you are talking about update and delete too?", "likes": 0}}, {"topLevelComment": {"author": "Ayoub Najim", "text": "For those who run (truffle test) and see nothing in output, check your node.js version with (node - - version). It should be v12 not v14. So use v12 and the problem will be resolved.", "likes": 14}, "replies": [{"author": "T.I.S.R.O Official", "text": "@Debjyoti saha the bigger problem is that he depleated the migrations folder so we can no longer follow along to this tutorial", "likes": 0}, {"author": "Debjyoti saha", "text": "it's still not working and showing me ' SimpleContract has not been deployed to detected network (network/artifact mismatch) ' this error", "likes": 0}]}, {"topLevelComment": {"author": "Fabccool43", "text": "please activate the subtitles", "likes": 0}}, {"topLevelComment": {"author": "Matt Graham", "text": "@eattheblocks, Awesome video! I have a really dumb question: How do I now deploy the front end to the web to be live? Maybe this is such a stupid question that u don't want to make a video about it, but instead could post a link to someone else's explainer video?", "likes": 3}}, {"topLevelComment": {"author": "apex1212", "text": "Thank you Julien, great tutorial...going to check out your DAPP 30 course ;)", "likes": 0}}, {"topLevelComment": {"author": "Oort Cloud", "text": "niiiiiice!", "likes": 0}}, {"topLevelComment": {"author": "Random Click", "text": "Ultimate", "likes": 0}}, {"topLevelComment": {"author": "Shrey Gupta", "text": "I am getting a \"Not Found\" error on npm start... Any solutions? \nEven i am not getting anything on the console.", "likes": 1}}, {"topLevelComment": {"author": "Ata Tekeli", "text": "How can I test smart contracts,\n\nWhen I test them, I have this result", "likes": 0}}, {"topLevelComment": {"author": "Miss Wilson", "text": "He is great !", "likes": 0}}, {"topLevelComment": {"author": "Alhaj Reeves", "text": "Hi am following this tutorial. So far it's great. However am stuck at day5. the config for the truffle-config for networks. My file does not have a typo error but truffle keeps sending me a uncaught syntax error . Could someone help?", "likes": 0}}, {"topLevelComment": {"author": "Mike Settecasse", "text": "amazing i completed the 5 dapps lessons, but im interesed in building a bot , i saw that you have an arbitrage trade oracle , is that a bot? or it is just an smart contract which fetches prices variations?", "likes": 1}, "replies": [{"author": "Mukesh Kumar", "text": "I also want to code that bot. please let me know If u figured out how to code. or drop the resources if u find any.", "likes": 0}]}, {"topLevelComment": {"author": "Hello There", "text": "InnerHTML is ripe for exploiting js. Use textContent", "likes": 0}}, {"topLevelComment": {"author": "Jaime Zuluaga", "text": "thank you very much, I have resolved tons of doubts with your course", "likes": 0}}, {"topLevelComment": {"author": "Kosta Kosta", "text": "is it possible to be used with windows 10?", "likes": 0}}, {"topLevelComment": {"author": "Crypto Miller", "text": "I'm trying to run Dapp 2 Hello World. When trying to run the smart Contract, I get HelloWorld but empty string after Data with an error:\n\n\"Uncaught (in promise) Error: ERROR: The returned value is not a convertible string:\n    at SolidityTypeString.formatOutputString [as _outputFormatter].\n\nCan you please help? Thanks", "likes": 0}}, {"topLevelComment": {"author": "Joao Silva", "text": "this GOLD", "likes": 0}}, {"topLevelComment": {"author": "Prashant S", "text": "Good course Thanks\nBut please use better syntax theme", "likes": 0}}, {"topLevelComment": {"author": "the cactus", "text": "Did he change the git repo? When I use the link in the description I just get an error not found", "likes": 2}, "replies": [{"author": "Shrey Gupta", "text": "the same for me ...", "likes": 0}]}, {"topLevelComment": {"author": "Lys Prata Atelier - Artes, Vida e Crypto.", "text": "I would like to have my web store app on blockchain but never found how to.", "likes": 2}}, {"topLevelComment": {"author": "Peter Nohm", "text": "If you follow Elastos, the blockchain is a general family of technologies, similar to computer science.  To many consumers, a computer is a computer, but to engineers there are many different computers, super computers can’t compare to keyboards which happened to be computers.\r\nElastos is a Smartweb, and other blockchain projects are about computers.  You simply can’t compare the Web with any computers in the world. \r\nThe Smartweb needs DID, cloud computing, consensus computing, decentralized storage, decentralized cloud computing, mobile devices, IoT devices, etc., which in turn will resort to many different computing technologies and blockchain technologies. \r\nAny project that let Apps/DApps open sockets, there is no future in it because they can’t solve the digital asset double spending problem.", "likes": 0}, "replies": [{"author": "oluwadamilola, moyosoluwa Adegunwa", "text": "@Peter Nohm thank you so much!", "likes": 1}, {"author": "Peter Nohm", "text": "@oluwadamilola, moyosoluwa Adegunwa \n\nthere is so much to read and learn about elastos, i will send you some useful links at the end which you can browse.\r\n\r\nthe best thing to do after your research is to join the telegram channel if you have any questions we can answer them there.\n\nhttps://www.elastoslinks.org/ (here you will find all possible links to elastos)\n\nhttps://www.youtube.com/watch?v=vaPdh35elYc (intro from cyberrepublic what we are)\n\nhttps://elastos.academy/ (for technical information)\n\nalso follow twitter to be always updated :)", "likes": 1}, {"author": "oluwadamilola, moyosoluwa Adegunwa", "text": "It seems you know a lot about what you are saying... any link to resources that can teach me more about what you are saying. Thanks in advance", "likes": 0}]}, {"topLevelComment": {"author": "Atharva Kokate", "text": "truffle test not showing any output...can anyone help me with that?", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "maybe you dont have test written?", "likes": 0}]}, {"topLevelComment": {"author": "Laura Escribano", "text": "When I run the npm start cmd, my browser opens a new page on localhost saying: CANNOT GET/\nPlease help!!!!", "likes": 1}}, {"topLevelComment": {"author": "SHUBHAM Kumar", "text": "Thanks man. Very nice tutorial and you taught step by step. Please keep making such tutorials. Thanks a tonn. 😍🙂👍", "likes": 1}}, {"topLevelComment": {"author": "Christian Sakai", "text": "Your twin brother needs more screen time lol", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "agreed haha", "likes": 0}]}, {"topLevelComment": {"author": "Kelvin Janssens", "text": "Dapps are being used by many firms but some firms only have dsaas also, firm like Trias are having one of the best blockchain services with dsaas and dapps which makes it unique from others, their services can be used in any blockchain and so is been used, they are great at it!!", "likes": 0}, "replies": [{"author": "YTG", "text": "mmm what ?", "likes": 0}]}, {"topLevelComment": {"author": "koko", "text": "when i install truffle i have this <deprecated mkdirp@0.5.1: Legacy versions of mkdirp are no longer supported. Please update to mkdirp 1.xdeprecated mkdirp@0.5.1: Legacy versions of mkdirp are no longer supported. Please update to mkdirp 1.x> what should i do ?", "likes": 0}}, {"topLevelComment": {"author": "Mudassir Ali", "text": "One of the best Dapp Tutorial for beginners I have ever  seen, you teach each and every basic concept of programming and ethereum, your knowledge is outstanding and  your way of delivering  and teaching is I like the most I have learned most of the things from your channel and videos.\nThanks for Sharing and yes Keep sharing these kind of tutorials\nMuch love from Pakistan!\nYour big Fan", "likes": 2}, "replies": [{"author": "EatTheBlocks", "text": "Thanks Mudassir :)", "likes": 0}]}, {"topLevelComment": {"author": "koko", "text": "22:24 which cmd u use ??", "likes": 1}, "replies": [{"author": "Van lcl", "text": "node.js command prompt", "likes": 0}]}, {"topLevelComment": {"author": "Alex Melka", "text": "36:06 environment explanations\n4:14:49 ropsten", "likes": 1}}, {"topLevelComment": {"author": "raghav", "text": "I am getting this error The MetaMask Web3 object does not support synchronous methods like eth_call without a callback parameter. I think the versions are now updated and don't support a call like this", "likes": 0}}, {"topLevelComment": {"author": "jOsh", "text": "This is the best dAPP course and you have a great sense of humour my friend.", "likes": 10}, "replies": [{"author": "M Younas", "text": "@begi mahone yes", "likes": 0}, {"author": "begi mahone", "text": "@M Younas did you get your ETH from faucet before starting?", "likes": 0}, {"author": "M Younas", "text": "@EatTheBlocks I followed you step by step however at the end when deploying to ropsten it's not working with me show this error message: \"Migrations\" could not deploy due to insufficient funds. how can I solve this issue?", "likes": 0}, {"author": "EatTheBlocks", "text": "thanks Josh:)", "likes": 0}]}, {"topLevelComment": {"author": "Klaüs Smooth", "text": "We need \"Smart contract\" counter", "likes": 2}}, {"topLevelComment": {"author": "abdullah yıldız", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Hezron Karani", "text": "Is he funny?", "likes": 0}}, {"topLevelComment": {"author": "Syed Muhammad Danish", "text": "At 01:23:00, i am getting error (Uncaught (in promise) Error: ERROR: The returned value is not a convertible string:). Everything is fine but the browser is not showing the return value from the smart contract.", "likes": 1}, "replies": [{"author": "Daweb Schools - Brasil", "text": "me too", "likes": 0}]}, {"topLevelComment": {"author": "Syed Muhammad Danish", "text": "I just don't know how to say thanks to all these free programming resources. You guys are amazing.", "likes": 23}}, {"topLevelComment": {"author": "Nas", "text": "31:11 when run 'truffle test' on terminal(Mac), I got the error as below\n\n\n\"Could not find suitable configuration file.\nTruffle v5.1.14 (core: 5.1.14)\nNode v12.15.0\"\n\n\nMay I know how to resolve this?", "likes": 0}, "replies": [{"author": "Unknow InternetUser", "text": "same problem did fixed it?", "likes": 0}]}, {"topLevelComment": {"author": "wilhelm", "text": "This is great 🙌", "likes": 0}}, {"topLevelComment": {"author": "RamaKant Kaurav", "text": "Hi, Thanks for giving brief description about Dapp. Can you also add video for multi Webpage Dapp with web3. It will be great help for us if you will do it.", "likes": 0}}, {"topLevelComment": {"author": "Nitin khanchandani", "text": "I read that Smart Contract that is entered in BlockChain can not be changed, as that is immutable,  but I am in confusion after executing day5-crud, please suggest", "likes": 0}}, {"topLevelComment": {"author": "The Anonymous", "text": "hi man, thanks for sharing this tutorial. I am trying to follow it but I am blocked at minute 22.23 because the link shown is a 404 github page, so i cloned the repo without removing \"pro\", but the folders are different, so it's a bit confusing to follow", "likes": 3}}, {"topLevelComment": {"author": "Parviz Ramazanli", "text": "Thank you so much for the video. But in this folder eattheblocks\\dapp-30\\day4-advanced-storage\\frontend\\start\\public, no any bundle.js file. Is it right? or this file is missed?", "likes": 0}, "replies": [{"author": "Nitin Choudhary", "text": "Did u find the solution for this missing file ?", "likes": 0}]}, {"topLevelComment": {"author": "Alex Melka", "text": "cool but only if you use apple otherwise useless", "likes": 0}, "replies": [{"author": "Brogrammer Ben", "text": "Im doing all of this on windows", "likes": 0}]}, {"topLevelComment": {"author": "Jay Jaganathan", "text": "When I run 'truffle test', I get 'Could not connect to ethereum client' error. How do i resolve it?", "likes": 0}, "replies": [{"author": "Rafael Carvalho", "text": "Install and run ganache-cli. Have a look at it in the truffle docs. If any doubt remains after that just let me know.", "likes": 0}]}, {"topLevelComment": {"author": "amy zhang", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "PHAN ĐĂNG QUÝ", "text": "Day 1. I run simpleSmartContract but error: \"Should deploy smart contract properly\". Please help me!", "likes": 0}, "replies": [{"author": "HARIN .G", "text": "@EatTheBlocks cmd . SimpleSmartContract has not been deployed to detected network (network/artifact mismatch)", "likes": 0}, {"author": "EatTheBlocks", "text": "Where do you see this error? What did you do exactly to see this? Are you using Remix? Are you using the correct version of Solidity?", "likes": 0}]}, {"topLevelComment": {"author": "Carlos Mendizabal", "text": "Can somebody explain how to access the ropsten implementation from another pc?", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "you mean access ropsten network? check out the tutorial for the 5th dapp in the video (3:47:25)", "likes": 0}]}, {"topLevelComment": {"author": "Naveen kumar K", "text": "bro do a video on corda dapp blockchain  also", "likes": 1}}, {"topLevelComment": {"author": "Fayaz basha", "text": "sir pls make video on ruby on rails soon.. its very urgent pls", "likes": 1}}, {"topLevelComment": {"author": "ЗАРАБОТОК ОНЛАЙН", "text": "Nice video 💥👍 like 👍 come visit 👉 Smartex 🚀 from Russia 🤝🇷🇺", "likes": 3}}, {"topLevelComment": {"author": "Carl Justine Mosquida", "text": "What's the prerequisites?", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "Basic skills in web development", "likes": 0}]}, {"topLevelComment": {"author": "JP COURSES", "text": "Great stuff. Invaluable information. Cheers!", "likes": 1}, "replies": [{"author": "Soph Xxx", "text": "Very good walkthrough. I understood more about eth watching this than I ever would watching  vids about using eth. It helps to know how and why stuff works and is used.  I was good with btc and its blockchain, but eth has so many apps for so much development with it that even finding out where one thing started and the next ended was melting my head.  What was just for eth, what was for contracts, and dev, and even working out if I should run a node or not to be happy with what wallets.  Urgghhh...  I had to learn the btc blockchain api to understand it properly, so I knew how it was secure, and I needed something like that for eth and contracts. As a programmer, it's how I need to learn, by understanding the processes. Simple, but seeing the simplicity within such a mess of stuff for eth was too much. This Saved me lots of time, thanks", "likes": 0}]}, {"topLevelComment": {"author": "Ł Pochron", "text": "People who develop blockchain: what inspires you to do it / why did you start / what is your goal / hobby or work?", "likes": 2}, "replies": [{"author": "Calvin Ebun-Amu", "text": "The vision of Satoshi Nakamoto inspired me. Then I came across Ethereum and realized just how revolutionary this technology is for the advancement of mankind.", "likes": 1}, {"author": "Παναγιώτης Κυρμπάτσος", "text": "the ability to harness the power and robustness of a technology which is only 10 years old yet has already  started to change the world", "likes": 3}, {"author": "EatTheBlocks", "text": "I believe people should be self-reliant and independent. \nHowever, capitalism promotes exactly the contrary: power is extremely concentrated, and it's only becoming worse.\nBlockchain promotes decentralization, and align better with my values.", "likes": 3}]}, {"topLevelComment": {"author": "Sakthi", "text": "Free code camp  please make a video of json tutorial for beginners", "likes": 2}}, {"topLevelComment": {"author": "Ganes", "text": "Hi sir, do you have full course of Oracle accounting", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "oracle accounting? not sure do you mean by that", "likes": 1}]}, {"topLevelComment": {"author": "R_u_p _D", "text": "⭐️ Course Contents ⭐️\r\nDapp 1 - Simple smart contract\r\n⌨️ 8:22: Smart contract: Intro to Solidity, Remix, Deploying contract on Remix\r\n⌨️ 21:09: Tests - Introduction to Truffle and tests\r\n⌨️ 32:03: Frontend - Architecture of Ethereum Dapp / integration with smart contract, ABI, intro to Web3\r\n\r\nDapp 2 - Helloworld\r\n⌨️ 57:18: Smart contract - Solidity read-only functions, Interacting with functions in Remix\r\n⌨️ 1:07:28: Tests - Testing a smart contract function with Truffle\r\n⌨️ 1:12:33: Frontend - Interacting with a smart contract function from frontend, with Web3\r\n\r\nDapp 3 - Simple storage\r\n⌨️ 1:24:00: Smart contract - Solidity functions that can modify smart contract data (in transaction)\r\n⌨️ 1:41:53: Tests - Test (transaction) smart contract functions with Truffle\r\n⌨️ 1:45:27: Frontend - Sending transactions from frontend, with Web3\r\n\r\nDapp 4 - Complex storage\r\n⌨️ 2:04:05: Smart contract - Solidity Arrays (adding element, read single element, read all elements and get length) \r\n⌨️ 2:14:37: Tests - Testing Solidity arrays with Truffle, introduction to the BN.js library to deal with Solidity numbers\r\n⌨️ 2:26:54: Frontend - Using Webpack / ES6 for Dapp frontend, Intro to (new) Metamask and integration with frontend\r\n\r\nDapp 5 - Crud\r\n⌨️ 3:06:51: Smart contract - create, read update and delete data in Solidity\r\n⌨️ 3:31:33: Tests - How to tests Solidity errors with Truffle (require, revert...)\r\n⌨️ 3:47:25: Frontend - Deployment on public testnet (Ropsten) and Mainnet with Infura\n\n\nHope, It will help someone! ;-)", "likes": 224}, "replies": [{"author": "Soumen Khara", "text": "Can you make the subdivision times also 😉👉👈", "likes": 0}, {"author": "Pratham Anand", "text": "Was this useful?", "likes": 0}, {"author": "Random Click", "text": "Thank you", "likes": 0}, {"author": "Aditya gedam", "text": "Thanks", "likes": 0}, {"author": "Kshitij Vengurlekar", "text": "Thank You", "likes": 0}]}, {"topLevelComment": {"author": "Gamers Shrine", "text": "Sir please create video on ipfs and explain how to host a dynamic website on ipfs or any p2p network", "likes": 0}, "replies": [{"author": "Tycooperaow", "text": "EatTheBlocks I know, but the performance of it isn’t the best right now.", "likes": 0}, {"author": "EatTheBlocks", "text": "@Tycooperaow You can use IPFS gateway for dynamic content", "likes": 0}, {"author": "Tycooperaow", "text": "Blockchain dev here. Although it’s possible to do that, IPFS isn’t at the current set up to accomplish that to where it works or even preform like normal sites", "likes": 0}, {"author": "EatTheBlocks", "text": "good idea :)", "likes": 0}]}, {"topLevelComment": {"author": "Stephen Gabriel", "text": "I like this guys energy, I already feel that I can go through this with him! Thanks man", "likes": 62}, "replies": [{"author": "Crypto captain", "text": "I came across a platform that helps you turn you\nweb app to dapp with just 3click", "likes": 0}, {"author": "Pavel Petrov", "text": "Did you?", "likes": 0}]}, {"topLevelComment": {"author": "Linz", "text": "Plz make tutorial how create Android wallet application for this token how can link with metamask wallet to create Android application.", "likes": 1}}, {"topLevelComment": {"author": "Chandni Sorathiya", "text": "Hey i don't know why you remove bootstrap tutorial Video bt please share that tutorial", "likes": 0}}, {"topLevelComment": {"author": "HARIKRISHNAN S R", "text": "Hi Team, your videos are really awesome. Could you please do a video tutorial for Hyperledger", "likes": 2}}, {"topLevelComment": {"author": "Jorge Santos", "text": "It was suppose to be this video instead the Bootstrap", "likes": 0}}, {"topLevelComment": {"author": "B U", "text": "I want to build  child support dapp and host a multi vendor website on blockchain", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "cool! Start small with this tutorial, after you can use what you learn as a basis!", "likes": 0}]}, {"topLevelComment": {"author": "Uffe Carlsson", "text": "very interesting topic. Just read about blockchain, and now easily explained and also tutorial.. Great job.. !", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "thanks!", "likes": 0}]}, {"topLevelComment": {"author": "Fernando Moura", "text": "thanks for sharing knowledge", "likes": 4}}, {"topLevelComment": {"author": "JAVAAID - Coding Interview Preparation", "text": "Nice one..", "likes": 1}}, {"topLevelComment": {"author": "Programming with Peter", "text": "This looks interesting! Saved it for later.", "likes": 5}, "replies": [{"author": "EatTheBlocks", "text": "awesome :)", "likes": 1}]}, {"topLevelComment": {"author": "Razeev", "text": "Thank you for the informative video.", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "Thanks man!", "likes": 0}]}, {"topLevelComment": {"author": "Videos Promoter", "text": "First", "likes": 1}}, {"topLevelComment": {"author": "Dinakenthiran.D", "text": "Please do about codeblocks", "likes": 0}, "replies": [{"author": "EatTheBlocks", "text": "codeblocks? you meam the code editor? I am not sure to understand", "likes": 1}]}]}