{"video": {"id": "9Fd9hw329fY", "title": "Create A 2.5D Platformer Game With Unreal Engine (Tutorial)", "description": "Learn how to create a 2.5D Platformer game with Unreal Engine in this full tutorial using C++. In this beginner's course, you will how to create a game with Unreal Engine and Blueprints.\n\n💻 Project assets: https://drive.google.com/file/d/1lAOYnsPh3oq89nfyc31zn5KrVs5wBK4p/view?usp=sharing\n💻 Completed code: https://drive.google.com/file/d/16jVlY4LB1CYVf0Lg2yyaESzLi_-4gErG/view?usp=sharing\n\n🎥 Course from Awesome Tuts. Check out their YouTube channel: https://www.youtube.com/awesometuts\n🔗 Learn more about game development here: https://www.awesometuts.com/ultimate-game-dev-academy?utm_medium=youtube&utm_source=freecodecamp\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT2H36M32S", "likes": "3466", "views": "177474"}, "comments": [{"topLevelComment": {"author": "Nursultan Nazarov", "text": "this guy is a noob", "likes": 0}}, {"topLevelComment": {"author": "史源喆", "text": "nice ue tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Makadi", "text": "حافظ مش فاهم", "likes": 0}}, {"topLevelComment": {"author": "success definition", "text": "What app is thar he is doing", "likes": 0}}, {"topLevelComment": {"author": "Frenchinator", "text": "it helps the algorythm", "likes": 0}}, {"topLevelComment": {"author": "Adam Lane", "text": "Is anyone else having trouble calling \"Show Interaction Text\" in \"BP_InteractiveBlock\" (1:57:00)? I cannot connect \"UI HUD\" to the Target pin on \"Show Interaction Text\". It also shows the current target of \"Show Interaction Text\" is \"BP Game HUD\". Is this correct? I'm using Unreal 5.0.1, FYI.", "likes": 0}}, {"topLevelComment": {"author": "Zingusan Interactive", "text": ":D\n-", "likes": 0}}, {"topLevelComment": {"author": "montather 97", "text": "gooooood\n💓💓", "likes": 0}}, {"topLevelComment": {"author": "Only Fam Oli", "text": "8:00 been looking for this everywhere", "likes": 0}}, {"topLevelComment": {"author": "Jessie Delorme", "text": "Look forward to more dude...im jus starting out in the world of game creation", "likes": 0}}, {"topLevelComment": {"author": "Nishal Poudel", "text": "At 4:03, he cliks on the exmaple map and it shows it on the screen. When I do it nothing shows, why?  The rocks mesh exists as I can  see them on the outliner but they don't show on the 'screen'. Can anyone help me please, I am a complete noob when it comes to unreal engine.", "likes": 1}}, {"topLevelComment": {"author": "Chris Fuentes", "text": "This is great brother!", "likes": 0}}, {"topLevelComment": {"author": "Naya Ramadan", "text": "My ball isn't showing in the game when I press play at 11:03 , anyone knows if something is wrong with the script or if I am doing something wrong..", "likes": 1}}, {"topLevelComment": {"author": "Naya Ramadan", "text": "4:39 bookmark", "likes": 0}}, {"topLevelComment": {"author": "Antti Kantola", "text": "it doesnt do the interaction from my E button :(  i think it some time. wonder that auto action and action thing.  maybe i find out trouble.", "likes": 0}}, {"topLevelComment": {"author": "Dmitry TT", "text": "Guys, if you have problems compiling the material (most likely you are working in ua5), use the mask node(r,g,b,a) at the moment when the node Lerp(time -> divide->sine -> lerp) goes to if(a==b). I had to spend a lot of time to fix this :D", "likes": 4}}, {"topLevelComment": {"author": "knarf", "text": "1:07:10 bookmark", "likes": 0}}, {"topLevelComment": {"author": "arsha parhizi", "text": "i wanna to add shooting system in this game but i dunno how some one can help me", "likes": 0}}, {"topLevelComment": {"author": "ᏞᎾᏒᎠs Ꮎf ᏟhᎪᎾs", "text": "can you guys make a video on tyranobuilder 1.8 i really will love to know how create an animated image button", "likes": 0}}, {"topLevelComment": {"author": "Rukasumi", "text": "i cant get the ball to move right it keeps moving up and down off the map also when i start the level it automatically moves to the right idk why", "likes": 0}}, {"topLevelComment": {"author": "Bryant Chiew", "text": "helpppp! my laser doesn't have color, what do i need to do to add the color?", "likes": 0}}, {"topLevelComment": {"author": "TheOfficialAMT", "text": "Can you make a game like Red Ball 4 for mobile?", "likes": 0}}, {"topLevelComment": {"author": "DarkiGG", "text": "This video is good, but you're doing so much more then the basics, and thats not nececasrly good", "likes": 1}}, {"topLevelComment": {"author": "Axdn", "text": "How would I add a timer function and track Personal Best times?", "likes": 0}}, {"topLevelComment": {"author": "엄재천", "text": "I need help. why rotate intreactiveBlock? absolutely I did Set motion type free to lock of angular swing limit and twist limit", "likes": 0}}, {"topLevelComment": {"author": "Ariel Araya", "text": "1:40:00 my ball can enter to the laser and it's detected but on the next frame it doesn't do anything, i do not know what's happening, it's like the bp_laser haven't the tick event activated but it is", "likes": 0}}, {"topLevelComment": {"author": "Kempu EU", "text": "yata yata yata", "likes": 0}}, {"topLevelComment": {"author": "Mark Sun", "text": "In the final part, when we move the elevator, are we doing it by setting a new location and the elevator slowly moves to that position?", "likes": 1}}, {"topLevelComment": {"author": "Almark", "text": "I don't think we have worked enough with the great potential of Unreal engine for 2D games. There is just so much you can do, and even if it's overkill, that's fine, use what it gives you and make a great game.", "likes": 0}}, {"topLevelComment": {"author": "Allusio", "text": "is it just me or are there no assets in the folders?", "likes": 0}}, {"topLevelComment": {"author": "DarthKickapoo", "text": "How does Puzzlemode boolean in the Player blueprint receive input to know if player is moving right or left.", "likes": 1}}, {"topLevelComment": {"author": "Jacopo Freddi", "text": "For those who are wondering at 1:05:00 \"why does sign stabilize the ball\". Just put a breakpoint (press F9) on the Launch Character node and hover with the mouse over the input of the Sign node to see what it looks like. The value I saw for the first hit was -75 (which is the distance between the location of the hit and the center of the ball, aka the radius). The difference between \"with sign\" and \"without sign\" is just that in the first case you're always adding the same launch velocity to the character (i.e. a <(+/-) 800, 0, 1400> vector), while in the second case the X component depends on the distance between the center of the ball and the hit position. In this game there is no difference since the ball is spherical and every hit will always be at the same distance, but it may not always be the case. So, if you multiply by a value like \"12\" instead of \"800\" after sign and don't normalize the vector, the jump would work roughly the same, while in other cases (say you are playing as a car, or a spaceship, or another irregular form) you will want to take the direction of the hit in a normalized form in order to consistently apply the same hit.\n\nAnother way to see this is: you take the \"hit vector\" composed like this: <ActorLocation.X - HitResult.X, 0, 0> and \"normalize\" it to get a vector that is either <-1, 0, 0> or <1, 0, 0>.", "likes": 4}, "replies": [{"author": "Nightflash28", "text": "Here's the short version: the \"sign\" function returns either \"1\" or \"-1\". I haven't watched the video yet, but my guess is that we just want to figure out the direction of something rather than having big numbers that would result in some weird buggy movement. In the case of the X axis 1 would mean right and -1 would mean left.", "likes": 0}, {"author": "Luckful", "text": "Nice essay", "likes": 0}]}, {"topLevelComment": {"author": "Bee Burk", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "potato killer", "text": "I came here to learn how to make a platformer, stayed because I love the way this guy explains everything with his semi-sarcastic tone", "likes": 2}}, {"topLevelComment": {"author": "maharab hossain", "text": "Which apps and from where i can find it?", "likes": 0}}, {"topLevelComment": {"author": "jatin singal 18EARCS725", "text": "my pawn is not visible how to fix please help!", "likes": 0}}, {"topLevelComment": {"author": "Furkan", "text": "soooooo beaitful", "likes": 0}}, {"topLevelComment": {"author": "Lateraluz", "text": "this doesnt use c++ this uses blueprints.", "likes": 0}}, {"topLevelComment": {"author": "Алексей Злотников", "text": "1:39:55 Hi! How did you turn the laser around?", "likes": 0}, "replies": [{"author": "Алексей Злотников", "text": "@Raiko thank you!", "likes": 1}, {"author": "Raiko", "text": "FOR THOSE WHO ARE STILL WONDERING, change the laser direction X to -1.0", "likes": 1}]}, {"topLevelComment": {"author": "Swagata Chakraborty", "text": "I can't see the faint glow on the ball Player, why is that and how do I resolve it?", "likes": 0}}, {"topLevelComment": {"author": "Monhoo Batraa", "text": "Thank you for amazing tutorial", "likes": 0}}, {"topLevelComment": {"author": "İsim bulamadım o beni bulsun", "text": "I did everything as you did but when I overlap with lazer its just giving damage when entering the collision and quiting collision its not permamently how can I do that I did everything on event tick as you", "likes": 2}, "replies": [{"author": "Алексей Злотников", "text": "@İsim bulamadım o beni bulsun  I'll try that. Thanks)", "likes": 0}, {"author": "İsim bulamadım o beni bulsun", "text": "@Алексей Злотников I completed game perfectly expect that issue rather I changed damage to 100", "likes": 1}, {"author": "Алексей Злотников", "text": "My a ball allso that stops moving when encountering a laser", "likes": 0}]}, {"topLevelComment": {"author": "Giampiero Giulianelli", "text": "i am try to devolope this project but there are few problem, the block are moving in Z axis and if i try to jump on they move my camera out of the game , and when you roll the block also the box collider is rolling so does mean they change the interacting point, anyone have a solution?", "likes": 3}}, {"topLevelComment": {"author": "Алексей Ч", "text": "Нихуя не понятно, но очень интересно", "likes": 0}}, {"topLevelComment": {"author": "Beats By Nate", "text": "really helpful vid...thanks!!", "likes": 0}}, {"topLevelComment": {"author": "jeromy Smith", "text": "Arrgh! Timestamp 51:01, I'm getting a rotating world. I've gone over the rotation blueprint and can't spot anything different. Help!", "likes": 0}}, {"topLevelComment": {"author": "Macy Spitfire", "text": "So many bad bois there i suspect this game is some kind of criminal den or something. Anyway good tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Kerem Bozkurt", "text": "Bunları çalıştıkça öğrenilecek meraklanacak bişi yok", "likes": 0}}, {"topLevelComment": {"author": "Kevin", "text": "Ok so, you created a mesh with a ball material and then in the code you wrote a blueprint that change the color of the material which is the entire ball mesh, how did you make glow that specific part of that material?? And also in 35:50 why did you picked the get actor forward and multiplied with get MoveRight? What is the connection?", "likes": 0}}, {"topLevelComment": {"author": "Franek H", "text": "I found four problems / bugs \n\n 1. The materials are broken (I had to set the textures for the ball in the nodes manually looking at your pasued video) and I cannot for some reason set the materials for the particles (you had  them already loaded) its just a green square at the material section of the particle blueprint but doesnt let me change to any material     [EDIT:    The materials for particles can be easily changed by nodes :) Idk why they dont work in the menu]\n\n 2.  The cubes spin around even though we set the rotation constraints on it\n\n 3. If you constantly press 'E' while on the top of the elevator it will infinitely go up (moves very little every time you press E)\n\n 4. In the \"OnEndOverlap\" event we are disabling the input on \"E\" but what if the player is still holding the key? The beam still works and the cube can be pulled from any distance! The simplest solution for me was to add the \"CloseGate\" custom event to the end of the \"OnEndOverlap\" node\n\nThanks in advance for any replies !! :)\nIf anybody even reads this 3 months after the release of this video...", "likes": 0}, "replies": [{"author": "jeromy Smith", "text": "This is hard to explain, but I'll give it a go. Basically the links are just broken. You have to relink them from the texture library. There are 5 texture sample boxes that need relinked. One traces back from the Normal, replace it with \"T_Tech_Hex_Tile_N\". The others are much more confusing, but one has a plug going into the multiply block that heads over to the emission plug. That's your emission mask. Use Bloom_Mask for that one. Plug the tilable texture into the one coming directly off the red TexCoordinate node. I plugged the Spec_Texture into the node that plugs into ambient oclusion. The last one I used the Bloom mask again. Not sure if that one is right, but my ball looks like his at this point, so I'm guessing it's okay. If I run into any bugs I will go back and play with that one.", "likes": 0}]}, {"topLevelComment": {"author": "nomadicwoodlouse", "text": "Great vid, thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "AMIR ,  Edu Biz rule's  comunties", "text": "HOW CAN I OPTIMIZE 2.5D LONG LEVELS IN UNREAL ENGINE GAMES LIKE LITTLE NIGHTMARE/INSIDE\nI know about level streaming but still no proper tutorial on YouTube or documentation 😅 \nIf there exist other methods or turorial plz provide links , i will be very great full", "likes": 2}}, {"topLevelComment": {"author": "REB", "text": "i don't know why, i have broken textures (", "likes": 0}}, {"topLevelComment": {"author": "Giampiero Giulianelli", "text": "plz dont stop ......", "likes": 0}}, {"topLevelComment": {"author": "REB", "text": "i have a problem, can somebody tell me why when i open map, rocks aren't loaded, some error.\nUPD: nvrm, somehow they don't have static mesh", "likes": 1}}, {"topLevelComment": {"author": "Aaap Chutiye", "text": "timespamps....WHERE THEM TIMESTAMPS!!!", "likes": 0}}, {"topLevelComment": {"author": "chirayu", "text": "niceeee", "likes": 0}}, {"topLevelComment": {"author": "StarWolf 00", "text": "Please, More unreal engine 4 tutorials.", "likes": 1}}, {"topLevelComment": {"author": "Icicle", "text": "Unreal and Unity\nNotice how they all started with \"Un\"?\nand when you remove the \"Un\"s,\nand combine them,\nYOU GET REALITY", "likes": 48}, "replies": [{"author": "Matthew Ao", "text": "two negatives make a positive", "likes": 1}, {"author": "Louis A", "text": "Not gonna lie that kind of blows my mind", "likes": 1}, {"author": "4cBeat_", "text": "wow bruh that's nice man", "likes": 0}, {"author": "WTF BRO", "text": "what are you smoking hahaha!!!", "likes": 2}, {"author": "KBG", "text": "bruh what xD", "likes": 1}]}, {"topLevelComment": {"author": "Alex Costea", "text": "I haven't had time to go through all the tutorial, but so far, i'm finding it very helpful. Thank you!", "likes": 8}}, {"topLevelComment": {"author": "Ноунейм?", "text": "Fantastic job", "likes": 0}}, {"topLevelComment": {"author": "Bator Darzabe", "text": "My ball doesn't move but I have done everything exactly like you have said can anyone help me", "likes": 0}, "replies": [{"author": "Icicle", "text": "Try looking at any possible errors in your console, and see if you forgot to add any condition statement", "likes": 0}]}, {"topLevelComment": {"author": "Axps", "text": "\"Just kidding ıhııhı\" 😀🙌", "likes": 1}}, {"topLevelComment": {"author": "rifz42", "text": "this is awesome!  more UE4 tuts please!   thanks for including the project, it helps so much!!!", "likes": 2}}, {"topLevelComment": {"author": "CodingAbs", "text": "I love your teams video tutorials they are awesome and I too got the inspiration from you guys to share my knowledge  too by creating a YouTube channel .Thanks Checkout my channel: CodingAbs", "likes": 0}}, {"topLevelComment": {"author": "Kritik Kaushal", "text": "fcc is gold", "likes": 0}}, {"topLevelComment": {"author": "Omansh Sharma", "text": "Pls feel free to add ads in the vid, u guys deserve it", "likes": 1}, "replies": [{"author": "Flashy", "text": "YEAH THAT'S IT ADD ADS SO YOU CAN BECOME RICH OMG NO ONE THOUGHT OF THAT DUDE YOU ARE OMANSH EINESTEIN", "likes": 0}]}, {"topLevelComment": {"author": "Bailee Hickman", "text": "\"Stay out of jail and stuff.\"", "likes": 5}}, {"topLevelComment": {"author": "Kar Lee", "text": "YOU ARE THE MAN YOU ARE THE MAN YOU ARE THE MAN LOVE YOUR AWESOME VIDEOS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "pankaj sharma", "text": "what is the best way when product 's add to cart", "likes": 0}, "replies": [{"author": "pankaj sharma", "text": "where i store product data add to card session or datatable", "likes": 0}]}, {"topLevelComment": {"author": "Code light Sparkles", "text": "nice video", "likes": 0}}, {"topLevelComment": {"author": "YouTube MaTe", "text": "👍👍👍👍👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "MarkGoldbridgeFanboy", "text": "I wanna get into this but idk where to start unreal engine will i learn c++ through learning unreal or should i learn that before idk what to do or where to start lol", "likes": 2}, "replies": [{"author": "Michael Brown", "text": "he wants his own YouTube channel", "likes": 0}, {"author": "MarkGoldbridgeFanboy", "text": "@rifz42 coool", "likes": 0}, {"author": "rifz42", "text": "I suggest learning Unreal first,  and there is so much Blueprints can do. I haven't needed C++ yet. \nbtw Fortnite is 80% blueprints.", "likes": 1}]}, {"topLevelComment": {"author": "shrpdrts", "text": "I am sorry? Can you read my mind?", "likes": 1}}, {"topLevelComment": {"author": "Jayshree", "text": "This morning I was actually thinking of creating a c++ game for my project!!\nThanks man💖💕", "likes": 2}}, {"topLevelComment": {"author": "hilty", "text": "Thanks FCC! :-)\nPlease bring more godot 2d tutorials, maybe a godot 2d for beginners! :-D", "likes": 5}, "replies": [{"author": "freeCodeCamp.org", "text": "Here is a good Godot course: https://www.youtube.com/watch?v=fQXKjmCDkIA", "likes": 3}]}, {"topLevelComment": {"author": "Gustavo Costa", "text": "i love your videos, kiss from brazil !!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Blueprint Programmer", "text": "\"with Unreal Engine in this full tutorial using C++\" - no c++ in this video, only Blueprints (which are great too), please correct the description.", "likes": 53}}, {"topLevelComment": {"author": "Damian", "text": "Tutorial creating moba plox.", "likes": 0}}, {"topLevelComment": {"author": "hemanthsatyendra villuri", "text": "Can you make with Godot please", "likes": 0}}, {"topLevelComment": {"author": "Moba players", "text": "Just say \"I need the money from coming Youtube to support my living cost \" beginning of the video I bet you get more likes and your channel will grow", "likes": 0}}, {"topLevelComment": {"author": "Mohsen albo", "text": "Dude you're awesome", "likes": 0}}, {"topLevelComment": {"author": "Abhishek", "text": "Can you please tell me what i need to know before watching this video \nLanguage???", "likes": 3}, "replies": [{"author": "Aditya Joshi", "text": "C++ and unreal engine", "likes": 1}]}, {"topLevelComment": {"author": "Rohith Vishaal", "text": "Free code camp always suprises me..\nSuch quality content almost everyday🔥🔥", "likes": 30}, "replies": [{"author": "anh bạn à", "text": "how you can select all of that rock pls tell me", "likes": 0}]}, {"topLevelComment": {"author": "Duje Mandalinic", "text": "Love you for making free tutorials 😘", "likes": 4}}, {"topLevelComment": {"author": "Duje Mandalinic", "text": "Love you for making free tutorials 😘", "likes": 1}, "replies": [{"author": "Duje Mandalinic", "text": "@EduRise I will check you out :)", "likes": 0}, {"author": "EduRise", "text": "Hey we have ReactJS project tutorials as well and it's free too :)", "likes": 1}]}, {"topLevelComment": {"author": "Abhishek", "text": "Really loved your content\nYou all are very hardworking and quality is top level", "likes": 9}}, {"topLevelComment": {"author": "Pritam Chakraborty", "text": "First commenorrrr. BIG FANNNNNN", "likes": 1}}]}