{"video": {"id": "9TVYjjWkuOU", "publishedAt": "2017-06-30T10:50:32Z", "title": "Should I go back to school to get CS degree? - Ask Preethi", "description": "Question:\nI have been teaching myself to code for almost a year now. I initially started from Freecodecamp.com and other tutorials, the more I learn about web technologies like javascript the more I want to learn lower level languages like c++. A part of me wants to go back to college and study computer science. I have done a little research and many seem to say that it is not necessary but I want be marketable for a career in software development. I have read that the industry is being flooded with junior developers that don't know enough to be productive so I suppose that is why I think I need to go back to school. I had been applying to companies that fit my skill set and I haven't received one response regarding an interview.\nI would really appreciate your advice on whether I should bite the bullet and go back to college or keep getting better at javascript and web technologies ie react, angular...\n\nAnswer:\n[See video]\n\nAbout Preethi:\nPreethi Kasireddy is an engineer based in San Francisco. She's an avid learner who taught herself programming and machine learning, and is passionate about understanding things clearly and explaining them to others via blog posts.\n\nShe was previously a front-end & API engineer at Coinbase, a digital currency platform, where she helped architect and rebuild their front-end in React, Mobx and Redux. Prior to that, she was a partner at the venture capital firm Andreessen Horowitz and an Investment Banker at Goldman Sachs. She studied Systems Engineering at USC.\n\nTwitter: https://twitter.com/iam_preethi\n\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT13M22S", "likes": "1416", "views": "72785"}, "comments": [{"topLevelComment": {"id": "UgzqyglXsGntVNTV6qt4AaABAg", "publishedAt": "2022-04-25T11:23:09Z", "author": "Najwa Al moh", "text": "I dont get computer science dgree but I lern Front end devolper\nData analyst", "likes": 0}}, {"topLevelComment": {"id": "Ugx84HGI5Y_Is4MaKN54AaABAg", "publishedAt": "2022-04-25T11:18:58Z", "author": "Najwa Al moh", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"id": "UgxAKK4ZLErdMOGaqgl4AaABAg", "publishedAt": "2022-04-11T13:34:05Z", "author": "Beatriz Andrade", "text": "Thank you for the video! It’s hard when you are the only one in your friends with a specific goal. I have a bachelor degree in nursing, and I’m doing a graduate diploma in digital health. I want to work in the development oh health technologies for space ( I already work in the implementation of health tech in clinical settings and work in clinical informatics). And, I want to go back and do a computer science degree to complete the loop of my clinical side, the management side and the tech side in order to get the type of job I have. Jobs working in the development of health tech requires always a comps sci or eng. Degree. My profile is too clinical… and to work in the space industry, they like when you have many skills…! \nSo there is my question! Should I do it? I’m participating in the canadian space agency challenge to create a health tech for astronauts, I’m part of a space health team in the experimental biotechnology team… so Being there I see they all are eng. Or comp. sci. Persons…! I know My clinical side is super helpful, but I have limitations with the building of the tech!", "likes": 1}}, {"topLevelComment": {"id": "UgySh3OT15bVp-VjyWJ4AaABAg", "publishedAt": "2022-02-17T08:20:24Z", "author": "SamDoe_tv", "text": "Lol so its a yes…. And if youre in highschool, its a def YES", "likes": 0}}, {"topLevelComment": {"id": "UgzWSbKP8Szh4g2zHSV4AaABAg", "publishedAt": "2021-10-17T16:28:14Z", "author": "cuongNC", "text": "thanks so much!", "likes": 0}}, {"topLevelComment": {"id": "UgxxUkwHfKNXHrWYo254AaABAg", "publishedAt": "2021-08-09T17:29:16Z", "author": "Alex L", "text": "Preethi, you are so pretty)", "likes": 0}}, {"topLevelComment": {"id": "UgwKz9yT97LEIA-201l4AaABAg", "publishedAt": "2021-03-07T05:38:32Z", "author": "Dewanand Sahu", "text": "There is actually not a competition and never was. If you want to do something just go and do it. What would you be doing if your whole life food supply is secure ? Do that", "likes": 1}}, {"topLevelComment": {"id": "UgxYDNJJG54pLR4myjR4AaABAg", "publishedAt": "2020-04-17T18:36:38Z", "author": "Abhishek Dhaka", "text": "A very simple thing is that you already had a job so it was easier for you to left?\nbut what about person with no job and no degree", "likes": 0}}, {"topLevelComment": {"id": "UgySCZh1ZeKowR6RqdV4AaABAg", "publishedAt": "2020-03-14T13:17:25Z", "author": "some random fat guy.", "text": "I am doing bachelor's in English and I'm thinking to go back and take CS bachelor's again.. IDK I feel so insecure.", "likes": 0}}, {"topLevelComment": {"id": "Ugzzl0MFy54p85mBzPx4AaABAg", "publishedAt": "2019-11-05T19:41:52Z", "author": "masoud azimi", "text": "To be honest at first as i decided to watch this video i kind of new that i am wright about what i had in mind!!!\nSurely every body can do anything if the spirit exist in that person... after many years of being distanced i finally have chance to come back in CS, I am a little confused of what major to choose right now but i m sure it will be solved soon and i will become what i believe...\nThank you for your very very good video\nif you would liked i could use some advice about decision making...", "likes": 0}}, {"topLevelComment": {"id": "UgyIllk-N4zndD8OknR4AaABAg", "publishedAt": "2019-10-27T05:48:51Z", "author": "Starvinmarvin Off", "text": "😍😍", "likes": 0}}, {"topLevelComment": {"id": "UgxqAvbwuaHWc2H0yc14AaABAg", "publishedAt": "2019-09-11T04:54:28Z", "author": "DSNCB919", "text": "I'm an automation engineer with a bachelors in mechanical engineering. I considered getting a masters in computer science but like said I'm not trying to go down student loan route again", "likes": 2}}, {"topLevelComment": {"id": "UgxVW03KLFeXt68eh-d4AaABAg", "publishedAt": "2019-07-12T17:20:08Z", "author": "Noc Tai", "text": "Same here,I don't have patience but want to be a programmer that's it", "likes": 0}}, {"topLevelComment": {"id": "UgzvH9l1FDJLS1tW8uJ4AaABAg", "publishedAt": "2019-06-26T01:18:25Z", "author": "Giovanny De Jesus", "text": "College make you pursue the degree...not so much the skill.", "likes": 1}}, {"topLevelComment": {"id": "Ugy08ePrudgxzyUYqmd4AaABAg", "publishedAt": "2019-06-21T04:45:11Z", "author": "Daniel", "text": "University is just a guide for you. It will help you avoid detours. Even so I dont think you need to go college to learn in this day and age.", "likes": 0}}, {"topLevelComment": {"id": "UgwXtnNVJ4JUXgCz81N4AaABAg", "publishedAt": "2019-04-10T04:48:19Z", "author": "Drew Nayr", "text": "This video is a bit old, but unless you get into a top school for computer engineering don't waste your time. My local university only teaches in C++, which will not get you a job these days. Is it nice to know C++? Sure, but chances are college didn't make you fluent in it, thus the unproductive junior programmers. You can learn Python, SQL, C# on your own and you will be employable. The key is to make some apps or websites and create a portfolio. Companies want to see that you can do it, nobody cares about your degree, although they do look good on a resume. If you are not getting call backs, look at your resume, is it full of unrelated job experience, or your program languages and projects?", "likes": 1}}, {"topLevelComment": {"id": "UgxMl6Ok42rgLvFpG_R4AaABAg", "publishedAt": "2019-02-06T18:24:31Z", "author": "QarnageFit", "text": "this video was a huge waste of time, and clickbaity. Youtube, do better with filtering stupidity.", "likes": 0}}, {"topLevelComment": {"id": "Ugw7qX-VLSLX-5QPh_54AaABAg", "publishedAt": "2018-09-29T21:18:40Z", "author": "Dr. Freeman", "text": "Free CS courses:\nhttps://ocw.mit.edu/index.htm", "likes": 0}}, {"topLevelComment": {"id": "Ugx06tf8th5tYWg5rCh4AaABAg", "publishedAt": "2018-09-19T15:02:40Z", "author": "vamshi Krishna nimmakuri", "text": "you should have been a student in India . then you will say to quit college ASAP", "likes": 0}}, {"topLevelComment": {"id": "Ugy4Rj6w9DUK07v4jjd4AaABAg", "publishedAt": "2018-09-19T05:31:56Z", "author": "myCousinVenny", "text": "Sales Rep => Software Engineer 👍🏽", "likes": 4}}, {"topLevelComment": {"id": "UgyuzSLNh_wXGaI-9Ht4AaABAg", "publishedAt": "2018-07-25T18:16:01Z", "author": "MSolved Tutoring", "text": "She did a really good job discussing this!", "likes": 0}}, {"topLevelComment": {"id": "UgyU2DgY6ozQ2f3WI0B4AaABAg", "publishedAt": "2018-05-30T14:17:00Z", "author": "mercantilistic", "text": "Programming is not the same as computer science. If you want to program you can certainly teach yourself like I did, just reading books and doing courses but it's not at all the same as having a computer science degree (which not having hurt me a lot when looking for a job overseas). Architecture, algorithms, compilers, how computers work isn't something that is covered by intermediate coding courses.", "likes": 18}, "replies": [{"id": "UgyU2DgY6ozQ2f3WI0B4AaABAg.8gsPC5EH-Jv9b-CzCUrJVb", "publishedAt": "2022-05-14T05:25:02Z", "author": "MaoItsMe", "text": "@Michal Poláček so you don't know how to read I guess", "likes": 0}, {"id": "UgyU2DgY6ozQ2f3WI0B4AaABAg.8gsPC5EH-Jv9b-AWGoA6JR", "publishedAt": "2022-05-14T05:03:28Z", "author": "Michal Poláček", "text": "@MaoItsMe Yes, so?", "likes": 0}, {"id": "UgyU2DgY6ozQ2f3WI0B4AaABAg.8gsPC5EH-Jv9Vz4gN0OM5O", "publishedAt": "2021-12-15T15:44:57Z", "author": "MaoItsMe", "text": "these are still subjects you can teach yourself online", "likes": 4}]}, {"topLevelComment": {"id": "UgzCceGm5c-gJa8B79d4AaABAg", "publishedAt": "2018-05-13T07:52:41Z", "author": "HOWYOUDOIN884", "text": "I never liked the term \"coding\" to mean anything other than working with static/markup languages like HTML, CSS, JS, and the like.  Speaking of terms, I heard the term \"Software Engineer\" has been deprecated, since it didn't really match other tech areas like engineering, where you literally need a license to earn the title of Engineer.   .", "likes": 1}}, {"topLevelComment": {"id": "Ugyd1yjjDNlXm9PgpPJ4AaABAg", "publishedAt": "2018-04-04T00:41:00Z", "author": "andrew nottoli", "text": "As a recruiter I can say this complete BS, unless you are a super smart undergrad (probably from a wealthy family) that graduated in SF in to an analyst position at Goldman Sachs SF, worked in the (TMT) tech sector in SF, then did huge deals, can afford to live in the Bay, worked for VC's, has by default a large network of extremely connected wealthy people in SF, and then want to work on block chain which everyone (like GS) is pouring money in to, and in are in a ultra high demand field with proven skill, and then you had the $ to go to hardest Boot Camp in SF,  (see her LinkedIn), then OK this is for you. If your'e at a normal school thinking you should drop out, and your network will end up just like hers making 250k plus per year, or you'll even get a job, you're probably delusional. Agreed, very highly misleading. At least have the decency to acknowledge you had a massive head start over almost anyone. I have worked with GS and they are extremely selective at who they hire and once they do, you're way ahead of everyone in the hiring lane. If you factor in the cost of living, all in it probably cost somewhere close to $500k to do this. I went to school with people just as confused as this one, saying anyone can do what she did when it's maybe 2%.", "likes": 45}, "replies": [{"id": "Ugyd1yjjDNlXm9PgpPJ4AaABAg.8eakIXPR1Iv8nhtFvvs_J6", "publishedAt": "2018-11-16T11:56:31Z", "author": "barret232hxc", "text": "my current job has nothing to do with my college degree. I answered a 1 sentence craigslist ad that said they would train the right people even with no experience. Came in for what they said was a class but was more like a crash course. Just googled everything to scrap together for something I had never done, got a call on my way home got the position 4 months being a contractor as a QA automation engineer, then got extended another 4 months and after became a fulltime employee. I knew nothing about javascript, automation, or web development. I'm now transitioning to a software engineer 3 years later. Everything I learned off youtube videos and googling. When I went to school there wasn't a wealth of free good quality learning resources. I learned more getting prepped for my current job than I did in college and I'm still learning every day.", "likes": 2}, {"id": "Ugyd1yjjDNlXm9PgpPJ4AaABAg.8eakIXPR1Iv8jSsPVhUciP", "publishedAt": "2018-08-02T20:35:40Z", "author": "phuturephunk", "text": "Fact.  All of it.", "likes": 8}]}, {"topLevelComment": {"id": "UgyqbIpnYxITT7Iwe7Z4AaABAg", "publishedAt": "2018-03-22T13:52:25Z", "author": "Joe Robertson", "text": "If you are already working in the field, I would not go back to school for a degree. Time spent working in the field beats time spent in college. If you haven't started in the field then college can help get in.", "likes": 1}}, {"topLevelComment": {"id": "UgzIzKoST4DteVQ-s714AaABAg", "publishedAt": "2018-03-15T23:38:16Z", "author": "Gotejjeken", "text": "I mean don't take this wrong, but no hiring manager is about to say no to someone like you.", "likes": 6}}, {"topLevelComment": {"id": "UgwGnOei6TM0ysh169p4AaABAg", "publishedAt": "2018-03-12T18:34:52Z", "author": "ZelenaZmija", "text": "One thing that always seems omitted in these types of videos is the types of jobs you can potentially get being self taught or going the boot camp route. These people are all web developer arguably one of the easier types of developer jobs in the field. Nothing wrong with that but it does not give you the background to do some of the other more intense (and cooler in my opinion) stuff like algorithmic trading for a big bank or hedge fund, the software behind making rockets fly and land, how to get a self driving car to actually drive itself, operating systems, cyber security. Not saying you cant get those types of jobs by being self taught but it is almost impossibly harder going the self taught route for those fields then just say being a really good CS student and doing a Bachelors in 4 years or a BS-MS combo in 5 years.", "likes": 4}}, {"topLevelComment": {"id": "UgxrbawwUV_Pf3ksCR54AaABAg", "publishedAt": "2018-03-08T02:14:58Z", "author": "amit singh", "text": "T", "likes": 0}}, {"topLevelComment": {"id": "UgxtXsDDZrzAk4hmuoF4AaABAg", "publishedAt": "2018-03-03T05:27:09Z", "author": "beenay18", "text": "I did bachelors in civil engineering. Liked nothing about civil engineering. I worked as architect for my dad who owns some trucks and few excavators and is trying to run a construction company. But he has no idea about good architecture and bad architecture. All he wanted was meeting the formality in as cheap price as possible. And on top of that the government engineers are making it hard for the non-government engineers to do this job by delaying and giving problems in approval process and persuading the clients to give them the projects instead or pay high amount of bribe to approve the design and construction works. I can't get work any more.  Now I am studying Msc. in structural engineering. But I don't think I can do this anymore. So I am thinking of switching my profession. I want to get into computer programming. Your insight was very helpful. Thank you very much.", "likes": 0}, "replies": [{"id": "UgxtXsDDZrzAk4hmuoF4AaABAg.8dJrbHbM_5T9iGfra_pGG9", "publishedAt": "2022-11-10T23:52:59Z", "author": "Konstantin", "text": "Hi! Just interesting :) Did u get it?", "likes": 0}]}, {"topLevelComment": {"id": "Ugw_W40g2frmAP5uJM94AaABAg", "publishedAt": "2018-03-03T05:12:52Z", "author": "beenay18", "text": "something in your nose was distracting.", "likes": 0}}, {"topLevelComment": {"id": "UgxuNitXNpMj0uYAho14AaABAg", "publishedAt": "2018-02-19T17:05:54Z", "author": "Jose Seminario", "text": "Hi! I would love to take your functional course.Have already signed up but havent received any mail.", "likes": 0}}, {"topLevelComment": {"id": "UgzzQ2Wez4jJFoc3r2t4AaABAg", "publishedAt": "2018-02-17T22:16:33Z", "author": "Tony D", "text": "Engineering mindset is where it's at. I know some friends who were so entrepreneurial and pragmatic in their thinking until they got a job. Then they turned back into consumers. They probably aren't going to stay that way. I'm not condemning anyone to being lazier (not lazy) once they find a job. But the engineering mindset is very powerful, and the doors opened by STEM and math degrees are many many many! With ADHD, the main thing is that we do, we practice. When we see an opportunity we go after it. Look, money is an opportunity. I worked at so many fast food and min wage jobs. You shouldn't be worried about skipping college. You should really be advocating for you and your friends to skip the min-wage experience! Ha.", "likes": 0}}, {"topLevelComment": {"id": "Ugx-pghqGCutTMgQQ9l4AaABAg", "publishedAt": "2018-01-11T19:59:45Z", "author": "west", "text": "guys i want to do a degree and a bootcamp    should i do bootcamp before the degree or after    ps i can do the bootcamp during summer so it wont interfer  with the degree   also im only 18 so i am young", "likes": 0}}, {"topLevelComment": {"id": "Ugz1RPb3Kmpmga-8vsN4AaABAg", "publishedAt": "2017-12-26T05:50:09Z", "author": "SandyRocks", "text": "I worked in Oracle I worked in HSBC for 6 years in total . I will say u definitely need degree but you should have a purpose that is what you want to learn example Machine Learning / Artificial intelligence / Computer Vision / self driving vehicle etc . You cannot learn it on internet . You need an experienced professor to work with to make your degree meaningful.", "likes": 8}, "replies": [{"id": "Ugz1RPb3Kmpmga-8vsN4AaABAg.8acNz5FhcdH9esVZzqVj_Y", "publishedAt": "2022-08-18T15:39:08Z", "author": "Rayyan Amir", "text": "You don't need to go to a college to learn the stuff tgat you mentioned. These days there is tons of free info on youtube, free code camp, coursera, etc", "likes": 0}, {"id": "Ugz1RPb3Kmpmga-8vsN4AaABAg.8acNz5FhcdH8m8RBcOomfz", "publishedAt": "2018-10-08T11:38:28Z", "author": "pradeep kumar", "text": "@SandyRocks Labs for 'research'\nThose labs can be your home desktop with a good gpu or you can hire one on a hourly basis from AWS\nGoogle Colab offers a gpu for their instance", "likes": 0}, {"id": "Ugz1RPb3Kmpmga-8vsN4AaABAg.8acNz5FhcdH8eAmkzlBD2U", "publishedAt": "2018-03-24T13:23:01Z", "author": "SandyRocks", "text": "Wallace Tan nope you need labs to do research !", "likes": 0}, {"id": "Ugz1RPb3Kmpmga-8vsN4AaABAg.8acNz5FhcdH8eAlsC8Em0-", "publishedAt": "2018-03-24T13:15:15Z", "author": "Bos Taurus", "text": "Except when you have all the resources yourself, and you will be your own professor.", "likes": 2}]}, {"topLevelComment": {"id": "Ugy5sJbinr03t7daAFZ4AaABAg", "publishedAt": "2017-12-14T04:12:22Z", "author": "Three One", "text": "1) I was a Dominos delivery driver for waaaaaay too long.\n2) I taught myself code.\n3) I did some cheap freelance work.\n4) I built one really good interactive photography site for a photographer.  I did this one for free.\n5) Somebody in Silicon valley saw the site and flew me out for an interview.\n6) I didn't get the job in Silicon valley and came back home crushed.\n7) I blasted out tons of resumes.\n8) I got my first job and never looked back.\nYou can do it!\n* Side note: At interviews I never talked about my lack of education and not one person even asked.  Nobody cared.  They just looked at my work.", "likes": 171}, "replies": [{"id": "Ugy5sJbinr03t7daAFZ4AaABAg.8a8JFQrBIGN9MljLT7KMtG", "publishedAt": "2021-04-30T18:37:03Z", "author": "Anurag pant", "text": "I am in the same condition as you were. Please connect with me on instagram -  pantanurag999", "likes": 0}, {"id": "Ugy5sJbinr03t7daAFZ4AaABAg.8a8JFQrBIGN90LzzNi6NcA", "publishedAt": "2019-10-21T13:52:16Z", "author": "awesh yakta", "text": "From where did you learned to code.", "likes": 0}, {"id": "Ugy5sJbinr03t7daAFZ4AaABAg.8a8JFQrBIGN8t9cOY2lj1v", "publishedAt": "2019-03-31T22:24:06Z", "author": "Marcio Mafideju", "text": "Great. You do not need to spend hundreds of thousands of dollars to learn something. You are the real example here. Congrats!", "likes": 2}, {"id": "Ugy5sJbinr03t7daAFZ4AaABAg.8a8JFQrBIGN8geuRjn4FWp", "publishedAt": "2018-05-25T08:29:23Z", "author": "DNAngel", "text": "Thanks for sharing your story! :)", "likes": 4}, {"id": "Ugy5sJbinr03t7daAFZ4AaABAg.8a8JFQrBIGN8aXIKkb5xdW", "publishedAt": "2017-12-23T21:05:22Z", "author": "Kenneth Dye", "text": "Three One Good for you!  Nice experience.", "likes": 1}]}, {"topLevelComment": {"id": "Ugx5uMYEvViSQU-VZAx4AaABAg", "publishedAt": "2017-12-04T05:15:49Z", "author": "Swarnim Arun", "text": "It's recommended to get a Degree and not must but my suggestion is that, if you have the money and the time and patience then get one and it will surely help. And better yet that it will be what you needed to get to the Job easier and meet alots of awesome people.", "likes": 2}}, {"topLevelComment": {"id": "UgxxqlCaicFmN_jUQV94AaABAg", "publishedAt": "2017-11-28T00:32:50Z", "author": "robbertou", "text": "Awesome vid! Currently on the self learning path and really enjoying it.", "likes": 0}}, {"topLevelComment": {"id": "UgyVtxxkfeGs9bRvh2B4AaABAg", "publishedAt": "2017-08-31T18:05:45Z", "author": "ARUMALS", "text": "If you don't go to the college you will be tide to the same time of jobs positions for years.\n\nIf you don't go to the college you won't be able to work in other countries, because countries have laws and they require you to have a degree according your position to emigrate.\n\nIf you don't go to the college you will learn how to write code, but you won't have the engineer background profile, and you will always be in disadvantage when competing to a good job position.\n\nYou can skip the college if you want to start your own business, but not if you want to work for a company.", "likes": 10}}, {"topLevelComment": {"id": "UgyTRwjCIMAj2Zi209p4AaABAg", "publishedAt": "2017-08-15T08:24:48Z", "author": "CantSeemToThink", "text": "That's very well put. \nIt If you have a chance (time/money/etc) go get a degree -it only helps. \nBut if you cannot afford to get a degree then be willing to put in passion and hard work and lots of time and nothing will stop you. Eventually you will have something real to show off and some knowledge to back up your skills during an interview. Be humble, honest and have something to support your claim that you are ready to work as a programmer.\nAlso don't forget that even a CS degree is just a start and you'll have to put in hard work to expand your knowledge, be competitive and stay relevant.\nBottom line IMHO is if you don't like it after a few months then just look for something else cause you won't have enough strength to do it for many years and it becomes really rewarding discipline after many years of hard work IMHO.", "likes": 1}}, {"topLevelComment": {"id": "Ugjs1Hs1swOUXHgCoAEC", "publishedAt": "2017-07-14T04:05:11Z", "author": "James Rabaryiza", "text": "Thank you very much for telling the truth.", "likes": 0}}, {"topLevelComment": {"id": "UggdXKVxICRAnHgCoAEC", "publishedAt": "2017-07-13T21:17:58Z", "author": "B T", "text": "So after all of this you are saying that the CS degree is better and easier to get a job with.", "likes": 0}}, {"topLevelComment": {"id": "Ugih0NNY-aOrb3gCoAEC", "publishedAt": "2017-07-11T21:16:26Z", "author": "Neeraj Shah", "text": "I strongly dislike this video. At 3:58, she mentions that if others could do it, she could do it too. Preethi came from USC, a private school notable for its amazing alumni network and worked as an investment banker at GS. Others that she mentioned also had a fantastic network full of higher ups and went to large private ivy league schools. I would like to offer my perspective from a regular person born to a middle class family. I went to college and got my CS degree despite knowing enough programming to get a full-time job in high school, and am now working at a very large corporation. If I had not gone to college, there is no possible way I would be working as a software engineer. Recruiters would have ignored my resume if I did not have a college in degree on it. If you are a regular person like me with no major connections, going to college is the only way you can get a real, well-paying software engineering job before you hit 30. \nAlso, she went to Hack Reactor, which is a very selective boot camp with a 3% admit rate. Most people who get into good boot camps already have college degrees from good schools and already have prestigious careers. I dislike the idea that anyone who works hard can get into the software field - the truth is that if you don't have the right connections or the right qualifications (like a college degree or major work experience) then most recruiters will ignore your resume regardless of how great your github profile is. Please, go to college if you can, especially if you are a high school student. It is worth the investment.", "likes": 62}, "replies": [{"id": "Ugih0NNY-aOrb3gCoAEC.8UtSRNvmTZZ92mjpqxjeh0", "publishedAt": "2019-12-21T01:32:41Z", "author": "Uzair Akram", "text": "Also you have to be realistic with yourself, some of the projects I did for my class, I would have never been able to do them at the pace that I did if I was doing independent learning. Also for anyone younger than 22 college provides a good excuse to focus on learning otherwise people don't tolerate or support you for self-learning for 4 years, you would probably need to work and you just don't have the time to learn anything. Yes my professor taught me nothing to little but the classes forced me to learn, however most of the learning I did was on my own time and I had to force myself to learn it to keep up with the curriculum.\nMost people would develop a website and think they are done. There is a lot more work that goes into things, college is a slow process so take the time to be more well rounded so you will be able to work in a multidisciplinary environment and have some cursory understanding of physics and math so you can work alongside other engineers.\nAnd as more and more people enter through the nontraditional route the quality of these self-taught programmers will degrade.", "likes": 0}, {"id": "Ugih0NNY-aOrb3gCoAEC.8UtSRNvmTZZ8qZOd2YVGqs", "publishedAt": "2019-01-26T09:01:13Z", "author": "Chris Sabre", "text": "Good points, she had a serious background. Still, the industry is becoming far more open as the demand increases.", "likes": 1}, {"id": "Ugih0NNY-aOrb3gCoAEC.8UtSRNvmTZZ8beqrZFPxBy", "publishedAt": "2018-01-21T01:21:08Z", "author": "Iana Kalinichenko", "text": "I agree. As an academic advisor, I noticed that most people make a connection between \"academic degree\" and \"high chance of being employed upon graduation\" based on the assumption that there is some kind of special relevant knowledge that an academic degree might give you. However, academic degree might not (and in most cases not even supposed to) give you the kind of knowledge that you can directly use in order to make yourself a more prospective candidate on a job market. What really matters IS your network. And academic degrees can give you that network if you do not have any other way to make connections in the field. But they will not give you any kind of knowledge that you will never get otherwise. Academic curriculum, literature lists, experienced mentors and study groups are openly available nowadays, so nothing prevents you to follow CS degree path without actually going to the college. What you cannot get anywhere else than in college is the label of \"a person who got a CS degree from a college\" :) And in some places those labels still play a role.", "likes": 4}, {"id": "Ugih0NNY-aOrb3gCoAEC.8UtSRNvmTZZ8VIMDchdppf", "publishedAt": "2017-07-21T22:42:22Z", "author": "Neeraj Shah", "text": "You missed my point. I am not saying that a CS degree is a \"legal requirement\" or that you learn things relevant to your career. I am saying that, from an industry recruiting standpoint, you MUST have a degree if you lack connections. Since most people lack connections into industry, they need a degree to get into the software industry. Also, if you want to peddle your bootcamp, go somewhere else please.", "likes": 9}, {"id": "Ugih0NNY-aOrb3gCoAEC.8UtSRNvmTZZ8VIEZ_rrwfY", "publishedAt": "2017-07-21T21:35:28Z", "author": "BlueGiant69202", "text": "Neeraj Shah You do have a point in that there are industries in which a degree from an accredited institution is a legal requirement for public safety/responsibility/liability reasons but business ownership and programming have so far escaped attempts to corral them like that. Will that last forever? I don't know. Sometimes it doesn't. I've met programmers that won't say a word about even the most basic thing in Java or VBA because they regard it as their bread and butter and worth a $60-$100 per hour consulting fee. Semmy Purewal, who wrote a book on Web App development, wrote in his preface that he got his degree and then found that the CS department was completely out of touch with commercial work so he had to learn from books and fellow practitioners. \nI know a person that was taught Pascal in University while a friend that went to a technical college to be a computer repair person was taught C.\n     Universities and polytechnical institutions have been out of sync with society for quite a while now (see Ch. 7 The Salvaging of Civilization by H.G. Wells, 1921) and they are now being actively bypassed by online experiential learning and mentoring available from organizations like XTOL (Experiential Teaching Online) that have partnered with accredited institutions of higher learning.\n  \nXTOL\nhttps://www.xtolcorp.com", "likes": 1}]}, {"topLevelComment": {"id": "UghJ4IfigmZgQXgCoAEC", "publishedAt": "2017-07-11T00:08:38Z", "author": "Brian Nock", "text": "Just because u go to school for it doesn't mean ur good at it, just means u did enough to get your degree.", "likes": 2}}, {"topLevelComment": {"id": "UgjJTZdNOCD3xHgCoAEC", "publishedAt": "2017-07-09T04:54:50Z", "author": "Namdev Kendre", "text": "Gr8...This video very inspiring....", "likes": 1}}, {"topLevelComment": {"id": "UgjLWw44ADWX9XgCoAEC", "publishedAt": "2017-07-07T20:05:44Z", "author": "JM Mariano", "text": "love ur videos!", "likes": 0}}, {"topLevelComment": {"id": "UgiJJmUccY5wQHgCoAEC", "publishedAt": "2017-07-07T15:13:27Z", "author": "Antonio de Sousa", "text": "If you want to be a CS professor or work on pushing the envelope of knowledge in the field, then go for it. But if all you want is a programming job then there are faster and more effective ways of breaking into the programming \"profession\".", "likes": 5}}, {"topLevelComment": {"id": "UgjrUZ0d85SZOXgCoAEC", "publishedAt": "2017-07-07T02:22:35Z", "author": "kuhan Nagalingam", "text": "Can do both parallely , freecodecamp and degree", "likes": 13}, "replies": [{"id": "UgjrUZ0d85SZOXgCoAEC.8Uh7VPj35Xm92mkWvGJfrY", "publishedAt": "2019-12-21T01:38:42Z", "author": "Uzair Akram", "text": "no one is stopping you", "likes": 0}, {"id": "UgjrUZ0d85SZOXgCoAEC.8Uh7VPj35Xm8rmAFPPKvua", "publishedAt": "2019-02-25T13:56:17Z", "author": "Hakim Dream", "text": "kuhan Nagalingam True", "likes": 0}]}, {"topLevelComment": {"id": "Ugirb_U3Um65e3gCoAEC", "publishedAt": "2017-07-07T02:10:58Z", "author": "That Developer Guy", "text": "She says that she \"slowly moved down the stack\" what does this mean?", "likes": 2}, "replies": [{"id": "Ugirb_U3Um65e3gCoAEC.8Uh6AJRR9TN8UnH6G3A00m", "publishedAt": "2017-07-09T11:41:59Z", "author": "Yotipo", "text": "That Developer Guy I think the stack in this instance means the stack of calls that higher level code such as scripting code and programs that will make to operating system code which gives the CPU instructions. For example starting with Python and ending up at C", "likes": 3}]}, {"topLevelComment": {"id": "UgjYv9HobpwAN3gCoAEC", "publishedAt": "2017-07-07T01:52:52Z", "author": "James Logan", "text": "Preethi always nails it with her varied experiences and sharp insights.", "likes": 0}}, {"topLevelComment": {"id": "UghQNR3cGnUaQXgCoAEC", "publishedAt": "2017-07-07T01:51:31Z", "author": "John Paul Ada", "text": "4:38 - 4:45: Psychology to Software Engineer: THAT'S ME! 😁😁", "likes": 16}, "replies": [{"id": "UghQNR3cGnUaQXgCoAEC.8Uh3wq2vVeA8meOKNDaZmB", "publishedAt": "2018-10-21T06:48:23Z", "author": "Ali", "text": "I am also transitioning in that direction. Phd psychology to software/web dev.", "likes": 0}, {"id": "UghQNR3cGnUaQXgCoAEC.8Uh3wq2vVeA8geuBncTERB", "publishedAt": "2018-05-25T08:27:13Z", "author": "DNAngel", "text": "Me too! :)", "likes": 0}, {"id": "UghQNR3cGnUaQXgCoAEC.8Uh3wq2vVeA8fXIzbRw-QU", "publishedAt": "2018-04-27T03:48:03Z", "author": "George", "text": "John Paul Ada how did you do it?", "likes": 0}]}, {"topLevelComment": {"id": "UgjnfIZ66bu373gCoAEC", "publishedAt": "2017-07-07T00:40:21Z", "author": "Maudie Maude", "text": "I have to disagree with the comments here. Some people like me prefer to learn in front of a teacher to be able to ask questions, better explanations, etc. Also, the friends you meet at uni might be in your life forever. You make lots of connexions and you learn much more than just basic stuffs. I have to say I live in Canada so uni is only about 300$ per class", "likes": 12}, "replies": [{"id": "UgjnfIZ66bu373gCoAEC.8Ugwnaa0gwO9GDhDXTWKCN", "publishedAt": "2020-11-19T00:56:42Z", "author": "sam Jain", "text": "$5k per class...here...?", "likes": 0}, {"id": "UgjnfIZ66bu373gCoAEC.8Ugwnaa0gwO8V3xvO9SLDG", "publishedAt": "2017-07-16T08:31:55Z", "author": "Alexander Mills", "text": "Oh let's stereotype.", "likes": 3}, {"id": "UgjnfIZ66bu373gCoAEC.8Ugwnaa0gwO8UsaTMqYKP3", "publishedAt": "2017-07-11T13:16:06Z", "author": "John Sprunger", "text": "Incorrect, I have meant plenty of social people in my CS program, try not to stereotype an entire section of Applied Mathematics.", "likes": 4}, {"id": "UgjnfIZ66bu373gCoAEC.8Ugwnaa0gwO8UjYthpH74v", "publishedAt": "2017-07-08T01:00:27Z", "author": "Alexander Mills", "text": "Yes, but software developers are mostly asocial, so you aren't likely to make great friends in a CS program :)", "likes": 12}]}, {"topLevelComment": {"id": "UghtMRhGw-2rDXgCoAEC", "publishedAt": "2017-07-06T23:56:19Z", "author": "Dean", "text": "I have a CS and masters degrees neither of which taught me that much about coding. I learnt far more through self-teaching.\n\nPreethi makes a good point about developing evidence of your work. Employers want to see examples of work far more than a piece of paper.", "likes": 5}, "replies": [{"id": "UghtMRhGw-2rDXgCoAEC.8Ugrl6JUtYy92moNBEb4Xp", "publishedAt": "2019-12-21T02:12:20Z", "author": "Uzair Akram", "text": "I think that shouldn't be hard when you're going through your degree. You have a lot of opportunity to build that evidence of work from the various projects you do.", "likes": 0}]}, {"topLevelComment": {"id": "UggGSqS4lKM1UXgCoAEC", "publishedAt": "2017-07-05T17:38:27Z", "author": "LastName FirstName", "text": "Thank you, Preethi! Very encouraging.", "likes": 0}}, {"topLevelComment": {"id": "UgjcXatFHDoG4HgCoAEC", "publishedAt": "2017-07-05T03:33:24Z", "author": "0x.c0zy", "text": "This is sound advice, I myself had some doubts and was on the fence about going back to college after dropping out due to life circumstances. thank you for this video.", "likes": 0}}, {"topLevelComment": {"id": "UggZ3hiTs5Tal3gCoAEC", "publishedAt": "2017-07-03T19:33:56Z", "author": "S Ford", "text": "I NEEDED THIS!!!!!!! MANY THANKS!!!!", "likes": 2}}, {"topLevelComment": {"id": "UgggrkNQ1vaJingCoAEC", "publishedAt": "2017-07-03T15:01:18Z", "author": "David Fekke", "text": "Couldn't agree more. I have a STEM related degree, but it is not a CS degree. I have been working as a software developer for 18 years, and I am largely self taught. I was lucky because I had good mentors. I also joined a user group, and learned a lot from fellow developers.", "likes": 3}}, {"topLevelComment": {"id": "UghEX-PNnxs4d3gCoAEC", "publishedAt": "2017-07-03T00:48:57Z", "author": "Joseph Jones", "text": "The answer is no.  I saved you 13 minutes.  I have a cs degree and no job for 8 months still.  Practice your algorithms, leetcode, hackerrank, soft skills, and get a job in the meantime.  School is pointless.", "likes": 72}, "replies": [{"id": "UghEX-PNnxs4d3gCoAEC.8UXeb51mwb58ahpN5vJomJ", "publishedAt": "2017-12-28T08:34:26Z", "author": "Petar Jovovic", "text": "Well i mean if you get a CS degree from some of the top schools its not usseles. If you had a CS degree from MIT i doubt you wouldnt get interviews.", "likes": 3}, {"id": "UghEX-PNnxs4d3gCoAEC.8UXeb51mwb58XAQqJkNmcu", "publishedAt": "2017-09-06T13:51:36Z", "author": "Steadman IS", "text": "school is pointless if only you go there to learn how to become an employee", "likes": 14}, {"id": "UghEX-PNnxs4d3gCoAEC.8UXeb51mwb58UkRd87ULix", "publishedAt": "2017-07-08T09:16:16Z", "author": "Odin IT", "text": "Joseph Jones I'm self teaching myself code. I already have 2 diplomas in technology(went to TAFE) equivalent to college I'd say. it's 1 level below university. both with distinction grades >83% average mark across my ranked subjects. I can't get a job in information technology as I'm not skilled enough by these so called recuiters and there not even aussie but foreign. you cannot beat these recuiters unfortunately because they practically dominate 99% of the IT job roles. they only hire their own or foreign workers that are cheap labour. so I'm learning code to make my own apps and sell them.", "likes": 1}]}, {"topLevelComment": {"id": "UggPlmlrMQyQd3gCoAEC", "publishedAt": "2017-07-01T15:39:58Z", "author": "Darren Evans", "text": "Might be worth checking out Stack Overflow Developer Survey 2017 (link below) for some insight that might help you make a decision. It has an education results section.\n\nI believe it's super-important to have a solid grasp of coding concepts that are language-agnostic, such as algorithm design and analysis (Big O notation etc), data structures and elements from complexity theory in general. Being able to have meaningful discussions with peers and interviewers about these topics regardless of the coding language will impress more than knowledge of any particular language or framework. Many of the good interviews will have you explaining your thought process as you work through a given problem long before being required to tap away at a keyboard in the language of choice.\n\nhttps://insights.stackoverflow.com/survey/2017", "likes": 8}, "replies": [{"id": "UggPlmlrMQyQd3gCoAEC.8UU5zGP1wrl8X3DNDU5Naq", "publishedAt": "2017-09-03T18:39:13Z", "author": "emma green", "text": "Well, 25% have no degree whatsoever and from those that have a degree 25% have a non \"computers\" related degree.\n\nThose numbers might be considered small but they are actually huge.\nIn theory, you have 1 in 4 chances to become as successful as someone that has decades worth of higher education.\n\nThose odds are extremely good actually.\n\nOf course it all comes down to how good a learner you are as 90% of devs are self-taught to some degree.", "likes": 3}, {"id": "UggPlmlrMQyQd3gCoAEC.8UU5zGP1wrl8Ui_xC8_eMl", "publishedAt": "2017-07-07T15:59:10Z", "author": "Moetasim Rady", "text": "Darren Evans Thus, getting a degree is kind of a big deal unlike what this video's all about.", "likes": 1}]}, {"topLevelComment": {"id": "Ugjl4zabMtbVgHgCoAEC", "publishedAt": "2017-07-01T14:35:52Z", "author": "Jonathan Turla", "text": "Thank you so much. This is so inspiring. :)", "likes": 1}}, {"topLevelComment": {"id": "Ugi3n4ErBF1ScngCoAEC", "publishedAt": "2017-07-01T07:38:11Z", "author": "Martin Payne", "text": "Don't get a CS degree because they are 100% useless. I graduated exactly 1 year ago with a CS degree and have only had 1 interview for a programming job and work as an Uber driver.", "likes": 42}, "replies": [{"id": "Ugi3n4ErBF1ScngCoAEC.8UTEqgUMgOA8getW41qRfj", "publishedAt": "2018-05-25T08:21:15Z", "author": "DNAngel", "text": "This is a great response! Thanks! :)", "likes": 0}, {"id": "Ugi3n4ErBF1ScngCoAEC.8UTEqgUMgOA8gCTF0dygXT", "publishedAt": "2018-05-13T22:05:01Z", "author": "MaddeyTv", "text": "I don't think so, you can link to your code in your portfolio. A portfolio can look however you'd like it to look but it is a culmination of all of your work to date and it is very useful to have, even if you don't show it to people in interviews, you will always have something to talk about and a place to point them to.", "likes": 1}, {"id": "Ugi3n4ErBF1ScngCoAEC.8UTEqgUMgOA8gAx7Wr0WBE", "publishedAt": "2018-05-13T07:56:24Z", "author": "HOWYOUDOIN884", "text": "I think portofolios are just for things you can take screen shots of that are public-facing.   So, like front-end web developers.   There really is no portfolio for software development with databases, business logic, etc.", "likes": 0}, {"id": "Ugi3n4ErBF1ScngCoAEC.8UTEqgUMgOA8etL-CDaGgF", "publishedAt": "2018-04-11T05:56:44Z", "author": "MaddeyTv", "text": "I don't think this is good advice Martin should be spending time creating projects, putting them on his github and adding those skills/languages/frameworks he learns to his resume in order to increase his chances of getting called back. Also connecting with people and inviting them out to coffee.", "likes": 0}, {"id": "Ugi3n4ErBF1ScngCoAEC.8UTEqgUMgOA8ch_qrzkfQX", "publishedAt": "2018-02-15T23:21:36Z", "author": "mjs28s", "text": "'\n\"Don't get a CS degree because they are 100% useless.\"\n\nHardly.", "likes": 2}]}, {"topLevelComment": {"id": "UgjUp7Kck9ZeCngCoAEC", "publishedAt": "2017-07-01T07:03:26Z", "author": "zeroxcub", "text": "\"The more I learn about web technologies like JS the more I want to learn lower level languages like C++\"\npoor dude, I feel you bro.", "likes": 15}, "replies": [{"id": "UgjUp7Kck9ZeCngCoAEC.8UTAs8OHzaR8zZ5xLN5cZa", "publishedAt": "2019-09-06T23:00:31Z", "author": "Ryan Bandler", "text": "Peter Jeremiah c and c++ are on the same level imo. C++ is really just C but with OOP added.", "likes": 0}, {"id": "UgjUp7Kck9ZeCngCoAEC.8UTAs8OHzaR8ggfG4WB3We", "publishedAt": "2018-05-26T00:55:13Z", "author": "Peter Jeremiah", "text": "C++ is actually a higher level language on the other hand C and Assembly language are low level languages because they work closer with the hardware.", "likes": 1}, {"id": "UgjUp7Kck9ZeCngCoAEC.8UTAs8OHzaR8aRsd73Lqa7", "publishedAt": "2017-12-21T18:35:53Z", "author": "Tianni Myers", "text": "I feel the same way. I’m looking into CS books to read to understand programming from its roots.", "likes": 2}, {"id": "UgjUp7Kck9ZeCngCoAEC.8UTAs8OHzaR8UTULoAxkEH", "publishedAt": "2017-07-01T09:53:39Z", "author": "Qian Bang", "text": "yeah, it's  always feel like something missing", "likes": 5}]}, {"topLevelComment": {"id": "UgiKNVTLEuYqSHgCoAEC", "publishedAt": "2017-07-01T06:06:04Z", "author": "Csaba Balogh", "text": "Finally somebody without BS.", "likes": 5}}, {"topLevelComment": {"id": "Ugj3M17-uhXTEHgCoAEC", "publishedAt": "2017-07-01T02:25:01Z", "author": "Felipe Borelli", "text": "This video was really inspiring. I'm learning how to program and watching it really gave me an additional boost. Thanks!", "likes": 8}}, {"topLevelComment": {"id": "Ugj-vchU1WVUtHgCoAEC", "publishedAt": "2017-06-30T19:12:29Z", "author": "LostIcarus", "text": "I went college for computer science, did maybe 70% of the course, dropped off, got a full time developer job (which I still have), went back to college and dropped off again! \nCS is boring as hell!\n|o|", "likes": 14}, "replies": [{"id": "Ugj-vchU1WVUtHgCoAEC.8URuVyRozfA8geuAbabsrF", "publishedAt": "2018-05-25T08:27:03Z", "author": "DNAngel", "text": "I think the key here is that you had a working application that demonstrated your ability to build software, rather than the design of it. Most people probably think that you have to create this amazing app to show software companies but I think that's far from the truth.", "likes": 0}, {"id": "Ugj-vchU1WVUtHgCoAEC.8URuVyRozfA8Vypi1xSDYv", "publishedAt": "2017-08-07T19:56:09Z", "author": "LostIcarus", "text": "Cool! You'll figure it out! There are a lot of free resources online that teach you this kind of stuff nowadays...there was a time when I also didn't know anything...the only thing you need is discipline in order to learn by yourself!", "likes": 1}, {"id": "Ugj-vchU1WVUtHgCoAEC.8URuVyRozfA8VyjQwyV9zk", "publishedAt": "2017-08-07T19:01:15Z", "author": "BiMiHi", "text": "wow cool idea,  my first app will be bus schedule watcher xD I need this so I know all the buses and times without constantly needing to search for every bus route, but adding a search possibility such as inserting bus spots and then the search engine finds the next route I am not capable of doing :D  I don't know databases", "likes": 0}, {"id": "Ugj-vchU1WVUtHgCoAEC.8URuVyRozfA8VyGX5srm1Y", "publishedAt": "2017-08-07T14:39:57Z", "author": "LostIcarus", "text": "I did an app about acupuncture (my girlgriend's business) the user would input some symptoms and the app would give a list of point to those symptoms. I did'n have money to pay a server to host the app's data, so I did a script in python to scrap some website with the information that I needed (which is probably illegal [lol]) and populated a sqlite database offline. It was a very simple app and the design wasn't very appealing at all...but it worked, it was my first complete functional app.", "likes": 5}, {"id": "Ugj-vchU1WVUtHgCoAEC.8URuVyRozfA8VthB7l2Tkq", "publishedAt": "2017-08-05T20:05:24Z", "author": "BiMiHi", "text": "I am pursuing android too :) i know some basic stuff but what kind of app would be good enough to get hired? Your answer would mean a lot", "likes": 0}]}, {"topLevelComment": {"id": "Ugg_rwaHT9qwq3gCoAEC", "publishedAt": "2017-06-30T16:10:58Z", "author": "Patrick Wise", "text": "practical experience is by far more beneficial than a degree. Contradictory to that is how HR departments will use a degree as a way to sort our resumes. There are a few good ways to get around this.\n1. Make your own interview. Hand deliver your application to an HR manager and strike up a conversation about the company. Your physical presence will make you stand out far more than a piece of paper.\n2. Award yourself a degree. Check with a few colleges to make sure your experience includes the majority of their curriculum (minus the math and general study courses). If everything checks out, look into awarding yourself a degree. There are legal ways to do this.\n3. WGU.edu. Western Governors University has an online, self paced, Software Development degree. With prior knowledge and experience you can get your degree in a year or less.", "likes": 4}, "replies": [{"id": "Ugg_rwaHT9qwq3gCoAEC.8UR_jRe5DHd8VIHlvKxAxS", "publishedAt": "2017-07-21T22:03:30Z", "author": "BlueGiant69202", "text": "Seven Pie Dr. Roger Schank, PhD has spoken and written a lot over several decades about the problems with the mismatch between degrees and experiential learning. The Universities have been out of syc with society for many decades.\n I owned a company years ago where I was legally required to have a PhD on staff to oversee and accept responsibility for certain work. I've also worked with Engineers and contractors within a regulated system of licensing. I have also seen people with advanced degrees from foreign countries working as janitors at fast food places.\n It only takes a misplaced decimal or comma to crash a spacecraft or cause a medical device to malfunction. If there are too many accidents, people start demanding certification, accredited training institutions, etc.", "likes": 1}]}, {"topLevelComment": {"id": "Ugge3qHahoku5ngCoAEC", "publishedAt": "2017-06-30T14:56:19Z", "author": "S B", "text": "check out CS50 on edx.org you get some low lvl language experience there!", "likes": 10}}, {"topLevelComment": {"id": "UgiTIHxn74d2SHgCoAEC", "publishedAt": "2017-06-30T14:36:06Z", "author": "Dhanush", "text": "Thank u preethi", "likes": 0}}, {"topLevelComment": {"id": "UgjmxHWOaqHFx3gCoAEC", "publishedAt": "2017-06-30T14:19:50Z", "author": "Erik Cruz", "text": "It all comes down to how much you want it? Forget binging on Netflix, going out for \"drinks\". Just start doing. 🔥💯🔥💯 When's the best time to start? It's NOW! 😉 ", "likes": 137}, "replies": [{"id": "UgjmxHWOaqHFx3gCoAEC.8URO0aBIoWH8XFZXFkCArM", "publishedAt": "2017-09-08T13:43:43Z", "author": "NotYaniece TV", "text": "Erik Cruz I needed to see this!", "likes": 1}, {"id": "UgjmxHWOaqHFx3gCoAEC.8URO0aBIoWH8UhdKGnwhvb", "publishedAt": "2017-07-07T07:09:26Z", "author": "Justin Lam", "text": "Grind time", "likes": 4}, {"id": "UgjmxHWOaqHFx3gCoAEC.8URO0aBIoWH8URvZU06Rug", "publishedAt": "2017-06-30T19:21:42Z", "author": "Shmapanese", "text": "yea buddy! , gimme that motivation.", "likes": 7}]}, {"topLevelComment": {"id": "UgjaniXEyeUmv3gCoAEC", "publishedAt": "2017-06-30T14:15:22Z", "author": "lilian1987", "text": "Thank you for an interesting interview and really great insights! Looking forward to your next videos! :)", "likes": 2}}, {"topLevelComment": {"id": "UgjeJJ0o_1MkUXgCoAEC", "publishedAt": "2017-06-30T13:39:02Z", "author": "forestar", "text": "how many hours would you recommend to spend on FCC each day if I am currently in college and need to sit my exams?", "likes": 0}, "replies": [{"id": "UgjeJJ0o_1MkUXgCoAEC.8URJLlWLbUh9esVQ45GwVM", "publishedAt": "2022-08-18T15:37:47Z", "author": "Rayyan Amir", "text": "Learn basic language syntax and then try solving problems or try leetcoding", "likes": 0}]}, {"topLevelComment": {"id": "UggDNf1U3XxddngCoAEC", "publishedAt": "2017-06-30T13:26:07Z", "author": "zada alex", "text": "how many hours of coding per day?at what point you can say that youre actualy working your ass off?", "likes": 2}, "replies": [{"id": "UggDNf1U3XxddngCoAEC.8URHs2sLjpD8UmiQt0I-zf", "publishedAt": "2017-07-09T06:30:13Z", "author": "Lux Nox", "text": "24hrs", "likes": 0}, {"id": "UggDNf1U3XxddngCoAEC.8URHs2sLjpD8USSRW-CX1r", "publishedAt": "2017-07-01T00:17:42Z", "author": "Danilo Marques", "text": "When you go to sleep and start dreaming about solving problems", "likes": 3}, {"id": "UggDNf1U3XxddngCoAEC.8URHs2sLjpD8URZWxvT1KF", "publishedAt": "2017-06-30T16:00:23Z", "author": "nvrmt", "text": "when you start to dream in code", "likes": 9}, {"id": "UggDNf1U3XxddngCoAEC.8URHs2sLjpD8URMaQtMYk2", "publishedAt": "2017-06-30T14:07:24Z", "author": "zada alex", "text": "so i have to be THE ONE from Matrix", "likes": 9}, {"id": "UggDNf1U3XxddngCoAEC.8URHs2sLjpD8URMB3BXGVs", "publishedAt": "2017-06-30T14:03:48Z", "author": "Luna", "text": "zada alex when you breath code", "likes": 5}]}, {"topLevelComment": {"id": "UgiDtI9RfnNO1ngCoAEC", "publishedAt": "2017-06-30T13:10:57Z", "author": "Andrei Tapuc", "text": "this series is soo helpful, Thanks Preethi and freeCodeCamp for making this posible!!!❤", "likes": 18}}, {"topLevelComment": {"id": "UgiyEh4xLe5b0ngCoAEC", "publishedAt": "2017-06-30T12:33:19Z", "author": "Shaunak De", "text": "Consider Makeschool", "likes": 0}}, {"topLevelComment": {"id": "Ugjll8UZJzRULngCoAEC", "publishedAt": "2017-06-30T11:45:42Z", "author": "Abraham Alonzo Velázquez", "text": "thanks", "likes": 1}}, {"topLevelComment": {"id": "UghSY5LbgU3GIngCoAEC", "publishedAt": "2017-06-30T11:14:43Z", "author": "SelfSage", "text": "preethi hi, question for you. I saw your bio,  you worked at coinbase.whats your view on investing in the crypt currencies for few years from now?  thank you", "likes": 1}}, {"topLevelComment": {"id": "UggD6fzlBSwRKngCoAEC", "publishedAt": "2017-06-30T11:07:14Z", "author": "SelfSage", "text": "passion makes things possible!!  😎", "likes": 7}, "replies": [{"id": "UggD6fzlBSwRKngCoAEC.8UR1yu-s7ki97f-oqj4jXo", "publishedAt": "2020-04-20T08:04:09Z", "author": "Sylvester Mnyeti", "text": "U delete it and  I'll re-comment 😊", "likes": 0}]}, {"topLevelComment": {"id": "Ugh5A145wVLNvngCoAEC", "publishedAt": "2017-06-30T10:55:25Z", "author": "AR Vlogs", "text": "Thanks a lot! Btw I'm the first viewer.. 😜🕉✌😀", "likes": 1}}]}