{"video": {"id": "9VPq1JxMfkA", "publishedAt": "2022-11-17T15:16:10Z", "title": "How to Make a WordPress Blog and Website – Tutorial for Beginners 2022", "description": "In this WordPress course for beginners, you will learn how to to create responsive blogs and websites using a drag and drop interface.\n\n🏗 Hostinger provided a grant to make this course possible. You can get a domain and hosting from them here: https://www.hostinger.com/start\n\n✏️ Beau Carnes created this course. \n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Introduction\n⌨️ (0:01:04) Setting up Hosting and Domain\n⌨️ (0:06:46) Installing WordPress\n⌨️ (0:07:54) WordPress Dashboard and Initial Settings\n⌨️ (0:10:23) Installing WordPress Theme\n⌨️ (0:15:30) Overview of Website\n⌨️ (0:17:10) Customizing Title\n⌨️ (0:19:18) Using Elementor to Edit Page\n⌨️ (0:22:40) Adding Images\n⌨️ (0:26:47) Customizing Website Elements\n⌨️ (0:39:24) Updating Site Menu and Categories\n⌨️ (0:42:35) Customizing Blog / Archive\n⌨️ (0:46:04) Customizing Single Blog Post\n⌨️ (0:47:22) Adding New Blog Post\n⌨️ (0:51:10) Customizing About and Contact Page\n⌨️ (0:53:47) Setting Up Website Forms Using WPForms\n⌨️ (1:00:19) Making URLs Look Better\n⌨️ (1:02:54) Updating Site for Responsive Design\n⌨️ (1:04:47) Updating Footer\n⌨️ (1:08:52) Creating New Pages\n⌨️ (1:13:02) Improving SEO (Search Engine Optimization)\n⌨️ (1:19:18) Conclusion\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Nattira Maneerat\n👾 Heather Wcislo\n👾 Serhiy Kalinets\n👾 Erdeniz Unvan\n👾 Justin Hual\n👾 Agustín Kussrow\n👾 Otis Morgan\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H19M41S", "likes": "1981", "views": "58960"}, "comments": [{"topLevelComment": {"id": "UgzCUvYcZb9__jEXvlp4AaABAg", "publishedAt": "2023-01-26T17:52:59Z", "author": "Kevin", "text": "Thank you very much. WordPress is a valuable tool under a freelancer's toolbelt.", "likes": 1}}, {"topLevelComment": {"id": "UgzJXUOP2Focuu807jF4AaABAg", "publishedAt": "2023-01-06T09:27:59Z", "author": "Ika Tsulaia", "text": "Can't get this hosting without paying?", "likes": 0}}, {"topLevelComment": {"id": "UgyLtj2hUyLzt28GzNZ4AaABAg", "publishedAt": "2022-12-28T19:36:03Z", "author": "bul@bil", "text": "👍", "likes": 0}}, {"topLevelComment": {"id": "UgwiRmG0i_G32D2nSFR4AaABAg", "publishedAt": "2022-12-28T18:55:08Z", "author": "UraniumPlushie", "text": "I am currently crying so hard right now. This is seriously the most beautiful, well put together story ever. I can’t believe how magical it was 1:12. That part truly made me shed a tear. And especially at 6:34 that part was just so truly heart touching words can not describe the series of emotions I felt. I absolutely loved the climax it had insanely excellent detail. Oh and we can’t forget the conclusion. The conclusion was the greatest and saddest conclusion I have ever seen better than any of the books I have read. Thank you so much for creating this absolute masterpiece. This is essentially the most important masterpiece of film history. It is a tragedy that this, it can’t be called a film, but a transcendent emotional experience, will be inaccessible for most. It beautifully encapsulates the human struggle to its basics; suffering, pleasure, faith, despair. It connects with the characters within the viewers, individuals suppressed within our own subconscious. It stays vibrant, fresh, and revolutionizes the art of storytelling and filmmaking while making a damn of statement on what it means to be human. Entertaining, gripping, and simply exhilarating. This might be the most impactful piece of art I’ve come across in my life, and I’m definitely coming back to it in the near future to study it more deeply. this is an absolute masterpiece , I was brought to tears listening to this and seeing the chip go whirly swirly in a circle countless times. it absolutely moved my soul , and I don't think I can ever be the same. this bacon has changed my entire mental state , I am now at peace with who I am and what I will be doing later in my life. i have forgiven all my enemies and now I am a man of a pacifist life. I will move on , gotta move on , as the song says. the chip is so inspirational , it shares it vast wisdom with all of us , and we are all so lucky that it would bestow it's great words with us. we are all children on chip . hail chip. hail chip . The spinning chip, rotating in one direction with this music... This made me tear up. How could such a bacon do such a thing? I'm struck by awe by this masterpiece. Especially when the chip spins, showing its lightly salt covered yellow skin. I can hear the crunch just from here, and so as the beautiful sound of the chip scraping the dark, smooth velvet floor.  The flavor, music and everything can be heard, tasted, seen and felt from a screen. You can really hear the breaths between the music artist, empathizing her love for this rotating chip. Truly what I call modern art. This was the most legendary performance by any piece of chip I have ever watched. The acting was top tier and very life changing. This is one of the greatest work from a piece of chip I have ever seen especially on 57:42.I am currently crying so hard right now. This is seriously the most beautiful, well put together story ever. I can’t believe how magical it was at 1:12. That part truly made me shed a tear. And especially at 6:34 that part was just so truly heart touching words can not describe the series of emotions I felt. I absolutely loved the climax it had insanely excellent detail. Oh and we can’t forget the conclusion. The conclusion was the greatest and saddest conclusion I have ever seen better than any of the books I have read. Thank you so much for creating this absolute masterpiece. This is essentially the most important masterpiece of film history. It is a tragedy that this, it can’t be called a film, but a transcendent emotional experience, will be inaccessible for most. It beautifully encapsulates the human struggle to its basics; suffering, pleasure, faith, despair.  It connects with the characters within the viewers, individuals suppressed within our own subconscious. It stays vibrant, fresh, and revolutionizes the art of storytelling and filmmaking while making a damn of statement on what it means to be human. Entertaining, gripping, and simply exhilarating. This might be the most impactful piece of art I’ve come across in my life, and I’m definitely coming back to it in the near future to study it more deeply. this is an absolute masterpiece , I was brought to tears listening to this and seeing the chip go whirly swirly in a circle countless times. Tt absolutely moved my soul , and i don't think I can ever be the same. this chip has changed my entire mental state , I am now at peace with who I am and what I will be doing later in my life. i have forgiven all my enemies and now I am a man of a pacifist life. I will move on , gotta move on , as the song says. the chip is so inspirational , it shares it vast wisdom with all of us , and we are all so lucky that it would bestow it's great words with us. we are all children on chip. hail chip. hail chip. The spinning chip, rotating in one direction with this music... This made me tear up. How could such a piece of bacon do such a thing? I'm struck by awe by this masterpiece. Especially when the chip spins, showing its lightly salt covered yellow skin. I can hear the crunch just from here, and so as the beautiful sound of the chip scraping the dark, smooth velvet floor.  The flavor, music and everything can be heard, tasted, seen and felt from a screen. You can really hear the breaths between the music artist, empathizing her love for this rotating bacon. Truly what I call modern art. This was the most legendary performance by any chip I have ever watched. The acting was top tier and very life changing. This is one of the greatest work from a bacon I have ever seen especially on 17:24. I am currently crying so hard right now. This is seriously the most beautiful, well put together story ever. I can’t believe how magical it was 1:12. That part truly made me shed a tear. And especially at 6:34 that part was just so truly heart touching words can not describe the series of emotions I felt. I absolutely loved the climax it had insanely excellent detail. Oh and we can’t forget the conclusion. The conclusion was the greatest and saddest conclusion I have ever seen better than any of the books I have read. Thank you so much for creating this absolute masterpiece. This is essentially the most important masterpiece of film history. It is a tragedy that this, it can’t be called a film, but a transcendent emotional experience, will be inaccessible for most. It beautifully encapsulates the human struggle to its basics; suffering, pleasure, faith, despair. The work put in to this is incredibly inspiring. The graphics, the animation, the music, so much thought was put into it. This has remined me that you can do anything you put your mind to. Not even mentioning the memories, this makes me feel like an infant again, just laying my eyes on this beautiful masterpiece gives me all the good feelings in life. I also understand what happiness is again from this. Not even to mention the most incredible part that is 2:10. chip spinning has changed my life for the better. It connects with the characters within the viewers, individuals suppressed within our own subconscious. It stays vibrant, fresh, and revolutionizes the art of storytelling and filmmaking while making a damn of statement on what it means to be human. Entertaining, gripping, and simply exhilarating. This might be the most impactful piece of art I’ve come across in my life, and I’m definitely coming back to it in the near future to study it more deeply. this is an absolute masterpiece , I was brought to tears listening to this and seeing the chip go whirly swirly in a circle countless times. it absolutely moved my soul , and I don't think I can ever be the same. this bacon has changed my entire mental state , I am now at peace with who I am and what I will be doing later in my life. So much great graphic design, so much suspense, so much greatness in this one video. i have forgiven all my enemies and now I am a man of a pacifist life. I will move on , gotta move on , as the song says. the bacon is so inspirational , it shares it vast wisdom with all of us , and we are all so lucky that it would bestow it's great words with us. we are all children on chip . hail chip . hail chip. The spinning chip, rotating in one direction with this music... This made me tear up. How could such a chip do such a thing? I'm struck by awe by this masterpiece. Especially when the chip spins, showing its lightly salt covered yellow skin. I can hear the crunch just from here, and so as the beautiful sound of the chip scraping the dark, smooth velvet floor.  The flavor, music and everything can be heard, tasted, seen and felt from a screen. You can really hear the breaths between the music artist, empathizing her love for this rotating chip. Truly what I call modern art. This was the most legendary performance by any chip I have ever watched. The acting was top tier and very life changing. This is one of the greatest work from a piece of chip I have ever seen especially on 57:42. I am crying. This has made me go through an emotional rollercoaster. I cried, beat off, and also watched a movie while watching this premiere. This has made me go through so much. I passed depression because of this. It really inspired me to become an outstanding young man. Thank you.", "likes": 2}, "replies": [{"id": "UgwiRmG0i_G32D2nSFR4AaABAg.9kBjvyAUQhd9kPrHewWgfE", "publishedAt": "2023-01-03T06:28:45Z", "author": "Programming", "text": "nah bruh, average ohio citizen💀", "likes": 4}, {"id": "UgwiRmG0i_G32D2nSFR4AaABAg.9kBjvyAUQhd9kManNFsciH", "publishedAt": "2023-01-02T00:06:57Z", "author": "Kaneda", "text": "Dah", "likes": 1}]}, {"topLevelComment": {"id": "Ugy0dXPoQX_zWnx8B114AaABAg", "publishedAt": "2022-12-27T13:50:49Z", "author": "Compass It", "text": "nav menu missing", "likes": 0}}, {"topLevelComment": {"id": "UgxOpIkffIV0doyNo7p4AaABAg", "publishedAt": "2022-12-22T09:41:34Z", "author": "Hacer İçirmez", "text": "Compro curtidas sempre com o Autoridade Social", "likes": 0}}, {"topLevelComment": {"id": "Ugxu8nCAaq5bBwPFmpB4AaABAg", "publishedAt": "2022-12-22T09:41:32Z", "author": "ruzgar berat", "text": "Comprem seguidores e inscritos no Autoridade Social, preço bom e serviço de alta qualidade", "likes": 0}}, {"topLevelComment": {"id": "Ugw-kiZVp98O69Wkei94AaABAg", "publishedAt": "2022-12-22T09:41:31Z", "author": "H5HYH5YHEHY5HJ5", "text": "Autoridade Social é top! Eu compro seguidores lá no instagram", "likes": 0}}, {"topLevelComment": {"id": "UgzhPCT0mFiT81G0AG14AaABAg", "publishedAt": "2022-12-22T09:41:30Z", "author": "Leyla Emre", "text": "comprei 100k de seguidores no Autoridade Social, Serviço de qualidade e fazem a reposição", "likes": 0}}, {"topLevelComment": {"id": "UgzWxurmrh8p6_D04-h4AaABAg", "publishedAt": "2022-12-22T09:40:19Z", "author": "Ahmet Bahaddinof", "text": "Obrigado!  Autoridade Social a melhor para comprar seguidores e inscritos", "likes": 0}}, {"topLevelComment": {"id": "Ugzx2gwz2Y1dyhMq6zh4AaABAg", "publishedAt": "2022-12-22T09:40:18Z", "author": "Fatma Sert", "text": "Recomendo comprar seguidores e inscritos sempre com o Autoridade Social", "likes": 0}}, {"topLevelComment": {"id": "UgyaQqbpyYQfPo5IwzB4AaABAg", "publishedAt": "2022-12-22T09:40:15Z", "author": "ömeristv10", "text": "Comprem visualizações no Autoridade Social o serviço é garantido e bom que eles tem referências", "likes": 0}}, {"topLevelComment": {"id": "UgyETgsYD84BFOesXRV4AaABAg", "publishedAt": "2022-12-04T02:05:44Z", "author": "prasan kumar", "text": "Need blog using next js", "likes": 1}}, {"topLevelComment": {"id": "UgzOuCcleHncA3NOZCt4AaABAg", "publishedAt": "2022-12-03T11:26:35Z", "author": "WNF Draco", "text": "Thank you sir 🥳", "likes": 0}}, {"topLevelComment": {"id": "UgxETxuWPrhly-UxhYd4AaABAg", "publishedAt": "2022-12-01T16:19:21Z", "author": "Kostiantyn Karzhanov", "text": "Hey, Beau! Thank you very much for one more Awesome tutorial! 💛💙", "likes": 3}}, {"topLevelComment": {"id": "UgwMT_Yym5kAMAwx2L14AaABAg", "publishedAt": "2022-12-01T06:22:48Z", "author": "ャ・ꪜꫀꪀꪮm", "text": "Cool, Absolutely great , Thank You..... 💫", "likes": 0}}, {"topLevelComment": {"id": "UgyRUhT0L8PBhlLO8J14AaABAg", "publishedAt": "2022-11-30T10:54:38Z", "author": "ecstasy", "text": "Great 😊.... But I hv a suggestion... When u teach u try to give small small tasks to be completed by the students on the go while watching the video. It will help to solidify the concept and it ll be interactive enjoyable also.", "likes": 6}}, {"topLevelComment": {"id": "UgxtGT_CIdGIQ_NXRll4AaABAg", "publishedAt": "2022-11-27T14:32:49Z", "author": "Tech With 0yik", "text": "I hope my channel can be as useful as this channel", "likes": 0}}, {"topLevelComment": {"id": "Ugw-muwJpi6dqd4kxqV4AaABAg", "publishedAt": "2022-11-27T00:58:17Z", "author": "杨旭彬", "text": "谢谢！", "likes": 0}}, {"topLevelComment": {"id": "Ugxe3ElDtlzTIPez5GV4AaABAg", "publishedAt": "2022-11-26T18:01:18Z", "author": "Kason", "text": "Ｐ𝐫Ｏ𝕞Ｏ𝓢ｍ", "likes": 0}}, {"topLevelComment": {"id": "UgzrEPHUsPeiXaFkKtp4AaABAg", "publishedAt": "2022-11-25T03:49:59Z", "author": "ChillTunes", "text": "If anyone uses the Highend theme? I wonder if they have a podcast option to add on a blog website....", "likes": 0}}, {"topLevelComment": {"id": "Ugw0Y19HnWPF59mxJ414AaABAg", "publishedAt": "2022-11-23T06:35:26Z", "author": "Ferdinand Getti", "text": "Just affiliate hosting? Or could you explain vultre etc......", "likes": 1}}, {"topLevelComment": {"id": "Ugxvby3lV4kSKysQNX94AaABAg", "publishedAt": "2022-11-23T02:14:58Z", "author": "Peter JB", "text": "Uhh WordPress 🤢🤮", "likes": 0}}, {"topLevelComment": {"id": "UgykyV19GX8Rk6MQt_94AaABAg", "publishedAt": "2022-11-22T21:41:51Z", "author": "Miss Lovelyy", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"id": "UgwRnlVMNfrlEWHYvAV4AaABAg", "publishedAt": "2022-11-22T06:14:02Z", "author": "Onuoha Kingsley", "text": "Thanks for this Video. Please can you make one on Shopify??", "likes": 1}}, {"topLevelComment": {"id": "Ugz8NenGL-D5GVi4BPt4AaABAg", "publishedAt": "2022-11-22T03:17:09Z", "author": "Light Creates Darkness Returns to Light", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"id": "UgyHhbvmnlzsbAxu1w14AaABAg", "publishedAt": "2022-11-21T14:29:26Z", "author": "LTZ", "text": "Please Crypto mining", "likes": 0}}, {"topLevelComment": {"id": "UgxbRxkcE2bF5maooNR4AaABAg", "publishedAt": "2022-11-21T10:02:17Z", "author": "Lucia Carrillo", "text": "Greetings Ms_Griselda hey thanks you very much for sharing I have seen fake videos like these and not as complete and easy to understand as yours, very complete I really congratulate you very honest on your part that's why I follow you and I like all your videos and I share it ,it has been very helpful,a professional in your videos thank you very much", "likes": 38}, "replies": [{"id": "UgxbRxkcE2bF5maooNR4AaABAg.9igWXzhjqw89igcgCK9TGs", "publishedAt": "2022-11-21T11:04:43Z", "author": "Michael eric Boney", "text": "It all sounded too good to be true, but I gave her a first shot, my first returns gave me a total change of thinking about Ms_Griselda She's God fearing lifestyle gives me more joy", "likes": 0}, {"id": "UgxbRxkcE2bF5maooNR4AaABAg.9igWXzhjqw89igc5lFQsSn", "publishedAt": "2022-11-21T10:59:36Z", "author": "Ameh John", "text": "She's just too good that's why people can talk about her this much, much love", "likes": 0}, {"id": "UgxbRxkcE2bF5maooNR4AaABAg.9igWXzhjqw89igbK9jYZZR", "publishedAt": "2022-11-21T10:52:50Z", "author": "Dillion Findlay", "text": "I'm not even shocked seeing her name been mentioned because he's good deeds is really making her know", "likes": 0}, {"id": "UgxbRxkcE2bF5maooNR4AaABAg.9igWXzhjqw89igaxD0JjXS", "publishedAt": "2022-11-21T10:49:34Z", "author": "Lucia Carrillo", "text": "@Ms_Griselda", "likes": 0}, {"id": "UgxbRxkcE2bF5maooNR4AaABAg.9igWXzhjqw89igavWlbVnO", "publishedAt": "2022-11-21T10:49:20Z", "author": "Lucia Carrillo", "text": "Contact her with the name below in the telegram", "likes": 0}]}, {"topLevelComment": {"id": "UgwmJCeIFViMaU_-LFV4AaABAg", "publishedAt": "2022-11-21T04:58:27Z", "author": "Nagie", "text": "thanks alot", "likes": 0}}, {"topLevelComment": {"id": "UgwErEUPLNw1mWC4iYd4AaABAg", "publishedAt": "2022-11-21T04:08:38Z", "author": "fjl05", "text": "Why in the snow tho? 🥶", "likes": 0}}, {"topLevelComment": {"id": "UgzOuaFO-inQRKOGTu94AaABAg", "publishedAt": "2022-11-20T22:49:18Z", "author": "Earnstein", "text": "God bless all the workers at freecodecamp", "likes": 0}}, {"topLevelComment": {"id": "UgwFak-AS4pmuawr2214AaABAg", "publishedAt": "2022-11-20T21:29:56Z", "author": "Sam Arbid", "text": "FCC, why you are not giving much love to Shell Scripting? \nI am trying to find a course on advanced shell scripting for CICD, and you are my favorite place to go to.", "likes": 2}}, {"topLevelComment": {"id": "UgyWEiSkC_UZBaiHYpB4AaABAg", "publishedAt": "2022-11-20T10:50:55Z", "author": "moshe oz", "text": "What about the snow? 😂😂\nThanks for your awesome channel!", "likes": 0}}, {"topLevelComment": {"id": "Ugx5knOwSxBpccCNQfl4AaABAg", "publishedAt": "2022-11-19T01:14:15Z", "author": "Roddy McDowall", "text": "Despite the economic downturn,I'm so happy☺️. I have been earning $ 60,000 returns from my $7,000 investment every 13days.", "likes": 31}, "replies": [{"id": "Ugx5knOwSxBpccCNQfl4AaABAg.9iaQWldGjTS9iaaxTalehB", "publishedAt": "2022-11-19T02:54:09Z", "author": "queen Nancy", "text": "@fernando tyrone <Thank you for this. Will definitely reach out to him now. Thanks again>", "likes": 0}, {"id": "Ugx5knOwSxBpccCNQfl4AaABAg.9iaQWldGjTS9iaa_XXbLhG", "publishedAt": "2022-11-19T02:50:53Z", "author": "fernando tyrone", "text": "<is active on Tele gram>", "likes": 0}, {"id": "Ugx5knOwSxBpccCNQfl4AaABAg.9iaQWldGjTS9iaa_CuCDkG", "publishedAt": "2022-11-19T02:50:50Z", "author": "fernando tyrone", "text": "<@Benjamin_owen1>", "likes": 0}, {"id": "Ugx5knOwSxBpccCNQfl4AaABAg.9iaQWldGjTS9ia_gTzR7ls", "publishedAt": "2022-11-19T02:43:06Z", "author": "queen Nancy", "text": "@fernando tyrone That's 100% true ✅ Please how do I start trading with him?", "likes": 0}, {"id": "Ugx5knOwSxBpccCNQfl4AaABAg.9iaQWldGjTS9ia_JS5sfml", "publishedAt": "2022-11-19T02:39:49Z", "author": "fernando tyrone", "text": "Long term investment is the best now. I invested $6,500 in march last year with  Benjamin owen and i top up my trade with $500 every week. Now, I'm having over $147,000 on my dashboard. Toping up your trade is really important", "likes": 0}]}, {"topLevelComment": {"id": "UgzhyOvbM8N0Xa3YtNZ4AaABAg", "publishedAt": "2022-11-18T15:39:08Z", "author": "Visualmodo", "text": "Very good work!", "likes": 1}, "replies": [{"id": "UgzhyOvbM8N0Xa3YtNZ4AaABAg.9i_OhWLTbvg9iciiDwSRi0", "publishedAt": "2022-11-19T22:40:27Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "UgyGFX3dVHVQrYlD6gN4AaABAg", "publishedAt": "2022-11-18T13:25:19Z", "author": "STORM", "text": "I need to setup Adaptive Performance for my mobile game.\nI got this error message from the package,\nwhat does that mean?\n[Adaptive Performance] No Active Loader was found. Make sure to select your loader in the Adaptive Performance Settings for this platform i need a solution", "likes": 0}, "replies": [{"id": "UgyGFX3dVHVQrYlD6gN4AaABAg.9i_9OQD2hnf9icij3ff2pu", "publishedAt": "2022-11-19T22:40:34Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "UgwARw0gRI7Wtt88XUB4AaABAg", "publishedAt": "2022-11-18T12:34:23Z", "author": "Dreami Sover", "text": "Invaluable channel, really like the topics!", "likes": 4}, "replies": [{"id": "UgwARw0gRI7Wtt88XUB4AaABAg.9i_3ZIpYXkV9icik4Vht_t", "publishedAt": "2022-11-19T22:40:43Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "UgwRjfvyR9WlxMyiAqh4AaABAg", "publishedAt": "2022-11-18T12:10:56Z", "author": "bob Tech1 IPTV Android", "text": "How do I protect my site from being hacked?", "likes": 0}, "replies": [{"id": "UgwRjfvyR9WlxMyiAqh4AaABAg.9i_0schw2fb9ih-Bhz7St-", "publishedAt": "2022-11-21T14:30:08Z", "author": "bob Tech1 IPTV Android", "text": "@Reddy PULAVARI yes", "likes": 0}, {"id": "UgwRjfvyR9WlxMyiAqh4AaABAg.9i_0schw2fb9ie_P1m3mj0", "publishedAt": "2022-11-20T15:57:32Z", "author": "Reddy PULAVARI", "text": "I can help you create secure hosting", "likes": 1}, {"id": "UgwRjfvyR9WlxMyiAqh4AaABAg.9i_0schw2fb9icil7oUhMG", "publishedAt": "2022-11-19T22:40:51Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "Ugxk8V9Z0GmSWFEFiEB4AaABAg", "publishedAt": "2022-11-18T12:10:54Z", "author": "bob Tech1 IPTV Android", "text": "How do I protect my site from being hacked?\nHow do I protect my site from being hacked?", "likes": 0}}, {"topLevelComment": {"id": "UgwOvgA691tLtIy9AnN4AaABAg", "publishedAt": "2022-11-18T09:40:15Z", "author": "Bangla Cartoon", "text": "did you use any plugin ? If you use Custome and post type  then I will watch.", "likes": 0}, "replies": [{"id": "UgwOvgA691tLtIy9AnN4AaABAg.9iZkcwF_A4U9icimBM4sUE", "publishedAt": "2022-11-19T22:41:00Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "UgwtRS7I7Pzb-hHbB-p4AaABAg", "publishedAt": "2022-11-18T09:02:36Z", "author": "DJVishnuVishnu", "text": "सकरात कैसे बढ़ाएं", "likes": 0}, "replies": [{"id": "UgwtRS7I7Pzb-hHbB-p4AaABAg.9iZgK7-M9sx9ie_SzhY_2R", "publishedAt": "2022-11-20T15:58:05Z", "author": "Reddy PULAVARI", "text": "I can help you", "likes": 0}, {"id": "UgwtRS7I7Pzb-hHbB-p4AaABAg.9iZgK7-M9sx9icidH_m_U9", "publishedAt": "2022-11-19T22:39:47Z", "author": "ᶠʳᵉᵉᶜᵒᵈᵉᶜᵃᵐᵖ.ᵒʳᵍ ₊₁₂₀₃₆₁₄₉₄₄₆", "text": "🔝ʜɪᴛ ᴍᴇ ᴜᴘ🔝🆒", "likes": 0}]}, {"topLevelComment": {"id": "UgyML5SZ33pqsHBQeRl4AaABAg", "publishedAt": "2022-11-18T08:55:22Z", "author": "Studying As You Were", "text": "Thank you for making learning coding free! I learnt CSS and HTML watching your videos and now I create web dev content ☺", "likes": 23}, "replies": [{"id": "UgyML5SZ33pqsHBQeRl4AaABAg.9iZfVBm2CE59jRLZZLJz_2", "publishedAt": "2022-12-09T23:49:56Z", "author": "Studying As You Were", "text": "@FawezX No. I make YouTube videos in my spare time :)", "likes": 0}, {"id": "UgyML5SZ33pqsHBQeRl4AaABAg.9iZfVBm2CE59jQtAJZRhtn", "publishedAt": "2022-12-09T19:33:05Z", "author": "FawezX", "text": "Do you get paid work", "likes": 0}, {"id": "UgyML5SZ33pqsHBQeRl4AaABAg.9iZfVBm2CE59j5nbmkd4Ka", "publishedAt": "2022-12-01T15:00:29Z", "author": "DarthVader", "text": "@NicK Thank You, it worked.", "likes": 0}, {"id": "UgyML5SZ33pqsHBQeRl4AaABAg.9iZfVBm2CE59j5naOV1xVG", "publishedAt": "2022-12-01T15:00:18Z", "author": "DarthVader", "text": "@Studying As You Were Thank You, it worked.", "likes": 0}, {"id": "UgyML5SZ33pqsHBQeRl4AaABAg.9iZfVBm2CE59j4TEThf3-W", "publishedAt": "2022-12-01T02:34:25Z", "author": "NicK", "text": "@DarthVader set Chrome your default browser", "likes": 1}]}, {"topLevelComment": {"id": "UgzDJKXTUKxHVT6B3E54AaABAg", "publishedAt": "2022-11-18T04:32:48Z", "author": "Rajiv Bandaru", "text": "Just in time when I wanted one badly. Thank you very much freecodecamp.", "likes": 0}}, {"topLevelComment": {"id": "UgwUmAisSKWFnztc2F94AaABAg", "publishedAt": "2022-11-18T03:06:40Z", "author": "Neural Nexus", "text": "Wouldn't it be better to just use Html,CSS,JS why would anyone want to build a website if they don't even know how to code?", "likes": 2}}, {"topLevelComment": {"id": "UgzmcXFW_KpKZr9bFKh4AaABAg", "publishedAt": "2022-11-18T02:46:42Z", "author": "Julius X5", "text": "Beau is a champ", "likes": 0}}, {"topLevelComment": {"id": "UgzhdCDEH-dVIE0CiSZ4AaABAg", "publishedAt": "2022-11-18T02:03:15Z", "author": "Murshid K", "text": "Dear freecodecamp,\n      Please make a complete tutorial on react native mobile app development.", "likes": 1}}, {"topLevelComment": {"id": "UgwIb7FQEUIVM5dlX5N4AaABAg", "publishedAt": "2022-11-17T21:50:21Z", "author": "Heitor Lopes Brasil", "text": "funny funny intro", "likes": 0}}, {"topLevelComment": {"id": "Ugw-v6MRSjmyE9OiVnx4AaABAg", "publishedAt": "2022-11-17T20:16:38Z", "author": "OvSki house", "text": "Useful", "likes": 1}}, {"topLevelComment": {"id": "Ugxr8NyKd4gPmNVnLB54AaABAg", "publishedAt": "2022-11-17T20:15:06Z", "author": "Nestor Antonio Berríos Gallegos", "text": "Hostinger, good price and good explanation from you, if anyone is study website development will see this helpfully", "likes": 1}}, {"topLevelComment": {"id": "Ugw1MEBTRAxTgTB4RHt4AaABAg", "publishedAt": "2022-11-17T19:45:31Z", "author": "Ahmed Azally", "text": "Great", "likes": 0}}, {"topLevelComment": {"id": "UgxAbjs-XlBLHC11xfB4AaABAg", "publishedAt": "2022-11-17T19:14:51Z", "author": "Surya Santosh", "text": "Thank you for the valuable video. But, I didnt understand one thing. Why is he standing in snow and recording this video?❄❄🏂☃", "likes": 0}}, {"topLevelComment": {"id": "UgyJcN-Ho9IsblVH43d4AaABAg", "publishedAt": "2022-11-17T19:01:48Z", "author": "50 Shades of Beige", "text": "People still use WordPress?", "likes": 0}}, {"topLevelComment": {"id": "UgyQ3X-Xzbrlb7YFftV4AaABAg", "publishedAt": "2022-11-17T18:33:44Z", "author": "Rigg 13", "text": "Started off with FreeCodeCamp in 2018. Knocked off the Frontend Course. Started freelancing. Found WordPress in 2019 and you know what's funny? WordPress brings in the money the quickest.", "likes": 0}}, {"topLevelComment": {"id": "Ugwhl-l6aR1-ytXVeRV4AaABAg", "publishedAt": "2022-11-17T18:21:03Z", "author": "SPACE", "text": "Beau are u web developer?", "likes": 0}}, {"topLevelComment": {"id": "UgwXS1jeo7gkLgP3dGh4AaABAg", "publishedAt": "2022-11-17T17:53:53Z", "author": "Ñight MàRê", "text": "i just speed ran through all free code camp courses , best platform to learn technology ever !!", "likes": 2}}, {"topLevelComment": {"id": "UgyW-cqHbMXSQU3UelR4AaABAg", "publishedAt": "2022-11-17T16:47:57Z", "author": "duz Tv", "text": "Please someone should clear my mind, if we can build a site with WordPress, then why taking pains to learn javascript, css, and all those many frameworks? Please someone should clear this up for me.", "likes": 2}, "replies": [{"id": "UgyW-cqHbMXSQU3UelR4AaABAg.9iXwmg572Uj9iY8EVeBYUE", "publishedAt": "2022-11-17T18:36:45Z", "author": "Ammar Jamil", "text": "Wordpress is full of packages that slows a websites so much. so techincal SEO's is much harder on wordpress.", "likes": 2}]}, {"topLevelComment": {"id": "UgxbhaT7uzwmSHi5-R94AaABAg", "publishedAt": "2022-11-17T16:28:10Z", "author": "GuitarHope", "text": "Thanks Beau. I feel both the course and the cold. Lol", "likes": 1}}, {"topLevelComment": {"id": "UgwONYJBj57n9Iow00J4AaABAg", "publishedAt": "2022-11-17T16:08:53Z", "author": "DP", "text": "Learning html and CSS will hammer WordPress. Wordpress is full of packages that slow a website so much.", "likes": 5}, "replies": [{"id": "UgwONYJBj57n9Iow00J4AaABAg.9iXsJWWQBiR9iya1TsSWIO", "publishedAt": "2022-11-28T10:27:52Z", "author": "Jason Rice", "text": "@DP - Then you don't understand how to use WP.  The core of WP is actually quite efficient, and the THEME (or theme framework) can make the difference between lean and bloat.  Research before making blanket statements like this, as it might discourage the curious from learning HTML and CSS, and WP, all of which are quite valuable for ANY web developer!", "likes": 0}, {"id": "UgwONYJBj57n9Iow00J4AaABAg.9iXsJWWQBiR9ibcOZBLw6f", "publishedAt": "2022-11-19T12:25:58Z", "author": "cukcan", "text": "that's why wp is the most used app (35% of all web) to create websites? smh", "likes": 1}]}, {"topLevelComment": {"id": "Ugzb4LVW0XL05c3DYmF4AaABAg", "publishedAt": "2022-11-17T16:07:48Z", "author": "CodeGen", "text": "Please can you do a custom WordPress theme development", "likes": 4}, "replies": [{"id": "Ugzb4LVW0XL05c3DYmF4AaABAg.9iXsBZIwdnx9ikweP2U35h", "publishedAt": "2022-11-23T03:16:11Z", "author": "Herry Full Stack Developer", "text": "Yes, Could I help you build the custom theme?", "likes": 0}, {"id": "Ugzb4LVW0XL05c3DYmF4AaABAg.9iXsBZIwdnx9iYNymIjxdZ", "publishedAt": "2022-11-17T20:54:17Z", "author": "CodeGen", "text": "@Mc Soud I know. I was hoping to get something new. Can you share the link for the video 🙏 thanks", "likes": 0}, {"id": "Ugzb4LVW0XL05c3DYmF4AaABAg.9iXsBZIwdnx9iYM4KKi2zB", "publishedAt": "2022-11-17T20:37:42Z", "author": "Mc Soud", "text": "@CodeGen Wordpress got the same hooks and functions, they are rarely degraded... So the 2017 theme courses is still viable", "likes": 1}, {"id": "Ugzb4LVW0XL05c3DYmF4AaABAg.9iXsBZIwdnx9iYJWRvk26I", "publishedAt": "2022-11-17T20:15:19Z", "author": "CodeGen", "text": "@Mc Soud for 2022?", "likes": 0}, {"id": "Ugzb4LVW0XL05c3DYmF4AaABAg.9iXsBZIwdnx9iXxFMynuz6", "publishedAt": "2022-11-17T16:52:01Z", "author": "Mc Soud", "text": "They have one already", "likes": 0}]}, {"topLevelComment": {"id": "Ugw0f6zYyMvOeAlU3qx4AaABAg", "publishedAt": "2022-11-17T16:03:25Z", "author": "RESEARCH BAG", "text": "Awesome Explanation 👍", "likes": 1}}, {"topLevelComment": {"id": "Ugya4rBJ9mPU7JU8aN94AaABAg", "publishedAt": "2022-11-17T15:58:03Z", "author": "Adam Driver", "text": "does hostinger have a free domain feature. To learn / test. Great work guys btw!", "likes": 3}}, {"topLevelComment": {"id": "UgzXMgKK_jk5OiW8GyR4AaABAg", "publishedAt": "2022-11-17T15:55:17Z", "author": "Crash Override", "text": "Please keep your Wordpress software up to date. Your malware analyst will thank you later.", "likes": 0}}, {"topLevelComment": {"id": "UgwQtiJFH4v6OEX6xw14AaABAg", "publishedAt": "2022-11-17T15:37:52Z", "author": "VLNTN", "text": "why are you out in the snow????????????????????????????????????", "likes": 0}}, {"topLevelComment": {"id": "UgxB9cV2BNgzYry-2TV4AaABAg", "publishedAt": "2022-11-17T15:33:16Z", "author": "Zettt", "text": "What a mad lad he is sitting outside in the snow 😭", "likes": 2}}, {"topLevelComment": {"id": "UgyHjSkflf0Qixn8_zx4AaABAg", "publishedAt": "2022-11-17T15:26:11Z", "author": "polis vlogs 24", "text": "Thanku so much ❤️", "likes": 0}}, {"topLevelComment": {"id": "UgzCZeamK9LjP5vrtMR4AaABAg", "publishedAt": "2022-11-17T15:21:28Z", "author": "Sanduni Maheshika", "text": "Thank you so much  Free code camp for providing us great knowledge", "likes": 13}}, {"topLevelComment": {"id": "UgwwQtcD1kj5c4mjmGB4AaABAg", "publishedAt": "2022-11-17T15:20:28Z", "author": "Tünde Eszlári", "text": "Fantastic video.", "likes": 0}}, {"topLevelComment": {"id": "Ugy9xNXlT4tTy6WVbSF4AaABAg", "publishedAt": "2022-11-17T15:18:03Z", "author": "aderinto david", "text": "Are Wordpress designer can also be called front end designer?", "likes": 0}, "replies": [{"id": "Ugy9xNXlT4tTy6WVbSF4AaABAg.9iXmVEjWbEF9iXp965kTUx", "publishedAt": "2022-11-17T15:41:15Z", "author": "Marcelo Anselmo", "text": "Web Designer. If you create themes and plugins, you can be a web developer.", "likes": 3}]}, {"topLevelComment": {"id": "UgxO0A0a74uXWAjYtu14AaABAg", "publishedAt": "2022-11-17T15:17:58Z", "author": "Mahendra Nath", "text": "Thank you so much ❤🫡👏👋🤗👌🙏🏻🎉", "likes": 0}}, {"topLevelComment": {"id": "UgzLkkl2AuNyURvvSQR4AaABAg", "publishedAt": "2022-11-17T15:17:43Z", "author": "𝙀𝙙𝙬𝙖𝙧𝙙 𝘾𝙪𝙡𝙡𝙚𝙣", "text": "Thank You so much ❤😊Freecodecamp For Everything.", "likes": 2}}, {"topLevelComment": {"id": "UgxFrWElWzMiXtXRbVB4AaABAg", "publishedAt": "2022-11-17T15:17:18Z", "author": "Anay Chandel 050", "text": "Thankyou 💛", "likes": 0}}]}