{"video": {"id": "_1BPrCHcjhs", "title": "Map data structure & ES6 map object - Beau teaches JavaScript", "description": "Maps are data structures that store key-value pairs. See how they work and learn about the ES6 map object.\n\n💻 Code: http://codepen.io/beaucarnes/pen/jBjobG?editors=0012\n\n🔗 Info: https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Map\n\n🐦 Beau Carnes on Twitter: https://twitter.com/carnesbeau\n\n⭐JavaScript Playlists⭐\n▶JavaScript Basics: https://www.youtube.com/playlist?list=PLWKjhJtqVAbk2qRZtWSzCIN38JC_NdhW5\n▶Data Structures and Algorithms: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkso-IbgiiP48n-O-JQA9PJ\n▶Design Patterns: https://www.youtube.com/playlist?list=PLWKjhJtqVAbnZtkAI3BqcYxKnfWn_C704\n▶ES6: https://www.youtube.com/playlist?list=PLWKjhJtqVAbljtmmeS0c-CEl2LdE-eR_F\n▶Clean Code: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkK24EaPurzMq0-kw5U9pJh\n\n-\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nRead great tech articles at https://medium.freecodecamp.com", "duration": "PT6M", "likes": "491", "views": "37674"}, "comments": [{"topLevelComment": {"author": "JorDANStew", "text": "Watch 2x speed but we about 40-50 videos a week.", "likes": 0}}, {"topLevelComment": {"author": "anant varma", "text": "Couldn't understand a single thing after watching it thrice. Rushing through the code without explaining anything. By far the worst explanation.", "likes": 0}}, {"topLevelComment": {"author": "Cesar Villegas", "text": "Man you are amazing at explaining this stuff", "likes": 1}}, {"topLevelComment": {"author": "grantpant2353", "text": "Your typing speed literally makes my head spin. I don't think I can even make my fingers moves that fast. You're an android, aren't you?", "likes": 0}, "replies": [{"author": "stogenzzo", "text": "i think its speeded up, look at text marker blinking speed", "likes": 2}]}, {"topLevelComment": {"author": "P Pow", "text": "Correction @ 4:28\nmap.entries() - returns keys + entries\nmap.keys() - returns keys", "likes": 3}}, {"topLevelComment": {"author": "Seth Koch", "text": "This is entirely incorrect.  A map is not a javascript object.  You would not, for example, be able to use a function as a key in your implementation.  This is a very naive and very wrong tutorial.  You should take this video down.", "likes": 0}, "replies": [{"author": "Nhon Ha", "text": "Someone does a video to explain how to use map. Someone complains the definition is wrong and video should be taken down. Point of the video is how to use map, not the definition of a map! This video is legit.", "likes": 6}, {"author": "freeCodeCamp.org", "text": "Good point about not being able to use a function as a key. However, you are incorrect to say 'a map is not a javascript object'. A map is a JavaScript Object. To prove it, try running this JavaScript code: `var m = new Map(); m instanceof Object` and you will see that a map is technically an object. Also, according to MDN, historically in JavaScript, \"Objects have been used as Maps\".", "likes": 9}]}, {"topLevelComment": {"author": "Aleksandr Osipov", "text": "So, the benefit of Map is that you can use key not only String or Symbol. But in your example you use Object as as collection to store key:value. It's wrong implementation. You need to use array as collection with item {key: key, value: value}", "likes": 1}}, {"topLevelComment": {"author": "Core Dump", "text": "Maps are useful for practical programming and Competitive programming alike.", "likes": 0}}, {"topLevelComment": {"author": "Antonio Perez", "text": "Hello, why do you make a size function (the one that returns the variable count), can't you just call the variable count directly?\n\ndon't myObj.count and myObj.size() return the same value?", "likes": 0}, "replies": [{"author": "Evgenii Serebriakov", "text": "You should use 'var count' instead this.count.\nIn other case someone can change the count value using 'map.count = 150;', for example.", "likes": 1}, {"author": "Antonio Perez", "text": "I see, that makes sense. Thanks for answering!\n\nGreat videos btw, I'm learning a lot.", "likes": 0}, {"author": "Beau Carnes", "text": "Yes, they do return the same value. There are two reasons for the size function. The main one is so you can use the terminology generally associated with maps. (which is 'size') Also, as a general practice, it is good to access variables stored in an object through functions. This allows you to make easier changes in the future to how the value is calculated or possibly only return the variable if certain conditions are met.", "likes": 1}]}, {"topLevelComment": {"author": "Good Wish", "text": "Very good explanation. Thank you teacher.\n\nThere might be one issue. It is the count++ in set method.\nIf we add item with existing key, it should not increment the count.\n\nMy CA$ 0.02.    ;)", "likes": 4}, "replies": [{"author": "Andrew Spode", "text": "Nothing a quick check wouldn't solve - but agreed - it stuck out at me too!", "likes": 0}]}, {"topLevelComment": {"author": "James Logan", "text": "These tutorials are excellent! The length is perfect and seeing a new concept or an old one in a different context is so useful. Thanks!", "likes": 8}}, {"topLevelComment": {"author": "Rohan Gayen", "text": "I am facing problems for using these new syntax of ES6... can't remember syntax at the time of programming... what to do?", "likes": 0}}]}