{"video": {"id": "_gWfFEuert8", "title": "OpenStack Tutorial – Operate Your Own Private Cloud (Full Course)", "description": "Learn how to use OpenStack and manage your own private cloud.\n\n🔗 Start working with OpenStack using OpenMetal here: https://openmetal.io/cloud-trial-youtube-exclusive/\n\nOpenStack is an open source software that provides cloud infrastructure for virtual machines, bare metal, and containers. In this course you will gain a core understanding of what OpenStack is and you will learn the basics of setting up and administering OpenStack using the OpenMetal platform.\n\n✏️ Beau Carnes created this course.\n\n🏗 This course was made possible by a grant from OpenMetal.\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) What is OpenStack?\n⌨️ (02:25) OpenStack Services\n⌨️ (04:42) Set Up OpenMetal\n⌨️ (09:17) Access OpenStack Dashboard\n⌨️ (13:42) Create OpenStack Project\n⌨️ (15:42) Create OpenStack User\n⌨️ (17:56) Manage and Creating Images\n⌨️ (21:54) Create a Private Network and Router\n⌨️ (25:25) Visualize Network Topology\n⌨️ (26:17) Create a Security Group\n⌨️ (27:33) Set Up SSH Access\n⌨️ (31:26) Create Instance\n⌨️ (37:15) Log In to Instance\n⌨️ (38:57) Install and Use OpenStack CLI\n⌨️ (46:29) List Servers Using CLI\n⌨️ (47:25) Using Various CLI Commands\n⌨️ (50:16) How Private Clouds are Deployed\n⌨️ (51:27) Understand Ceph\n⌨️ (53:01) Check Status of Ceph Cluster\n⌨️ (54:53) View Used Resources\n\n--\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT57M45S", "likes": "3807", "views": "157559"}, "comments": [{"topLevelComment": {"author": "forgottenvy", "text": "When you're in class waiting for homeroom teacher but the principal decides to continue in his stead", "likes": 1}}, {"topLevelComment": {"author": "Ayoub Mzari", "text": "I understand less after watching it xd, but at least I understood that i knew nothing", "likes": 0}}, {"topLevelComment": {"author": "Frank Tricamo", "text": "So i need to spend a min of 400 per month after 30 days with this tutorial. How about a follow up with how to set up a local lab?", "likes": 1}}, {"topLevelComment": {"author": "212helpdesk", "text": "I was at a BIG name company in their data center recently. I was sat in their NOC. I was allowed to watch engineers use Openstack to administer their various cloud platforms. I stated how impressed I was that they knew Openstack. Their response was they dont setup or maintain Openstack they just use it. Another team sets it up. At this point in time I will choose to learn how to use it to accomplish tasks in an heterogeneous environment.  I will get an account with OpenMetal and try to learn possibly how to use Openstack. Some mechanics repair Mercedes cars while other folks drive them, which are you? Do I want to drive it or repair it? I repair servers for Data Analytic staff. They make twice as much money \"driving\" the app as I do fixing it.", "likes": 4}}, {"topLevelComment": {"author": "this is really me", "text": "Thanks for this FCC. MORE PLEASE :-)", "likes": 1}}, {"topLevelComment": {"author": "Emely Javier", "text": "Respect to your good work, thanks a lot", "likes": 2}}, {"topLevelComment": {"author": "THEFOREXEA DEVELOPER", "text": "Best of the best", "likes": 1}}, {"topLevelComment": {"author": "Daniel senanu", "text": "nice education", "likes": 1}}, {"topLevelComment": {"author": "lone wolf coding", "text": "what about ansible whats difference?", "likes": 0}, "replies": [{"author": "this is really me", "text": "Terraform is what's often used to automate creation of the infrastructure (instead of using the OpenStack web UI or command line). Once you have provisioned VMs running, then you can use Ansible to push configuration you want, apps you want, etc.  Different toolkits for different goals.", "likes": 0}]}, {"topLevelComment": {"author": "Paul Kleber", "text": "Insane many ads - every 1:46. I have never seen something like this before, it is the  worst ever, but finally installed an addblocker.", "likes": 0}}, {"topLevelComment": {"author": "0110 Japan", "text": "Thank you so much Sensei! You are a blessing!", "likes": 2}}, {"topLevelComment": {"author": "奮迅責強", "text": "Works well!! DANKEEE", "likes": 1}}, {"topLevelComment": {"author": "Semira Uthsala", "text": "Openstack still a thing in 2022 ? thought this project was dead", "likes": 1}}, {"topLevelComment": {"author": "Alex Lima", "text": "This guy should be a bilionaire.", "likes": 1}}, {"topLevelComment": {"author": "范博翔 本悟", "text": "I an I understand it when he's sayin it but i can't do it myself", "likes": 1}}, {"topLevelComment": {"author": "Market Maker", "text": "Please make a course on setting up openstack nova.", "likes": 1}}, {"topLevelComment": {"author": "Tyler James Harden", "text": "This is really a tutorial on how to use OpenStack on OpenMetal. I’d appreciate a tutorial of freeCodeCamp quality on everything from the bare metal hardware up to setting up OpenStack entirely on your own physical hardware. I don’t want to just switch from AWS or Azure to OpenMetal. Some of us are trying to be our own OpenMetal…", "likes": 68}, "replies": [{"author": "Human Person", "text": "@Jason Hwang id also like to ask what KYPO is", "likes": 0}, {"author": "this is really me", "text": "@TylerJamesHarden -- \"This is really a tutorial on how to use OpenStack on OpenMetal.\" - WRONG. \n\nPlease CITE to support your claim. Which features are different?\n\nYou really wanted this to be another topic (I.T. cluster building) and you are disappointed. Fine. But it's no reason to make a false claim to hype your ask. (Using your real name even, wow).\n\nIncidentally, to some (many?) software devs, THE most important feature of \"cloud\" is _forgetting_ about what you are insisting comes first: the hardware. There are I.T. teams to build clusters. 🙂", "likes": 2}, {"author": "this is really me", "text": "I second the request for more tutorials on different aspects of OpenStack. Let's all please remember that \"Operating OpenStack\" (ie, a user) is a completely different role and scope to \"installing and configuring OpenStack\". As different as Development is from DevOps. So yeah, let's have future related tutorials about different work with OpenStack.", "likes": 1}, {"author": "212helpdesk", "text": "@Jason Hwang who/ what is KYPO, can you give a link, I searched but didn't find anything relevant. Thanks!", "likes": 0}, {"author": "Jason Hwang", "text": "@Alberto Pimpo OpenStack deployment with Kolla-Ansible can be done without a ton of effort, detailed instructions available from OpenStack. Also if you want to set up a cyber range on top check out KYPO. I believe their YouTube installation videos cover a basic OpenStack install.", "likes": 3}]}, {"topLevelComment": {"author": "Ayoub Bensakhria", "text": "We really need like this open source technology to get rid of tech giants dependency. Especially those whose deal with sensitive data", "likes": 12}}, {"topLevelComment": {"author": "learncode-ميمو زيار", "text": "Can I translate your videos into Arabic?", "likes": 0}}, {"topLevelComment": {"author": "learncode-ميمو زيار", "text": "Can I translate your videos into Arabic?", "likes": 0}}, {"topLevelComment": {"author": "learncode-ميمو زيار", "text": "Can I translate your videos into Arabic?", "likes": 1}}, {"topLevelComment": {"author": "learncode-ميمو زيار", "text": "Can I translate your videos into Arabic?", "likes": 1}}, {"topLevelComment": {"author": "Michael Vilain", "text": "I attempted to create an account on OpenMetal and found they require a Github account or a LinkEdIn profile in order to create an account for this course. I'm not comfortable with that although giving AWS my credit card info seems just as intrusive. Be aware that this \"grant\" from OpenMetal is also a marketing campaign to gather information on potential new users. I'll pass on this but YMMV.", "likes": 3}, "replies": [{"author": "this is really me", "text": "It's obvious that infrastructure services can never be granted anonymously. There's _much_ cheaper ways for a company to become havens for miners and spammers. The marketing data they could glean from a GitHub account is pretty slim since it's just your GH public profile (and not all of the marketing information that Microsoft has on us)", "likes": 0}]}, {"topLevelComment": {"author": "riskzerobeatz", "text": "OpenMetal sucks. I registered on the 11th and approval is pending since then :D", "likes": 2}, "replies": [{"author": "OpenMetal", "text": "Please check your spam or junk folder, we contacted you via e-mail on the 13th", "likes": 0}]}, {"topLevelComment": {"author": "Aaron John Canlas", "text": "If you want I can conduct an Ansible or Linux Tutorial", "likes": 1}}, {"topLevelComment": {"author": "saleh hassan", "text": "Thanks a lot i want learn how to deploy openstack platfrom like as OpenMetal, so do you know any roadmap to study it", "likes": 1}}, {"topLevelComment": {"author": "M k", "text": "Hello guys, I was not paying attention and during the installation of Windows 10, instead of formatting the C drive, I deleted it, and now I don't know what to do, please help me.", "likes": 3}}, {"topLevelComment": {"author": "Arunsai Vemula", "text": "Sir you are amazing, can you make a tutorial on Android AOSP internals.\nAndroid development with Java and kotlin", "likes": 1}}, {"topLevelComment": {"author": "Ricardo Ramirez garcia", "text": "Mrs Sophia is legit and her method works like magic I keep on earning every  week with her new strategy.", "likes": 72}, "replies": [{"author": "Douglas Morin", "text": "😍", "likes": 0}, {"author": "Douglas Morin", "text": "Trade with her and remember to share testimonies with others", "likes": 0}, {"author": "Douglas Morin", "text": "Mrs Sophia has brought me out of the wrenches and to a better living through trading options, I encourage newbies to trade with her", "likes": 0}, {"author": "Kimberli", "text": "🥰🥰🥰🥰", "likes": 0}, {"author": "Kimberli", "text": "Most people remain poor only because friends and relatives discouraged and advise them against investing and trading forex while the wise ones kept investing and growing higher financially", "likes": 0}]}, {"topLevelComment": {"author": "Meyagul Niazee", "text": "Can you please guide me how to make an account for free trail of openmetal please please please", "likes": 1}}, {"topLevelComment": {"author": "Minhaj Balwan", "text": "Hey can you please make a video on search filter but not a simple one, an advanced one with Google like features\n\nSome features are :-\nIf someone has written wrong spelling it should still able to find the query.\nThats all i need", "likes": 1}}, {"topLevelComment": {"author": "Ivan Masum", "text": "Eagerly waiting for next tutorial on openstuck cualaansible for docker managment.  One question, how may i manage and put commands in my instence graphically like aws and huwaei cloud?", "likes": 1}, "replies": [{"author": "OpenMetal", "text": "OpenStack does have Heat and a CloudFormation compatibility layer, which can be used to deploy applications and resources from Horizon (OpenStack web UI) or the API, and they can be inspected graphically from Horizon. There is also an OpenStack project called Murano that allows directly deploying applications from Horizon, although it isn't widely deployed.", "likes": 1}]}, {"topLevelComment": {"author": "yusran ade pratama", "text": "It's based on kolla-ansible for deploying the openstack. Great video man!", "likes": 1}}, {"topLevelComment": {"author": "Nord Warrior", "text": "Interesting. I'm actually planning to build a server computer and this could be good fit for my needs.", "likes": 3}}, {"topLevelComment": {"author": "Ashish Nair", "text": "Talk about timing!!", "likes": 1}}, {"topLevelComment": {"author": "Vikash", "text": "Is it free?", "likes": 0}}, {"topLevelComment": {"author": "Ibrahim Ahmad", "text": "IS very good tuts, i invite you to  to Islam . IS the best path .", "likes": 1}}, {"topLevelComment": {"author": "Sandy 🤪", "text": "Waiting for such unique root level Cloud Tuts.\nSimilarly Can you make Course on RHCE-8 Ansible / Ansible for DevOps and latest Docker DCA Course", "likes": 3}}, {"topLevelComment": {"author": "Amanze Ogbonna", "text": "He blinks", "likes": 0}}, {"topLevelComment": {"author": "Ankit Ranjan", "text": "Hindi channel video very late upload come back new video upload", "likes": 1}}, {"topLevelComment": {"author": "Tasir Rahman", "text": "How can i create own hosting server like hostinger, godaddy, hostgator?", "likes": 1}}, {"topLevelComment": {"author": "Stone", "text": "You had me at Ironic. 😂", "likes": 1}}, {"topLevelComment": {"author": "Madhav Pandya", "text": "I request you guys to bring the course on how to do hardware setup and install openstack", "likes": 6}, "replies": [{"author": "Damola Azeez", "text": "Looking forward to this too", "likes": 0}, {"author": "Apoorv", "text": "Yes pls help in this", "likes": 0}]}, {"topLevelComment": {"author": "Dom Free", "text": "I wish you could help me with a question. I’m a Pokémon Go player. There are battles we can engage in with people around the world. We are told these battles are random. But it seems there is an algorithm, which most deny, that matches us based on our Pokémon weakness and advantages. Can you please help?", "likes": 2}}, {"topLevelComment": {"author": "Yaser Nimreh", "text": "Can you make a video about Xamarin Forms next time ?", "likes": 1}}, {"topLevelComment": {"author": "arnaud wanet", "text": "Excellent, thank you so much..", "likes": 2}}, {"topLevelComment": {"author": "John Boikov", "text": "Can some billionaire give this guy a million dollars please?", "likes": 110}, "replies": [{"author": "Maryam Abubakar", "text": "Lol", "likes": 0}, {"author": "SA", "text": "@John Boikov ✌", "likes": 0}, {"author": "John Boikov", "text": "Peace and love to all my software/cloud engineering/developing colleagues worldwide.  The global era is upon us and I am happy to be working with you all!", "likes": 5}]}, {"topLevelComment": {"author": "István Máté", "text": "these tutorials are worth gold", "likes": 5}}, {"topLevelComment": {"author": "Darbokst", "text": "went and looked at the pricing... 1k/a month? I'm sure there is something less expensive then that for them? maybe i'm looking at the wrong place.", "likes": 2}, "replies": [{"author": "D Israel", "text": "So what exactly i can do in this that i can do in the public cloud services", "likes": 0}, {"author": "OpenMetal", "text": "@D Israel OpenMetal is different because it gives you access to use private cloud services (on private servers that allow for modifications at your root level configurations) that can be spun up and down at the speed of public clouds.", "likes": 0}, {"author": "OpenMetal", "text": "We do have an entry point at $540 per month\n\n\r\n\r\n\r\n\r\n\r\n\r\nBefore you pay anything, you  take a free trial with us and make sure OpenStack meets your needs and then you can schedule a call with our specialists to discuss your needs and budget. With our services you get access to colocation space, setting up a rack, and server hardware which can easily cost over 100k.", "likes": 0}, {"author": "James Mittermair", "text": "@D Israel Control, lower long term cost (if self hosted - CAPEX/OPEX debate), and much more advanced features. It's also open source as opposed to proprietary.\n\nDownside is it's written in Python and is a bit of a monolithic codebase, whereas I believe a lot of AWS was ported to Rust where it mattered.", "likes": 0}, {"author": "D Israel", "text": "What's the adventage of using this vs azUre or aws?", "likes": 0}]}, {"topLevelComment": {"author": "Rick Bhattacharya", "text": "Hello sir , \nThanks for your videos it really helps students like me who can't afford expensive courses . One question can you please bring a full length Openshift cource.", "likes": 27}, "replies": [{"author": "TripleWho?", "text": "Hey! My videos aren’t as professional as this guy. But I do have a bunch of OpenShift along with OpenStack videos that you might find useful. \n\nIm happy to take requests if there is something specific you wanted to learn about.", "likes": 5}]}, {"topLevelComment": {"author": "Alfonso R. G.G.", "text": "i love this channel and this guy", "likes": 1}}, {"topLevelComment": {"author": "Simu Islam", "text": "Nice video", "likes": 1}}, {"topLevelComment": {"author": "coderNerd", "text": "I got one rule with creating web projects as much less 3rd party (not care if they are free to start with) services as possible and pay as less money for vps hosting as possible. None of this is needed and just add extra cost...", "likes": 2}}, {"topLevelComment": {"author": "Rishi Raj", "text": "🙏😌", "likes": 1}}, {"topLevelComment": {"author": "Gaston", "text": "hello i wanna know how to create a switch cli like cisco's, does anyone know where to start?", "likes": 1}, "replies": [{"author": "Brice Arthur G.", "text": "GNS3", "likes": 0}]}, {"topLevelComment": {"author": "vaibhav oza", "text": "Hi I want to learn about System Design in detail. Thanks for all the tutorials.", "likes": 6}}, {"topLevelComment": {"author": "Richard Coterie", "text": "NOICE", "likes": 1}}, {"topLevelComment": {"author": "Rodrigo Motta", "text": "Works on a 32bit SO? I have an old pc with next cloud intalled.", "likes": 1}, "replies": [{"author": "OpenMetal", "text": "It doesn't run on your PC, it runs on our Platform so your system capabilities would not prevent you from using OpenMetal to deploy OpenStack", "likes": 1}]}, {"topLevelComment": {"author": "bsdpowa", "text": "Unless you’re a BigCorp stay away from OS, it’s not worth the stress", "likes": 4}, "replies": [{"author": "bsdpowa", "text": "@Acedus I hate OS with a passion, it’s ok when it works fine but when it doesn’t then it really doesn’t work! Maintenance is absolute nightmare and requires an entire team of people!!! but usually has just one poor guy (me) trying to maintain it because nobody else wants to touch it, don’t blame them, but the biggest problem with it is that 99% of teams use it for virtual machines which any hypervisor out there can do with half less overhead… but vmware doesn’t sound as cool as Openstack and lately k8s… I really really hate it, it’s way too complex for majority of companies and hardly anyone knows what they’re doing, idk why it still exists outside Openshift", "likes": 0}, {"author": "Saad Owain", "text": "does not seem difficult. very easy", "likes": 0}, {"author": "Acedus", "text": "As an OpenStack admin with years of experience, I completely agree op, it is a bloated mess and the fact that it's a cloud provider written entirely and exclusively in Python doesn't help.", "likes": 0}, {"author": "freeCodeCamp.org", "text": "It has become easier to use for small teams using OpenMetal (shown in the course).", "likes": 6}]}, {"topLevelComment": {"author": "RUSHAAD", "text": "Do a video on how to make your own OS please", "likes": 13}, "replies": [{"author": "this is really me", "text": "Yes. Let's have a video on How To Write an Operating System, but let's keep it to 57 minutes instead of the usual 57 hours.", "likes": 0}, {"author": "lone wolf coding", "text": "next how to build own microchip using monocrystal silicon", "likes": 0}, {"author": "Kartik Chauhan", "text": "With C", "likes": 1}, {"author": "killerdroid99", "text": "Fork any of the Linux distro", "likes": 3}]}, {"topLevelComment": {"author": "spal solo", "text": "Butterfly Effect", "likes": 1}}, {"topLevelComment": {"author": "ZsaZsa Garcia", "text": "Hi I want to learn the Linux, hoping that you can also teach us how the Linux working? Thank so. much 😊", "likes": 12}, "replies": [{"author": "freeCodeCamp.org", "text": "Here is a Linux course that may be helpful. https://www.youtube.com/watch?v=ROjZy1WbCIA", "likes": 24}]}, {"topLevelComment": {"author": "Abhijeet Singh Chauhan", "text": "This guy is growing his beard gradually increasing it every video", "likes": 4}, "replies": [{"author": "Charles Ludwig", "text": "He still sounds like Jerry Seinfeld", "likes": 0}]}, {"topLevelComment": {"author": "Sanjay K", "text": "Great", "likes": 1}}, {"topLevelComment": {"author": "Gustavo Juantorena", "text": "Great!", "likes": 1}}, {"topLevelComment": {"author": "WiseOldAir", "text": "Yes.", "likes": 2}}, {"topLevelComment": {"author": "yash singh", "text": "First😁 thanks for video", "likes": 2}}]}