{"video": {"id": "ABlaMXkUwzY", "title": "Debugging JavaScript - Are you doing it wrong?", "description": "Learn a better way to debug your JavaScript.\n\nVideo from WellPaidGeek. Check out his channel: https://www.youtube.com/channel/UCejtQthQXQpZs3-kZCqsbrg\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT4M44S", "likes": "1047", "views": "28654"}, "comments": [{"topLevelComment": {"author": "Linda Scoon", "text": "This video is 4 years old  and I've not seen this video .  Life could have been so much easier better late than never I guess", "likes": 0}}, {"topLevelComment": {"author": "Ken Taylor", "text": "Whatttt!!!! Thank you", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Zaakir Mungrue", "text": "This video makes no sense, how did the App magically load itself into the browser ? Apparently he started teaching before the video started and he did not realise that the video had not yet started !!!  LOL How could you give a tutorial and the most important part of the tutorial was completed before the video even started and why is this so popular ? This is not a tutorial this is just you showing a different way to use the the debugger", "likes": 0}}, {"topLevelComment": {"author": "Pennyworth", "text": "lol...I can finally sleep", "likes": 0}}, {"topLevelComment": {"author": "whereismycheese 54", "text": "console.log -> debugger!", "likes": 1}}, {"topLevelComment": {"author": "Shaz Kingdom", "text": "😜 😂 console prints 😬", "likes": 1}}, {"topLevelComment": {"author": "Shani Bhatti", "text": "Thanks♡", "likes": 0}}, {"topLevelComment": {"author": "FrankCoding", "text": "Cool stuff. I was also working a modern review of debugging with console object in JavaScript :)", "likes": 0}}, {"topLevelComment": {"author": "Low Frequency", "text": "What os are you using ?", "likes": 0}}, {"topLevelComment": {"author": "Aromal Anil", "text": "freeCodeCamp has helped me a lot in my way. And now I have got a new piece of knowledge !", "likes": 0}}, {"topLevelComment": {"author": "Christian Lanoire", "text": "That’s the way to explain, right to the point, you deserve to be well paid :)", "likes": 3}}, {"topLevelComment": {"author": "H G", "text": "Freecode camp reinforces console.log() debugging through their curriculum unfortunately! Should have people using the real debugger from the get-go and should also teach debugging before they get beyond basic javascript!", "likes": 1}}, {"topLevelComment": {"author": "shabblabbat wababbalat", "text": "Good lord, haven’t ever used a console.log in 15 years, just set a breakpoint.  Who’s teaching these codemonkeys these days, philosophy majors?", "likes": 0}}, {"topLevelComment": {"author": "Kevin Deason", "text": "Better way? I highly doubt this is a statement we can assert as fact. It most definitely is a good way but not in all instances a better way.\n\n\nIf I wanted to inspect every item in a for/foreach loop I would much rather just log the data than inspect it through the dev tools as per the video. It will be faster.\n\nEach method has it's own merits", "likes": 2}}, {"topLevelComment": {"author": "별자리TV", "text": "Thanks for teaching this way and I will use console. log", "likes": 3}}, {"topLevelComment": {"author": "gopher", "text": "Logging is good way to find problem", "likes": 0}}, {"topLevelComment": {"author": "rajashekhar", "text": "Coverage,  performance, animations, sensor in chrome", "likes": 0}}, {"topLevelComment": {"author": "The Pup", "text": "console.log() fan club represent!!", "likes": 3}}, {"topLevelComment": {"author": "Dima Tonkih", "text": "That's all good and can be used in someway, but, i think, breakpoint's in devtools are more usable anyway.", "likes": 6}}, {"topLevelComment": {"author": "Hitek Boy", "text": "Rubishhhhhhhhhhhh", "likes": 0}, "replies": [{"author": "Hitek Boy", "text": "abhijeet badale its my personal comment and dont jump into anothers comment dont try to steal someone ideas create ur own. GoodWork always stay far ones cheap/ costly cmnt and makes 0 effect ...SamhjeBeta", "likes": 0}, {"author": "abhijeet", "text": "Looks like mahira is from pak... If u cant appreciate good work by people dont atleast spoil their videos by ur cheap comments", "likes": 0}, {"author": "Hitek Boy", "text": "WellPaidGeek VeryNiceVideo I love it", "likes": 0}, {"author": "Hitek Boy", "text": "Mike Anon ChupBeyLavre", "likes": 0}, {"author": "WellPaidGeek", "text": "Thanks for your eloquent criticism of my video.", "likes": 2}]}, {"topLevelComment": {"author": "S D", "text": "Does this work for Angular Typescript too?", "likes": 0}}, {"topLevelComment": {"author": "johncena smokie", "text": "nice video thaks for sharing", "likes": 0}}, {"topLevelComment": {"author": "Meleeman", "text": "Wonder if this works in node", "likes": 0}, "replies": [{"author": "WellPaidGeek", "text": "If you have the browser setup correctly and run the node app with --inspect, then yes!", "likes": 0}]}, {"topLevelComment": {"author": "demfak •", "text": "good to know, I was going crazy with console.logs", "likes": 3}, "replies": [{"author": "WellPaidGeek", "text": "I know the feeling!", "likes": 1}]}, {"topLevelComment": {"author": "Chaaos2", "text": "Very cool", "likes": 1}, "replies": [{"author": "WellPaidGeek", "text": "Thanks.", "likes": 0}]}, {"topLevelComment": {"author": "Aleksandr Vysockij", "text": "Didn’t know about this. Thank you. Will try it out!", "likes": 5}, "replies": [{"author": "WellPaidGeek", "text": "Thanks!", "likes": 0}]}, {"topLevelComment": {"author": "GammaEspeon", "text": "Wouldn't it be better to just set a breakpoint in the developer tools rather than adding anything into the code to force it? That way you wouldn't have to go back and extract the debugger command later, particularly if you have several of them lying around within the code.", "likes": 26}, "replies": [{"author": "ooo ooo", "text": "I agree. When you're used to classic dev such as Java, C#, C and the like the IDE takes care of it all. But here we work on a browser. The flow is not exactly the same.\nI knew times I dreamt of such tools.", "likes": 0}, {"author": "medicore0000", "text": "WebStorm has this functionality where you can add the break point by just clicking the appropriate line number. Just like in the dev tools. No need to write that debugger line and remove it later.", "likes": 1}, {"author": "Hashim Warren", "text": "I heard people mention this technique but never saw it demonstrated. Than you! Very clear!", "likes": 0}, {"author": "Replica", "text": "I agree with the above. Changing code to do debugging in general is a bad practice. Chrome debugger works relatively well with the source maps and all that jazz without needing this. Slippery slope of weird coding practices. It's a nice trick but we'd have years of slowly replacing leftover console.logs to start replacing leftover these language specific debugging statements.", "likes": 2}, {"author": "WellPaidGeek", "text": "I see what you mean, but at the same time you'd have to navigate to the right place in the sources tab within the developer tools, so it's easier to initially add the first breakpoint within your IDE, since you'll probably already have the offending code open in there. A linter should pick up stray debug statements. But yes, what you're proposing is still a viable alternative.", "likes": 13}]}]}