{"video": {"id": "aiTTClKJbnw", "title": "Flutter Tutorial - Building a Production App From Scratch", "description": "Learn how to build well planned and fully tested Flutter apps from scratch. This will guide you through planning what should go into the app, how to stay organized, all the way to fully testing your application. \n\n✏️ Course by Tadas Petra. Check out his channel: https://www.youtube.com/channel/UCNaJHBXsvbfkItVMNmzmTPQ\n🐦 Tadas Petra on Twitter: https://twitter.com/tadaspetra\n\n💻 Link to Code: https://github.com/tadaspetra/todoapp\n💻 Link to Widget Test Code: https://github.com/tadaspetra/flutter_basics/tree/master/017_unit_testing\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Introduction\n⌨️ (00:48) Planning\n⌨️ (04:39) Before you start\n⌨️ (07:42) Building the App\n⌨️ (19:38) Unit Testing\n⌨️ (37:15) Widget Testing\n⌨️ (41:51) Integration Testing\n⌨️ (51:07) Maintainability\n\n\n--\n\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT53M21S", "likes": "4592", "views": "168635"}, "comments": [{"topLevelComment": {"author": "Tadas Petra", "text": "Thank you all for watching! Feel free to reach out to me if you have any questions!", "likes": 116}, "replies": [{"author": "Nanda Kishore", "text": "Sorry for asking\nI am thinking of building a productivity app,, is this tutorial really true that can I build with the information you give or fake like others.... I think this is a real tutorial", "likes": 0}, {"author": "mohcine", "text": "is it the same if i use phpmyadmin database ?", "likes": 0}, {"author": "Burak Kosova", "text": "@hitesh saini actually thats a good idea my ig: burakosova_", "likes": 1}, {"author": "hitesh saini", "text": "Hey guys, My name is Hitesh. I am learning flutter now. I want a partner to study with me so that we can talk to each others, make new flutter apps, solve queries and also improve our knowledge. We can become friends on instagram, whatsapp, on any platform wherever you want.", "likes": 2}, {"author": "purushottam (pk)", "text": "Make series on Rxdart", "likes": 1}]}, {"topLevelComment": {"author": "Hossein", "text": "its very hard to grasp. full of jumps and cuts. also not described anything. its not beginer friendly.", "likes": 1}}, {"topLevelComment": {"author": "TRBRY", "text": "why do _all_ flutter tutorials copy past from docs that are no longer there ;-;", "likes": 1}}, {"topLevelComment": {"author": "Will Simz", "text": "How do you add the firebase to the flutter app\n\nIma having trouble running commands in the firebase CLI", "likes": 1}}, {"topLevelComment": {"author": "UCME YTSC", "text": "I couldn't watch this as you begin assuming viewers know anything about dart and firebase, this is not a tutorial in the teaching sense.", "likes": 2}, "replies": [{"author": "QuicksterGames Tutorials/Gameplay/And more!", "text": "This is more of a \"How to plan your app\" video. It is not about how to program it from the beginning to end. If you are comfortable with Flutter and Dart and all you need is to know how to plan your app, this video is perfect. Again, the title is misleading.", "likes": 0}]}, {"topLevelComment": {"author": "Mr. Poro", "text": "what app do you use for sketching and making notes?", "likes": 1}}, {"topLevelComment": {"author": "Olustra KenBP", "text": "Multiple output directories specified", "likes": 0}}, {"topLevelComment": {"author": "Fiifi Welsing-Jones", "text": "Went soo fast in such a short time", "likes": 0}}, {"topLevelComment": {"author": "Mr Cyb", "text": "Oh Maahnn!...…..\n\nI don't know what to say, you saved my not a single day. I am beginner on Programming so i have many doubts and problems to find out. but majority of them solved with a single video. the all thinks are perfectly crystal clear. i watched more tutorials but all of them wasted my time. anyway thanks from bottom of heart :)", "likes": 0}}, {"topLevelComment": {"author": "ROG PUNCH", "text": "greaeet", "likes": 0}}, {"topLevelComment": {"author": "Yoosuf Ahmadh", "text": "I don't understand this since I'm a new user. I hope to check it again after familiarizing with flutter. Seems like some useful content here", "likes": 0}}, {"topLevelComment": {"author": "Afrikan King", "text": "Landed a Sub for both channels", "likes": 0}}, {"topLevelComment": {"author": "Match Interview Express", "text": "Good night..could you do a plant garden application which has a user profile and a user community along with information about growing a plant?", "likes": 0}}, {"topLevelComment": {"author": "Prasan Osara", "text": "its mostly like how to copy-paste from scratch", "likes": 0}}, {"topLevelComment": {"author": "Alex Chen", "text": "I must say that this tutorial is not good for people who wish to follow each step and reproduce the whole app. He goes over the whole thing very fast. It is an intermediate tutorial. It is good to just watch through and get the gist of it.", "likes": 1}}, {"topLevelComment": {"author": "Prod. By Ralph", "text": "I don’t understand anything he is talking about lol😂😂😂", "likes": 0}}, {"topLevelComment": {"author": "Jasmin Lawerance", "text": "hi I wanted to develop an app in flutter and dart, my logic building concepts aren't clear, just a beginner and want your help in its development also I already have the full layout ready just need implementation with your help in collaboration .even little knowledge is ok but should be determined", "likes": 0}}, {"topLevelComment": {"author": "Chetan Temkar", "text": "Actually feel bad about criticizing but these videos don't really teach you much, it's more like revision for what you know.\nYou need videos that talk about what you are doing and why you are doing it step by step.\nUnfortunately most tech guys are pretty bad at teaching:)", "likes": 3}, "replies": [{"author": "apex player 101", "text": "true that, i was referring to this guys video and he just blows past a lot of details.totally not for beginners", "likes": 1}]}, {"topLevelComment": {"author": "Muhammad Ibrahim", "text": "I don't know how to setup firebase environment stupid", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Ibrahim", "text": "This isn't from the scratch stupid", "likes": 0}}, {"topLevelComment": {"author": "Charleone", "text": "what app are you using on iPad to jot down the Requirements and Testing at 1:24", "likes": 0}}, {"topLevelComment": {"author": "Necor Vartem", "text": "This is not from scratch at all.", "likes": 0}}, {"topLevelComment": {"author": "Musekwa Evariste", "text": "How do you jump from the designing step to the Firebase connection?", "likes": 2}}, {"topLevelComment": {"author": "coder xu", "text": "what kind of device do you use to write something by pencil?", "likes": 0}}, {"topLevelComment": {"author": "Earl John Calizar", "text": "Hi there Tadas, what a great video. But I have a concern on taking course on Udemy, they are kinda outdated like sometimes the codes are deprecated or removed. I'm looking for something that is really updated like the flutter 2.2 and also how to do with state management or the Providers. THANKS!", "likes": 0}}, {"topLevelComment": {"author": "John Strandt", "text": "8 months later, the code, she dona worka so good..", "likes": 0}}, {"topLevelComment": {"author": "Julius Soutine", "text": "Great tutorial! Only issue now is that the code seems to have been just slightly outdated, only on two lines. \n\ncontent = documentSnapshot.data() ['content'] as String;\ndone = documentSnapshot.data() ['done'] as bool;\n\nDoesn't work, the [ ] isn't accepted... it just goes \"Error: The operator '[]' isn't defined for the class 'Object'.\"", "likes": 1}, "replies": [{"author": "Jari Rentsch", "text": "I had the same error. Try to convert it to Map<String, dynamic> first.\n\ncontent = (documentSnapshot.data() as Map<String, dynamic>)[\"content\"] as String;\ndone = (documentSnapshot.data() as Map<String, dynamic>)['done'] as bool;", "likes": 0}, {"author": "Nanda Kishore", "text": "Did this tutorial work on making an app", "likes": 0}, {"author": "Nanda Kishore", "text": "Hey man", "likes": 0}]}, {"topLevelComment": {"author": "Kode Forest", "text": "\"Flutter Tutorial - Building a Production app from scratch\" - App Already created and doesnt even tell us how to create those .yaml files and how to setup firebase", "likes": 25}, "replies": [{"author": "VOID", "text": "What else u expect in 50min?", "likes": 0}, {"author": "itachiniko", "text": "this tho....huge assumption to think that we know how to even get this far", "likes": 9}]}, {"topLevelComment": {"author": "Wesley Barnes", "text": "I have an important question - maybe you could help us find an less complicated solution. Since you cover production here, what about building apps for real life professional environments that require a Dev, Staging, Production setup. I find the solutions out there so complicated - There must be a more \"manual\" or simplified way to manage it. I am building for a client and this is a real challenge for me atm. Thanks for the videos 👍🏻🍻", "likes": 0}}, {"topLevelComment": {"author": "Lance", "text": "Good also will be a good idea to implement architecture components as for today's technology there are so many requirements for it.", "likes": 0}}, {"topLevelComment": {"author": "Marco S", "text": "This is not a project from scratch at all. He copy-pasted waaaay too much of important code. This is more like an overview of a FlutterFire boilerplate.", "likes": 0}}, {"topLevelComment": {"author": "Hammad Pervez", "text": "Read my question it's important please, I'm currently working on an e-commerce project Having an issue with route navigation stacking\nI've an appbar with cart action button\n1) user tap on a product. It gets you to the  product detail and fetch it by ID.\n2) on redirecting to  product detail, I pop HomeView.\n\n3) when user tap on back button, I offPush  to home screen.\n4)  when user is on cart screen from detail page and on tap of cart item it redirects to detail page and then pop it on back button press. \nEtc......\n\nI'm currently using onRouteGenerator to manage my route navigation. But I don't know how can I recognize is it home page  I should redirect to or detail. When screen gets more nested and nested it's becomes a mass to handle. \n\nSorry for the bad explanation", "likes": 0}}, {"topLevelComment": {"author": "Aaron Kofi Gayi", "text": "You said guide yet you skipped the crucial part of adding firebase and we have to struggle to do that... is this not a beginner crash course?!", "likes": 0}}, {"topLevelComment": {"author": "TINASHE Jena", "text": "\"Flutter Tutorial - Building a Production App From Scratch\" but the project are started already", "likes": 22}}, {"topLevelComment": {"author": "Syed Daniyal Haider Naqvi", "text": "Integration tests look like fun 😍", "likes": 0}}, {"topLevelComment": {"author": "Yahya", "text": "Nice tutorial, only one minor thing, your voice isn't synced with the video around 7:40", "likes": 0}}, {"topLevelComment": {"author": "T0kwe", "text": "In my Opinion you are not abstracting the services enough from the UI Code. What happens when my App gets lots of Users and Firebase is too expensive? Then I want to switch my backend and with this architecture it is not possible because you use the Firebase Specific Models in the UI Code. So the UI Layer (Widgets & Screens) and the infrastructure layer (Services & Repositories) should be independent of each other and the domain layer should be independent from Flutter and Firebase. Then the domain layer defines contracts and models which are implemented in the infrastructure layer and the UI layer is then using these implementations via dependency injection.", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Yea you are right. The intention was to give a simple easy to follow along version. But it could be broken up better, and probably should be for bigger projects", "likes": 0}]}, {"topLevelComment": {"author": "De Coding Engineer", "text": "Loving the first 4 min of the video! I have a question, in the \"Before you start\" part of the video, how did you create a fire base project and a flutter project and connect to it?", "likes": 7}, "replies": [{"author": "Santiago Caro", "text": "May be this could help a little! Had the same confussion https://www.youtube.com/watch?v=Wa0rdbb53I8&t=23s", "likes": 1}, {"author": "Tadas Petra", "text": "Firebase actually guides you through how to initialize it. It is the same way as you would do for Android and iOS :)", "likes": 2}]}, {"topLevelComment": {"author": "Mohamed Amine Djidel", "text": "If C# is so clear with Mike , so you are my next thing to learn\nThanks for this video's \nFlutter seems cool and fast", "likes": 1}}, {"topLevelComment": {"author": "Ville Pakarinen", "text": "I freaking love flutter been working with it 2.5 months and still a lot to learn.", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "It never ends haha 😂", "likes": 0}]}, {"topLevelComment": {"author": "AB RAIYAN", "text": "This 1-hour tutorial is full of content. There is so much to learn, so much.  Thanks. Now I will go to your youtube channel. You are impressive!", "likes": 2}}, {"topLevelComment": {"author": "Amam Mustofa", "text": "'enter password field , very securee, 123456'  Xd . Anw, kudos to you, totally widen my knowledge in flutter, looking forward for your next videos :D", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "glad I could help!", "likes": 1}]}, {"topLevelComment": {"author": "Bruno Bernardes", "text": "Such a great great video, thanks a lot", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Glad I could help!", "likes": 0}]}, {"topLevelComment": {"author": "AntDinoDev", "text": "got to 19:40. He went a bit too fast and doesn't show the code for the login screen. Would like to see how he validates his login data. Also he doesn't show the imported packages for the yaml file.", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "The code is linked in the description if you want to take a look yourself. I don't think there was too much validation of login data here", "likes": 0}]}, {"topLevelComment": {"author": "NadjiN MALADE", "text": "The best video coding\nThanks", "likes": 0}}, {"topLevelComment": {"author": "hitesh saini", "text": "Hey guys, My name is Hitesh. I am learning flutter now. I want a partner to study with me so that we can talk to each others, make new flutter apps, solve queries and also improve our knowledge. We can become friends on instagram, whatsapp, on any platform wherever you want.", "likes": 0}}, {"topLevelComment": {"author": "Sameer Sarwar", "text": "Ive seen many people say that FutureBuilder shouldnt be used in stateless widgets. Can anyone explain why ?", "likes": 0}}, {"topLevelComment": {"author": "Julien Reszka", "text": "Not a tutorial for beginners.", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Hamza Shujaat", "text": "How to set up the app and flutter in the first place ? like Installation etc ?", "likes": 0}}, {"topLevelComment": {"author": "Strange World", "text": "Great tutorial!\r\nI facing a problem actually I am working on a like button similar Facebook has. if a user has a login then he will be able to like or unlike the post. using a listview builder for it. if you have an idea or have code then please share it with me. Thanks", "likes": 0}, "replies": [{"author": "Strange World", "text": "@Tadas Petra Thanks", "likes": 0}, {"author": "Tadas Petra", "text": "You can execute some quick logic that checks the auth state of the user!", "likes": 1}]}, {"topLevelComment": {"author": "Nilesh Bhakre", "text": "For production level flutter tutorial just watch reso coder YouTube channel...", "likes": 0}}, {"topLevelComment": {"author": "digigoliath", "text": "Awesome!!! TQVM!", "likes": 0}, "replies": [{"author": "Tadas Petra", "text": "thank you for watching 😊", "likes": 1}]}, {"topLevelComment": {"author": "Sachin Rathor", "text": "thankyou so much", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "thank you for watching 😊", "likes": 1}]}, {"topLevelComment": {"author": "Siddharth Panjwani", "text": "Does not explain the pre requisites, emulator used, OS etc. Firebase is not as easy to set up as shown. Ran into tons of errors when trying to do it for Android and it just halted progression. Definitely not \"well planned\".", "likes": 1}, "replies": [{"author": "Zaid Dar", "text": "It's not for beginners. The beginner version is elsewhere on freecodecamp. It says \"production app from scratch\" and you can't really build a production app straight away if you are a beginner.", "likes": 0}]}, {"topLevelComment": {"author": "Truong Le", "text": "I like your video style, great tutorial !", "likes": 0}}, {"topLevelComment": {"author": "Elio Kyomo", "text": "I like the tutorial. Can someone please tell me how he navigated to the main screen after entering his details?", "likes": 0}}, {"topLevelComment": {"author": "Ivan Yosifov", "text": "The video doesn't show how to set up Firebase or Flutter project. Kinda disappointing considering its for amateurs.", "likes": 28}, "replies": [{"author": "Ivan Yosifov", "text": "@David Owens According to the first 10 seconds of this tutorial *it should be for beginners*", "likes": 5}, {"author": "David Owens", "text": "It's not for beginniners.", "likes": 0}]}, {"topLevelComment": {"author": "Jeps", "text": "I thought it's gonna be an enterprise app. didn't expect a cliché practice project.", "likes": 0}}, {"topLevelComment": {"author": "Andenet Alexander", "text": "That's very awesome! can u please do the same tutorial using some state management included in it? perhaps using provider. because i don't see much tutorials on State management + Firebase altogether.  Thanks in advance.", "likes": 0}, "replies": [{"author": "Garri R", "text": "https://www.youtube.com/watch?v=vrPk6LB9bjo", "likes": 0}]}, {"topLevelComment": {"author": "Zxenon", "text": "I can't help when i see Flutter and FCC ...", "likes": 0}}, {"topLevelComment": {"author": "AMIT DUTTA", "text": "Great tutorial... Covering most important and ignored topics", "likes": 0}}, {"topLevelComment": {"author": "Yuber Vasquez", "text": "muy bien muchas gracias, me sirve de mucho\nthanks very much", "likes": 0}}, {"topLevelComment": {"author": "SILENMUS", "text": "u looks like ferry corsten", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "lmao he looks more handsome than me", "likes": 0}]}, {"topLevelComment": {"author": "HD 189773b Ice 6", "text": "Liked the video", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "thank you 😊", "likes": 0}]}, {"topLevelComment": {"author": "ManofSteele25", "text": "check out\" flutter with firebase app build net ninja\",... its good for beginners, this is literally from scratch.....", "likes": 11}}, {"topLevelComment": {"author": "Umer Farooq", "text": "Please upload the same tutorial for React Native?", "likes": 0}}, {"topLevelComment": {"author": "CodeJ", "text": "What theme is he using for vscode? Been looking for that theme and can’t seem to find it. Thanks in advance!", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "CodeJ thank you! I really appreciate it 😊", "likes": 0}, {"author": "CodeJ", "text": "Amateur Coder Thanks! Awesome work on the video btw!", "likes": 1}, {"author": "Tadas Petra", "text": "It's called Pitch Black 😊", "likes": 2}]}, {"topLevelComment": {"author": "UP-Graduate WithTechdevelopers", "text": "This is what we expected, a nice training.", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you 😊", "likes": 0}]}, {"topLevelComment": {"author": "Marlon Subuyú", "text": "This was the tutorial I was looking for! Thank you a lot!!!", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching!", "likes": 1}]}, {"topLevelComment": {"author": "bs will", "text": "I love your style of teaching. You also taught planning and maintainability", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "Thank you very much! I really appreciate it", "likes": 0}]}, {"topLevelComment": {"author": "Yash Jaiswal", "text": "Thank you very much for teaching us the industry level standards for app development", "likes": 3}}, {"topLevelComment": {"author": "Pranay Singh Parihar", "text": "I was literally looking to learn flutter yesterday", "likes": 4}, "replies": [{"author": "Tadas Petra", "text": "Hopefully I can help! I also have a playlist for beginners on my channel :)", "likes": 1}]}, {"topLevelComment": {"author": "anonymous bot", "text": "Need spring boot full stack project and tutorial please", "likes": 1}}, {"topLevelComment": {"author": "NSP Tech", "text": "Man! I just literally started using flutter today and this video pops up!", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Perfect timing!", "likes": 0}]}, {"topLevelComment": {"author": "Nick Bakker", "text": "Can you do this to with xamarin", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "I'm sure you can, but I haven't worked with it", "likes": 1}]}, {"topLevelComment": {"author": "Bazil Baachu", "text": "Thanks Amateur Coder for such a great tutorial❤👏", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching!", "likes": 0}]}, {"topLevelComment": {"author": "Hartley94", "text": "❤️️", "likes": 1}}, {"topLevelComment": {"author": "Moh Kur", "text": "Very nice video and well explained, I just have one comment, at 13:16 , you put a trim on the password which you should never do since a space at the beginning or the end of the password is totally viable, this might also break in the future as a user can put a single character password and surround it with spaces. But nevertheless it was a great video.", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "Yes, you are totally right! I just trimmed the email, and didn't think about it for the password field. Great catch!", "likes": 1}]}, {"topLevelComment": {"author": "D Sai Venkat", "text": "How many people feel blessed because of this channel..! 😇", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "Me 😊", "likes": 1}]}, {"topLevelComment": {"author": "Mirador Medico Ayala", "text": "Congratulation!\nHow many videos the flutter free course have?", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "I have like ~80 videos flutter videos on my channel, if that is what you're asking", "likes": 1}]}, {"topLevelComment": {"author": "Farid", "text": "really? another todos? lol, \"nice coder\" (no)", "likes": 0}}, {"topLevelComment": {"author": "Ohemaa Marygold", "text": "Nice tutorial.....Thanks", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching 😊", "likes": 0}]}, {"topLevelComment": {"author": "Neo", "text": "Hey try visiting his own channel he too has some amazing stuff;)", "likes": 6}, "replies": [{"author": "Tadas Petra", "text": "Thank you! I really appreciate it 😊", "likes": 2}]}, {"topLevelComment": {"author": "Shatrudhan Kumar", "text": "A lot of very Thnx sir", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "thank you for watching 😊", "likes": 0}]}, {"topLevelComment": {"author": "Chaitanya Kulkarni", "text": "Dam, thats good , nice job buddy", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you so much 😊", "likes": 0}]}, {"topLevelComment": {"author": "BornProud 85", "text": "Great video! Been a big fan of Amateur Coder’s content since the beginning! Glad to see you getting more recognition!", "likes": 4}, "replies": [{"author": "Tadas Petra", "text": "yuh yuh yuh", "likes": 1}]}, {"topLevelComment": {"author": "mayank", "text": "i really wanted a flutter tutorial and couldnt find one thanks for it", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "thanks for watching", "likes": 0}]}, {"topLevelComment": {"author": "Francesco Ciulla", "text": "Great video Tadas🔥🔥🔥", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you Francesco!", "likes": 0}]}, {"topLevelComment": {"author": "Ahmed abdorhman", "text": "That's awesome, Thanks a lot.", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "You're awesome! Thanks for watching 😊", "likes": 1}]}, {"topLevelComment": {"author": "GUL TARIQ", "text": "Amazing video🤯", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching!", "likes": 0}]}, {"topLevelComment": {"author": "Caleb Mbugua", "text": "woow..great job..thanks", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching 😊", "likes": 1}]}, {"topLevelComment": {"author": "Asif Imtiaz Ahmed", "text": "First 28 seconds, you got my \"like\" for the video. NO ONE covers the planning phase yet it is so important to know the thought process behind how we go about creating/designing an app", "likes": 48}, "replies": [{"author": "Tadas Petra", "text": "I think they are both topics that are overlooked! If you are trying to build a real product, then these are necessary!", "likes": 1}]}, {"topLevelComment": {"author": "ahmad fauzi", "text": "Hey tanks for this tutorial. I have question, can we build / run flutter with no internet connection / work offline ?", "likes": 2}, "replies": [{"author": "Tadas Petra", "text": "Yes, definitely! Obviously as long as you don't need a database or anything!", "likes": 2}]}, {"topLevelComment": {"author": "Daniel Millier", "text": "Fantastic! Curious, should we learn Dart before learning Flutter?", "likes": 1}, "replies": [{"author": "meet panchal", "text": "If you have already worked or if you are familiar with a Oop programming language then you just need to go through the syntax  of dart and freedcodecamp has a dart tutorial which you can watch ,all the best..", "likes": 1}, {"author": "Tadas Petra", "text": "Dart is actually really similar to Java and C# and other languages. So if you know those just learning the syntax is all you really need!", "likes": 0}]}, {"topLevelComment": {"author": "Hritik Gupta", "text": "Please make a tutorial for object detection app with flutter using tflite model.\nThanks in advance😀", "likes": 4}, "replies": [{"author": "Tadas Petra", "text": "ill look into it", "likes": 3}]}, {"topLevelComment": {"author": "D33P M4RK3T3R", "text": "Super", "likes": 1}}, {"topLevelComment": {"author": "Shubham Rajput", "text": "Thanks for this course", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Thank you for watching 😊", "likes": 1}]}, {"topLevelComment": {"author": "Anirudh Venkatesan", "text": "Youre the best", "likes": 1}, "replies": [{"author": "Tadas Petra", "text": "Anirudh Venkatesan best of luck! This includes everything you would need to build one. If you want more basic tutorials I have those playlists on my channel 😊", "likes": 0}, {"author": "Anirudh Venkatesan", "text": "@Tadas Petra Im in 7th grade, have some python knowledge", "likes": 1}, {"author": "Tadas Petra", "text": "No that is you 😊", "likes": 1}]}, {"topLevelComment": {"author": "Anirudh Venkatesan", "text": "Hi", "likes": 1}}, {"topLevelComment": {"author": "Code Stone", "text": "i wanted this tutorial thx", "likes": 3}, "replies": [{"author": "Tadas Petra", "text": "You're welcome 😊", "likes": 0}]}, {"topLevelComment": {"author": "Jelle Huibregtse", "text": "Finally someone who includes testing in their tutorial. Good work!", "likes": 162}, "replies": [{"author": "Jeremiah Parrack", "text": "The only reason I would watch this, thanks for the comment", "likes": 1}, {"author": "Tadas Petra", "text": "@Akshay Bengani Awesome! Glad I could help!", "likes": 0}, {"author": "Akshay Bengani", "text": "​@Tadas Petra  Yeah, there is no other tutorial I found, explaining integration testing in such deep detail, Thankyou brother I was stuck in the initial load of futurebuilder during my app starts, your isPresent function literally saved me.", "likes": 2}, {"author": "Simran Preet Singh", "text": "Checkout ResoCoders channel", "likes": 1}, {"author": "Soumyajit Dey", "text": "Exactly! It is one of the most essential part and most of the creator misses it.", "likes": 5}]}, {"topLevelComment": {"author": "KISHENTHIREN KUMARAN", "text": "lol first like haha", "likes": 1}, "replies": [{"author": "KISHENTHIREN KUMARAN", "text": "@Tadas Petra i wish I'll be able to contribute too in the future 😂💯", "likes": 2}, {"author": "Tadas Petra", "text": "@KISHENTHIREN KUMARAN Freecodecamp has helped me learn programming so much! It is nice to be able to give back", "likes": 1}, {"author": "KISHENTHIREN KUMARAN", "text": "@Tadas Petra ayyy thank u for sharing ur knowledge to us for free yo😂🙏🏼much appreciated dude❤️🙌🏼", "likes": 1}, {"author": "Tadas Petra", "text": "Thank you for watching 😊", "likes": 1}, {"author": "Deadly Dave", "text": "Nice!", "likes": 1}]}]}