{"video": {"id": "AKacS-t-MfQ", "title": "Day in the life of a freelance developer and mom", "description": "Colleen is a mother of three and freelance developer. She shares freelance tips while showing what a normal day is like for her.\n\n🐦 Colleen Schnettler on Twitter: https://twitter.com/leenyburger\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT8M40S", "likes": "2259", "views": "50733"}, "comments": [{"topLevelComment": {"author": "happygolucky", "text": "Doesn't she look like Anne Hathaway?", "likes": 0}}, {"topLevelComment": {"author": "happygolucky", "text": "But how  did you get those additional 2 hours to work in the night (from 7.30 to 9.30) considering your baby sitter is not there?", "likes": 0}}, {"topLevelComment": {"author": "sazk4000", "text": "i am thinking of starting freelance work. thank you for this insightful video", "likes": 0}}, {"topLevelComment": {"author": "Janai gift", "text": "Pls I want to learn freelanc developer. Pls how can I join?", "likes": 0}}, {"topLevelComment": {"author": "Hari harinath", "text": "how is this work freelance job", "likes": 0}}, {"topLevelComment": {"author": "Mina Dief - Entrepreneurs Coach", "text": "you made it after 6 years! congrats!", "likes": 0}}, {"topLevelComment": {"author": "Wess Zep", "text": "Thanks Coleen", "likes": 0}}, {"topLevelComment": {"author": "ConceptCoder", "text": "Mom, what's your channel? I would like to see more....", "likes": 1}}, {"topLevelComment": {"author": "ConceptCoder", "text": "I'm father of three also.....", "likes": 0}}, {"topLevelComment": {"author": "Fernando Padilla López", "text": "Hey! I just saw your codeland 2018 talk, great work!", "likes": 0}}, {"topLevelComment": {"author": "Benzaza Laid", "text": "may God protect you and protect your children\r\nyou have a gift of a great actress", "likes": 1}}, {"topLevelComment": {"author": "sanjay gatne", "text": "Hi, your \"No time, No money\" video is just hilarious and it relates so many people who are struggling for a job. Keep it up. Expecting more videos.", "likes": 2}}, {"topLevelComment": {"author": "فائدة-FAYADA", "text": "i remember your video from codenwbie  great story  keep doing", "likes": 0}}, {"topLevelComment": {"author": "Siva Kancharla", "text": "I love coding since I was a kid ,but had to pursue marine engineering due to parents pressure ,though salary is decent ,I am not happy with my job ,and I always feel something is missing in my life ,after watching your videos ,u proved that shifting career is not impossible if you set your mind to it ,handling two kids and still managing time ,Respect from India", "likes": 0}}, {"topLevelComment": {"author": "Shantanu Patil", "text": "awesome video", "likes": 0}}, {"topLevelComment": {"author": "Humans of Mira Road", "text": "Thanks Colleen, thanks FCC. Wow, FCC, you guys are amazingly super. lovely people, lovely video.", "likes": 0}}, {"topLevelComment": {"author": "Junnu Ravi Kumar", "text": "loved the 25 minute break time rule.", "likes": 0}}, {"topLevelComment": {"author": "Ham AlA", "text": "pheeeeeeeeew, listening to a militant's wife !!\n\naudience gonna learn something certainly !!!", "likes": 0}}, {"topLevelComment": {"author": "Yasir Karam", "text": "How to you consensus on expressing issues, is there a standard technique?", "likes": 0}}, {"topLevelComment": {"author": "rocky rocky", "text": "Cute", "likes": 0}}, {"topLevelComment": {"author": "World Aquarium Singapore", "text": "Coolest Colleen, i saw your other video, of you giving a talk in a conference, anyone else?", "likes": 2}}, {"topLevelComment": {"author": "music is Life", "text": "Is she at codenewbie  video? Wife of a us army", "likes": 1}}, {"topLevelComment": {"author": "Todd Boothbee", "text": "Is billing by the hour instead of by the project unusual?", "likes": 0}}, {"topLevelComment": {"author": "blerdinthecity", "text": "Love this!!! I've been searching for mom developer video just to find someone else in my boat so I know there's hope. 🥴  This helped so much. I'm going to make it happen! 🖤 I feel you on the sneaking around your toddler. 😩", "likes": 4}}, {"topLevelComment": {"author": "K B", "text": "I know this is an old video, but thank you for making it! This is exactly the type of work/life balance I'm looking for as a mom of 3 boys.", "likes": 8}, "replies": [{"author": "Hari harinath", "text": "Hi", "likes": 1}]}, {"topLevelComment": {"author": "LUIS FERNANDO CUESTA SANCHEZ", "text": "What an angel, \nher husband is a lucky man", "likes": 1}}, {"topLevelComment": {"author": "Tehseen Khan", "text": "Supermom.", "likes": 0}}, {"topLevelComment": {"author": "MichaelsTube", "text": "Finally a software developer with kids. Thanks for sharing.", "likes": 1}}, {"topLevelComment": {"author": "Mike S.", "text": "I pray whoever reads this comment becomes successful in their field of life", "likes": 1}}, {"topLevelComment": {"author": "Luan Almeida", "text": "How does one kid go to sleep at 7pm??? Never heard of that where I'm from, if it was my daughter she would wake up at 3am", "likes": 2}}, {"topLevelComment": {"author": "plenty2say", "text": "Any woman who can handle children and a career from home is easily a SUPERHERO!", "likes": 4}}, {"topLevelComment": {"author": "Cielle Sohal", "text": "I love you vlog and I can relate to it too! Hope you can drop by at the website to see the blog that I have posted: @t Thank you", "likes": 0}}, {"topLevelComment": {"author": "Peyton Randall", "text": "It is definitely not that simple to make money on the web. Are you still looking for a great opportunity? Google “Kοyοgο ydα” and then try to discover everything that’s on their site. In this site, you will learn techniques and get training resources that can help your online business become a success. .", "likes": 1}}, {"topLevelComment": {"author": "Sara", "text": "Your are such an inspiration .. i wish you all the best ♥️♥️♥️♥️♥️♥️", "likes": 0}}, {"topLevelComment": {"author": "A k", "text": "let your husband to help you with the kids. I do the same..", "likes": 0}}, {"topLevelComment": {"author": "Coding in Flow", "text": "Great energy you have, I love it", "likes": 9}}, {"topLevelComment": {"author": "David Denson", "text": "\"cloned a repo\" ?? What does that mean?", "likes": 0}}, {"topLevelComment": {"author": "Alisson Thomaz", "text": "marry me?", "likes": 0}}, {"topLevelComment": {"author": "Stu Lora", "text": "just a small remark: the upper edge of your monitor should not be higher than your eyes, so that you mist never look up. That will only give you an aching head, neck and back.", "likes": 1}}, {"topLevelComment": {"author": "Stu Lora", "text": "finally! a real world experience! thank you!!", "likes": 6}}, {"topLevelComment": {"author": "Dispute", "text": "LMAO 3:38", "likes": 0}}, {"topLevelComment": {"author": "Uri Frazier", "text": "Very cool. I came here after listening to your interview on CodeNewbie. Thanks for sharing your knowledge and experience Colleen!", "likes": 0}}, {"topLevelComment": {"author": "Jimmy sale", "text": "All the best sister.", "likes": 0}}, {"topLevelComment": {"author": "A D", "text": "It was really inspiring. You are managing your work and kids amazingly.", "likes": 1}}, {"topLevelComment": {"author": "Valley Bae", "text": "thank you for this! this is inspiring!", "likes": 0}}, {"topLevelComment": {"author": "Trucking life", "text": "Great video thanks a lot for the motivation", "likes": 0}}, {"topLevelComment": {"author": "sigmiami", "text": "Cool like me only female", "likes": 0}}, {"topLevelComment": {"author": "Doug Taylor", "text": "Definitely an inspiration. I am running out of excuses with the frequency that I see everyday people putting familiar tools to practice. I can and I will.", "likes": 1}}, {"topLevelComment": {"author": "Adam Atlas", "text": "(4:23) Go bake some cookies, woman! 😅😂🤣 And let REAL PROS do that kind of job !!!", "likes": 3}}, {"topLevelComment": {"author": "Mohamed Kuthubudeen", "text": "Her son in the red t-shirt is so smart.", "likes": 0}}, {"topLevelComment": {"author": "Patricia Jackson", "text": "Hello Collen! Are you a front-end, back-end or full stack developer? I only ask because I'm currently learning to be a front-end developer and I'll be looking to work as a freelancer. Thank you for sharing your video!!", "likes": 1}}, {"topLevelComment": {"author": "Carl Tanner", "text": "Thanks for sharing, Colleen. You provided a great insight.", "likes": 0}}, {"topLevelComment": {"author": "Sylvia Castro", "text": "I’m so happy to find this video!! I am also a mom software engineer & cant wait to get this show on the road so I can work full time! ❤️", "likes": 19}}, {"topLevelComment": {"author": "bstn myr", "text": "This Mom is just crazy cool.", "likes": 1}}, {"topLevelComment": {"author": "axiomvp", "text": "that kid looks like a reincarnation of Aaron Swartz.", "likes": 0}}, {"topLevelComment": {"author": "John Dough", "text": "Why not charge by project, instead of by the hour? Less tracking, more consistency, and you aren’t penalized if you’re a fast and proficient developer.", "likes": 32}, "replies": [{"author": "King of YouTube", "text": "I've thought about it. But the freelance sites make more money by charging by the hour than per project.", "likes": 3}]}, {"topLevelComment": {"author": "chaitanyacckr", "text": "just curious to know what technologies  you are working on and as well kind of projects and how long they go", "likes": 1}}, {"topLevelComment": {"author": "Ashok  Astrologer ", "text": "I am an astrologer and spiritual healer from Delhi India ,", "likes": 0}}, {"topLevelComment": {"author": "Ashok  Astrologer ", "text": "good", "likes": 0}}, {"topLevelComment": {"author": "ali shahverdi", "text": "reading a new code base almost eats all of my life how did you do that on morning xD", "likes": 2}}, {"topLevelComment": {"author": "The Knowledge Center", "text": "Very inspiring, thank you!!!", "likes": 0}}, {"topLevelComment": {"author": "Myles Gmail", "text": "Thx for the video, ur awesome!", "likes": 2}}, {"topLevelComment": {"author": "Froggy Phantom", "text": "inspiring but please landscape your dual monitor!  You're wasting a whole screen lol or just staying focused :P cheers", "likes": 1}}, {"topLevelComment": {"author": "Gugulethu Mtshali", "text": "Hi Collen, did you obtain your developer skill through freecodecamp? If you did, how long did it take?", "likes": 0}}, {"topLevelComment": {"author": "Nilufar", "text": "you r awsome )) your kids soo cute", "likes": 0}}, {"topLevelComment": {"author": "DeadMan Experience", "text": "Best Mom ever.", "likes": 1}}, {"topLevelComment": {"author": "Lemuel Junior", "text": "Thank you for sharing this video. I don't have kids but sometimes it is so hard to deal with time and all the other things in life that it feels like a big pressure. Watching her video and reading those comments here helped me a lot, specially by reminding me that I'm not alone in that track. Keep it up, y'all =)", "likes": 2}}, {"topLevelComment": {"author": "Exodus fivesixfivesix", "text": "A little bit challenging. Lol you must have skillz.", "likes": 1}}, {"topLevelComment": {"author": "Tristan Bailey", "text": "pom-a-door-o with the washing machine having a 25 min cycle is sometimes a good double focus too :) Nice to hear you sharing day as a freelance parent also", "likes": 1}}, {"topLevelComment": {"author": "Debbie isaacs", "text": "I have quite a fundamental question - on such days, what /when do you fit in cleanup/ food prep.? It doesn't seem like you have much time\nIf you are taking breaks of 5 mins each half hour  on a 9 hour day, you are basically recessing for a total of 1.5 hrs each day?", "likes": 0}}, {"topLevelComment": {"author": "Debbie isaacs", "text": "Your kids are adorable :)\nThanks so much for sharing. One of the main reasons that I wanted to start with web dev is the option to freelance as things get advanced, so that I could be a stay at home mom, please G-d.", "likes": 1}}, {"topLevelComment": {"author": "Michael G", "text": "Did you learn coding on your own? Or do you have a CS degree?", "likes": 0}}, {"topLevelComment": {"author": "sieve5", "text": "Instead of charging by the hour, I have started charging based on the value of my work to the client. So if the client stands to get their first round of funding for 100k, I charge them 10k (.5k for initial meeting, roadmap for sprints/project, contract. 1.5k for the next sprint based on difficulty it might be more,  keep billing until you reach the end of the project). Knowing your clients budget and what value they get out of it helps me find the value for the client even if all they have is a thousand bucks.", "likes": 1}, "replies": [{"author": "sieve5", "text": "Usually I get push-back from the client about this and we end up agreeing on a weekly or bi-weekly payments. Not charging based on a unit of time helps the client feel at ease knowing that I'm not gonna rack up a bunch of hours without them knowing what's going on.", "likes": 0}]}, {"topLevelComment": {"author": "SemiColon Keese", "text": "This was a great video! One suggestion I would make is when u transition to the short clips of you working, maybe have some music instead of the silence. \n\nQuestion: u mentioned u have to learn different code bases when pulling in new clients. Do you have a set of languages that you stick to or do you just learn as you go?", "likes": 0}}, {"topLevelComment": {"author": "DaBusyB", "text": "You are amazing! I have four at home and I'm just getting started on my journey. I would love to see more from you as I never really considered freelancing before.", "likes": 15}}, {"topLevelComment": {"author": "Travis Owens", "text": "I don't know whats more impressive. A mother working at home with 3 kids or her ability to use that terrible setup.", "likes": 1}}, {"topLevelComment": {"author": "Annis Monadjem", "text": "Keep up the wonderful job and thanks for sharing.", "likes": 0}}, {"topLevelComment": {"author": "Tanxy Rogue", "text": "crazy work ethic....", "likes": 0}}, {"topLevelComment": {"author": "AlfonsoTech", "text": "Thanks for sharing, I enjoyed watching!", "likes": 0}}, {"topLevelComment": {"author": "Davis David", "text": "That amazing ,I like the way  you manage your time", "likes": 0}}, {"topLevelComment": {"author": "Jesse Weigel", "text": "This is such a great video! Thank you Colleen for sharing your daily routine!", "likes": 1}}, {"topLevelComment": {"author": "Anna Dziedziul", "text": "Hi :) It looks like my day, but I don't hire a babysitter as yet.", "likes": 0}}, {"topLevelComment": {"author": "PixemWeb", "text": "Awesome video. I'm also a Freelance Developer who works from home with 3 kids. I should create my version of this video from a dads perspective. These types of videos are great since they share the type of information a person might need when starting off as a web developer. Time management, family work balance, business mindset etc.", "likes": 154}, "replies": [{"author": "Lemuel Junior", "text": "I loved that too! :)", "likes": 2}, {"author": "Soul Scribbler", "text": "I love that this comment lead to the other video...you're awesome @freeCodeCamp!", "likes": 7}, {"author": "freeCodeCamp.org", "text": "The video has been made! Day in the live of a developer and dad - https://youtu.be/vmmtFnLt_2Q", "likes": 16}, {"author": "PixemWeb", "text": "Hi Ketan, Just a heads up. They uploaded the video today. Check it out.", "likes": 1}, {"author": "PixemWeb", "text": "Hi Alfonso, Just a heads up, the video is up on this Channel.", "likes": 2}]}, {"topLevelComment": {"author": "Arminder Dahul", "text": "I work from home and I understand and respect the work ethic and juggling you have to do as a parent. 👍", "likes": 23}}, {"topLevelComment": {"author": "THI NHA", "text": "That's Cool ! I try as  u", "likes": 0}}, {"topLevelComment": {"author": "Divyesh Parmar", "text": "Hi Dudleen... Wow I'm just starting off my career as a 22 yo I think this is how I should also be focusing and managing work", "likes": 11}, "replies": [{"author": "Vocheseleon", "text": "@Divyesh Parmar niice. Thank you for the response.", "likes": 0}, {"author": "Divyesh Parmar", "text": "@Vocheseleon well so right now I'm 26. And now I'm working from home full time. I started working remotely even before Pandemic, in November 2019. \n\nNow I've started my own freelancing business working with clients on side. While I've a good full time job", "likes": 0}, {"author": "Vocheseleon", "text": "I am 22 now, what happened to you man?", "likes": 0}, {"author": "Adrian Garza", "text": "Hows it going for you man", "likes": 0}]}, {"topLevelComment": {"author": "Tan", "text": "I'm in love", "likes": 0}}, {"topLevelComment": {"author": "Guilherme", "text": "Very inspiring! Thanks for sharing your routine with us! By the way, I highly advise you to revise your office setup concerning the height of your table and monitors, it could get you into trouble in the long run (I'm suffering from it right now, I have to go to physical therapy three times per week to fix my right elbow).\nWish you all the best!", "likes": 1}}, {"topLevelComment": {"author": "Ragavan Rajan", "text": "great to see how your managing your work life balance", "likes": 0}}, {"topLevelComment": {"author": "westfield90", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "dedZombie", "text": "Wow a living example of a Ruby develepor. I thought all of them dissapered 😁 I just think you're great and how you keep everything managed between your private and work life. Great motivation. Keep it up", "likes": 3}}, {"topLevelComment": {"author": "Kevin", "text": "Amazing productivity strategy. Please, how did you find your first clients ?", "likes": 0}}, {"topLevelComment": {"author": "Marcos Lessa", "text": "Does your husband help?", "likes": 15}}, {"topLevelComment": {"author": "Nick Dean", "text": "Thank you for the great video! Lots of insite for freelancing and some really helpful tips!", "likes": 0}}, {"topLevelComment": {"author": "IsaaK", "text": "Awesome thanks for sharing", "likes": 0}}, {"topLevelComment": {"author": "Shannon Clark", "text": "That was really interesting. I’m curious: how much time do you spend maintaining existing web apps vs working on new projects for clients? Obviously I’m not familiar with your situation, but would value-based pricing be an option? That way you aren’t trading time for money, and you might be able to break for lunch, and take time off when you want to.", "likes": 2}}, {"topLevelComment": {"author": "Oscar Olivera", "text": "Great video. Now I want to try yoga!!!", "likes": 0}}, {"topLevelComment": {"author": "tenchichrono", "text": "Hm... maybe i should start freelancing... hmmm", "likes": 1}}, {"topLevelComment": {"author": "Vincent Pena", "text": "A guide please for finding clients. Thanks for sharing.", "likes": 42}, "replies": [{"author": "Vincent Pena", "text": "Thanks for sharing this awesome tips guys! This will help me big time 😁", "likes": 0}, {"author": "sieve5", "text": "Fun fact it was a free code camp meetup", "likes": 1}, {"author": "sieve5", "text": "Vincent, I would hit up your local programming meetups to find some business contacts you can do freelance work for. One way I was able to get clients is by speaking on how to get started with React at my local javascript startup. This puts me in a light that showcases myself as a professional. I got two clients from that talk.", "likes": 3}, {"author": "abhineet", "text": "start with 99 design, Upwork, appfutura, clutch, peopleperhour, guru, goodfirms etc", "likes": 8}]}, {"topLevelComment": {"author": "SolarFlareBabe", "text": "Thank you, this was a really helpful glimpse into what freelancing would be like", "likes": 10}}, {"topLevelComment": {"author": "Mirza Sisic", "text": "Nice organization.", "likes": 0}}, {"topLevelComment": {"author": "Manda Putra", "text": "Cute son. Cute Mom too", "likes": 11}}, {"topLevelComment": {"author": "Nurul Amin", "text": "I wanna say hi\nHiiiiiiii", "likes": 6}}]}