{"video": {"id": "B2q5cRJvqI8", "title": "Natural Language Processing with TensorFlow 2 - Beginner's Course", "description": "This course is a practical introduction to natural language processing with TensorFlow 2.0. In this tutorial you will go from having zero knowledge to writing an artificial intelligence that can compose Shakespearean prose.\n\nNo prior experience with deep learning is required, though it is always helpful to have more background information. We’ll use a combination of embedding layers, recurrent neural networks, and fully connected layers to perform the classification. \n\n\n⭐️Course Contents ⭐️\n⌨️ (01:16) Getting Started with Word Embeddings \n⌨️ (33:25) How to Perform Sentiment Analysis on Movie Reviews \n⌨️ (59:32) Let’s Write An AI That Writes Shakespeare \n\n\n⭐️Course Description ⭐️\nThe basic idea behind natural language processing is that we start out with words, i.e. strings of characters, that are almost impossible for the computer to meaningfully parse. We can transform these strings into a vector in a higher dimensional space. Different words will be represented as vectors of different lengths and directions in this space, and this allows us to find relationships between words by finding the component of one vector along another. Don’t worry, the TensorFlow library handles all of this, we just have to have some basic idea of how it works.\n\nSince this is a type of supervised learning, we also have labels for our text. This allows the AI to compare the relationships between words to the training labels, and learn which sequences of words represent good and bad movie reviews. This would also work for finding toxic comments, fake product reviews… just about anything for which we need a multiclass classification of text – provided we have enough training data and labels.\n\nThe last step in complexity is to change the final layer that handles the classification. This allows us to actually output text that the AI thinks is meaningful. What’s really special about this is that the neural network starts out not even knowing that letters are a thing, or that we use spaces and punctuation, to producing something that approximates human level writing.\n\n⭐️Code ⭐️\n🔗 Word Embeddings: https://github.com/philtabor/Youtube-Code-Repository/blob/master/tf_embeddings.py\n🔗 Text Classification: https://github.com/philtabor/Youtube-Code-Repository/blob/master/tf_sentiment.py\n🔗Text Generation: https://github.com/philtabor/Youtube-Code-Repository/blob/master/tf_text_gen.py\n\n⭐️Resources ⭐️\nAs stated in the videos, these are from the official TensorFlow tutorials. You can find them here:\n🔗https://www.tensorflow.org/tutorials/text/word_embeddings\n🔗https://www.tensorflow.org/tutorials/text/text_classification_rnn\n🔗https://www.tensorflow.org/tutorials/text/text_generation\n\n\nThis course was created by Phil Tabor. If you’d like to see more deep learning, reinforcement learning, and artificial intelligence content, please check out his channel: https://www.youtube.com/MachineLearningWithPhil\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H35M44S", "likes": "2190", "views": "76508"}, "comments": [{"topLevelComment": {"author": "code creator", "text": "I don't think this guy is explaining for beginners.", "likes": 0}}, {"topLevelComment": {"author": "Arjun Verma", "text": "The Last Jedi was polarizing at best. Its got great critic reviews and poor audience reviews. But the SW audience is kinda infamous for their immaturity so", "likes": 0}}, {"topLevelComment": {"author": "Ki", "text": "41:36 so cute lol\nWent through this tutorial after finished Patrick Loeber's TF playlist. Imo Patrick's code is friendlier to read.\nThis is probably not a good tutorial for TF beginners, but a great one after you learn the basics of TF.", "likes": 0}}, {"topLevelComment": {"author": "Abrar Fahim", "text": "Not for beginners. :/", "likes": 0}}, {"topLevelComment": {"author": "Tuna Özateş", "text": "I think this requires some background, I do not know much about TF and in first 15 minutes, I did not understand what is going on.", "likes": 0}}, {"topLevelComment": {"author": "The Unknown Evidence", "text": "It's really annoying that you keep mentioning the typos.", "likes": 1}}, {"topLevelComment": {"author": "Rakibul Hasan", "text": "Not a good tutorial for beginners, No explanation is provided! Wasted my 2 hours", "likes": 1}}, {"topLevelComment": {"author": "Aritra Karmakar", "text": "This video is not for beginners at all.", "likes": 1}}, {"topLevelComment": {"author": "A Bail", "text": "Dr. Phil", "likes": 0}}, {"topLevelComment": {"author": "Jeet Shah", "text": "You are using tensorflow with GPU or without???", "likes": 0}}, {"topLevelComment": {"author": "Parakeet Basmati", "text": "That's a garbage tutorial. The code you're using is not generalizeable at all. When people inevitably deal with data that isn't from Tensorflow Datasets, how are they going to replace \"encoder = info.features['text'].encoder\". I have no idea what it does: it's Tensorflow specific. You should have turned the Tensorflow dataset into a Numpy array or a list immediately.", "likes": 2}}, {"topLevelComment": {"author": "iKostanCom", "text": "Extremely unclear, it seems like there must be some preparation course in order to understand what this dude is doing...", "likes": 6}}, {"topLevelComment": {"author": "Robert Hinson", "text": "What editor are you using? Looks like vi.", "likes": 0}}, {"topLevelComment": {"author": "Jack", "text": "is it normal for the training to take a long time for the text generation", "likes": 0}}, {"topLevelComment": {"author": "Wizartar", "text": "very good video to get an overview of this stuff, but aren't uncompiled languages just so much fun to work with! run.run.run.typo!", "likes": 0}}, {"topLevelComment": {"author": "Tristan Rinehart", "text": "This is not a beginner's course.", "likes": 2}}, {"topLevelComment": {"author": "Muhammad Anas", "text": "I am getting a ConnectionResetError in tfds.load method in the code shown at 10:30 in the video. I can't seem to find any help on stackoverflow or any other site. has anyone got this problem and figured it out? please help with this, thanks", "likes": 0}}, {"topLevelComment": {"author": "Muthu", "text": "Unity tutorial please", "likes": 0}}, {"topLevelComment": {"author": "Ivan Yosifov", "text": "This is definitely not for beginners. Knowing Python is not enough. You also need to know TensorFlow.", "likes": 26}}, {"topLevelComment": {"author": "Aditya Shukla", "text": "I think it's GPT3", "likes": 0}}, {"topLevelComment": {"author": "Syed Aqib", "text": "I am new to Python...And know all basic of Python...Is this video worth ??? Viewer please answer me", "likes": 2}, "replies": [{"author": "Andrew Greinser", "text": "it's only 1.5 hours. So yes you can view it", "likes": 0}]}, {"topLevelComment": {"author": "Nikos Ellinas", "text": "Hello, have you explored how to build a custom encoder decoder architecture with tf2? For example machine translation, but to be able to run with variable length sequences, not just pad to maximum overall length.", "likes": 0}}, {"topLevelComment": {"author": "EarlZMoade", "text": "For vim you should have a look at the coc.nvim plugin with the coc-python extension. It'll prevent you missing syntax errors before running the file.", "likes": 0}}, {"topLevelComment": {"author": "BOOM BUBBLE BUST REPEAT", "text": "I really wish freeCodeCamp would bring back the Shirts and Hoodies in their store!", "likes": 4}}, {"topLevelComment": {"author": "Phillip Brown", "text": "You're not really explaining what you're doing as you're going... Which is a shame. Appreciate there's a lot of documentation to refer to, but 'beginners course' is a bit of a misnomer", "likes": 63}, "replies": [{"author": "vikram bhaik", "text": "Agree", "likes": 0}, {"author": "Bianca Aguglia", "text": "I think this is a good video for beginners who want to see someone else's workflow and get an idea of what it means to go through a simple NLP project in TensorFlow. For that reason, I believe the title is not a bad choice and the video is a good resource. 🙂\n\n\nLike you though, I wish there were some tutorials that did a good job explaining NLP theory and made it easier to go from beginner to good. The tutorials I've found so far are either too simple and general, either too advanced (for me, at least). For example, I've just discovered stanfordonline's \"CS224N NLP with Deep Learning\", which is a great course but is kicking my bottom because I understand very little of the math behind it. 🙃\n\n\nSince more and more people are becoming interested in NLP, we'll probably start seeing more tutorials soon. It will become easier to find something that fits our learning styles. Until that happens, I'll try to not get depressed watching the Stanford tutorials and seeing those students ask smart questions while I have to google every step of a simple back propagation formula . 😁", "likes": 5}]}, {"topLevelComment": {"author": "Kenzie7", "text": "I got my first job as a software engineer thanks to freeCodeCamp. I cannot thank you guys enough. I will definitely donate soon", "likes": 61}, "replies": [{"author": "Kenzie7", "text": "@umang mishra Go to the FCC website. They have a whole hands on course on HTML, CSS and JS. As you're doing the exercises, keep practicing DS and algo problems and make a few projects if you can", "likes": 0}, {"author": "umang mishra", "text": "Hello bhai can you please tell me exactly which videos you watched to get the software engineer job because there are so many videos on this channel it is impossible to watch all. Hence please tell me the names of ALL the videos you watched, that would be very very helpful for a beginner like me. Also can you please tell me the path you took to learn. Thank you so much", "likes": 0}, {"author": "M R", "text": "What languages did you focus on if you don’t mind me asking? Also, how did you structure learning them?", "likes": 0}, {"author": "skt gaming", "text": "@Kenzie7 thank you. I didn't know about Angel list . I will check 👍", "likes": 1}, {"author": "Kenzie7", "text": "@skt gaming For startups, angel list is really good. For a fresher, salary package is decent", "likes": 1}]}, {"topLevelComment": {"author": "Yasser Elbarbary", "text": "look at these GPUs...", "likes": 14}}, {"topLevelComment": {"author": "know it", "text": "I have started a python programming ch named infinite programming  .... Can you pliz see the channel and give me some suggestions and pliz give me blessings", "likes": 1}, "replies": [{"author": "know it", "text": "Btw awesome video", "likes": 0}]}, {"topLevelComment": {"author": "steVENOM", "text": "Bruh they straight up copped the Fleet Farm logo", "likes": 1}}, {"topLevelComment": {"author": "Satyajit Das", "text": "Where is the GitHub for this project?", "likes": 0}, "replies": [{"author": "Qori", "text": "@Quincy Larson links broken now", "likes": 0}, {"author": "Tapan Dabrai", "text": "@Quincy Larson Thank you for everything Mr. Larson !!", "likes": 0}, {"author": "Quincy Larson", "text": "We're using Google Colab this time instead of GitHub. There are links to the different codebases in the description.", "likes": 2}]}, {"topLevelComment": {"author": "Satyajit Das", "text": "I want to run this project. Where can I find the datasets ? For doing this hands-on ?", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "Just added links to code in the description. Here they are:\n⭐️Code ⭐️\n🔗Word Embeddings: https://colab.research.google.com/github/tensorflow/docs/blob/master/site/en/tutorials/text/word_embeddings.ipynb\n🔗Text Classification: https://colab.research.google.com/github/tensorflow/docs/blob/master/site/en/tutorials/text/text_classification_rnn.ipynb\n🔗Text Generation: https://colab.research.google.com/github/tensorflow/docs/blob/master/site/en/tutorials/text/text_generation.ipynb", "likes": 5}]}, {"topLevelComment": {"author": "Rok Zabukovec", "text": "I've got warning with 2.0 but they are not funny😂", "likes": 2}}, {"topLevelComment": {"author": "ReKuZa Studio", "text": "I learnt python with this channel, and now I'm creating my own course on a free platform (Stepik), To Give back to the Community ❤", "likes": 20}, "replies": [{"author": "ReKuZa Studio", "text": "@Francis2k4 thanks and same to you😊", "likes": 0}, {"author": "Francis2k4", "text": "Thanks. I will check it out. \n\nHappy you grabbed the Python skills.  Try and start applying the knowledge asap so you won't forget it.", "likes": 0}, {"author": "ReKuZa Studio", "text": "@Francis2k4 That Python for beginners by Mike helped me the most, it was one of the finest course", "likes": 1}, {"author": "Francis2k4", "text": "Nice to hear that. I am also learning. What courses helped you the most?", "likes": 0}]}, {"topLevelComment": {"author": "A I.", "text": "I can't believe I've learned so much from this channel. Love from Pakistan.", "likes": 0}}, {"topLevelComment": {"author": "Vatsal", "text": "First comment", "likes": 0}}, {"topLevelComment": {"author": "NS", "text": "13 seconds agi", "likes": 0}}]}