{"video": {"id": "B7seUQzZGx0", "title": "Computer Basics 15: Analog vs Digital and how File Compression works", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n  How computers turn analog sound into digital files, and the pros and cons of data compression.\n  Let's discuss analog vs digital on a very basic level.\n  Most specifically, we'll talk about how computers interpret analog sound and turn it into a digital file.\n  An analog sound wave could look like anything, but for this example it's a wavy line.\n  The computer takes it and measures at lots of different points, turning them into numbers.\n  This is called sampling.\n  Later, the computer can take those numbers and turn them into sound again.\n  Let's also discuss data compression.\n  The benefit of compression is that it's a smaller file: it's easier to store, it's easier to send to someone else, and it just takes up less space.\n  One of the ways this is done in sound is that the sampling is taken less often.\n  Another way is that it takes the measurement from a median point instead of from 0, so the numbers recorded are smaller.\n  In images, it's done by measuring groups of pixels by 16 instead of individually.\n  The takeaway from this video is that you'll want to use digital files as they're a higher quality, and when you're looking at compression, you want to decide how far you are willing to go to ensure the user still has the best possible experience.", "duration": "PT1M39S", "likes": 0, "views": "20829"}, "comments": [{"topLevelComment": {"author": "Militant minded", "text": "I like how these videos progressively get longer until there like 14 hours lol", "likes": 2}}, {"topLevelComment": {"author": "Anthony Botting", "text": "Can you describe what you mean by saying a digital file is \"higher quality\" than the analog file it represents?  For example, a sine wave can be described by a continuous function. Taking samples of a continuous function to represent it results in a lower quality representation, no matter how many sampling points are taken over the interval.", "likes": 5}}, {"topLevelComment": {"author": "David Castrillón", "text": "I think it would be a good idea name the video with a clear title, maybe related to the topic :D", "likes": 3}}]}