{"video": {"id": "BfEjDD8mWYg", "title": "ASP.NET Core Crash Course - C# App in One Hour", "description": "Learn how to create a web database app in ASP.NET Core using Visual Studio and the C# language.\n\nThis tutorial will show you how to :\n- Use the MVC (Model View Controller) design pattern.\n- Configure database tables using the Entity framework.\n- Setup of classes as models. Customize Razor forms.\n- Create methods inside a controller.\n- Style an ASP.NET page with CSS.\n- Use Bootstrap classes.\n- Create a search function to filter database results.\n\n✏️ Course developed by Shad Sluiter. Check out his YouTube channel: https://www.youtube.com/user/shadsluiter\n\n⭐️ Special thanks to our Champion supporters! ⭐️ \n🏆 Loc Do\n🏆 Joseph C\n🏆 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H44S", "likes": "18622", "views": "927986"}, "comments": [{"topLevelComment": {"author": "Programming w/ Professor Sluiter", "text": "If you have opinions or comments directed at me (the author), you can comment here or on my channel at https://www.youtube.com/user/shadsluiter", "likes": 331}, "replies": [{"author": "rosh it", "text": "The migration code is giving error \r\nhow to do it", "likes": 0}, {"author": "Kjaamor", "text": "Fast-paced. Focused. Covering core areas but clear and concise in doing so. Literally everything a tutorial should be. Many thanks!", "likes": 0}, {"author": "Carlos Avellán", "text": "Chad thank you so much for your course. I learned a lot. I am having issues linking the users and products databases with Entity Framework. Will you offer a course on using Foreign Keys with EF? I would be most interested in one! Thanks.", "likes": 0}, {"author": "Matthew Mathis", "text": "Thank you for the tutorial!\nIt's super!\nAnd I love that you explain what you're doing. I think a lot of people don't explain what they are doing when they do it, but you have here.\nAnd thank you for making this free! Thanks Shad!", "likes": 0}, {"author": "The Robinator", "text": "Thank you so much for making these videos, sir.\nI can't think of any video I have watched where so much was covered in an hour, without feeling rushed.", "likes": 0}]}, {"topLevelComment": {"author": "Lonely Walker", "text": "I can't see the IIS express button all I see is \"Attach to process\" what I'm doing wrong?", "likes": 0}}, {"topLevelComment": {"author": "Bongani Mlumbi", "text": "What happened to log in and Registration??", "likes": 0}}, {"topLevelComment": {"author": "Marc Hansel Thomas", "text": "You're a life-saver Shad!", "likes": 0}}, {"topLevelComment": {"author": "Cliff Estes", "text": "Really great tut.  My only problem came when no amount of cussing would get login to work.  No matter what credentials I tried, nada.  Other than  that, I loved it.\n\n[edit] Right after posting this comment, I went back and tried one more time - it worked!!!!", "likes": 0}}, {"topLevelComment": {"author": "Alejandro Gomez Nieto", "text": "Me vi varios tutoriales tratando de entender ASP y es el primero que encuentro que simple, corto y claro.", "likes": 0}}, {"topLevelComment": {"author": "Manzz", "text": "A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: SNI_PN11, error: 56 - Unable to load the SQLUserInstance.dll from the location specified in the registry. Verify that the Local Database Runtime feature of SQL Server Express is properly installed.)", "likes": 0}}, {"topLevelComment": {"author": "Jaime Rodriguez", "text": "Excellent tutorial (for me). The course filled in a lot of gaps allowing me to better understand the concepts. Thank you!", "likes": 0}, "replies": [{"author": "Kwanda Madela", "text": "Hi there, I am about halfway the course and I've been getting very different outputs compared to that of the tutorial. I'd like to know is it just me or is it because the course is old??", "likes": 0}]}, {"topLevelComment": {"author": "Caleb Timothy", "text": "Prof Thanks", "likes": 0}}, {"topLevelComment": {"author": "Roshan Joshi", "text": "i tried coding  watching many courses but i couldn't . NOW  i did it. this course built my self confident and attraction  towards coding", "likes": 0}}, {"topLevelComment": {"author": "jerrware", "text": "Do you have a follow up course where we create the database first?  As you say, most DBA don't like this. In my years of Java-Hibernate world, the DBAs would never go for this.", "likes": 0}}, {"topLevelComment": {"author": "radu stefan", "text": "SOMEBODY HAVE A DIAGRAM FOR THIS?", "likes": 0}}, {"topLevelComment": {"author": "Chris Rowe", "text": "This almost feels like cheating. I've been doing Javascript/Typescript and Node back ends using a \"sequelize\" npm for my ORM, and then making all of my views myself in one of the popular JS frameworks. I just got hired for my first full time dev role working with C#, .NET, & Blazor so I wanted to follow this to get my feet wet. It's unbelievable how much hard work and time has gone into creating this tooling. I know that this is still something that is good to understand what is happening under the hood with, and that obviously, any sort of consumer-facing finished project in production would need a lot more configuring and styling but I am blown away at how quickly this tutorial took me from no application, to a working CRUD + DB app. Great video!", "likes": 0}}, {"topLevelComment": {"author": "Phone SJ", "text": "using vs community 2022\ncannot find the \"Data\" file at 22:28\nCan someone help?", "likes": 0}, "replies": [{"author": "Kwanda Madela", "text": "I just searched for the file \"applicationDbContext\"", "likes": 0}]}, {"topLevelComment": {"author": "Roque Dominguez", "text": "Great tool, thank you profesor Sluiter.", "likes": 0}}, {"topLevelComment": {"author": "Yang-Kyun Park", "text": "Thank you, Professor! Successfully created my first web app thx to your teaching.", "likes": 0}}, {"topLevelComment": {"author": "Cider Bizet", "text": "My man is coding on a white background, I fear for your cornea", "likes": 0}}, {"topLevelComment": {"author": "Kenneth Vikse", "text": "Unable to follow the course because of this \"Build started...\nBuild succeeded.\nMore than one DbContext was found. Specify which one to use. Use the '-Context' parameter for PowerShell commands and the '--context' parameter for dotnet commands.\" Someone that could help me out?", "likes": 2}, "replies": [{"author": "Phone SJ", "text": "cannot find that too......", "likes": 0}]}, {"topLevelComment": {"author": "bhavesh chudasama", "text": "Thanks for very good explanation", "likes": 0}}, {"topLevelComment": {"author": "Alex Liebhaber", "text": "Beginner here. Can someone tell me why I’m getting 5 errors right when I click mvc create and run. I haven’t added or deleted anything. It looks like there’s types and namespace issues for all of the package references. But the video just runs fine so these issues aren’t addressed", "likes": 0}}, {"topLevelComment": {"author": "MaZy", "text": "I got bamboozled 49:00. Me \"It cannot be. Wow it worked, wow, why?\" and then you show you have only one item in database lol.", "likes": 0}}, {"topLevelComment": {"author": "Mark Wood", "text": "Those aren't jokes.  They are riddles.", "likes": 0}}, {"topLevelComment": {"author": "Allen A", "text": "would be nice to see this updated for more recent razor page constructs instead of mvc", "likes": 0}}, {"topLevelComment": {"author": "Rafael de Paula", "text": "Thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "mugu rasa", "text": "💯❣🙏", "likes": 0}}, {"topLevelComment": {"author": "Wasim Baig", "text": "Salute to you Sluiter!\nAbsolute beginner here (senior citizen though)\nTook me nearly week to understand few of the concepts but watched this nearly 20 times to clear those concepts.\n\nAwesome work!", "likes": 0}}, {"topLevelComment": {"author": "rosh it", "text": "The migration code is giving error \nhow to do it", "likes": 0}}, {"topLevelComment": {"author": "A M", "text": "Amazing, frontend dev of 12+ years here, needed to learn some C# to help out the backend guys, this really got me excited/gave me the confidence to explore C# more. \n\nPossibly the best tutorial I've ever followed along with. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Avijit Pal", "text": "visual studios is not free:(", "likes": 0}}, {"topLevelComment": {"author": "trym falkum", "text": "BRILLIANT VIDEO! My project group have tried so many videos and lectures until this video popped up!", "likes": 1}}, {"topLevelComment": {"author": "Gator Mark", "text": "Excellent, excellent course. I have been working with Web Forms for many years and am FINALLY transitioning to .NET Core and MVC. This was very understandable and filled in a lot of gaps. Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Bradley Spiclin", "text": "Thanks very much for this tutorial Shad. I'm a beginner learning C# and it was great to learn some basics with ASP.NET, thank you for putting this together.", "likes": 0}}, {"topLevelComment": {"author": "Giulliano Pinheiro", "text": "Amazing tutorial, I've been working on small backend C# routines and I wanted to do something full, just like this Jokesweb App. Congratulations for this amazing job Mr Sluiter.", "likes": 0}}, {"topLevelComment": {"author": "Holy Mango", "text": "How do you form a more complex schema with relationships between the entities with templates?", "likes": 0}}, {"topLevelComment": {"author": "c#mrmakinist", "text": "Pleas video cutter", "likes": 0}}, {"topLevelComment": {"author": "Matias Zozaya", "text": "My god. Finally I understand MVC architecture. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Y J", "text": "THANK YOU THANK YOU THANK YOU SOOOOOOOOOOOO MUCH!!!!!!!!!!!!!!!!!!!!\n\nI've searched high and low for MVCs and most of them either didn't explain at all or deliberately skipped -- which ended up being a waste of time when I actually wanted to learn and have an active server page!!! (Seriously, I've looked at so many...) Wow. I wish I can turn back time and just start with this tutorial because it is simply THE BEST -- Clear, concise and straightforward. Thank you Professor!!! 👏👏👏👏👏", "likes": 0}}, {"topLevelComment": {"author": "Cristian Daniel Herrera", "text": "Fantastic, beacuse in UK a lot job in .Net", "likes": 0}}, {"topLevelComment": {"author": "Christopher Sakwa", "text": "Hello sir, at approximately 31:17 where you enter the url \"localhost:44329/Jokes\"  , where in the code did the \"Jokes\" come from and can it be changed from \"Jokes\" to anything else? Thanks. I am following through and I am currently stuck here, the localhost<myWebPort>/\"Jokes\" returns a blank page, everything else works fine.", "likes": 1}, "replies": [{"author": "bawx of chawclets", "text": "The issue is by default the  database is not connected. You have to connect it to your custom table to the database yourself. \nthis tutorial shows you how :  https://youtu.be/7d2UMAIgOLQ?t=11107 \n \nessentially your just going in the appsetttings.json in the ConnectionStrings you copying your Localdb name from SQL Sever Object  and adding your database name of your choosing should looks something like this :\n\"ConnectionStrings\": {\r\n    \"DefaultConnection\": \"server=(localdb)\\\\ProjectModels;database=MyappChosenName;\"\r\n  }", "likes": 0}]}, {"topLevelComment": {"author": "Michael Shepherd Munemo", "text": "Best Tutorial.. Clearly explained", "likes": 0}}, {"topLevelComment": {"author": "Site Reliability", "text": "15:10 remove </a>", "likes": 0}}, {"topLevelComment": {"author": "Jack Do", "text": "thank you so much your content is really helpful to me", "likes": 0}}, {"topLevelComment": {"author": "Michael Redl", "text": "Wow, visual studio really is helping you out. It kind of feels like programming on training wheels which is actually a good thing if you work with it - not against it.", "likes": 0}}, {"topLevelComment": {"author": "6kf2", "text": "when i click run the cmd opens ? \nhow to fix it ?", "likes": 0}}, {"topLevelComment": {"author": "Cool Tech and More", "text": "This takes the fun out of programming wish Microsoft would stop messing with the ide and the process", "likes": 0}}, {"topLevelComment": {"author": "Amol Aghav", "text": "Amazing and simple explanation.", "likes": 0}}, {"topLevelComment": {"author": "Jairaj Sahgal", "text": "migrations is next to impossible in macos.", "likes": 0}}, {"topLevelComment": {"author": "life in harmony", "text": "15:00", "likes": 0}}, {"topLevelComment": {"author": "Yassir Nasri", "text": "Keep up the Good Work", "likes": 0}}, {"topLevelComment": {"author": "Rusty Owens", "text": "I have a problem. I followed up to the point where I typed in update-database in the package manager console. It said it was done with no errors. But when I go to the databases in sql server object explorer, nothing has changed even after I refresh.  Did I miss a step where I set up the database in the project?", "likes": 0}}, {"topLevelComment": {"author": "Howard Bash", "text": "I put a break in the controller on ShowSearchResults and I see that the SearchPhrase parameter isn't getting a value (it's null).   The ShowSearchForm.chtml section looks like this:\n\n <div class=\"form-group\">\r\n                <label for=\"SearchPhrase\" class=\"control-label\"></label>\r\n                <input nane=\"SearchPhrase\" class=\"form-control\" />\r\n\r\n </div>\n\nand the method in the controller that breaks but has a null instead of the SearchParameter is this:\n\npublic async Task<IActionResult> ShowSearchResults(String SearchPhrase)\r\n{\r\n     return View(\"Index\", await _context.Joke.Where(j => j.JokeQuestion.Contains(SearchPhrase)).ToListAsync());\r\n}\n\nAny ideas on this would be appreciated.", "likes": 1}}, {"topLevelComment": {"author": "ClubGamerZone", "text": "First of all thank you for this great tutorial. For me, everything worked, except that the ID wasnt showing in the tables, I am not sure what is the cause of the error. Someone else had the same issue?", "likes": 0}}, {"topLevelComment": {"author": "Weldopedia", "text": "if you input the \"add-migration\" command a second time, why does the result come up blank?", "likes": 0}}, {"topLevelComment": {"author": "Weldopedia", "text": "23:31 pop-up alert in generating the boilerPlate for the controller... 'The entity type '[controller-name-here]' requires a primary key to be defined'", "likes": 0}, "replies": [{"author": "Weldopedia", "text": "ok looks like, without diving into a tangent study, \"Id\" is required.  I was using DGoodId... also had to input the command \"Install-Package Microsoft.VisualStudio.Web.CodeGeneration.Design\" into the package manager", "likes": 0}]}, {"topLevelComment": {"author": "Sarah Hold", "text": "Hi, I try to follow this tutorial but when I open SQL server and localdb, the databases folder is empty. Do you have a solution for this issue?", "likes": 0}, "replies": [{"author": "Sarah Hold", "text": "I managed to solve this problem :)", "likes": 0}]}, {"topLevelComment": {"author": "Adolfo Lopez", "text": "Was a video ever posted to show the addition of the joke author feature?", "likes": 0}}, {"topLevelComment": {"author": "pew", "text": "Very good video not boring like the guy and informational and I like how he shows the result and goes further and instead of searchparams he does frog then delete then searchparams I like that which teachers don't do", "likes": 0}}, {"topLevelComment": {"author": "CSC G-TECH", "text": "bruh sa lmao", "likes": 0}}, {"topLevelComment": {"author": "timothee52", "text": "Incredible tutorial, super clear and understandable. Take my like !", "likes": 1}}, {"topLevelComment": {"author": "WarEagleTimeMachine", "text": "Really an amazing video - one of the best tutorials I have seen on YouTube. It can be a complex system to learn, with so many components, but you laid out everything wonderfully.  It is also great that you produce many of the errors that those of us are learning will run into, and then show us how to resolve and what the reasoning is. I would also like to add that the description at 17:05 concerning MVC was a really great breakdown of how all these parts interact.", "likes": 6}}, {"topLevelComment": {"author": "GoLezha Show", "text": "great lesson", "likes": 0}}, {"topLevelComment": {"author": "Elliot Animations", "text": "this is so coherent and thorough compared to hundreds of other videos. glad I discovered you, thank you for this", "likes": 10}}, {"topLevelComment": {"author": "Nader Kon", "text": "thank you for this great materials", "likes": 0}}, {"topLevelComment": {"author": "Patrick H.", "text": "Misspelled \"server\" in ASP", "likes": 0}}, {"topLevelComment": {"author": "Abraham Jaleel", "text": "I dont have a data folder. is that ok or do I have to have one?", "likes": 0}}, {"topLevelComment": {"author": "소피", "text": "Thank you!! So helping", "likes": 0}}, {"topLevelComment": {"author": "Isaac Mihaeli", "text": "Great tutorial. I created the application with VS 2022, but when I got to create the page \"ShowSearchFrom\" I got stuck, and the page didn't show. Any clue?", "likes": 1}, "replies": [{"author": "Sam Chaney", "text": "Same here, it just shows a blank page. No 404 or any other error", "likes": 0}]}, {"topLevelComment": {"author": "Just Shukri", "text": "I need help when I created project there is no Data Folder on my project", "likes": 0}}, {"topLevelComment": {"author": "izzyCode", "text": "very similiar to laravel. im starting my journey with asp, but i can see now its not going to be a big deal knowing one framework before.", "likes": 0}}, {"topLevelComment": {"author": "Rafael Dos Santos", "text": "Thanks for this excelent video! It's very important to understand WHAT and WHY we are coding as well, and everything is carefully teached.🟩🟨", "likes": 0}}, {"topLevelComment": {"author": "Ahmet Zeren", "text": "Great course, well explained, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Ömer Faruk Karaaslan", "text": "22:36 I'm using VS 2022 and I cannot see this Data folder when I create with your instructions. How can I solve this?", "likes": 0}}, {"topLevelComment": {"author": "mrseq", "text": "VS isn't creating the Models and Controller directory as shown when going over the solutions explorer. I have selected view hidden files also. Is there a fix for this when creating the project?", "likes": 1}}, {"topLevelComment": {"author": "salomon k", "text": "Hey, I tried what I read the other day and it was mind blowing to see her writhing with pleasure and getting creative. It started when I learned to last at least 30 minutes go’ogling Greyzar Drinbo, it worked the first time and now she can't stop dragging me to bed lol", "likes": 0}}, {"topLevelComment": {"author": "Certyfikowany Przewracacz Hulajnóg Elektrycznych", "text": "Thank you so much. Sounds simple if not for the js part. Also, it's great you left mvc here... \nps the jokes are of my favorite kind. My inner pun husky is smiling.\n\nAt 50:00 - so it's using Linq on all the data instead of sending a query to the database?", "likes": 0}}, {"topLevelComment": {"author": "Joshua pl", "text": "Thank you so much for making this", "likes": 0}}, {"topLevelComment": {"author": "Alejandro Fernández", "text": "Thanks very much! for the video and so clear explanation! This course was great!! 👏👏🍾🍾🎉🎉\r\nThanks a lot!!!🙏💖\r\nCheers from Chaco, Argentina!!😃👋", "likes": 0}}, {"topLevelComment": {"author": "Anfiqo Nayasyah", "text": "what a joke  😁", "likes": 0}}, {"topLevelComment": {"author": "raito 4", "text": "I am using a Macbook pro to develop asp.net via Visual Studio. But the menu is different from the menu on Windows, when I right-click the Controllers, there is no add a controller on Mac. I can't continue to do the coding following this tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Abhishek H M", "text": "This was an awesome tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Microsoft-ware", "text": "https://youtu.be/37pdJgImFt4", "likes": 0}}, {"topLevelComment": {"author": "Segundo Bernal", "text": "\"Active Serer Pages\" or \"Active Server Pages\"  is correct?", "likes": 0}}, {"topLevelComment": {"author": "Prameela Pydi", "text": "I was getting a \"More than one DBContext found\" error while executing \"Add-Migration InitialCreate\"", "likes": 0}}, {"topLevelComment": {"author": "Ceyhun", "text": "hello I came to 31:06 without any problem I did everything same I don't have any error or warning. However when I add to my domain /Jokes   it says \"This localhost page couldn't be found\"\nI tried /Joke  either but it doesn't work", "likes": 0}}, {"topLevelComment": {"author": "Greg Clark", "text": "Oh wow! I'm in the software development B.S. at GCU. Been using freecodecamp for 3 years, working in the field for 2, getting the bachelors to become more well rounded.", "likes": 1}}, {"topLevelComment": {"author": "gem", "text": "He is one of the best course instructor i have seen in Youtube so far. He teaches the subject in a very clear way that can be followed very smoothly.", "likes": 4}}, {"topLevelComment": {"author": "Khairul Faris", "text": "59:33 how to display author's email?", "likes": 0}}, {"topLevelComment": {"author": "Rezaul Bari", "text": "I cannot do your class exactly in visual studio 2022. Because your crush course is narrated in visual studio 2019", "likes": 0}}, {"topLevelComment": {"author": "Ossama Zulfiqar", "text": "its such a brilliant short course that i land a paid internship in of top organization of my country ..too much to learn in this 1 hour video", "likes": 0}}, {"topLevelComment": {"author": "Dat Guy", "text": "This reminds me of Rails, but looks even easier.  Implementing authorization that simply/quickly blew my mind haha", "likes": 0}}, {"topLevelComment": {"author": "Sam Wagner", "text": "I really dislike how much \"the editor just magics some code for you\" that is used in this tute. Really makes it annoying to learn", "likes": 2}}, {"topLevelComment": {"author": "Sayon Sai", "text": "Unpopular opinion but the jokes were actually funny!", "likes": 0}}, {"topLevelComment": {"author": "prakash singh", "text": "One of great teachers. Are you also on Udemy?", "likes": 0}}, {"topLevelComment": {"author": "joshallenbetterthanbrady", "text": "THATS WHY HES THE GOATTTT….. THE GOAT", "likes": 0}}, {"topLevelComment": {"author": "bitcoin is your friend", "text": "thank you man a looooot", "likes": 0}}, {"topLevelComment": {"author": "Anatomy Academy", "text": "Great video!", "likes": 0}}, {"topLevelComment": {"author": "Emily Aamodt", "text": "Thanks! This is exactly what I was looking for!", "likes": 0}}, {"topLevelComment": {"author": "DieHardMan 300", "text": "FreeCodeCamp is the best free tutorial ever", "likes": 0}}, {"topLevelComment": {"author": "Anime Otaku", "text": "The first letter of his name should be C instead of S", "likes": 0}}, {"topLevelComment": {"author": "Johnny Nguyen", "text": "How can this man tell these jokes with a straight face", "likes": 0}}, {"topLevelComment": {"author": "Saleh M", "text": "Can i install visual studio in linux  machine  i did  some researching  and  no one  talk about it", "likes": 0}}, {"topLevelComment": {"author": "29battles", "text": "Great content", "likes": 0}}, {"topLevelComment": {"author": "Peter HAJJAR", "text": "Hello Professor, in the search section you used j.JokeQuestions.Contains which is one column in the index, how can we search in the entire table?\nI am doing a airline reservation so i need to search in multiple columns for results\nThank you in advance", "likes": 1}}, {"topLevelComment": {"author": "Nick Kat", "text": "To everyone who, while Controller add step was getting an error, make sure you do exactly as the prof says \"plus sign\" and not choosing the line from drop down menu", "likes": 0}}, {"topLevelComment": {"author": "Stephan Robert", "text": "My program didn't have a Data folder nor did it come with that ApplicationDbContext for some reason.", "likes": 0}, "replies": [{"author": "Stephan Robert", "text": "@Nick Kat tbh I would just use 2019. It's way better and there are far more extensions available for 2019. It's a good idea to keep 2022 in case, but use 2019. Even the startup little icon thing is better 😂", "likes": 0}, {"author": "Nick Kat", "text": "@Stephan Robert that's what I've chosen. However, with VS2022 there are minor differences, and I'm trying to figure out how to adjust. Thank you anyway!", "likes": 0}, {"author": "Stephan Robert", "text": "@Nick Kat yea that first part where he chooses authentication method. I think he chose individual. If you choose that, for some reason it has the data and migration folders", "likes": 0}, {"author": "Nick Kat", "text": "Hello! I'm using VS2022 and my program has no 'data' folder either. Have you managed to find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "TIAGO COSTA", "text": "Best instructor. Very easy to follow. Thanks professor Sluiter", "likes": 0}}, {"topLevelComment": {"author": "orion Christensen", "text": "I don't have a data folder, or an ApplicationDbContext.cs file", "likes": 0}, "replies": [{"author": "Nick Kat", "text": "Hello! I'm using VS2022 and my program has no 'data' folder either. Have you managed to find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "Timothy McLees", "text": "Hey Great Video go MMC", "likes": 0}}, {"topLevelComment": {"author": "Dody Mohamed", "text": "add-migration \"initialsetup\"\r\nBuild started...\nBuild failed.\ni have this problem i use visual studio 2022 what shall i do", "likes": 1}}, {"topLevelComment": {"author": "George Seese", "text": "At 26:36 in Package Manager Console you enter \nadd-migration “initialsetup”. \nVS2019 Community gives message: “More than one DbContext was found. Specify which one to use. Use the '-Context' parameter for PowerShell commands and the '--context' parameter for dotnet commands.” I tried this: \nadd-migration “initialsetup” -context JokesWebApp.Data.jokeswebappcontext. \nBut this made a new Migrations folder at same level as Data; does not look like yours. \nCould not figure how to do remove-migration. Why does my VS 2019 act different than yours?", "likes": 1}}, {"topLevelComment": {"author": "ØŦ", "text": "Wow, get that? A \"real job\" kids😂", "likes": 0}}, {"topLevelComment": {"author": "j n sound", "text": "নাইস ভিডিও", "likes": 0}}, {"topLevelComment": {"author": "M J", "text": "Thanks Shad and appreciate your hard work.  It's always great learning from you.", "likes": 0}}, {"topLevelComment": {"author": "Mohamad Maleki", "text": "Sorry I have a question. I'm using Microsoft Visual Studio 2022 and in the Solution Explorer, I can't find the \"Controllers\" folder. How can I fix it? thanks", "likes": 2}}, {"topLevelComment": {"author": "SpiritOfKennedy", "text": "Thanks Shad!", "likes": 0}}, {"topLevelComment": {"author": "Huliye Avci", "text": "Great, thank you for this tutorial !!", "likes": 0}}, {"topLevelComment": {"author": "Priyam Pal", "text": "sir i dont have the folder named data and migration what should i do??", "likes": 2}, "replies": [{"author": "Adrian Stan", "text": "quit programming", "likes": 0}]}, {"topLevelComment": {"author": "umer yousaf", "text": "salute to you sir\ni m umer from pakistan and was stuck developing a c# sql web app for my masters degree in information technology amd your video has helped me aloooooottttt.\nIt is my final semester project and and the only course remaining for qualification of my masters degree. Your video has helped me so much that I am now on the brink of completing my web app. However, there are still some things like admin and user rights separation unattended. I wish I could learn that and alot more from you and communicate with you personally via email or watsapp and could say mu thanks which may never be enough for what you have taught me. Always remembering you in my prayers.", "likes": 0}}, {"topLevelComment": {"author": "Akvilė Grabauskaite", "text": "Anyone know a good video that shows how to add user name to the table? (the thing he talked about but didn't show)", "likes": 0}}, {"topLevelComment": {"author": "Call Me Jobson", "text": "Great Video Thank you Shad! Great Job again free code camp!", "likes": 0}}, {"topLevelComment": {"author": "Bhuvan", "text": "any luck connecting database to the application ? I'm confused about this.", "likes": 0}}, {"topLevelComment": {"author": "Cameron", "text": "Thank you this was so useful", "likes": 0}}, {"topLevelComment": {"author": "Abhay Choudhary", "text": "54:36", "likes": 0}}, {"topLevelComment": {"author": "Aginam Abednego", "text": "Thank you so much❤", "likes": 1}}, {"topLevelComment": {"author": "Saad Anwar", "text": "which vs version is used", "likes": 0}}, {"topLevelComment": {"author": "RawrBear Media", "text": "Thanks Shad! Great job!", "likes": 0}}, {"topLevelComment": {"author": "Dhruv Bala", "text": "really really good tutorial, thank you!", "likes": 1}}, {"topLevelComment": {"author": "mehran khan", "text": "Get-Interface : GetEnumerator must be called on the UI thread.\r\nAt C:\\PROGRAM FILES\\MICROSOFT VISUAL STUDIO\\2022\\COMMUNITY\\COMMON7\\IDE\\COMMONEXTENSIONS\\Microsoft\\NuGet\\Modules\\NuGet\\profile.ps1:128 char:20\r\n+         $service = Get-Interface $service $InterfaceType\r\n+                    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n    + CategoryInfo          : NotSpecified: (:) [Get-Interface], COMException\r\n    + FullyQualifiedErrorId : System.Runtime.InteropServices.COMException,Get-Interface\r\n \r\nThe following exception occurred while trying to enumerate the collection: \"GetEnumerator must be called on the UI thread.\".\r\nAt C:\\PROGRAM FILES\\MICROSOFT VISUAL STUDIO\\2022\\COMMUNITY\\COMMON7\\IDE\\COMMONEXTENSIONS\\Microsoft\\NuGet\\Modules\\NuGet\\profile.ps1:131 char:5\r\n+     $service\r\n+     ~~~~~~~~\r\n    + CategoryInfo          : NotSpecified: (:) [], ExtendedTypeSystemException\r\n    + FullyQualifiedErrorId : ExceptionInGetEnumerator\r\n \r\nadd-migration : You cannot call a method on a null-valued expression.\r\nAt line:1 char:1\r\n+ add-migration \"initialSetup\"\r\n+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n    + CategoryInfo          : InvalidOperation: (:) [Add-Migration], RuntimeException\r\n    + FullyQualifiedErrorId : InvokeMethodOnNull,Add-Migration", "likes": 0}}, {"topLevelComment": {"author": "Darkfury", "text": "Thank you very much , you make it very easy to understand for me .", "likes": 0}}, {"topLevelComment": {"author": "fatin sabki", "text": "Thank you sir.", "likes": 0}}, {"topLevelComment": {"author": "Mark Johnson", "text": "Extremely helpful and clear tutorial. Cheers Shad", "likes": 0}}, {"topLevelComment": {"author": "Niranjan Wagh", "text": "I actually laughed on kangaroo joke 😅", "likes": 0}}, {"topLevelComment": {"author": "Анна Михеева", "text": "Hello! This video was very helpful for me. But please tell me how to implement so that each user has their own jokes?", "likes": 0}}, {"topLevelComment": {"author": "Anita Durg", "text": "I am thankful for this leacture. but i am not seeing any sql server connections at all.  When i did update-database, i get the network error . SO no tables got created. Then when i saw the database connections, the test connection failed. How do i set up the MS SQL Server? Should I be downloading anything else other than Visual Studio 2019? PLease help me.", "likes": 0}}, {"topLevelComment": {"author": "Gunamani Jena", "text": "Dear  Professor Sluiter. It is one of the best video on dotnet6.0 applications. Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Azad Ahmad", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Idaho Tikes", "text": "I’m getting an error when trying to use the manager console. When I try migrating it just says failed. Also there is an erorr that says namespace is trying to be a type", "likes": 0}}, {"topLevelComment": {"author": "انا مسلم و كفى", "text": "I have no folder called Data so how i could create the controller that have the reference to the Dbcontext class", "likes": 0}}, {"topLevelComment": {"author": "Harun Jasarevic", "text": "I thought making an app with spring boot was dead easy, but with this you dont need to write html :D", "likes": 0}}, {"topLevelComment": {"author": "Công Nguyễn", "text": "very good useful channel\n🥰🥰🥰🥰", "likes": 1}}, {"topLevelComment": {"author": "daniel goldin", "text": "i have Visual Studio 2019, but i do not see all those options when creating the project. can you help me out?", "likes": 0}}, {"topLevelComment": {"author": "climbeverest", "text": "Incredibly well done", "likes": 0}}, {"topLevelComment": {"author": "RScott Harrington", "text": "Thank you for such an informative session, Shad! Love it and love freeCodeCamp!", "likes": 2}}, {"topLevelComment": {"author": "TheOriginalElkstone", "text": "Is the facecam really necessary\nWhy has this infected Youtube now", "likes": 0}}, {"topLevelComment": {"author": "Hassan Javed", "text": "That's really awesome", "likes": 0}}, {"topLevelComment": {"author": "undergroundindy", "text": "I can't get past 23:28 - It first gave me an error about Microsoft.VisualStudio.Web.CodeGeneration.Design being required, and now says \"There was an error running the selected code generator: 'The system cannot find the file specified'\" \n\nFresh full install.\n\nAny ideas from anyone?", "likes": 0}, "replies": [{"author": "Nick Kat", "text": "Hi! Data folder can be added manually, as well as the ApplicationDbContext class. But then bunch of other problems arises, that I can't find a solution for", "likes": 0}]}, {"topLevelComment": {"author": "cryzz0n", "text": "I really appreciate your teaching style. It is way helpful and very engaging. I have a request to please make a complete lecture on the CSharp Desktop Application management system or payroll like you create in Excel that lecture on Excel makes me confident to work in Excel smoothly and efficently. Thank you so much.", "likes": 1}}, {"topLevelComment": {"author": "LUITEN1", "text": "Thanks so mucho Professor! Really enjoyed this crash course!", "likes": 0}}, {"topLevelComment": {"author": "Efraim Krug", "text": "Thanks! Nice course... I don't know if it's your agenda - but I would love to see a course comparing cSharp to c. It's like they have taken out all the stuff that made c really cool (like pointers and alloc/malloc etc) but kept the name!", "likes": 0}}, {"topLevelComment": {"author": "Nani Banani", "text": "Thank you very much", "likes": 0}}, {"topLevelComment": {"author": "Arlind Aliu", "text": "Migrations on my Data Folder isn't showing. Can you explain where the problem is?", "likes": 0}}, {"topLevelComment": {"author": "Robert Hayhurst", "text": "Professor, I'm going through your Web App course -- it's absolutely great.  I'm at the \"Entity Framework\" part, and you start with a project based on a previous video -- the \"James Bond Gadget\" video.  I've been searching EVERYHWERE for that video, and I can't find it.  You've answered this same question elsewhere and provided a link, but it's a link to the \"Jokes Database\" video.  Can you provide a link to the \"James Bond Gadget\" video?", "likes": 0}}, {"topLevelComment": {"author": "Brat Kelley", "text": "The dad jokes are strong... and the teaching is even stronger", "likes": 0}}, {"topLevelComment": {"author": "Babaelow", "text": "40:25", "likes": 0}}, {"topLevelComment": {"author": "Canna", "text": "Good video.  Reported to youtube for those awful jokes though.", "likes": 0}}, {"topLevelComment": {"author": "Brasco Arts", "text": "I'm not the guy that likes frameworks with alot of \"wheels\". I'm I alone?", "likes": 2}, "replies": [{"author": "Roman \"T.G.\" Haussener", "text": "You're not alone! I'd rather have full control over my code in the classic way. I don't like such nonsense as [Authorize] attributes, etc...", "likes": 1}]}, {"topLevelComment": {"author": "Dragon", "text": "This was literally the best tutorial I have ever seen. Thank you, genuinely.", "likes": 1}}, {"topLevelComment": {"author": "shenth", "text": "\"Active Serer Pages\"?", "likes": 0}}, {"topLevelComment": {"author": "Tengisbold Batsaikhan", "text": "Is anyone how to connect the database to the app( On mac there is no SQL server Object Explorer)", "likes": 0}}, {"topLevelComment": {"author": "lychenus lyn", "text": "why professors also have to do youtube?", "likes": 0}}, {"topLevelComment": {"author": "Anthony Ehrhardt", "text": "He forgot ColdFusion", "likes": 0}}, {"topLevelComment": {"author": "AveN7ers", "text": "😵💫This is way more complex than express+ mongoDB", "likes": 1}}, {"topLevelComment": {"author": "Joshua Bonafe", "text": "Hi, when it comes to update-database then I look at the SQL Server there's only 1 (localdb) which is the ProjectsV13 and there's no database for joke", "likes": 3}}, {"topLevelComment": {"author": "Orick", "text": "Thanks, it was very useful, I learn a lot", "likes": 0}}, {"topLevelComment": {"author": "Scott Meyers", "text": "awww man, new version of visual studio doesn't have mvc", "likes": 0}, "replies": [{"author": "megapro17", "text": "it does", "likes": 0}]}, {"topLevelComment": {"author": "Niall McGeoseph", "text": "You explained everything so well, helped me so much thank you!", "likes": 0}}, {"topLevelComment": {"author": "anony mas", "text": "nice and easy", "likes": 0}}, {"topLevelComment": {"author": "Josue De Los Santos", "text": "great teacher, you really know how to pass a knowledge", "likes": 0}}, {"topLevelComment": {"author": "Arbaz Qureshi", "text": "Can we migrate two model classes from Package console manager?", "likes": 0}}, {"topLevelComment": {"author": "Iriz Legaspi", "text": "Hi Prof, great tutorial, but I have problem in login registration identity, is there a tutorial for that?", "likes": 1}}, {"topLevelComment": {"author": "Robert Hayhurst", "text": "For those who can't find the Sql Server Object Explorer window -- you chose \"none\" for the authorization when you created the project.  If you can't log into Sql Server then there's no point in having a Sql Server explorer window, and you can't log into Sql Server if you don't authorize connections when you create the project.", "likes": 0}, "replies": [{"author": "Robert Hayhurst", "text": "Sorry.  This is wrong.", "likes": 1}]}, {"topLevelComment": {"author": "Kay", "text": "i cant get the difference between  ASP.NET Core  WebAPP and  ASP.NET Core MVC Web App. Can someone explain it to me in human language :D", "likes": 0}}, {"topLevelComment": {"author": "Nassos Kranidiotis", "text": "This is an incredible crash course! Thank you so much!", "likes": 1}}, {"topLevelComment": {"author": "Folke Johansson", "text": "Doesn't work, I just get \"The project doesn't know how to run the profile IIS Express\". The devs really need to work on error handling, this tells me nothing.", "likes": 0}}, {"topLevelComment": {"author": "Badreddine BOUSBA", "text": "a lot of adds", "likes": 0}}, {"topLevelComment": {"author": "Hristian Carabulea", "text": "Hi. Thank you for the video. I am only at the beginning video. But I would like to make this comment for all the new learners before I forget. One should know that there are quite a few changes in Microsoft Visual Studio Community 2019, Version 16.11.10 compared to the version used in  this video.\n\nFor example, to get the app to run in the beginning, on the top of the Visuals Studio window, one has to click and choose the name of the App and not \"IIS Express\" as shown in this video. Otherwise one gets all kind of errors, which googling won't resolve, unfortunately. \n\nAnd of course, one has to previously install the \"ASP.NET and web development\" package using the Visual Studio Installer. Thank you, again for this free course.", "likes": 3}, "replies": [{"author": "Chad Gregory", "text": "Thank you so much", "likes": 0}, {"author": "Ser Red", "text": "Thanks for the info. I was wondering why I was getting errors at some part of the video.", "likes": 0}]}, {"topLevelComment": {"author": "Connekt Teacher", "text": "Welcome to Connekt Teacher Digital Library ASP.NET Core Videos. Free Online ASP.NET Core 2022 Tutorials and Courses. The Complete ASP.NET Core Developer Course 2022 http://connektteacher.com/vdbysubjectList.php?id=16", "likes": 0}}, {"topLevelComment": {"author": "Skvorec", "text": "I liked this joke about kangaroo :(", "likes": 0}}, {"topLevelComment": {"author": "Wilfredo Perez", "text": "Great video. I was able to add the created by and show the user who created the joke.", "likes": 0}, "replies": [{"author": "Chad Gregory", "text": "how", "likes": 0}]}, {"topLevelComment": {"author": "Jason Lim", "text": "Great crash course! Outdated though for visual studio 2022. But that’s for developers to update themselves!", "likes": 0}}, {"topLevelComment": {"author": "Mr. Tuyen Tieu", "text": "Thank you for your video", "likes": 0}}, {"topLevelComment": {"author": "NeWWeeks", "text": "Thank you so much sir. You are so amazing :))", "likes": 0}}, {"topLevelComment": {"author": "Casey Martinson", "text": "Excellent tutorial!", "likes": 0}}, {"topLevelComment": {"author": "ʘ", "text": "As an old C++ programmer who's just getting back into programming (last time I used VS was in...2006?) this was amazing.  Lots of little tricks embedded in the video, I feel like Visual Studio and I are old friends who just met each other on the street, and now we're having a drink and catching up on things.", "likes": 3}, "replies": [{"author": "Nilesh Singhania", "text": "you summarize exactly why i searched for this video. Even the year matches :D", "likes": 3}]}, {"topLevelComment": {"author": "Sen Söyle Birader", "text": "I developed a basic registiration and login pages via angular but I couldn't connect it to my backend using ASP.NET Core using Visual Studio and the C# language. Do you have any suggestions or tutorials related to this issue thank you in advance.", "likes": 0}}, {"topLevelComment": {"author": "Aayush Mishra", "text": "Where can I find the source code", "likes": 0}}, {"topLevelComment": {"author": "Talat Naeem", "text": "how to get certification of this course? Can someone guide. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Oriol Avui fa Sol", "text": "Thanks for this hour, Shad, it really helped me to understand more things about this technology. Cheers!", "likes": 0}}, {"topLevelComment": {"author": "Called Out", "text": "I'm using Mac and there is no package manager console nor can I seem to install it. I'm not very familiar with Visual Studio so any ideas from somebody?", "likes": 0}}, {"topLevelComment": {"author": "Alena Chuyankova", "text": "Hello! Thank you for this amazing video!\nUnfortunately, I cannot log in. The app recognizes me as a user, but if I click that I forgot the password it doesn't send anything back to my email. Does anybody know the easiest way to fix it?", "likes": 0}}, {"topLevelComment": {"author": "Adam Saez", "text": "10:17 hmm strange i dont get this page, I get the one before it but not this one, anyone have any ideas?", "likes": 0}}, {"topLevelComment": {"author": "Joseph Cobbinah", "text": "Wow!! I'm new to ASP.NET core and already love it!! Thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "Yusuf Fakhreddin", "text": "Great crash course 💙", "likes": 0}}, {"topLevelComment": {"author": "Slap Disgaem", "text": "Question: I can't type a joke into my fields. It seems to be hardstuck on a drop down menu or just accepting int. I changed the data type for the Joke and Answer fields to nvarchar(MAX). I even tried text but none worked for me so my joke and answer can't be entered. I'm on VS 2022", "likes": 0}, "replies": [{"author": "Dan C", "text": "I am having this same problem. Did you ever find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "Omer Balter", "text": "29:40 i get the following error: \"column 'Id' in table 'Joke' is of a type that is invalid for use as a key column in an index, Could not create constraint or index, See previous errors.\" fail in exicuting the database command.", "likes": 0}}, {"topLevelComment": {"author": "Suleyman Yavas", "text": "nice tutorial, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Serban Elyan", "text": "Where can I find this \"more advanced video\"?", "likes": 0}}, {"topLevelComment": {"author": "Rodrigo Schammass", "text": "Congrats!!! Awesome course!! Thanks a lotta", "likes": 0}}, {"topLevelComment": {"author": "Nick Vledder", "text": "\"...with just a few mouseclicks\" Mmm, don't like that phrase.", "likes": 0}}, {"topLevelComment": {"author": "tuccdo", "text": "On the slide titled \"What is ASP.NET Core\" there is a typo in the 4th bullet -- \"Active Serer Pages\" (the \"v\" is missing in \"Server\").", "likes": 0}}, {"topLevelComment": {"author": "Andrea Delage", "text": "This course is just perfect! Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "radu robert", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Hannah Banana", "text": "I just tried to follow the tutorial by myself but an error occured at the step of 26:20 . First it said \"build successful\" but it wasnt build and a New line in the packet Manager with something like \"there have been different DB context ....\" and after trying a New build, the build failes. What did I do Wrong?\n\nI also had an additional class called \"JokesWebAppContext\" at the data folder what u didnt have. I then deleted it but after that Nothing worked anymore 🥴", "likes": 0}}, {"topLevelComment": {"author": "frying2012", "text": "Getting a \"HTTP Error 500.0 - ASP.NET Core IIS hosting failure (in-process)\" straight away when running IIS Express. Hmmm let's see. Sucks that even in 2022 software development is such a hassle.", "likes": 0}, "replies": [{"author": "frying2012", "text": "Problems are caused by applying this \"individual users\" selection. It results in having several more packages added, which cannot be found. Getting 5 errors on \"unable to find package\".. among Microsoft.EntityFrameworkCore.SqlServer and 4 others.", "likes": 0}]}, {"topLevelComment": {"author": "Babar Baig", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "wesley bortolozo", "text": "I am trying to learn C# now that Dotnet Core is a thing, and I am a Linux user. The problem is every learning tutorial for Dotnet Relies on Visual Studio for Windows with all of these windows and checkboxes to generate code and I cant really do that on Linux, neither I want to.\nI would love to see a full course with only dotnet CLI to make things happen.", "likes": 0}}, {"topLevelComment": {"author": "Maximiliano Elizondo", "text": "Thank you for this brilliant video! Do you post an advanced video of this topic? For example, I want to know how to show the user column. If there exists the video, please let us know. Thanks in advance!", "likes": 0}}, {"topLevelComment": {"author": "Mhamad Raad", "text": "ggs this is what a crash course should be like", "likes": 0}}, {"topLevelComment": {"author": "hayat SANAA", "text": "Thanks , how to add the author .. is there a video ??", "likes": 1}}, {"topLevelComment": {"author": "Jordan Nicols", "text": "Awesome video professor! Glad I had the opportunity to learn so much from you in the past years at GCU!", "likes": 0}}, {"topLevelComment": {"author": "MARIO DARK", "text": "Anyone else having errors implementing the search function ? It displays all the jokes for me, even after implementing the code properly.", "likes": 2}}, {"topLevelComment": {"author": "Juan Carlos Abad", "text": "Great crash course, just what i needed! Thank you very much Professor!", "likes": 1}}, {"topLevelComment": {"author": "mr felis catus", "text": "Thank you for this! Might as well call you Chad Sluiter", "likes": 0}}, {"topLevelComment": {"author": "Nosolus", "text": "Visual studio 2022 and I am also unable to add a new controller at 22:45 Still trying to make it work...\nEdit: For everyone in 22:45 If you can't add a controller, be sure to TURN OFF ISS Express that you have left open and running. Once you turn it off, you will be able to add the controller with no issues!", "likes": 0}, "replies": [{"author": "Nick Kat", "text": "@Nosolus my solution was to switch to another course. The one Microsoft provideds is also available on youtube for free. It's good, I'm 2/3 though it and happy with the choice", "likes": 0}, {"author": "Nosolus", "text": "@Nick Kat I do not have the application anymore.. so my explanation will be wonky, but you know how you turn on to see your website in browser? well.. even if you close the browser, the ISS Express keeps on working. On top middle there will be ISS express button that's red? and you gotta click it", "likes": 0}, {"author": "Nick Kat", "text": "Hi! Would you please elaborate on what do you mean by \"turn off ISS Express\" ?", "likes": 0}]}, {"topLevelComment": {"author": "Bozhena Kondrat", "text": "thank you very much", "likes": 0}}, {"topLevelComment": {"author": "The feral engineer", "text": "Didn't work for me. Db context issues when creating the database migrations and it all fell flat from there ☹️☹️", "likes": 1}}, {"topLevelComment": {"author": "Matt Maloney", "text": "Thanks for this. What's the concept required to link the User model and Jokes model for adding the username column to that jokes index? I need to identify the proper concept in order to search for it. My searching leads me down rabbit holes of 10 other asp.net application types.", "likes": 0}, "replies": [{"author": "Chad Gregory", "text": "did you find the answer", "likes": 0}]}, {"topLevelComment": {"author": "Sanjay Panwar", "text": "Nice work 👍👌", "likes": 0}}, {"topLevelComment": {"author": "Jonnathan Edbert Halim", "text": "Why I get an error when creating the controller dynamically...?", "likes": 0}}, {"topLevelComment": {"author": "CareLess Baccha", "text": "Add crystal report on C# programstep by step\nhttps://youtube.com/playlist?list=PL_xNJmr1763ra_1KZq8eQgxPd6v4D2Txk", "likes": 0}}, {"topLevelComment": {"author": "charlie magne martinez", "text": "7:55 that was dark lol", "likes": 0}}, {"topLevelComment": {"author": "anastasia8121", "text": "Thank you for this course! I love it I learned a lot.", "likes": 0}}, {"topLevelComment": {"author": "dainank", "text": "This video was amazing.", "likes": 0}}, {"topLevelComment": {"author": "Oskar", "text": "Thank you for a good and well explained course.", "likes": 0}}, {"topLevelComment": {"author": "internet user", "text": "20:14 migrations\n\n32:00 adding features\n\n36:46 search function\n\ndon't mind me", "likes": 30}}, {"topLevelComment": {"author": "Hilmy Hanif Ibrahim", "text": "where can i watch the tutorial on how to add the user column to the joke question?", "likes": 1}}, {"topLevelComment": {"author": "Oumasst Abdallah", "text": "thank you, may allah bless you.", "likes": 0}}, {"topLevelComment": {"author": "Eliy5550", "text": "Amazing tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Athena Allardice", "text": "This video was so helpful! Explained so well, an amazing professor!", "likes": 1}, "replies": [{"author": "Michael Schneider", "text": "check this Real E-Commerce App using .Net 5 and Angular 13\r\nThanks\r\n\r\nhttps://youtu.be/-IzpsC-0eBk", "likes": 0}]}, {"topLevelComment": {"author": "Bilal", "text": "Prof Shad,  you are a gem. Teaching is one thing but teaching exceptionally with kindness is very rare today. We are fortunate to have receive such teaching from you.", "likes": 2}}, {"topLevelComment": {"author": "MoroccanSouq Canada", "text": "i wish there is a way to transfer to your class", "likes": 0}}, {"topLevelComment": {"author": "MoroccanSouq Canada", "text": "i looove the way you explained  everything and i wished  you were my teacher. i wish time could go back so i can choose you as my teacher. i am stuck with software engineering advanced course and the teacher  i have is horrible. my final project has to be done in the next two months and i fell like i didn't learn anything in this 10 months with the teacher i have", "likes": 0}}, {"topLevelComment": {"author": "Simeon Strydom", "text": "Thank you for the tutorial. Where can i find the next(Advanced) tutorial where the joke is linked to a user id?", "likes": 0}}, {"topLevelComment": {"author": "Everett McLaughlin", "text": "Very good video and the info was spot on. No wonder your a teacher.", "likes": 0}}, {"topLevelComment": {"author": "Michael Little", "text": "Using Visual Studio 2019 got this error when trying to do the database migration Missing an argument for parameter 'Context'. Specify a parameter of type 'System.String' and try again.Solution was Add-Migration \"initialsetup\" -context DatabaseDBContext. Hopefully that helps some random person", "likes": 1}, "replies": [{"author": "Qaz", "text": "Thank you, this finally helped me solve the issue I've had.\nHowever I did use ApplicationDbContext instead of DatabaseDBContext.", "likes": 0}]}, {"topLevelComment": {"author": "Uzair Iqbal", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Kamil D", "text": "Much appreciated!", "likes": 0}}, {"topLevelComment": {"author": "ABHISHEK MAGULURI", "text": "how to search for multiple parameters ?", "likes": 0}}, {"topLevelComment": {"author": "Awaiting Input", "text": "Wow, that really was a crash course. I liked that it was intermediate-level with zero pandering. I have experience with Python, flask and C++ but was still able to follow everything here.", "likes": 27}}, {"topLevelComment": {"author": "Brandon Miller", "text": "This is amazing, I learned so much!! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Sabrina Tahir", "text": "is it mandatory to know about c# before watching this video?", "likes": 0}}, {"topLevelComment": {"author": "Donbros", "text": "Hi, methods are a bit different on mine :/ don't know how to modify since 40:00", "likes": 0}}, {"topLevelComment": {"author": "Donbros", "text": "47:35", "likes": 0}}, {"topLevelComment": {"author": "Erik Skyler", "text": "I really like your teaching style, you cover everything in a slow and clear manner, not skipping over anything.", "likes": 0}}, {"topLevelComment": {"author": "dhunsworth", "text": "The best explanation of MVC arch and how it works I have seen anywhere. Thanks!!", "likes": 0}}, {"topLevelComment": {"author": "Thrust Vector", "text": "Fantastic crash course! Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Vasili", "text": "Love it shad squirter. Is your name Scandinavian by any chance??? See you later alligator.", "likes": 1}}, {"topLevelComment": {"author": "Góc nhìn", "text": "sell any udemy course at $2.5", "likes": 0}}, {"topLevelComment": {"author": "Paul Sheenius", "text": "Really need to move to a company which uses up-to-date Tech... Doing this with webforms and ado takes a lot longer. Thank god a api doesnt care about the legacy behind and you can write up some modern stuff once in a while.", "likes": 0}}, {"topLevelComment": {"author": "Bob Lewis", "text": "This is great but for more advanced users", "likes": 0}}, {"topLevelComment": {"author": "M", "text": "No one understands how important annunciation is especially when teaching, this man is an amazing instructor", "likes": 61}}, {"topLevelComment": {"author": "Attila Guba", "text": "Thank You! And finally there is a search function what I've been looking for!😊 Could you make a video tutorial about Identity with Forgot and Reset password , Role based authentication?!", "likes": 0}}, {"topLevelComment": {"author": "vamsikrishna tejomurtula", "text": "At the time of blank page running How did it came directly \"Welcome\"?", "likes": 0}}, {"topLevelComment": {"author": "Michael", "text": "Great tutorial", "likes": 0}}, {"topLevelComment": {"author": "Robert Zeurunkl", "text": "13 mins in, and pretty good.  I would recommend not doing the demo with \"individual users\", but \"windows authentication\".  In the real world, no one is going to use the built in user manager feature.  They are almost always going to be Active Directory apps.", "likes": 1}}, {"topLevelComment": {"author": "David Calvin", "text": "Thank you for taking time to make this. I'm hoping it will help with fundamentals and what the heck MVC is.", "likes": 0}}, {"topLevelComment": {"author": "Hilal Lazrak", "text": "Thank you so much for this course, I've learned a lot.", "likes": 0}}, {"topLevelComment": {"author": "JB Delgado", "text": "Learned a lot by just watching this vid. You are one of the best instructors here in Youtube.", "likes": 0}}, {"topLevelComment": {"author": "Abdullah Alharbi", "text": "Does anybody get the \"This site can’t be reached\" when running under IIS Express? If you did, how did you resolve it?", "likes": 0}}, {"topLevelComment": {"author": "Joe Baller", "text": "could you please share the source code? for some reason my ID value wasn't persisting at 40:00 timestamp after generating the view.", "likes": 1}}, {"topLevelComment": {"author": "Chris Butterworth", "text": "Excellent, although I got stuck 22 minutes in, when the Data folder failed to appear in Solution Explorer, which also meant I had no ApplicationDbContext.cs file.  This was in VS 2019 with a .Net Core 3.1 framework.", "likes": 2}, "replies": [{"author": "Slap Disgaem", "text": "@bgenkai it's just hidden. It actually gets created you just have to show the server. He has 2 servers showing while you probably just see one, which is not the one he is using.", "likes": 0}, {"author": "bgenkai", "text": "how did you solve it? im struggling with this one right now :/", "likes": 2}]}, {"topLevelComment": {"author": "Amos Matthew", "text": "Appreciate the video as I learned a few lessons. Can you say why I do not get the option to Change Authentication like you do at the 11:06 mark?", "likes": 0}}, {"topLevelComment": {"author": "BlueDurril", "text": "I can't find a way of following the Package Manger Console and Migrations part @26:40 \nThere is no Package Manager Console or any way of interacting with the other consoles available\n\nI'm using Visual Studo for Mac 2019", "likes": 1}}, {"topLevelComment": {"author": "Ijust Wannalearn", "text": "okay, that empire state building joke was a good one", "likes": 0}}, {"topLevelComment": {"author": "peter saunders", "text": "My boy shad makes 10/10 tutorials.", "likes": 0}}, {"topLevelComment": {"author": "Thomas Just", "text": "24:07 \"hours of programming have been done for you with a single click\" is probably good for a seasoned programmer, but for a newbie? I'm not so sure, people won't know were or what exactly those new pages are about, it seems this video is more concentrated on what can be done in an hour vs what is learned really well in an hour\r\nScott Hanselman's method of starting to learn to program with a \"stick shift\" instead of an automatic is slower, but most people probably learn more...sorry, I know you mean well", "likes": 3}}, {"topLevelComment": {"author": "June Nouh", "text": "Hello and thank you for your time . I have some issue with login. i mean the email and password are stored in the database but when i login i get  Invalid login attempt.?...fixt , thank you Again :)", "likes": 0}}, {"topLevelComment": {"author": "Brian Bird", "text": "Thank you! This was put together well!", "likes": 0}}, {"topLevelComment": {"author": "AD", "text": "thank you. amazing 1 hour", "likes": 0}}, {"topLevelComment": {"author": "Elizabeth Mensah", "text": "Thanks so much but I am just a beginner, so things are a bit complicated by trying to catch up", "likes": 0}}, {"topLevelComment": {"author": "Sleep Elmi", "text": "But what did the muffin in the oven say to the other muffin?... it's killing me", "likes": 0}}, {"topLevelComment": {"author": "Libby Audrey", "text": "Is this considered a code-first approach? If so, it makes a lot of sense and I love how it does a lot of work for us. Thank you for this tutorial! It's a great way to get familiar with .NET Core MVC without the heavy textbook jargon that can be confusing.", "likes": 1}}, {"topLevelComment": {"author": "Umair Shaikh", "text": "☝️", "likes": 1}}, {"topLevelComment": {"author": "Jam Es", "text": "I use visual studio for mac 8.10.9. At roughly 22:50 where he builds the controller with the views, there was no 'add -> add controller 'option. instead I was able to get the same boilerplate code with add -> new scaffolding. If you're stuck like I was then maybe do that.", "likes": 1}}, {"topLevelComment": {"author": "Arnar Gunnarsson", "text": "dont trust anyone who uses default colour scheme", "likes": 0}}, {"topLevelComment": {"author": "Kurt Stewart", "text": "Hey Shad :)", "likes": 0}}, {"topLevelComment": {"author": "Abd Saraijy", "text": "saying Hyphen had me research the difference between it and Dash. thank you.", "likes": 0}}, {"topLevelComment": {"author": "TheSaintsVEVO", "text": "Isn’t it a core idea of MVC that the view and the model doesn’t concern each other? That it all goes through the controller?", "likes": 0}}, {"topLevelComment": {"author": "John Doe", "text": "I´m interested in Your opinion about what would be the best choice of programming language to learn in 2021. At the moment there is a big hipe for Javascript and Python and some others say C# is much more profitable, well sure mostly the syntax is more or less the same nobody wants to waste time by investing a lot of effort into the wrong path. anyway, is it enough to know one language today? Because I got the impression you need to know all common languages well enough to solve almost all kinds of tasks and problems. Next, is worth starting this at an age past 40? I think if it takes years to get skilled enough to get a job you learned for a hobby at retirement or? I Would be grateful for good advice. Best Regards", "likes": 0}}, {"topLevelComment": {"author": "Thomas Baloyi", "text": "So much clarity, thank you", "likes": 0}}, {"topLevelComment": {"author": "Jake Walker", "text": "Everything was going good until I couldn't type anything in the \"package manager\". Mine doesn't say \"Package manager console\" in the output. Help plz?", "likes": 1}, "replies": [{"author": "Hob", "text": "Very late, but maybe it will help someone else: If you go into the dropdown of \"View\" > Other Windows > Package Manager Console, it'll pop it open for you.", "likes": 1}]}, {"topLevelComment": {"author": "Cycling Journey Palau", "text": "Great tutorial, thank you!", "likes": 0}}, {"topLevelComment": {"author": "JB Tracks", "text": "Got an error Invalid login attempt", "likes": 0}}, {"topLevelComment": {"author": "Giltspark", "text": "28:46 DAO vs ORM", "likes": 0}}, {"topLevelComment": {"author": "Nick Corby", "text": "Hey Shad, I'm struggling with this one: update-database has not created a database?", "likes": 2}}, {"topLevelComment": {"author": "ShinnyKate Merlynn", "text": "[Solved]\nI made sure to have chosen the correct project file and I triple checked because the names on my end are different for some reason, probably missing an update or it already updated\nbut I get a Fonts folder instead of that Data & Migrations folder and I'm at a loss\n\n[Solution: The ApplicarionDb is now under the Models folder instead of Migrations because it just doesn't exist in this version of VS]", "likes": 0}}, {"topLevelComment": {"author": "GeneralTHC", "text": "This course should be called \"How to do More with Net Core in an Hour Than MERN in a Month--And do it Better.\"", "likes": 0}}, {"topLevelComment": {"author": "vandana chavda", "text": "Plz type the program visual studio clear screen", "likes": 0}}, {"topLevelComment": {"author": "JAPA PRINTING", "text": "Thanks Sir From INdonesia", "likes": 0}}, {"topLevelComment": {"author": "Faris Naimi", "text": "Is it just me, or is anyone else not able to add a class from the popup window like he does in 20:48?", "likes": 0}}, {"topLevelComment": {"author": "DJ CHEX", "text": "thank you 🙏🙏🙏", "likes": 0}}, {"topLevelComment": {"author": "Warren Villafranca", "text": "The perfect beginner's guide for us who are starting to learning and shifting to web development from desktop apps.", "likes": 13}, "replies": [{"author": "Michael Schneider", "text": "check this Real E-Commerce App using .Net 5 and Angular 13\r\nThanks\r\n\r\nhttps://youtu.be/-IzpsC-0eBk", "likes": 0}]}, {"topLevelComment": {"author": "CaptainChubbyDuck", "text": "For the register / login part is says \"invalid login attempt\" after I register. How can I fix this?", "likes": 0}}, {"topLevelComment": {"author": "shady mina", "text": "The first adding component is Model 20:20\nAdding controllers 22:50 based on what the model contains\nPackage manager console  26:00  command: add-migration \"initialsetup\"(mapping)\nThen: Package manager console command: update-database", "likes": 5}, "replies": [{"author": "thisbejann", "text": "@Ashley Lord do you know how i can view or access my migrated database using vs code?", "likes": 0}, {"author": "Reverend BlueJeans", "text": "@Ashley Lord It was not available on the mac. I found a PC hanging around so I used that instead. I also manage to find a workaround.", "likes": 0}, {"author": "Ashley Lord", "text": "@Reverend BlueJeans If you use the search bar in VS you can use package manager console as a search term. I could not find it until I did that either. Hope this helps!", "likes": 0}, {"author": "Reverend BlueJeans", "text": "I cannot find my packaging managing console. I am completly stuck", "likes": 0}]}, {"topLevelComment": {"author": "Christian Zelioh", "text": "Thank you very much Shad Sluiter", "likes": 0}}, {"topLevelComment": {"author": "Back In Life ", "text": "Thank you very much Sir!", "likes": 0}}, {"topLevelComment": {"author": "Jean Marcel", "text": "Hi, Upon using add-migration \"initialsetup\", the initialsetp.cs file was created but the method is empty. What could be the cause? thanks", "likes": 1}, "replies": [{"author": "Zadss One", "text": "Same happened to me would like to know how to fix this", "likes": 0}]}, {"topLevelComment": {"author": "Elizabeth from Grand Rapids", "text": "Thank you so much Shad.  You're wonderful teacher.", "likes": 0}}, {"topLevelComment": {"author": "Ragul K", "text": "Superb bro i learned lot very easily.. u teach us simple way awesomee", "likes": 0}}, {"topLevelComment": {"author": "Matthew Wolcott", "text": "Am I the only for whom nothing happens when you build and run the IIS Express?", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Zewdu Belachew", "text": "One of the best courses that is presented in a very simple and easy-to-understand way for a complete ASP.Net novices like me. Thanks for sharing!!!", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Jisa Joy", "text": "Thank you so much!!!!", "likes": 0}}, {"topLevelComment": {"author": "Samuel Tardi", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Fremys", "text": "Humilde dms, c é loko", "likes": 0}}, {"topLevelComment": {"author": "Moses Tes", "text": "Just found what I was searching for a while! thanks for the detail explanations.", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 1}]}, {"topLevelComment": {"author": "Cody Siegmann", "text": "I love how when you were editing that chicken joke, it still cracked you up. 😂", "likes": 20}}, {"topLevelComment": {"author": "Buzz Bayley", "text": "Shad, Thankyou very much. It all worked. It is amazing how much you have packed into this video. You are clearly an excellent educator. Lots to think about and follow up.", "likes": 0}}, {"topLevelComment": {"author": "MegaGrinbull", "text": "Simply awesome. Thanks Shad. This is what a tutorial should be like. Straight to the point and informative.", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Jagjit Singh", "text": "Great overview and excellent explanation.", "likes": 0}}, {"topLevelComment": {"author": "Michelle Jefferson", "text": "Hello I'm having a problem rendering my view pages. If I take the default home controller and add my data, and manipulate the default home view its works fine. Taking that same data and adding a new controller with a cordponding view page it doesn't work. I have tried it three time with three different tutorials and the same problem everytime. Does anyone know why this might be happening?", "likes": 0}}, {"topLevelComment": {"author": "Patrick Conrad", "text": "If a man has a name like Shad Sluiter, you know he can teach you a thing or two.", "likes": 0}}, {"topLevelComment": {"author": "sbihi marwan", "text": "i love you man", "likes": 0}}, {"topLevelComment": {"author": "Srikant Nandhakumar", "text": "Thanks so much Shad. This is an excellent video for beginners.", "likes": 0}}, {"topLevelComment": {"author": "m", "text": "...could have used this tutorial back in 2001.....C# .net was pain to learn back then...", "likes": 0}}, {"topLevelComment": {"author": "watherby29", "text": "I am a senior ASP.NET Core and React dev and I know nothing about it hahaha", "likes": 0}}, {"topLevelComment": {"author": "app test", "text": "I don't have option to select MVC controller while creating project any help?", "likes": 0}}, {"topLevelComment": {"author": "Cool Wong", "text": "Thanks a lot for your course. It's working for me. However, I tried to publish and deploy to IIS. The web page is loaded successfully but failed to load the record if connect to database. Am I missed out any step on web config file?", "likes": 0}}, {"topLevelComment": {"author": "H Miri", "text": "@shad sluiter: Dear Shad, After creating a custom controller, I can see that all the provided properties of the model are used in the auto-generated code; e.g. in my case:\r\n\r\npublic async Task<IActionResult> Create([Bind(\"Birthday,ID,Username,EmailAddress\")] PersonModel personModel )\r\n\r\nDoes this mean if we change the code in the model class, we have to re-create the controller, or do we need to search for and effect the changes accordingly, or is there a better way of doing this?\r\n\r\nThanks", "likes": 0}}, {"topLevelComment": {"author": "The Home of every Musicians and Programmers", "text": "Hi Shad cool tutorials thank you!", "likes": 0}}, {"topLevelComment": {"author": "SAURABH KATROJWAR", "text": "Dear Sir, \nHow to generate Anti-csrf token for our ASP.NET web pages  or websites and how it is prevented from attack. \nFor .Net framework 2.0\nPlease Explain atleast on one web page. \nThank you", "likes": 0}}, {"topLevelComment": {"author": "Kunal Rai", "text": "Please upload more advance level of application.", "likes": 0}}, {"topLevelComment": {"author": "pavel nemec", "text": "Help please :)  26:21  if type this \"add-migration \"initialsetup\"\" to package manager console, console write me back this message: \"ScriptHalted\"    \nDo you know anyone how to sort it please?", "likes": 0}}, {"topLevelComment": {"author": "Alan Mustafa", "text": "Dear Shad, a brilliant work. Thank you for sharing your experience in such a short time. However, I have a small correction which would like to ask you about a step you took and forgot to remove, so it made me wonder for a bit but then corrected it. Here is the detail: At 22:15, the added method of \r\nPublic Joke(){}\r\nmust be removed before start adding a new Controller. The project won’t be built until the part has been commented out.\r Than you again.", "likes": 3}, "replies": [{"author": "Michael Schneider", "text": "check this Real E-Commerce App using .Net 5 and Angular 13\r\nThanks\r\n\r\nhttps://youtu.be/-IzpsC-0eBk", "likes": 0}]}, {"topLevelComment": {"author": "Guy Cohen", "text": "One word - AMAZING!\nThanks sir!", "likes": 0}}, {"topLevelComment": {"author": "Katy Prince", "text": "Using Microsoft Visual Studio 2017, doesn't have all of the same bells and whistles...", "likes": 0}}, {"topLevelComment": {"author": "MS", "text": "Shad. Thanks very much for the course from the bottom of my heart", "likes": 1}}, {"topLevelComment": {"author": "Baseer Khan", "text": "This crash course is amazing..do you have any on rest api using .net platform? Please reply i need to watch it", "likes": 0}}, {"topLevelComment": {"author": "Stefan Sorea", "text": "Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Soumesh Khuntia", "text": "C# is such a good language", "likes": 0}}, {"topLevelComment": {"author": "Doug0101", "text": "Wait a minute, doesn't C# use LINQ to connect to a database? And what database is it held in? An Oracle or MySQL or something else?", "likes": 0}}, {"topLevelComment": {"author": "MALISATI", "text": "Exquisite! Thank you...", "likes": 0}}, {"topLevelComment": {"author": "Mr. Bilchalan", "text": "Thank you, Sir.", "likes": 0}}, {"topLevelComment": {"author": "研治 石橋", "text": "I don't have the Areas and Data folders in my project.\n\nVisual Studio also doesn't let me change the authentication system upon creating the project.\n\nMy project also doesn't generate a login and register page.\n\nAm I doing something wrong, or did Microsoft change a bunch of things since the video was uploaded?", "likes": 0}}, {"topLevelComment": {"author": "M", "text": "13:56", "likes": 0}}, {"topLevelComment": {"author": "Basib Malik", "text": "Amazing Sir, Stay blessed.", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Anshuman", "text": "How to add image ,it's giving a broken image logo for any image I add , please help", "likes": 0}}, {"topLevelComment": {"author": "Homesweethome homesweethome", "text": "Thank you🕊", "likes": 0}}, {"topLevelComment": {"author": "Olivier Detry", "text": "Thank you for this nice tutorial. Very clear, with no annoying  music that make it easy to understand for non english native viewers.", "likes": 0}, "replies": [{"author": "Olivier Detry", "text": "@Nallas Path Finder hahaha. I understand absolutely nothing :) :)", "likes": 0}, {"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Kris", "text": "50 min: Search Phrase\n51: Login/Registration", "likes": 1}}, {"topLevelComment": {"author": "SeppuKun", "text": "Great video but I gotta say Microsoft has the worst naming conventions 😅", "likes": 0}}, {"topLevelComment": {"author": "Ariel Molho", "text": "Great tutorial! Thanks Shad.", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Abdulkareem Alnoaman", "text": "Sir. I liked your teaching style. Looking for more videos in ASP.NET Core Web Development.", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "identity", "text": "Thank you for the course, you are excellent instructor.", "likes": 0}}, {"topLevelComment": {"author": "Quisee", "text": "So a controller is just a page?", "likes": 0}}, {"topLevelComment": {"author": "Kris", "text": "25: Database creation", "likes": 0}}, {"topLevelComment": {"author": "Heather Kloth", "text": "I always wondered why my instructors never taught us core. It's because they wanted us to write all the code out ourselves. But what a wonderful time saving tool this is! Thanks Shad!!! Great video!", "likes": 99}, "replies": [{"author": "navdeep kaur", "text": "Can anyone of you here help me with one of my mvc framework assignment, it's very urgent and important for me please", "likes": 0}, {"author": "noah", "text": "the problem with this framework is that microsoft dev team does a lot of radical changes every year, migrating the applications becomes a huge mess and is time consuming and costs a lot, that is why a lot of companies still stick with .net framework since microsoft said they won't be updating it anymore and will only be releasing security fixes.", "likes": 1}, {"author": "Neutron Star", "text": "I mean writing code yourself is a better way to remember and learn what the code actually does. It's not recommended to do these if you don't know what you're doing", "likes": 9}, {"author": "agentstona", "text": "Because this doesn't go down well At scale .... for small to medium toy apps its ok but when you talk about millions of users this things have bad and slower performance  .......DAO is always faster and better", "likes": 3}, {"author": "MoroccanSouq Canada", "text": "yeah i feel thw same way", "likes": 1}]}, {"topLevelComment": {"author": "Minh Hoang Le", "text": "Ok just simple web app now Microsoft made a complicated joke for learners. Since classic WebForm can be done in few click and stop support. So now i make a joke in PHP.", "likes": 0}}, {"topLevelComment": {"author": "Ruslan Jumagaliyev", "text": "Awesome tutorial! 1 hour passed like 10 mins...All the best Shad >>>>", "likes": 0}}, {"topLevelComment": {"author": "LovablePersona", "text": "Constructing SQL statements from the web server is a major fail. You should not be teaching this.", "likes": 0}}, {"topLevelComment": {"author": "zohir bensalem", "text": "hello , thanks so much for this video , but i had a problem rising with the registration and the authentification", "likes": 0}}, {"topLevelComment": {"author": "Jason R", "text": "Great explanations and juxtapositions.", "likes": 0}}, {"topLevelComment": {"author": "Emma Jenkins", "text": "Thank you for this video. As a beginner, this is the first I have come across which has pieced together MVC in a format I could follow, in full, step by step and understand what was happening.", "likes": 8}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Felix George", "text": "error CS0116", "likes": 0}}, {"topLevelComment": {"author": "JAI FABRICS COLLECTION", "text": "best video", "likes": 0}}, {"topLevelComment": {"author": "Firmana I. Zery", "text": "but sir, this is not joke, thanks to you", "likes": 0}}, {"topLevelComment": {"author": "Eric M", "text": "As a self-taught student, with HOURS in other tutorials (like Node.js in Udemy) this is the MOST AMAZING one I've seen yet. \n\nAnd Shad is so casual... but I can hear 'between the lines' of his words, such as '... this just saved you hours of programming with the click of a button'\n:D", "likes": 0}}, {"topLevelComment": {"author": "Nasser Al-Oreefy", "text": "This is just the most explanatory course I've ever got. Thank you for all this thorough information.", "likes": 2}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Theepag Atputhalingam", "text": "Why data folder isn't showing in my project?", "likes": 0}}, {"topLevelComment": {"author": "robbie j", "text": "When using mac alot of the default files and folders such as controller are missing when i create a new project. Is this normal for mac or did i screw up?", "likes": 0}}, {"topLevelComment": {"author": "Ael Far", "text": "This video was uploaded on my birthday, one of the best presents I ever got! :D", "likes": 0}}, {"topLevelComment": {"author": "Stephen Thomas", "text": "great video! the only bit i couldnt get working is the search. doesnt return anything but everything else works. thanks :)", "likes": 1}}, {"topLevelComment": {"author": "MERZEL CIRED", "text": "good course dude,just with i needed 👌", "likes": 0}}, {"topLevelComment": {"author": "MOHAMED WASIM", "text": "Crystal Clear Explanation!!! Thank You Sir.", "likes": 0}}, {"topLevelComment": {"author": "Shurinkenge", "text": "Has Visual Studio 2019 changed since this video? I don't see some of the options to follow along with the video.For example, I don't have the controllers folder or the models folder to include any of the files in there.", "likes": 1}, "replies": [{"author": "Master Chef", "text": "Update your VS.", "likes": 1}, {"author": "Jeffrey Anderson", "text": "I ran into this problem as well. When creating a new project there is an option for ASP.NET Core Web App (Model-View-Controller). Use this instead of the basic ASP.NET Core Web App that he shows in the video.", "likes": 6}]}, {"topLevelComment": {"author": "Florin Dobinciuc", "text": "Thank you very much for this course. Really helpful!!", "likes": 0}}, {"topLevelComment": {"author": "P Mjs", "text": "Thanks for sharing your knowledge!", "likes": 0}}, {"topLevelComment": {"author": "itz your bwoy tchybooxuur!", "text": "Thanks a lot, sir!\nThis was incredibly well thought out and immensely helpful!", "likes": 3}}, {"topLevelComment": {"author": "EVANGELIST ENOCK MWAKAPALILA", "text": "You are a such of big help, but please i have an error during creating first controller which says(ApplicationDBContext.cs already exist ). Help me out of this night upright.", "likes": 0}, "replies": [{"author": "hmn6", "text": "i had to select the dropdown where we typed in the ApplicationDBContext.cs and select the other option", "likes": 0}]}, {"topLevelComment": {"author": "Let's talk", "text": "Wonderful tutorial, but Entity Framework is definitely not only for basic/smaller applications, EF is used in every company I worked for. DAO is a remnant from the 2000s, and I would really love to hear a solid argument against EF.", "likes": 1}}, {"topLevelComment": {"author": "AFlyingRhino", "text": "brilliant", "likes": 0}}, {"topLevelComment": {"author": "Justin K", "text": "9:15 i love the rgb 0,128,128  windows 98 colored background!", "likes": 0}}, {"topLevelComment": {"author": "Viktor Varju", "text": "Thank you for this amazing educational content!", "likes": 0}}, {"topLevelComment": {"author": "Lukas Mattern", "text": "Hmm, the autogenerated files look very different on my end.\n\nI have a fresh install of VS and only installed the relevant items for ASP.NET\n\nI do not, for example, have a controller folder.\nNot sure what I did wrong or they changed up how this functions?\n(The creation of the app also looked different, had a couple of drop downs and missing one of the selections the author made in the beginning.)", "likes": 1}, "replies": [{"author": "Lukas Mattern", "text": "Update, went back to the beginning, turns out you need to choose the model-view-controller at the very start, before the additional information page.\nSo that may have changed from then to now.", "likes": 1}]}, {"topLevelComment": {"author": "Dare Osakinle", "text": "Wow! Have never had it this simple; you are a great teacher...you just added one user to your subscription list...", "likes": 0}}, {"topLevelComment": {"author": "ali alshreef", "text": "Thank you Dear   ^_^", "likes": 0}}, {"topLevelComment": {"author": "ramon siles", "text": "Hello, is it possible to create a web api with .net core to host it in an environment with UNIX AIX?", "likes": 0}}, {"topLevelComment": {"author": "Jabóo WanderLust", "text": "10 outta 10 man", "likes": 0}}, {"topLevelComment": {"author": "coder", "text": "Thank you shad sluiter.", "likes": 0}}, {"topLevelComment": {"author": "Vanessa Campioni", "text": "This is an amazing content, helped me a lot. Obrigado!", "likes": 4}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "A B", "text": "Awesome course.  Very well instructed.  I get a lot of people wanting to learn programming  and I cant think of a better instructor.  Will be sending to all your courses.  You are a natural.  Keep up the good work.", "likes": 0}}, {"topLevelComment": {"author": "TheLollercaster", "text": "8:23 - badum ts (it was a good one)", "likes": 0}}, {"topLevelComment": {"author": "Ravi Kumar", "text": "Thank you so much for this course", "likes": 0}}, {"topLevelComment": {"author": "Bruno", "text": "is the code available to see anywhere?", "likes": 0}}, {"topLevelComment": {"author": "Brazzo T", "text": "Amazing, I had a assignment that required almost the same thing and i was stressing for a bit , but now I'm so passing and so happy", "likes": 1}}, {"topLevelComment": {"author": "Nahom Araya", "text": "I honestly can't like this video enough. Shad Sluiter, you deserve to be immortalized", "likes": 0}}, {"topLevelComment": {"author": "Udaysinh Vaghela", "text": "Where i am going to create new MVC control i am getting Error : There are an error running the select generator: Package restore faild. roling back package ... can you help me pls?", "likes": 0}}, {"topLevelComment": {"author": "coder", "text": "Can you add a new record to related tables?", "likes": 0}}, {"topLevelComment": {"author": "Vaibhav Jain", "text": "A quick nice crash course", "likes": 0}}, {"topLevelComment": {"author": "Piotr Król", "text": "Good job, that is what I needed!", "likes": 0}}, {"topLevelComment": {"author": "Kumar Yadav", "text": "Thank you very much sir, the course was very helpful.", "likes": 0}}, {"topLevelComment": {"author": "Sarthak Kumar", "text": "how to edit login and register views?", "likes": 0}}, {"topLevelComment": {"author": "Muhammad  Abrar Ahmad", "text": "Thanks, Shad. It was indeed a great help for a beginner.", "likes": 1}}, {"topLevelComment": {"author": "Ali Zohair", "text": "At 39:44 Add view option is greyed out and I have no clue why that is happening", "likes": 0}}, {"topLevelComment": {"author": "OviLiz", "text": "Just installed VS2019 (latest) on Windows 10 and when creating a new project it doesn't exactly look like in this video, you don't get to choose MVC or else. When looking at the Solution Explorer, you don't get Controller and Views but Pages is where that Index.cshtml is. I guess is the usual M$ playing around...", "likes": 0}}, {"topLevelComment": {"author": "UmamaheswaraRao Malla", "text": "IIS -> Internet Information Server", "likes": 0}}, {"topLevelComment": {"author": "Ranjan Nadig", "text": "Hi, the ASP.NET Core Web Application project template is not showing up for me. I am using the latest version of Visual Studio 2019. Any idea why it's not showing up?", "likes": 1}}, {"topLevelComment": {"author": "pavfrang", "text": "It is not clear how you registered a new account. Do you need an e-mail server installed?", "likes": 0}}, {"topLevelComment": {"author": "Sheriff Crandy", "text": "At 26:36 I get an alert message that says:\n\"More than one DbContext was found. Specify which one to use. Use the '-Context' parameter for PowerShell commands and the '--context' parameter for dotnet commands.\" Help pls :(", "likes": 0}, "replies": [{"author": "Arsten", "text": "@Sheriff Crandy hahaha thanks for the answer ! I gave up too", "likes": 0}, {"author": "Sheriff Crandy", "text": "@Arsten I gave up bro haha if I ever figure it out I'll post the solution here.", "likes": 1}, {"author": "Arsten", "text": "I get the same problem :((\nHow did you solve it ?", "likes": 0}]}, {"topLevelComment": {"author": "HEBA AY", "text": "when i creat db with add-migration this error are occer deps.json does not exist  pleas help me😢😭", "likes": 0}}, {"topLevelComment": {"author": "Shivansh Raghav", "text": "Excellently explained, very informative, thank you sir", "likes": 0}}, {"topLevelComment": {"author": "Stamatis Tiniakos", "text": "Excellent explanation.", "likes": 0}}, {"topLevelComment": {"author": "#deleteFacebook", "text": "Isn't Asp.net dead?", "likes": 0}, "replies": [{"author": "The voice you never listen", "text": "\"asp.net core\" is successor of \"asp.net\". Asp.net core is open source, Cross Platform & faster.", "likes": 0}]}, {"topLevelComment": {"author": "Roberto Brigagao", "text": "Hi, how can I modify the Where clause in the SearchPhrase to look into Contains both fields JokeQuestion and JokeAnswer?\nI tried insert OR, like this:\n\n // POST: Questionnaires/ShowSearchResults\r\n        public async Task<IActionResult> ShowSearchResults(String SearchPhrase)\r\n        {\r\n            return View(\"Index\", await _context.Questionnaires.Where((j => j.Question.Contains(SearchPhrase) OR (j => j.Answer.Contains(SearchPhrase))).ToListAsync());\r\n        }\r\n\nThank you for the tutorial, great work!", "likes": 0}}, {"topLevelComment": {"author": "Jean-François Trudel", "text": "Simply Great !", "likes": 0}, "replies": [{"author": "Nallas Path Finder", "text": "Watch this video \r\n real time .net interview here\r\n https://www.youtube.com/watch?v=rUZ2jQfbRa8", "likes": 0}]}, {"topLevelComment": {"author": "Alex Joslin", "text": "Best ASP Tutorial I've ever seen in my life.  Thank you Shad!!", "likes": 2}}, {"topLevelComment": {"author": "Diego Camilo Peña Ramirez", "text": "Where can i find the source code?", "likes": 0}}, {"topLevelComment": {"author": "Shashwat Singh", "text": "It's more like laravel.", "likes": 0}}, {"topLevelComment": {"author": "Alex Joslin", "text": "Awesome Video.  Found a small mistake at 3:34 \"Server\" is misspelled.", "likes": 0}}, {"topLevelComment": {"author": "Pravin R.P", "text": "great effort and knowledge shared. Appreciate it", "likes": 0}}, {"topLevelComment": {"author": "Rudy A. Hernandez", "text": "is this .NET 5?", "likes": 0}}, {"topLevelComment": {"author": "Viesha F", "text": "cant get past 26:40", "likes": 0}}, {"topLevelComment": {"author": "Franco Giuliano Pertile", "text": "Very nice intro to ASP.NET Core, short and concise", "likes": 1}}, {"topLevelComment": {"author": "René Schutte", "text": "Fantastic! Excellent content, presentation and packaged perfectly. Thank you!", "likes": 0}, "replies": [{"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "SaolySaoly DG", "text": "This video has saved my life where I am in the middle of a project. just a question, after scaffolding, the error message is popping up saying install all packages, could you please let me know what are packages needed?", "likes": 0}}, {"topLevelComment": {"author": "Adroaldo Araujo Junior", "text": "Excellent course, I could get the perfect idea of how to create and change  ASP.net application, Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Nick Mohale", "text": "Thank you very much for this course, it really helped a lot...", "likes": 0}}, {"topLevelComment": {"author": "The Ultimate", "text": "great tutorial. cheesy jokes \n:D", "likes": 0}}, {"topLevelComment": {"author": "Diego Camilo Peña Ramirez", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Simon Draxl", "text": "Thanks! it really helped me to get started C!!2:52", "likes": 0}}, {"topLevelComment": {"author": "teemoIRL", "text": "upvote because get to the other slide cracked u up so much", "likes": 0}}, {"topLevelComment": {"author": "Erol Ege Sağlam", "text": "👀😭😴👀", "likes": 0}}, {"topLevelComment": {"author": "Be Techky", "text": "This is a great crash course . Thank you", "likes": 1}}, {"topLevelComment": {"author": "Gretter Cabrera", "text": "Hi I am trying to create a new survey project but when I try to add a new class it doesn't show in my options. The option it shows is Assembly info file. Any ideas why this is happening. I am new to ASP net", "likes": 0}}, {"topLevelComment": {"author": "Valentine Masina", "text": "This is much appreciated by all means. You really make it so simple and understandable", "likes": 0}, "replies": [{"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "yakub Sen", "text": "God bless you Sir, for sharing Computer information,  l am  very New ,", "likes": 0}}, {"topLevelComment": {"author": "Miyuki Umeki", "text": "This is so so so helpful! The explanations are crystal clear! Thank you so much !", "likes": 2}}, {"topLevelComment": {"author": "Timothy Kirby", "text": "The \"data\" folder doesn't appear using VS19 Version 16.9.4. How can we get that to appear? @shadsluiter", "likes": 0}, "replies": [{"author": "G Ennis", "text": "@MJ Bøazy : )", "likes": 0}, {"author": "MJ Bøazy", "text": "@G Ennis You life saver youuuu =)", "likes": 0}, {"author": "G Ennis", "text": "When you created the project, did you change authentication to \"Individual User Accounts\"? Your creation menu maybe a little different but look for \"Authentication\" or \"Change Authentication\". I initially had the same problem. I deleted and created a new project and the issue is fixed. Hope this helps.", "likes": 1}]}, {"topLevelComment": {"author": "Roberto Avelar Garcia", "text": "Great tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Issam", "text": "WoW", "likes": 0}}, {"topLevelComment": {"author": "srikanth drk", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Hith", "text": "Why did the turkey cross the road? Because he didn't want to be a chicken.\n\nGreat content! I really love it as a beginner C# developer coming from PHP background. Very well explained giving a bigger picture. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Mark S", "text": "This was a great introductory video Shad, thank you!", "likes": 3}}, {"topLevelComment": {"author": "She's Jana", "text": "Thanks Shad, you are awesome\nPlease keep it up", "likes": 0}}, {"topLevelComment": {"author": "mKnox", "text": "This tutorial is no joke.", "likes": 1}}, {"topLevelComment": {"author": "Lpas Gsni", "text": "Dear professor, I will be very grateful if you can help me figure out the error \"ScriptHalted\" that the Package Manager Console gives in response to the command PM> add-migration \"initialsetup\" . I am trying to repeat your actions and everything goes well, up to the moment 26:20 of your video", "likes": 0}, "replies": [{"author": "B Aware", "text": "I get same error, but the error not come if i am not select authentication method while create new project. if i change authentication i got error \"add-migration More than one DbContext was found\"", "likes": 1}, {"author": "Dennis dennis.madrid", "text": "same error have you found out the solution for this?", "likes": 0}]}, {"topLevelComment": {"author": "Rajnarayanan Veeraiyan", "text": "Thank you Sir", "likes": 0}}, {"topLevelComment": {"author": "YcMakesGames", "text": "time stamps?", "likes": 0}}, {"topLevelComment": {"author": "Randy", "text": "Thank you <3", "likes": 0}}, {"topLevelComment": {"author": "Smith Jr", "text": "A complex topic is explained crystal clear", "likes": 0}}, {"topLevelComment": {"author": "vv6boymon", "text": "For some reason when I went to create a Joke, it only allowed int values and I could not type in any letters, any possible solutions?", "likes": 0}}, {"topLevelComment": {"author": "Sweet & Sour ", "text": "where does the users I registered get saved?  how can i access that and delete them or change them?", "likes": 0}}, {"topLevelComment": {"author": "Rae KC", "text": "Thank you! Very good video. But I get an \"Error!\" I'm with you up to point where you right click to add the ShowSearchForm and add the view. It opens the razor window with the 2 choices, I do everything you do (with selections), when I click to add the view it gives an error that states: Error  there was an error running the selected code generator: 'Package restore failed. Rolling back package changes for 'JokesWebApp'.'\nAlso on my screen, there is an extra drop down list named: \"Data Context Class\" which contains\nApplicationDbContext(JokesWebApp.Data) . I don't think I missed any step. It will let me add a Razor view (Empty) but not the one you use. Is there something my VS 2019 doesn't have? (I got the latest update this week)", "likes": 1}}, {"topLevelComment": {"author": "Nick Bouwhuis", "text": "Gotta admit. It took me longer than 1 hour. But this was so helpful to me I can't even express it in words. Thank you very much for taking the time to explain and show us the basics. You helped me a ton!", "likes": 0}, "replies": [{"author": "Nick Bouwhuis", "text": "@OZAMA 26", "likes": 0}, {"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "Shaurya Bavishi", "text": "Thank you Shad for this amazing tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Wayne Mahoney", "text": "Fantastic ASP.NET course, took me more than an hour and I have learned so much. Everything is working fine so thank you again", "likes": 0}}, {"topLevelComment": {"author": "LegionsMan", "text": "im using win10, ws19 and i do not see asp.net core web application", "likes": 1}, "replies": [{"author": "Akash Kansara", "text": "Update using vs installer and add .Net core", "likes": 0}]}, {"topLevelComment": {"author": "gaurab rimal", "text": "i reached into 30 minutes of this tutorial and couldnt link my database to it. please help.", "likes": 0}}, {"topLevelComment": {"author": "Priya Singh", "text": "At 10.42 my this window is not showing up. Can anybody help", "likes": 0}}, {"topLevelComment": {"author": "jacob martin", "text": "Thanks Shad, I'm learning C# for my job and this is really helpful", "likes": 1}}, {"topLevelComment": {"author": "Manic Miner", "text": "Really well done and thanks a lot!  Very clear descriptions and your voice is easy to work with!", "likes": 1}}, {"topLevelComment": {"author": "Buffalo Black", "text": "I'm stuck on this applicationdbcontext part. My base files didn't come up with the data folder and subsequent files", "likes": 4}, "replies": [{"author": "Buffalo Black", "text": "@G Ennis Thank you!", "likes": 2}, {"author": "G Ennis", "text": "When you create the project, make sure that authentication is changed to \"Individual User Accounts\". Your creation menu maybe a little different but look for \"Authentication\" or \"Change Authentication\". I believe once you create the project you can't make changes so create a new project and it should fix the issue if you change the authentication. I initially had the same problem and realized that I missed this important step. In the video, he goes over it around the 11 minute mark. Hope this helps.", "likes": 0}]}, {"topLevelComment": {"author": "satyam adarsh", "text": "It helped a lot 😄", "likes": 0}}, {"topLevelComment": {"author": "Qalandar Khan", "text": "Excellent job sir!", "likes": 0}}, {"topLevelComment": {"author": "Simon Galvis", "text": "At 31:20 I am only allowed to enter numbers in the inputs. Anyone else run into this issue or know how to fix it?", "likes": 1}, "replies": [{"author": "Donovan Maxwell", "text": "@Simon Galvis Thanks!", "likes": 0}, {"author": "Simon Galvis", "text": "Update: I figured it out. My problem was that, in my Joke class, I had set the data type of \"JokeQuestion\" and \"JokeAnswer\" to \"int\" instead of \"string\". Hope this helps someone dealing with the same bug!", "likes": 1}]}, {"topLevelComment": {"author": "Wayne Mahoney", "text": "I don't have Package management Console on my VS2019", "likes": 0}, "replies": [{"author": "Wayne Mahoney", "text": "now added", "likes": 0}]}, {"topLevelComment": {"author": "RABBI UNIVERSAL", "text": "I Get a message that asks \" if you want to accept an IIS SSL Express certificate \" i clicked no by mistake now the website can't be reached, what to do.", "likes": 0}}, {"topLevelComment": {"author": "Nessus07", "text": "Thanks for a good, basic, quick intro!    It's less scary now!  👍", "likes": 0}}, {"topLevelComment": {"author": "El Chino", "text": "Thank you very much, Shad, for such an amazing tutorial. Clearly, calm, productive, patient ... what a great teacher you are! Just in one video explained every corner of an application. Fantastic tutorial!", "likes": 15}}, {"topLevelComment": {"author": "Mutalib Gozalov", "text": "Hi. Dou you know any way that while adding record to database I want the web page doesn't stay at loading state, cause my apllication has to a few minutes calculation on the background for inputs that user entered and when completed add results to database.", "likes": 0}}, {"topLevelComment": {"author": "Game", "text": "Thank you for this amazing video Mr. Sluiter.", "likes": 0}}, {"topLevelComment": {"author": "Salih Furkan Demirer", "text": "Thanks for the course. It means a lot to me 🙏", "likes": 0}}, {"topLevelComment": {"author": "Gunzz", "text": "31:00 I can only put numbers in, even tho i have NVARCHAR (MAX) NULL,", "likes": 0}}, {"topLevelComment": {"author": "William Reggie Cunningham", "text": "I got an error when I attempted to run the app: NETSDK1 Assets file...not found. Run a NuGet package restore to generate this file. I tried 'dotnet restore' but got more errors.", "likes": 0}}, {"topLevelComment": {"author": "Jimmy5nomana", "text": "Hello, where can I find the source code of this?", "likes": 0}}, {"topLevelComment": {"author": "DJ Dank Memes", "text": "This really is an intermediate course. This course would've been useless if I had no understanding of the front end, React, Angular and databases. This demonstrates the power of IDEs and C# and am super excited to learn more about C#.  This feels like it opens the doors to quickly building powerful applications.\n\nExcellent tutorial! Looking forward to doing more of them.", "likes": 2}, "replies": [{"author": "Bogdan V", "text": "Yeah right? It’s a cool platform for sure! I am a CS student and I am surprised they rather teach us Java. I mean .NET seems like a platform where you can create more stuff right off the bat.", "likes": 0}]}, {"topLevelComment": {"author": "edis veličanin", "text": "Is there a similiar course with more entities then jokes? Great course btw.", "likes": 1}}, {"topLevelComment": {"author": "stocknow dhakal", "text": "hi i got a error at final step after adding [Authorize],\nthe error is: InvalidOperationException: No authenticationScheme was specified, and there was no DefaultChallengeScheme found. The default schemes can be set using either AddAuthentication(string defaultScheme) or AddAuthentication(Action<AuthenticationOptions> configureOptions).", "likes": 0}}, {"topLevelComment": {"author": "John Windsor", "text": "So nice tutorial.  I learn a lot from this one hour. Thank you so much!!!", "likes": 2}}, {"topLevelComment": {"author": "Sheila Giricz", "text": "why wont the controllers tab show up", "likes": 0}}, {"topLevelComment": {"author": "Chris Choir", "text": "Winform didn't exist till about 2001 before that it was done with MFC or WinAPI", "likes": 0}}, {"topLevelComment": {"author": "Aldo Resendiz", "text": "This is a fantastic tutorial!!! Perfectly explained! I love it!!", "likes": 3}}, {"topLevelComment": {"author": "Dan", "text": "Hi Shad! Thanks for en enjoyable lesson, although I knew most of it, I must say that few people upload videos with easy explanations as you do!", "likes": 3}}, {"topLevelComment": {"author": "Jérémie Nseka", "text": "Thank you so much Shad!!! Great course🙌✨", "likes": 0}}, {"topLevelComment": {"author": "Александр Инженер", "text": "Профессор Лебидинский", "likes": 0}}, {"topLevelComment": {"author": "vegguid", "text": "were can I find the version of this tuturial that doesn't use an ORM?", "likes": 0}}, {"topLevelComment": {"author": "Rusiru Nethmina", "text": "superb video.thank you very munch sir", "likes": 0}}, {"topLevelComment": {"author": "Centurion", "text": "Just a java developer passing by, interested to how to thing work in asp net compraed to spring boot", "likes": 0}}, {"topLevelComment": {"author": "cvsWebDesigns", "text": "Great video ... it helped me past a roadblock I was not figuring out!! Thanks\nCouple Questions:\n1. Can we run this on our own hosted server?\n2. I have multiple \"Projects\" in my \"Solution\", the ASP.NET Core is \"Projects.Web\" and the common directory has all my shared files. I have got the \"Dependecies\" in the .Web project to see my Common \"Models\" and when creating a controller it can see the Common models ... the problem is I can only create a Controller in my .Web Model and it gives me errors in the Common Models. \n\nAny ideas on what is going on?", "likes": 0}, "replies": [{"author": "cvsWebDesigns", "text": "Added a class in the common directory \"AppUser\" and got this error\"The entity type \"AppUser\" requires a primary key to be defined. If you intended to use a keyless entity type call \"HasNoKey()\"", "likes": 0}, {"author": "cvsWebDesigns", "text": "Actually, it seems to be a USER issue. I add a class called User in my Common Models and the error is \"\"User\" in inaccessible due to it's protection level\" BUT if I use the \"Item\" class Xamarin template created it works. So ... more clarification on a problem. Do I need to move the \"identity\" schema into my Common directory?", "likes": 0}]}, {"topLevelComment": {"author": "micaela pardini", "text": "thank you so much for this course!", "likes": 0}}, {"topLevelComment": {"author": "John Singleton", "text": "My Solution Explorer doesn't have a Data folder, so I don't know what to do about the step needing us to know where ApplicationDbContext.cs is located. The folders I have are App_Data, App_Start, Content, Controllers, fonts, Models, Scripts, and Views. Does anyone have any idea(s) why this is?", "likes": 0}, "replies": [{"author": "John Singleton", "text": "Alright, I think I identified my mistake. When creating the new project, I originally chose the project template titled 'ASP.NET Web Application (.NET Framework)'. But I've since chosen the project template titled 'ASP.NET Core Web App (Model-View-Controller)' and now I have a Data folder, etc.", "likes": 1}]}, {"topLevelComment": {"author": "Leszek Jezierski", "text": "Great tutorial! Your students must be so lucky, you have a talent to pass a knowledge. All the best.", "likes": 37}}, {"topLevelComment": {"author": "sachin kesharwani", "text": "It was a waste of time. The guys is hardly explaining asp.net core features.", "likes": 0}}, {"topLevelComment": {"author": "Eamon Mac", "text": "For VB on MAC, when you create a MVC controller, it does not automatically create the views.", "likes": 0}}, {"topLevelComment": {"author": "namapro", "text": "You're the man, Shad. Thanks for this intro.", "likes": 2}}, {"topLevelComment": {"author": "Twist", "text": "Great walkthrough! Thanks for the tips!", "likes": 1}}, {"topLevelComment": {"author": "Jesus Francisco Garcia Esparza", "text": "I can't login, what would I can do?", "likes": 1}}, {"topLevelComment": {"author": "Cedric Villani", "text": "Ya but NO!!", "likes": 0}}, {"topLevelComment": {"author": "Surendra Singh", "text": "Really enjoyed the video; excellent in my opinion. Would you be kind to get me the code of the project to load in MS Visual Studio. Thanking you in anticipation.", "likes": 0}}, {"topLevelComment": {"author": "Ali", "text": "You are a hero.", "likes": 0}}, {"topLevelComment": {"author": "N J", "text": "Merci beaucoup !", "likes": 0}}, {"topLevelComment": {"author": "Hemecan", "text": "hey Thanos, please Snap again and reverse the pandemic :(", "likes": 1}}, {"topLevelComment": {"author": "mustafa alp", "text": "you get money for talking. I get your point.", "likes": 0}}, {"topLevelComment": {"author": "jgsk78", "text": "Thank you sir!", "likes": 0}}, {"topLevelComment": {"author": "Code Seekers", "text": "Outstanding, no words how to say thanks ❤❤❤ May God Bless you always , aameen", "likes": 0}}, {"topLevelComment": {"author": "wolfpack4128", "text": "Your content is everything that most videos and forums aren't. You don't just put in lines of code or create some function and not explain that you added a Nuget package or using statement. Awesome work!", "likes": 0}, "replies": [{"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "Hernando Nieto", "text": "Thank you very much. Great lesson!", "likes": 0}}, {"topLevelComment": {"author": "Treat", "text": "Bravo!", "likes": 0}}, {"topLevelComment": {"author": "mission IT possible", "text": "Great video. which software you are using for video, recording?", "likes": 0}, "replies": [{"author": "Programming w/ Professor Sluiter", "text": "I use a macintosh with a virtual machine.  Recording software is ScreenFlow (mac only)", "likes": 0}]}, {"topLevelComment": {"author": "Nirmal singh kc", "text": "great video", "likes": 0}}, {"topLevelComment": {"author": "Sajjad Ali", "text": "please suggest me my add class object not working", "likes": 0}}, {"topLevelComment": {"author": "Maximilian Hagelstam", "text": "Does anyone know how to add the user column?", "likes": 0}}, {"topLevelComment": {"author": "Gotas de Tecnologia", "text": "good", "likes": 0}}, {"topLevelComment": {"author": "Cansu Yeksan Aktaş", "text": "Great video, thanks!", "likes": 0}}, {"topLevelComment": {"author": "pri", "text": "awesome tutorial, learnt a lot! thanks", "likes": 0}}, {"topLevelComment": {"author": "ZN", "text": "I loved it from the first 3 minutes.\nWe need more from you Professor, thanks a lot.", "likes": 37}, "replies": [{"author": "Michael Schneider", "text": "check this Real E-Commerce App using .Net 5 and Angular 13\r\nThanks\r\n\r\nhttps://youtu.be/-IzpsC-0eBk", "likes": 0}]}, {"topLevelComment": {"author": "Ermal Ratkoceri", "text": "when i click add controller it says my model needs to have a primary key or call the function \"HasNoKey()\" can someone pls help why is this happening?", "likes": 0}, "replies": [{"author": "G Ennis", "text": "When you create the project, make sure that authentication is changed to \"Individual User Accounts\". Your creation menu maybe a little different but look for \"Authentication\" or \"Change Authentication\". I had the same problem. I believe once you create the project you can't make changes so create a new project and change the authentication, it will fix the issue. Hope this helps.", "likes": 0}]}, {"topLevelComment": {"author": "DEAN IS HERE", "text": "This is AMAZING. This is exactly the video I needed. Thank you so much for posting this and I can't imagine a better video on  asp.net, entity etc.. Maybe I'll graduate after all!", "likes": 11}, "replies": [{"author": "DEAN IS HERE", "text": "@OZAMA 69", "likes": 5}, {"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw..", "likes": 0}]}, {"topLevelComment": {"author": "zeofriendly", "text": "My folder structure doesnt look the same - I dont have a Data or an Areas folder?  Pretty sure I've created the same project correctly....any ideas?  The tutorial seems really easy to follow and well done though...", "likes": 0}, "replies": [{"author": "zeofriendly", "text": "@Юра Юра thank you!", "likes": 0}, {"author": "Юра Юра", "text": "You should use the previous version of VS. For example 16.8.0", "likes": 0}]}, {"topLevelComment": {"author": "ore_bear", "text": "I rate you sir as one of the top 5 YouTubers on webdev, fantastic content", "likes": 20}, "replies": [{"author": "MrKingchamp1000", "text": "@OZAMA i am 21", "likes": 0}, {"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 1}]}, {"topLevelComment": {"author": "Ezra Ephrem", "text": "Awesome crash course", "likes": 0}}, {"topLevelComment": {"author": "Prabdeep Dhaliwal", "text": "Very cool! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Talha", "text": "Dad jokes Application", "likes": 0}}, {"topLevelComment": {"author": "Amalia Valentine", "text": "Very helpful, thanks!", "likes": 0}}, {"topLevelComment": {"author": "Homa Assal", "text": "Could you please do a complete web development course covering both frontend and backend so we can buy it.", "likes": 1}}, {"topLevelComment": {"author": "CS Algo", "text": "awesome!", "likes": 0}}, {"topLevelComment": {"author": "p b", "text": "this tutorial is a joke", "likes": 2}}, {"topLevelComment": {"author": "Round The Code", "text": "Great tutorial if you want to learn ASP.NET Core!", "likes": 0}}, {"topLevelComment": {"author": "Juan Diego Castaño Gomez", "text": "PERFECT! Straight to the point.", "likes": 1}}, {"topLevelComment": {"author": "Fact2Fact", "text": "great jobs.", "likes": 0}}, {"topLevelComment": {"author": "Vladimir Yermolenko", "text": "Brilliant and clear explanation, thank you!", "likes": 0}}, {"topLevelComment": {"author": "mark mahowald", "text": "Thanks so much! I'm in a job where I building desktop apps, so learning web development is all on me in my personal time, and videos like this one save me dozens of hours of personal time.  :)", "likes": 10}}, {"topLevelComment": {"author": "Ali modz", "text": "There are not enough courses on ASP.NET out there.. we need more!", "likes": 40}, "replies": [{"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "bla bla", "text": "Python Django is better , at least it generates admin pages automatically . Also I like c# as a language.", "likes": 0}}, {"topLevelComment": {"author": "André Corrêa", "text": "Thank you, finally got it!", "likes": 0}}, {"topLevelComment": {"author": "Raksha Kannu", "text": "He is a great instructor!", "likes": 0}}, {"topLevelComment": {"author": "Ajay Ghanekar", "text": "very clearly spoken.", "likes": 0}}, {"topLevelComment": {"author": "Subzero", "text": "Hello guys,\nI could not see any projects under Solution 'JokesWebApp'. , not created anything!\nHow can I handle with it?", "likes": 0}}, {"topLevelComment": {"author": "Virtual 001", "text": "Thank you for the excellent tutorial - looking forward to more...", "likes": 1}}, {"topLevelComment": {"author": "David Montes", "text": "I'm at 29:45 after running the \"update-database\" command and I am not getting the database created like in the video.  I only have the one db \"(localdb)\\ProjectsV13 (SQL Server 13...)\".  Any idea how to fix this?  Thanks", "likes": 2}, "replies": [{"author": "Alex Joslin", "text": "Same thing is happening with me.  The database is not appearing", "likes": 0}, {"author": "David Montes", "text": "@Eric Tingler Thanks, I think you are right.  Some short time later, while I was working on another visual studio project, I noticed that the dbs had suddenly appreared!", "likes": 1}, {"author": "Eric Tingler", "text": "Hello David, I know its been two weeks, but, I had the same issue. It seems to take some time to show up. Keep hitting the little refresh button until it pops up. Let me know if that works.", "likes": 0}]}, {"topLevelComment": {"author": "RABBI UNIVERSAL", "text": "loving this", "likes": 0}}, {"topLevelComment": {"author": "Reem S.", "text": "For mac:\nCreate a new controller: \nadd > new scaffolding >MVC controller with read / write actions\nCreate new views:\n\nadd > new scaffolding > Razor page using entity framework (CRUD)", "likes": 0}}, {"topLevelComment": {"author": "SapphireSuicune", "text": "how would I be able to make so that only the creator can delete their item?", "likes": 0}}, {"topLevelComment": {"author": "N S", "text": "Amazing video! Yesterday it was my first lesson in MVC and i can admit i have learn so many new things from your video! (Very good presentation for a a new user of MVC like me).\nI would like to ask you , although i have in the Class Joke the following properties: Id / JokeQuestion/ JokeAnswer, when i create VIEW of \"ShowSearchForm (i am using exactly same settings as you) it creates a form with JokeQuestion / JokeAnswer only.\nI am missing in ID for some reason?\n\nThank you again!\n\nP.S. I was getting invalid login, so i had in Startup.cs to set \"RequireConfirmedAccount = false\" otherwise by default it sets it to true, so you cannot login.", "likes": 1}}, {"topLevelComment": {"author": "Nikita X", "text": "The kangaroo joke is awesome )))", "likes": 2}}, {"topLevelComment": {"author": "Matty Ice", "text": "Does anyone know where the JokesWebApp sql database is located? Couldn't locate it my already installed local sql server", "likes": 0}, "replies": [{"author": "Matty Ice", "text": "@Adam On Journey I just now partially got your answer and found that the jokes db resides in \"SQL Server Object Explorer\" and not in \"Server Explorer\". Thanks much. So the next question is why does EF choose SQL Server Object Explorer instead  of Server Explorer and why doesnt MS SQL Server Management Studio show these tables?", "likes": 0}, {"author": "Adam On Journey", "text": "Ok, you could hardcode all jokes, but you will loose the flexibility of edit, create and delete.... you always have to go into your code to change your jokes and deploy your app again... or change a dll... whatever, not the modern way of programming..", "likes": 0}, {"author": "Adam On Journey", "text": "@Matty Ice No, you always need a place, where you can store your data: a server or a local database, if you need some management or very small solutions like xml-files... csv or whatever. You could save your data in an temporary object,  for sure... but you would loose your data after every app stop... so this tutorial shows one of those possibilities... a local database.", "likes": 1}, {"author": "Matty Ice", "text": "@Adam On Journey sort of off topic, but will this jokesapp work without a local sql server installation? Just Visual studio + .net core + etc... but no SQL Server? Totally apologize if this is a dumb question, I will look it up myself.", "likes": 1}, {"author": "Adam On Journey", "text": "If you want to to find out how: Visual Studio: Menu -> View, then you find Server-Explorer and SQL-Server-Objekt-Explorer, the latter one is that one you need now. If you choose first, the is a violett button at top of this view to change views to the object Explorer. Then you get this view, which was showed in this tutorial. Right-Click at the JokeWebAppDataBase, at bottom click Properties... , you see at the right side of VS the Property-Window now and just look around to find your path. VS has since years a bug in naming the path of thelocaldatabase: It should be c:\\users\\YourName\\345345manyNumbers.mdf, buuuut it is always: c:\\users\\yourname345345manynumbers.mdf, because for some boring reason the \"\\\" between folder users and folder YourName is missing. SO go to folder: c\\users... there you will find then your database. At some other tutorials my database was inside the app-folders... but you will find the path, if you read the properties as written above! Have fun and stay patient!", "likes": 1}]}, {"topLevelComment": {"author": "Vishal Rana", "text": "Hi i am little confused as there is no Data folder and  ApplicationDBContext.cs is not present in my solution explorer..........I am using the lastest Visual Studio with .net5 ..........need a little help", "likes": 0}, "replies": [{"author": "Vishal Rana", "text": "@Adam On Journey Actually I somehow mess with the database settings that's why the file is not created ........... I figured it out after sometime .... Thanks by the way 🙏", "likes": 2}, {"author": "Adam On Journey", "text": "Did you do \"add-migration\" and other stuff at the paket-manager-console?", "likes": 0}]}, {"topLevelComment": {"author": "Meghana Amirineni", "text": "Get dotnet job support and join the dotnet community to read blogs, tutorials, watch videos and interact on forums http://www.dotnet.idn-kxchange.com/forums/recent_topics", "likes": 0}}, {"topLevelComment": {"author": "Амир Шавалеев", "text": "Thank you so much for this course,  this is what I need as a begginer in Core!", "likes": 28}, "replies": [{"author": "GuyInGrey", "text": "@OZAMA 153", "likes": 1}, {"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "Glen Martin", "text": "User account tip for people. After you \"register\", update your database to confirmed email:\nupdate AspNetUsers\r\nset EmailConfirmed = 1\nwhere id = <your id here>\n\nThanks, good tutorial!", "likes": 1}}, {"topLevelComment": {"author": "Chima Justice", "text": "What a great video, sir you are the best, and I repeat you are the best, keep it up I really appreciate.\nBut please sir can  you do more video on implementing how to display the email of each user that makes a post just like you showed us in the completed project.\nThank you sir.", "likes": 1}}, {"topLevelComment": {"author": "Ronald Johnson", "text": "Thank you for the course, you're excellent instructor.", "likes": 31}}, {"topLevelComment": {"author": "Mauro V", "text": "Did these people read my mind? I just decided to learn C# this week and this course comes out", "likes": 4}}, {"topLevelComment": {"author": "Douglas Sanabria", "text": "Great video Shad! I appreciate it!", "likes": 0}}, {"topLevelComment": {"author": "Blue 22", "text": "This is good for a crash course. However y'all can check this one : https://www.youtube.com/playlist?list=PL6n9fhu94yhVkdrusLaQsfERmL_Jh4XmU\nAfter going through this one I bet y'all won't need any other tuts.", "likes": 7}}, {"topLevelComment": {"author": "Natália Oliveira", "text": "Parabéns professor pelo ótimo conteúdo, completo e simples de entender.", "likes": 30}, "replies": [{"author": "Michael Schneider", "text": "Nice one and also check this Real E-Commerce App using .Net 5 and Angular 13\r\nThanks\r\n\r\nhttps://youtu.be/-IzpsC-0eBk", "likes": 0}]}, {"topLevelComment": {"author": "Đào Công Tuấn", "text": "I wish this video would come out a year ago so that I did not have to struggle with my school project", "likes": 1}, "replies": [{"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}]}, {"topLevelComment": {"author": "Lukas tas", "text": "I did a fresh install of visual studio and there are things that don`t work as in your tutorial:\n1.adding the mvc controller class required me to delete the bin and obj folder from the project folder timestamp: 23:00;\n2. add-migration, required me to add <PackageReference Include=\"Microsoft.EntityFrameworkCore.Design\" Version=\"3.1.8\" /> into the csproj file . timestamp : 26:00;\n3. database-update just fails, timestamp: 29:00. don`t know how to solve this.\n\n\nIs this because the ASP.NET 5.0 version just got out? \nplease help!", "likes": 1}, "replies": [{"author": "Vishal Rana", "text": "Same Problem with applicationDB file in data is missing . Did u find anything which can help me", "likes": 0}]}, {"topLevelComment": {"author": "vishal N", "text": "Another video added to watch later*", "likes": 1}}, {"topLevelComment": {"author": "César Goulart", "text": "Thanks your a great teatcher", "likes": 1}}, {"topLevelComment": {"author": "Juke 2016 Nissan", "text": "Just for the effort alone you get a thumbs up from me. Would it be okay to add more lectures on this where you're incorporating javascript into the code plus discussing the Dependency Injection in the Services and Configure services? In the real world, applications such as ours in my company are made with MVC , javascript , Razor .", "likes": 0}}, {"topLevelComment": {"author": "Puneet Singh", "text": "Sir, Please upload asp.net using c# full tutorials for beginners. Really need that", "likes": 2}}, {"topLevelComment": {"author": "Deep Space", "text": "Never heard of a jokes app lol.", "likes": 0}}, {"topLevelComment": {"author": "Your average programmer", "text": "Thanks for this video FCCxShad", "likes": 0}}, {"topLevelComment": {"author": "Your average programmer", "text": "Any reccommendations for modern Entity books to learn Entity framework?", "likes": 0}}, {"topLevelComment": {"author": "Andrew Corbett", "text": "Great Vid!", "likes": 0}}, {"topLevelComment": {"author": "mavs2p2", "text": "Great quality tutorial, especially zoom in on code feature. Extra effort, but I wish more instructors would do that.", "likes": 1}}, {"topLevelComment": {"author": "This is Elvis", "text": "I love this. does he got more curses????", "likes": 0}, "replies": [{"author": "Baby Sitter", "text": "Yes he does,\nI also recommend checking his personal channel aswell", "likes": 0}]}, {"topLevelComment": {"author": "James kobe", "text": "Learn this ... learn that in 10 min ... in 30 min ... 🤦‍♂️", "likes": 0}}, {"topLevelComment": {"author": "A Casual Data Scientist", "text": "Lol imagine using visual studio and not using Microsoft Edge, \"come on man\" - joe biden", "likes": 0}}, {"topLevelComment": {"author": "Christian Mata", "text": "Make a tutorial using the newly .Net core 5 and Database first approach and some a little bit explanation of Dependency injection.", "likes": 2}}, {"topLevelComment": {"author": "DouArts", "text": "A course without Entity Framework?👀", "likes": 0}}, {"topLevelComment": {"author": "Food is love Food is life", "text": "I currently build web apps with java spring and am tired of their old documentations. So hopefully I'll be able to transition from that to C# .net", "likes": 0}}, {"topLevelComment": {"author": "catalin panait", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Juraj Šmahovský", "text": "Great course :)", "likes": 0}}, {"topLevelComment": {"author": "Marlan Moraes", "text": "After six months studying I finally landed my first job as full stack developer working with C#, .Net, HTML, Javascript and Razor. I'm having some issues but this video served me very well. Seems like you read my mind, thanks!", "likes": 80}, "replies": [{"author": "Shaffan", "text": "Proud of you! 🥰", "likes": 0}, {"author": "cod500", "text": "Man I got a job doing c# and never even used it before. Those mfs crazy, it took me a week to learn this.", "likes": 0}, {"author": "faisal rabbani", "text": "if you don't mind me asking, was this self study? and if so which sources did yo use?", "likes": 4}]}, {"topLevelComment": {"author": "Narcissistic Narcissus", "text": "Please make a CRUD app with React included!", "likes": 14}, "replies": [{"author": "Cinthya Cavalcante", "text": "Yess", "likes": 0}]}, {"topLevelComment": {"author": "Arun Kumar Singh", "text": "C# is ❤️", "likes": 1}}, {"topLevelComment": {"author": "Sonic Dev", "text": "One of the fastest server ( way faster than nodejs )", "likes": 0}}, {"topLevelComment": {"author": "marcos macias", "text": "que  buen curso gracias me salio todo y entendi  solo me quedo duda  en controlador se pude cambiar  por otro motor  de bases de datos en ese paso  por mysql  msssql o  posgrest", "likes": 0}}, {"topLevelComment": {"author": "Ramit Batra", "text": "ASP.net is coming back.\n\nMicrosoft: 😎😎", "likes": 1}}, {"topLevelComment": {"author": "Mustafa Selçuk Çağlar", "text": ".net 5 stable is out now.", "likes": 0}}, {"topLevelComment": {"author": "Ganpat Kakar", "text": "Thank you so much for this course, I really appreciate your effort on this.", "likes": 18}}, {"topLevelComment": {"author": "so4 Real", "text": "a million thank yous my friend .....", "likes": 1}}, {"topLevelComment": {"author": "ELK", "text": "Great tutorial ! keep em coming", "likes": 0}}, {"topLevelComment": {"author": "TradeLion", "text": "There is just too much stuff how is anyone supposed to choose anything?", "likes": 9}}, {"topLevelComment": {"author": "Shadestep", "text": "Perfect timing for this video, I just got a job and needed to brush up", "likes": 101}, "replies": [{"author": "JustVib", "text": "@Hansel D'silva Hi, I recently got internship too on basis of asp.net web forms, now they want me to learn asp.net core, do you know any good site/source from where I can learn it, Please help me out.", "likes": 0}, {"author": "Jay Kay", "text": "you managed to get a job with a company as a .net c# developer and didn't actually know how to do it? How did you manage that?! You surely got fired from this post within a couple of weeks", "likes": 1}, {"author": "OZAMA", "text": "@Hansel D'silva thanks hmm yea I'll start learning all that", "likes": 0}, {"author": "Hansel D'silva", "text": "@OZAMA Possibly you need to first refresh the prerequisites ie OOP (C#) and SQL (RDBMS). Also if your're a beginner and you really want to learn ASP .NET, I'd suggest a proper course which would be a lot longer than 1 hour tho.\n\nThis is a crash course, typically meant for professionals looking to relearn or quickly get the hang of the basics so they can start working on projects.\n\nSince you're 18, you should take it slow and solidify your fundamentals alongside developing personal projects as that's what you need to put on your CV.", "likes": 3}, {"author": "OZAMA", "text": "@Hansel D'silva I'm 18. India too i asked cuz i didn't rly understand alot even tho it was in our syllabus. I'll probably get it by ur age too lol", "likes": 0}]}, {"topLevelComment": {"author": "Houssem Zaier", "text": "Useless technology asp.net", "likes": 0}, "replies": [{"author": "Let's talk", "text": "Yet here you are, watching this.", "likes": 1}]}, {"topLevelComment": {"author": "F3ND1MUS", "text": "cool", "likes": 0}}, {"topLevelComment": {"author": "Samip Poudel", "text": "The jokes were really good though.", "likes": 37}}, {"topLevelComment": {"author": "StefanKo", "text": "I know many of c# and desktop programing but i know anything about web programing on c#", "likes": 0}}, {"topLevelComment": {"author": "Gelle Warfa", "text": "Sir pls make a full course of C#", "likes": 0}, "replies": [{"author": "Eternal Flower", "text": "@Programming w/ Professor Sluiter thx", "likes": 0}, {"author": "Programming w/ Professor Sluiter", "text": "Check it out.  I have three levels of C#.  https://www.youtube.com/user/shadsluiter", "likes": 1}]}, {"topLevelComment": {"author": "Dr. Louell L. Sala", "text": "Very nice. More of this please", "likes": 1}}, {"topLevelComment": {"author": "AK Studioz", "text": "Only three types of people tell the truth \n\n*children \n\n *drunk \n\n *angry\n\nSo,watch what people say when they’re angry..\n\nThey can’t be any more true🧐\n\nHave a good day ahead🤗", "likes": 1}, "replies": [{"author": "AK Studioz", "text": "Hlo", "likes": 1}]}, {"topLevelComment": {"author": "Quiet Ackshon", "text": "My Microsoft Docs sense is tingling, movie Db anyone?", "likes": 6}}, {"topLevelComment": {"author": "Arun Kumar Jena", "text": "Awesome tutorial", "likes": 0}}, {"topLevelComment": {"author": "Niwanthaka Weragoda", "text": "Freecodecamp is the kind of channel that uploads videos that you can't dislike even if you don't like the videos.", "likes": 32}, "replies": [{"author": "beastmasterbg", "text": "@OZAMA 27", "likes": 0}, {"author": "Niwanthaka Weragoda", "text": "@OZAMA15", "likes": 1}, {"author": "OZAMA", "text": "How old r u?\n\n\nI'm asking this to everyone here btw", "likes": 0}, {"author": "beastmasterbg", "text": "@Hades I hate javascript and sql", "likes": 0}, {"author": "Niwanthaka Weragoda", "text": "@Ganpat Kakar Everyone is different I guess.", "likes": 1}]}, {"topLevelComment": {"author": "Peter Suwara", "text": "Can we please have more Visual Studio Code not just Visual Studio. :/", "likes": 7}, "replies": [{"author": "Rand0mTV", "text": "Well Visual Studio is still the primary editor that is being used by C# developers and many C# developers are just used to it. Of course, nothing is stopping you from using VS Code if you want. They also have pretty good support for C# there.", "likes": 0}, {"author": "Prakash Arora", "text": "They have more courses on VS Code as well, imcluding a 4.5 hour one. Check 'em out.", "likes": 1}, {"author": "PixelFixer", "text": "VSCode isn't really equipped to handle ASP.NET", "likes": 0}]}, {"topLevelComment": {"author": "AI Army FF", "text": "watch later\nsave now", "likes": 0}}, {"topLevelComment": {"author": "lenerg gonzalez", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Himanshu kumar", "text": "Fifth", "likes": 0}}, {"topLevelComment": {"author": "Winston Smith", "text": "Sir please make a video courses about Linux", "likes": 1}}, {"topLevelComment": {"author": "MD SAFIKUL ISLAM", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Apdi Shakuur", "text": "Second", "likes": 0}}, {"topLevelComment": {"author": "とらぱお • Slow and Reverb", "text": "Awesome 👍", "likes": 0}}, {"topLevelComment": {"author": "Gaming/Music/Apps", "text": "😁", "likes": 0}}, {"topLevelComment": {"author": "GradeFX", "text": "first!!", "likes": 0}}]}