{"video": {"id": "bK7I79hcm08", "title": "Queues & Priority Queues - Beau teaches JavaScript", "description": "Queues are a first-in first-out data structure. Also learn about priority queues.\n\n🔗 Code: http://codepen.io/beaucarnes/pen/QpaQRG?editors=0012\n🔗 More info: https://www.safaribooksonline.com/library/view/learning-javascript-data/9781783554874/ch04.html\n\nBeau Carnes on Twitter: https://twitter.com/carnesbeau\n\n⭐JavaScript Playlists⭐\n▶Data Structures and Algorithms: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkso-IbgiiP48n-O-JQA9PJ\n▶JavaScript Basics: https://www.youtube.com/playlist?list=PLWKjhJtqVAbk2qRZtWSzCIN38JC_NdhW5\n▶Design Patterns: https://www.youtube.com/playlist?list=PLWKjhJtqVAbnZtkAI3BqcYxKnfWn_C704\n▶ES6: https://www.youtube.com/playlist?list=PLWKjhJtqVAbljtmmeS0c-CEl2LdE-eR_F\n▶Clean Code: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkK24EaPurzMq0-kw5U9pJh\n\n-\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nRead great tech articles at https://medium.freecodecamp.com", "duration": "PT6M39S", "likes": "475", "views": "38029"}, "comments": [{"topLevelComment": {"author": "Rajat Pratap Singh", "text": "for peek in queue: \n\nqueue[queue.length]", "likes": 0}}, {"topLevelComment": {"author": "DuoDecillion", "text": "Isn't the splice inside the for loop of the enqueue function to make it O(n^2)?. And I think you could make the dequeue function O(1), if you use pop() instead of shift which is O(n), just changing the condition on the enqueue function to be element[1] > collection[i][1] etc.", "likes": 0}, "replies": [{"author": "Isabelle Giuong", "text": "the splice is to insert into the correct spot. The shift is to remove from the front (queues remove from front), pop() will remove from the back, so it's not what you want in this case.", "likes": 0}]}, {"topLevelComment": {"author": "Oplaflafla", "text": "thx, very useful to know how to implement priority queues in js", "likes": 0}}, {"topLevelComment": {"author": "YAHUAH'S son & friend", "text": "Always remember to repent of your sins (sin is transgression of YAHUAH The Father In Heaven’s LAW: Genesis, Exodus, Leviticus, Numbers, & Deuteronomy) And Have Belief On Yahusha The Messiah. HE Died and Rose three days later so that you can be forgiven of your sins! \n\nHE Loves you! Come to HIM🙂🙂🙂🙂🙂🙂", "likes": 0}}, {"topLevelComment": {"author": "Mohaiminul Hasan", "text": "Thanks. This helped me with my pathfinding visualizer. But during enqueue I compared current priority > iterated priority. I guess it has something to do with min-heap / max-heap.  Once I made that change pathfinding was faster than DFS in my grid.", "likes": 0}}, {"topLevelComment": {"author": "Naman Gupta", "text": "Shift method works like a charm for removing first element from the array.", "likes": 0}}, {"topLevelComment": {"author": "Fadi", "text": "For the enqueue method, instead of using a for loop and writing all that code, you can push the element into the collection array and then sort it in ascending order:\n\nthis.enqueue = function(element) {\r\n\tthis.collection.push(element);\r\n\tthis.collection.sort((a, b) => a[1] - b[1]);\r\n}", "likes": 1}, "replies": [{"author": "renetchi", "text": "using sort will be O(n log n) \nusing the for loop in the video will be O(n)", "likes": 0}]}, {"topLevelComment": {"author": "Dzenis H.", "text": "Concise and practical, love it 👏", "likes": 1}}, {"topLevelComment": {"author": "Shayn Hacker", "text": "How do I dynamically assign priority to data being sent into the array/collection array instead of it being hard-coded like how you have it in the video?", "likes": 0}}, {"topLevelComment": {"author": "israel meza", "text": "if you remove form the beginning of an array the  complexity is  O(n) if you remove from a linked list it is O(1). Does this mean that for coding interviews I have to implement my own linked list queue?", "likes": 1}, "replies": [{"author": "ScientificBEST", "text": "It doesn't have to be a linked list in the strict sense. You can certainly implement it in a more efficient way using linked list semantics.", "likes": 0}]}, {"topLevelComment": {"author": "Charlie Kim", "text": "for this.enqueue function isn't line 41: if(this.isEmpty()) a bit redundant since we would just be doing the same thing in line 52?  If collection is empty, then var added will remain false since the If-statement in the for-loop would never evaluate to true and therefore the element would be pushed onto collections.\n\nAre we just checking for the empty array right away so in the case where the array is empty we could just stop the function early?  Does this help performance or something?", "likes": 1}}, {"topLevelComment": {"author": "Vishnu B", "text": "http://interviewhelperphpjs.co/binary-treemax-heap-priority-queue-and-implementation-using-javascript/427/", "likes": 0}}, {"topLevelComment": {"author": "Tushar Chhibber", "text": "Anyone please correct me if I am wrong, when we are running a loop to check for priorities... lets say this is the sample collections [ ['a', 4], ['b', 3], ['c', 2]] and I want to add ['d', 1]. If we run look from i = 0 to collection.length with if condition of element[1] < collection[i][1], we will end up with  [ ['d', 1], ['a', 4],  ['b', 3], ['c', 2]], but if we run with if condition of element[1] > collection[i][1], we will get [ ['a', 4],  ['b', 3], ['c', 2], ['d', 1] ] ....", "likes": 0}}, {"topLevelComment": {"author": "Jason Jay Nulla", "text": "In the priority queue, why not use index as the priority? Then each index has a collection and just check if it's empty or not instead of looping through all the elements?", "likes": 1}, "replies": [{"author": "pagnito", "text": "@Pankaj Agham i suppose you can check if given index has an item and if so place the new item next to it?", "likes": 1}, {"author": "Pankaj Agham", "text": "then how you tackle the items with similar priorities?", "likes": 0}, {"author": "FiredForFighting", "text": "Jason Nulla yes I was thinking this same thing", "likes": 0}]}, {"topLevelComment": {"author": "Académie Réparation", "text": "I didn't get collection.splice(i, 0, element) in PriorityQueue.enqueue('cedar', 2)\nIs not element[0] and not just element, because enqueue have 2 parameters in an array?\nEDIT: I got it, bc he's adding the priority too...\nNice implementation", "likes": 1}, "replies": [{"author": "Deepak Kumar Mohanty", "text": "@xavier i got confused while adding splice. the i value was suppose to be 2 and it should insert at 2nd index\nCould you explain it? please", "likes": 0}]}, {"topLevelComment": {"author": "Bijay Timilsina", "text": "The simple code along with the soft voice makes it so easy and quick to understand these things. Just a tip: You can put the collection with array of items on a side window or as comments beside the line of code that you are currently explaining so it's easy to see the code along with collection ( eg. the part where you do colletion[ i ] [1]). Not a big thing, but human brain's algorithm is bit slow in searching memory queues (pun intended), especially for beginners. Thank you Beau, you are AWESOME and please keep sharing. Have a nice day :)", "likes": 6}}, {"topLevelComment": {"author": "Jay P", "text": "The enqueue function here is linear. If you use a heap as the storage, you will have logarithmic enqueue/dequeue functions. Using a heap, you can still maintain FIFO within a given priority level by performing a secondary comparison to an \"epoch\" or \"addedAt\" parameter.", "likes": 8}}]}