{"video": {"id": "bSuivEKegVk", "title": "My Google Job Interview", "description": "Jesse Weigel interviewed for a front end engineer position at Google. This is his experience from first contact to on-site interviews!\n\nYou can see Jesse live coding on our channel or check out his personal channel: https://www.youtube.com/channel/UCUGkNhK8IEUj8A0vbyJ1Bzw\n\nJesse talks about his job search in this video: https://www.youtube.com/watch?v=cvz3NUQ5-ac\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT20M37S", "likes": "1170", "views": "61649"}, "comments": [{"topLevelComment": {"author": "V S", "text": "without specifics about the interview questions this video revelation is useless.", "likes": 0}}, {"topLevelComment": {"author": "E M", "text": "thank you!", "likes": 0}}, {"topLevelComment": {"author": "ex0day", "text": "congrats brother for the effort you put in the process I'm personally experienced the same situations thaks for the video", "likes": 1}}, {"topLevelComment": {"author": "Melon Shake", "text": "Subscribed already honey! ;)", "likes": 0}}, {"topLevelComment": {"author": "RENA KAVUKA", "text": "Please help!!!!!", "likes": 0}}, {"topLevelComment": {"author": "RENA KAVUKA", "text": "If you know an acting job please help me!", "likes": 1}}, {"topLevelComment": {"author": "PinguimGutemberg Carvalho", "text": "Eu tenho 48 anos, mas sobre tecnologia minha mente tem 3 anos, que foi quando aprendi ler por conta própria. Obrigado", "likes": 0}}, {"topLevelComment": {"author": "PinguimGutemberg Carvalho", "text": "Estou me analisando para hackers a inteligência artificial do Google, agora que falei, vcs vão se precaver, é muito fácil.", "likes": 0}}, {"topLevelComment": {"author": "Alan Hernandez", "text": "Wow, incredibly thorough detailing of the process! Thanks man!", "likes": 3}}, {"topLevelComment": {"author": "Nnamdi Jideani", "text": "I'm on my 8th interview 🤦🏾‍♂️", "likes": 0}, "replies": [{"author": "F", "text": "did you get the job?????? What open questions were you asked?", "likes": 0}, {"author": "RENA KAVUKA", "text": "Help me get one", "likes": 0}]}, {"topLevelComment": {"author": "Chris Mitchell", "text": "It is because you are a white male. You didn't make it passed the first face to face meeting. You might want to look into that. They are being sued by an ex-employee right now.", "likes": 0}}, {"topLevelComment": {"author": "ethernet", "text": "Every YouTube video I see about interviews with Google are for coding jobs. Aren’t there any sales, engineering (other), operations, pm, etc... jobs?", "likes": 1}}, {"topLevelComment": {"author": "John D", "text": "You're a great guy for sure. I'd say this is Google's loss.", "likes": 1}}, {"topLevelComment": {"author": "Lee Charlie", "text": "Is it a must to have project experience? If trying to go from other field to Software engineer(therefore there is no project experience before), is being good at coding challenge (data structure and algorithm from leetcode; have been doing leetcode for half year now) enough to get a job?", "likes": 0}}, {"topLevelComment": {"author": "Amin Kuhail", "text": "I don't appreciate you commenting on interviewers not being English native speakers. The majority of software engineers aren't.  They should have good English without a thick accent, but being a native speaker shouldn't be a requirement, and shouldn't be something that gets talked about at all. It's offensive to be honest for someone like me who has worked so hard on my English for a long time, then someone like you who is lucky to be be a native speaker or has the local culture comments on something like that.", "likes": 2}}, {"topLevelComment": {"author": "Jeff H Sipe", "text": "Jesse Weigel thank you for sharing your experience.  To anyone that has interviewed at Google and received positive feedback, keep trying.  From my experience, we hired more people the second and third time they interviewed because they gained more experience and had a better feel for how Google interviews worked.  In addition, by the end of my time at Google, I mostly sourced only using the internal Google database because so many good people had already interviewed, they just needed another shot.  I hope this advice helps!", "likes": 5}, "replies": [{"author": "Nirmal Silwal", "text": "@\rJeff H Sipe thank you for sharing this insightful information.", "likes": 1}, {"author": "Jaganeeshwar S", "text": "See your face everywhere 😇.. Sir", "likes": 1}]}, {"topLevelComment": {"author": "Mahmud Ahsan", "text": "Great video. Thank you for sharing your interview experience. Many people advise that, take interview as a game and take it just to gain some experience. Otherwise sometimes it may give hard feelings or self disappointments.", "likes": 1}}, {"topLevelComment": {"author": "vidsraval", "text": "Hi, Can you pleas let me know how did you prepare for front end role? What types of coding questions and from where did you prepared?", "likes": 0}, "replies": [{"author": "max", "text": "Closure, dom manipulation\nPromise\nMaps/List\nCallbacks,\nEvent delegation - bind\nBinary, graphs, search\n\nsetTimeout\nProtos", "likes": 0}]}, {"topLevelComment": {"author": "OutNProud500", "text": "The good part is, you can always reapply in the future. You should try applying to some of the locations on the east coast such as New York, Miami, or even Chicago. Moving across the country would definitely be a hassle with 4 kids!", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "That's true, thanks!", "likes": 0}]}, {"topLevelComment": {"author": "Dinesh Rout", "text": "Man, you are a nice person", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "Thank you!", "likes": 1}]}, {"topLevelComment": {"author": "Mitesh Bagwe", "text": "Thanks for posting this video. It's very helpful.", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "You're welcome! I am glad it was helpful to you!", "likes": 0}]}, {"topLevelComment": {"author": "Meenakshi Maroliwala", "text": "My new year's resolution is to become Googler.\n I applied to the Career Page several times But I did not get any feedback from the recruiter \nI am waiting for a mail or call and I will....😃", "likes": 3}, "replies": [{"author": "The Coding Journal", "text": "You will just keep applying❤", "likes": 0}, {"author": "Jai krish", "text": "if u r from india!then u need to participate in their kickstart event or ask for any referral from an employee working there,it is the only way possible.i guess", "likes": 0}]}, {"topLevelComment": {"author": "James H Nguyen", "text": "btw, I remember one ytuber who went to 3 google iviews b4 landing the job..so plz don't give up", "likes": 2}, "replies": [{"author": "Nnamdi Jideani", "text": "3?? I'm on interview #8", "likes": 2}, {"author": "Jesse Weigel", "text": "Thanks! That is good to know!", "likes": 0}]}, {"topLevelComment": {"author": "James H Nguyen", "text": "curious you had to pay for the flights?", "likes": 1}, "replies": [{"author": "Ernesto D Espinoza Castillo", "text": "Looks like you donta paya attten shon James 🤪", "likes": 0}, {"author": "Jesse Weigel", "text": "No, Google paid for the flights and hotel.", "likes": 1}]}, {"topLevelComment": {"author": "Safi Zidan", "text": "thank you for this video can you share the books and everything that sent to you from google", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "I am not sure if I can directly share what Google sent, but there may be Google interview prep materials available on Google's job application site.", "likes": 2}]}, {"topLevelComment": {"author": "prsion", "text": "Thanks a lot for sharing  your experience !!!", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "You're welcome!", "likes": 0}]}, {"topLevelComment": {"author": "Charbel Sarkis", "text": "Does he get the job. I didn't watch all the video.", "likes": 0}, "replies": [{"author": "Home, Mind & Love", "text": "no he didn't but he went through a lot of rounds", "likes": 0}, {"author": "Jesse Weigel", "text": "No I ended up not getting an offer from Google. But at that point I already had four other offers. I am really happy where I ended up though!", "likes": 0}]}, {"topLevelComment": {"author": "ForgottenJamRoom", "text": "What's the starting pay for a job like this at Google this seems like an awful lot to go through for a job", "likes": 0}, "replies": [{"author": "Jesse Weigel", "text": "I have no idea what the pay would have been. I imagine it would have been at least in the 150k range because the cost of living is so high in Mountain View.", "likes": 0}]}, {"topLevelComment": {"author": "Arnaud P.", "text": "Thanks for your insight Jesse!", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "You're welcome!", "likes": 0}]}, {"topLevelComment": {"author": "Sangey Chhonjin", "text": "What the hell is this video about??", "likes": 0}, "replies": [{"author": "Jesse Weigel", "text": "@Alfa Beta Thanks for the feedback!  do tend to be kinda long winded. I am working on it.", "likes": 1}, {"author": "Alfa Beta", "text": "Could have summed up in five minutes. Too boring", "likes": 2}, {"author": "cbj324jkl234jk234", "text": "Did you not watch?", "likes": 2}, {"author": "Jesse Weigel", "text": "My Google interview experience.", "likes": 2}]}, {"topLevelComment": {"author": "QiroLab", "text": "Thanks for sharing your experience with us. This is a very helpful and informative video.", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "You're welcome! I am glad it was helpful!", "likes": 1}]}, {"topLevelComment": {"author": "Rahul", "text": "Can a fresher get job at Google..?? After Completing Bs in Cs. & from where should i apply for to get job at google ??", "likes": 0}}, {"topLevelComment": {"author": "Ben Liepert", "text": "great vid", "likes": 1}}, {"topLevelComment": {"author": "hoastbeef", "text": "Our US corporations being taken over and run foreigners who don't have American values instilled in their blood.", "likes": 0}, "replies": [{"author": "Anonymous47", "text": "The United States of America was founded , so we get the respect and freedom England didn’t give us and not for making fun of other races you White Supremacist and Trump Supporter.", "likes": 1}, {"author": "aqua123670", "text": "Lol, racist bigot", "likes": 1}, {"author": "chromosome24", "text": "I've been doing wrong.  Didn't know American values were instilled in blood.", "likes": 2}]}, {"topLevelComment": {"author": "Daniel Cojocaru", "text": "Hi Jesse. Thank's for the feedback. Can you please post a link with the \"Cracking the Coding Interview\" book that you used? I found more than one on amazon and I don't know which one to pick. Thank you in advance. Cheers!", "likes": 3}, "replies": [{"author": "Jesse Weigel", "text": "I have links to all my resources in the description on this video: https://youtu.be/OIuKqgn9gsM", "likes": 0}]}, {"topLevelComment": {"author": "rakkrisr123", "text": "Genuinely thought it was Russell Peters in the thumbnail...", "likes": 4}}, {"topLevelComment": {"author": "Gilbert-MSFT", "text": "I know the feeling. I almost made it to the on-site interview last month.", "likes": 1}}, {"topLevelComment": {"author": "Muneeb Mukhthar", "text": "Great information s!! thank you", "likes": 1}}, {"topLevelComment": {"author": "Indian Software Engineer", "text": "Best video on Interview process, sir, Love this channel.\nPlease sir, bring your other friends who are working in BigTech and make more videos of this type.\nSo that, one day we will also pass Google Interviews and we will be on same podcast like you.\nBTW, Love you sir from India.", "likes": 4}, "replies": [{"author": "Indian Software Engineer", "text": "@Jesse Weigel \nThanks again.", "likes": 1}, {"author": "Jesse Weigel", "text": "Thank you so much! I have some other videos up on my channel and plan on making more about interviewing and other tech related topics.", "likes": 2}]}, {"topLevelComment": {"author": "heq65", "text": "Thank you, great video.", "likes": 1}}, {"topLevelComment": {"author": "Guillermo Arellano", "text": "I had similar experience with my Google interview where I studied for the algorithms and data structures, when I hadn't done that since college, 15 years ago! Needless to say, I bombed my first technical phone interview. Didn't even finish it because I was totally caught off guard by the focus on front end. Glad you were able to fly out to Mountain View and make it to the next round. Thanks for sharing.", "likes": 5}, "replies": [{"author": "Jesse Weigel", "text": "Hopefully this video will help other front end candidates know what to expect.", "likes": 0}]}, {"topLevelComment": {"author": "Rushikesh ganesh", "text": "I am fresher how I m apply for Google", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "Go for it!", "likes": 0}]}, {"topLevelComment": {"author": "Yiou Chen", "text": "When I got an on-site from Google as a new grad, the questions I got are all very algorithm and data structure heavy despite  the fact that my resume was mostly front end related.", "likes": 0}, "replies": [{"author": "Jesse Weigel", "text": "@Yiou Chen That makes sense. I think they only ask front end questions if you apply for a specifically front end position.", "likes": 0}, {"author": "Yiou Chen", "text": "@Jesse Weigel Yes, I was Computer Science major and I applied the general Software Engineer (new grad) position", "likes": 1}, {"author": "Jesse Weigel", "text": "Interesting, did you graduate with a Computer Science degree? I ask because my degree was in business, so I never really had any formal CS training. Maybe that had something to do with the questions. Also, did you apply for a front end position?", "likes": 0}, {"author": "Guillermo Arellano", "text": "Yeah, because you were a recent grad. That stuff is ingrained in you in a lot of college computer science courses, but rarely used outside of a university setting. At least that was the case with me. Like me, Jesse hasn't been in college in years and thus the interviewers deferred asking those type of questions.", "likes": 1}]}, {"topLevelComment": {"author": "Minh Duc Pham", "text": "Wow, could i connect to you on Linkedin", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "Sure!", "likes": 0}]}, {"topLevelComment": {"author": "Sylwester", "text": "good luck for the future", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "Thanks!", "likes": 0}]}, {"topLevelComment": {"author": "Florian K.", "text": "Great insights Jesse! You can be proud of yourself.", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "Thanks!", "likes": 0}]}, {"topLevelComment": {"author": "Sam sadat", "text": "Whats your age and how long u ve been practicing programming", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "@Guillermo Arellano good guess! I am 33 and have been programming professionally for about 5 or 6 years.", "likes": 1}, {"author": "Guillermo Arellano", "text": "He's had 4 kids and he's been out in the real world solving business problems. So I am going to guess early 30's.", "likes": 1}]}, {"topLevelComment": {"author": "Seth Wilson", "text": "More videos like this please!", "likes": 3}, "replies": [{"author": "Jesse Weigel", "text": "I have some other videos like this on my channel and I will be making more soon!", "likes": 1}]}, {"topLevelComment": {"author": "Anjolaoluwa Awe", "text": "I don’t personally know you but I’m so proud that you got an interview with google", "likes": 19}, "replies": [{"author": "Jesse Weigel", "text": "Thank you!", "likes": 1}]}, {"topLevelComment": {"author": "tony tony", "text": "if you did't get the job , WHY NOT JUST TELL US THE QUESTIONS?", "likes": 1}, "replies": [{"author": "Frosty FF", "text": "@Guillermo ArellanoKeeping information for yourself is not the best idea. Atleast, tell us the difficulty levels, ofcourse chances of getting same questions are slim...so, whatever.", "likes": 0}, {"author": "Jesse Weigel", "text": "@Winter Eh Yep, I did sign an NDA. I really do think that knowing the questions that I was asked wouldn't be that helpful because it is very unlikely that someone would be asked the same questions.", "likes": 3}, {"author": "Guillermo Arellano", "text": "I think most people don't like to disclose those questions because they want you to struggle as much as they did getting to those positions at top companies. At least that's what I've seen from most people out in the business world who keep information to themselves.  If he charged you for the questions and answers, would you pay for that information? If so, how much would you pay? Thanks.", "likes": 0}, {"author": "Winter Eh", "text": "They probably make you sign a non disclosure just to interview", "likes": 2}]}, {"topLevelComment": {"author": "レネさん", "text": "Thx for this video. A big thank you for your shares", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "You're welcome!", "likes": 0}]}, {"topLevelComment": {"author": "Nagarajan R", "text": "Thanks for sharing ...!", "likes": 1}}, {"topLevelComment": {"author": "Rahul Ramachandran", "text": "What was the name of the practice website you mentioned in the video?", "likes": 5}, "replies": [{"author": "Jesse Weigel", "text": "@Luis Lugo yep, that is the one!", "likes": 0}, {"author": "alagie chune", "text": "You can check out #codesignal as well for practice.", "likes": 1}, {"author": "Luis Lugo", "text": "think is this one https://www.pramp.com/#/", "likes": 6}]}, {"topLevelComment": {"author": "Ashish Pancholi", "text": "It's great to hear from you about Google interview. \nCan you please share the coding interview books and other stuffs to prepare from.\n\nThanks in advance.", "likes": 2}, "replies": [{"author": "Jesse Weigel", "text": "I am planning on making a video about all of the resources that I used soon. I will post it on my channel sometime in the next week most likely.", "likes": 0}, {"author": "Ashish Pancholi", "text": "@Guillermo Arellano thanks for the advice.", "likes": 0}, {"author": "Guillermo Arellano", "text": "@Ashish Pancholi Python is a good server language. It is a programming language used a lot in coding bootcamps and to code things on hardware, and to perform data science analysis. Like JavaScript, it is quite ubiquitous and powerful. Learn that if you are aiming to become a systems administrator, data scientist, machine learning, robotics maker, or back-end developer. There's a ton of resources out there that are free. But I prefer paid ones. One of them is Pluralsight.net. The other, more expensive, is a guy named Reuven Lerner. Good luck!", "likes": 0}, {"author": "Ashish Pancholi", "text": "@Guillermo Arellano thanks for the revert, its quite helpful. Had some queries regarding programming languages such as php, IOT, raspberrypi and python. For future perspective which would be better and how can I learn for the same.", "likes": 1}, {"author": "Guillermo Arellano", "text": "Typically when you interview with Google, the recruiter gives you a ton of useful resources for you to prepare. They rock with that aspect. One of those resources is a book called \"Cracking The Coding Interview.\" It's a great book, just for you to understand the way the gatekeepers, other programmers, think and strategize to select individuals into their organizations and their teams.", "likes": 2}]}, {"topLevelComment": {"author": "Felipe", "text": "I thought Finn Cole Was an actor", "likes": 1}, "replies": [{"author": "Jesse Weigel", "text": "lol, do I look like Finn Cole?", "likes": 0}]}, {"topLevelComment": {"author": "Nazmul Ahsan", "text": "wow", "likes": 1}}, {"topLevelComment": {"author": "Parthiban K", "text": "Good Video", "likes": 1}}, {"topLevelComment": {"author": "Naruto", "text": "1st view", "likes": 3}}, {"topLevelComment": {"author": "Shiva Shankar Varaprasad Katapally", "text": "1st view....", "likes": 0}}, {"topLevelComment": {"author": "Alvira Rahman", "text": "Good video✌️", "likes": 5}, "replies": [{"author": "Jesse Weigel", "text": "Thanks!", "likes": 1}]}]}