{"video": {"id": "CdqT7_6v60E", "title": "Computer Basics 21: Chrome JavaScript Console and how Logging works", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n  We discuss what (and where) the console is, why it's useful, and show a little of how it works.\n  The console: what it is, where you can find it, and what you use it for.\n  The console is very commonly used to display system adminstrative messages.\n  Your browser and your computer both have their own consoles.\n  Once you become famlliar with it, you will find it to be a very useful and powerful tool.\n  In Javascript, the console is used as a great tool for debugging and finding out where in your code there's a problem.\n  One of the most important terms you'll need to remember is \\console.log()\\.\n  The process of doing this can be put anywhere in the lines of code to help find, identify, and ultimately fix specific issues.\n  Using the Chrome browser and the Chrome console, if we type in \\console.log(\\Free Code Camp rocks!\\);\\ the console will literally display \\Free Code Camp rocks!\\.\n  This will also work with numbers and booleans, which are true/false statements.\n  When consoling words, it's important to put it inside of quotations so it recognizes it's a string.", "duration": "PT2M40S", "likes": 0, "views": "21645"}, "comments": [{"topLevelComment": {"author": "Kavy Solanki", "text": "hey can the words in console.log work with double quotation marks( \" ) or only with single quotation only ?", "likes": 0}}, {"topLevelComment": {"author": "cyclezcirclezncferez", "text": "Do you literally not explain how to access the console in this video?", "likes": 0}}, {"topLevelComment": {"author": "Taryn Bell", "text": "I appreciate this video thanks so much", "likes": 0}}, {"topLevelComment": {"author": "Drew Paveza", "text": "I'm studying the JavaScript console today!\n\nJust a quick warning, when I'm on web pages (like Google, YouTube, or Facebook), I don't want to accidentally delete codes on the \"Elements\" tab. Can you do that, or will the computer not allow you too?", "likes": 0}}, {"topLevelComment": {"author": "Aarón Argotte López", "text": "<3", "likes": 0}}, {"topLevelComment": {"author": "johncena smokie", "text": "Cheatcodes S*X", "likes": 1}}, {"topLevelComment": {"author": "Wing N.", "text": "I wish the video would explain exactly how console.log can help debug in javascript.  I can't seem to grasp exactly how that is done.", "likes": 3}, "replies": [{"author": "Sultan Issa", "text": "@John N it can help to test/check the result of a function or the value of variable etc..", "likes": 0}, {"author": "John N", "text": "yea, me neither. Its like ...great, now I can type arbitrary shit into a little box I know nothing about", "likes": 2}]}, {"topLevelComment": {"author": "Darren Joy", "text": "Watching all these FCC vids back to back, I get the distinct impression you like cheese", "likes": 11}, "replies": [{"author": "Eternal Kino ", "text": "@Briana Swift beauty", "likes": 1}, {"author": "Briana Swift", "text": "that's not false", "likes": 2}]}, {"topLevelComment": {"author": "amine amine", "text": "He studied the concept thank you", "likes": 1}}]}