{"video": {"id": "CoESC2XGZLg", "title": "Chrome Dev Tools: Sources Tab", "description": "Info and mini-lesson on the 'Sources' tab of Chrome Dev Tools. Check out more in-depth documentation here: https://developers.google.com/web/tools/javascript/breakpoints/\n\nThe 'Sources' tab is most useful for debugging JavaScript. The bigger your project is, the harder it can be to find exactly where a problem occurs. \n\nYou can select different parts of the code to be 'breakpoints', checkpoints that will stop the code at that exact moment.\n\nThere are different breakpoints you can watch for, like for a specific line of code, on a DOM event, a server request called XMLHTTP request, or a javascript event. \n\nWhen you set a breakpoint, the browser pauses everything when it interprets that line of code or event. \n\nBy slowing everything down and giving yourself a chance to examine what's happening at every spot you've set, you can keep track of exactly what's happening in the page or app. \n\nOnce all of the breakpoints are set, you can step through the code and examine the state of your page or app at every breakpoint. \n\nJust like with elements, you can live-edit through dev tools, but remember to save those changes however you can so your progress isn't lost.", "duration": "PT1M39S", "likes": "101", "views": "13732"}, "comments": [{"topLevelComment": {"id": "UgwitkxQFQuCFfI719N4AaABAg", "publishedAt": "2022-01-24T17:50:46Z", "author": "Tadas V", "text": "what is the purpose of your head in *tutorial*? to increase focus on content?", "likes": 1}}, {"topLevelComment": {"id": "UgyDXVEg1YxTGiajfPl4AaABAg", "publishedAt": "2020-01-29T06:50:07Z", "author": "Sinac", "text": "Yes, I know that's really helpful, but what's page, file-system, override, overrides,  content scripts and snippets tabs under Sources tab?!", "likes": 0}}, {"topLevelComment": {"id": "UgxkiQp98MAZnEtKu-h4AaABAg", "publishedAt": "2017-08-31T09:55:35Z", "author": "Balance.", "text": "How did you add the break point?", "likes": 0}}, {"topLevelComment": {"id": "UgjDeNEN-Fz_iXgCoAEC", "publishedAt": "2015-12-29T01:59:34Z", "author": "Chris Cintron", "text": "great videos, thank you.", "likes": 0}}]}