{"video": {"id": "CseCDFed458", "title": "The History of JavaScript: a timeline of programming language evolution over the past 20 years", "description": "From the early days of the wild wild web, JavaScript has been there. Its evolved from a simple two week hack into a vibrant ecosystem that is continuously evolving to the modern web.\n\nJoin Matt as he walks the timeline of JavaScripts evolution from where it began into what it has become today. If you are new to web development or just getting back into development or coming to web development from a different part of the stack this is for you. Matt will showcase several demo apps that highlight the differences in how web apps used to be built with ES5 and highlight the tools that have changed how they are built for the modern web and ES6. Finally he will show how that same app can be built with Angular, one of the many modern frameworks that helps engineers build responsive and performant web applications.\n\nTalk given by Matt Hippely at the JavaScriptLA meetup.\n\nThanks to JavaScriptLA for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT1H7M34S", "likes": "286", "views": "14752"}, "comments": [{"topLevelComment": {"id": "UgyAYNe1JKkKGWocW4Z4AaABAg", "publishedAt": "2022-01-26T00:09:31Z", "author": "Maxïmum", "text": "I hate the complexity it adds for nothing ... its already easy to do stuff with nodejs + php mysql, you certainly need other stuffs but the more you add the worse the archetecture is, its over engineered", "likes": 1}}, {"topLevelComment": {"id": "UgwO-tUeSK_fcidRvzd4AaABAg", "publishedAt": "2021-08-01T13:30:47Z", "author": "George Chetrone", "text": "This information isn't understood clearly for beginners, you need a certain experience to understand this video.", "likes": 0}}, {"topLevelComment": {"id": "UgwxsPafIu2zkqjy1F54AaABAg", "publishedAt": "2021-07-18T22:45:21Z", "author": "Ryan Hamilton", "text": "Great presentaion, thank you so much :)", "likes": 0}}, {"topLevelComment": {"id": "UgzsNCZXh4sAxcIvjQF4AaABAg", "publishedAt": "2021-03-09T07:02:36Z", "author": "Arakon1", "text": "I like how the speaker starts out by saying that this video is intended for people who look at modern, framework-based Javascript code and think 'Why can't I just use jQuery, jQuery at least makes sense', then shows us three examples that go from reasonably easy to understand to completely incomprehensible. These front-end frameworks seem to have been built with no thought to entry-level developers, they're just layer upon layer upon layer upon layer of poorly explained complexity intended to solve problems that most developers are never going to encounter. My head hurts right now.", "likes": 0}, "replies": [{"id": "UgzsNCZXh4sAxcIvjQF4AaABAg.9KeaXcTGEkx9l7FAwb-Bya", "publishedAt": "2023-01-20T21:32:07Z", "author": "Scott Doherty", "text": "I agree, 'simplicity' came at the cost of extraordinary complexity.", "likes": 0}, {"id": "UgzsNCZXh4sAxcIvjQF4AaABAg.9KeaXcTGEkx9_RYFinFERP", "publishedAt": "2022-04-05T12:26:52Z", "author": "Coop", "text": "I agree that it can sometimes seem unnecessarily complex, but I disagree that it’s solving problems most devs won’t face. It does solve those problems, but most importantly, once you get the hang of it, it makes reactivity a very quick, cookie cutter process, and provides greater abstraction for the front end.", "likes": 0}]}, {"topLevelComment": {"id": "UgwUG9e6KzxVNWwJb7h4AaABAg", "publishedAt": "2020-10-13T17:08:58Z", "author": "Mohit A", "text": "Can you please give code URL, please...", "likes": 0}}, {"topLevelComment": {"id": "UgxlUYnZC2EpFaCBTYV4AaABAg", "publishedAt": "2019-06-02T10:56:38Z", "author": "Anit Shrestha ", "text": "A really good brief presentation on JS evolution that many of web developer did it back in the days. Thank you Matt!", "likes": 1}}, {"topLevelComment": {"id": "UgzQtNaC0bI-aAwr4194AaABAg", "publishedAt": "2019-06-02T10:40:39Z", "author": "Yasir Karam", "text": "Lovely with truthful tactical methods to observer pattern", "likes": 0}}, {"topLevelComment": {"id": "UgwEHMKrv6Onbjet6dd4AaABAg", "publishedAt": "2018-11-02T00:26:27Z", "author": "B", "text": "Brilliant presentation! Maybe one stage that's missing in this evolution is Require.js - a major step in writing modular code, which preceded Webpack", "likes": 2}}, {"topLevelComment": {"id": "Ugz2FOF-aljZeGtpAfF4AaABAg", "publishedAt": "2018-10-25T05:23:47Z", "author": "Programming Tutorials", "text": "someone is eating back there :)", "likes": 0}}, {"topLevelComment": {"id": "UgzS4ljF5aSjpPndbH14AaABAg", "publishedAt": "2018-10-19T10:33:19Z", "author": "Jeremy Halvorsen", "text": "I'm happy the video was released and we get to see it, but my god, who decided to film this pointed right at such a busy door? It was driving me insane with people constantly walking in and out and just standing in the door eating.", "likes": 1}, "replies": [{"id": "UgzS4ljF5aSjpPndbH14AaABAg.8m_dTvIS_L48nliPjX61ki", "publishedAt": "2018-11-17T23:38:42Z", "author": "hackbuddy", "text": "We're working on improving our production quality. The more support we get the better we'll be able to do with production.  Thanks for checking out the video! :)", "likes": 0}]}, {"topLevelComment": {"id": "Ugz8MGuH60UFq1PAbUF4AaABAg", "publishedAt": "2018-10-19T09:29:17Z", "author": "SIAIVIEID", "text": "A perfect example why Angular is simply overengineered.", "likes": 4}, "replies": [{"id": "Ugz8MGuH60UFq1PAbUF4AaABAg.8m_X8wVFtJE9-wtHWXHjPZ", "publishedAt": "2019-10-11T10:33:28Z", "author": "UnstableFractal", "text": "I think example itself is over engineered and there's an rxjs on top of Angular as well.", "likes": 0}, {"id": "Ugz8MGuH60UFq1PAbUF4AaABAg.8m_X8wVFtJE8n7aGlwuwmz", "publishedAt": "2018-11-02T00:18:43Z", "author": "B", "text": "It's not over engineered if you're working on an enterprise level app", "likes": 0}]}, {"topLevelComment": {"id": "UgxXUXlvM8fLSs6_g8J4AaABAg", "publishedAt": "2018-10-14T20:32:59Z", "author": "Ruvalter França", "text": "Where can I find the source code for the Angular app?", "likes": 0}}, {"topLevelComment": {"id": "Ugwj0v0tDLDxjpJfBSd4AaABAg", "publishedAt": "2018-10-12T18:59:29Z", "author": "Luigi S.", "text": "how to complicate life and be unhappy devs. You must put the fu**ing .js file in the head, pubblish in FTP and boom. No model, no worker, No package, no binding, no events, no classes, no unit test, no webpack, no redux... no, no and NO. JavaScript is for scripting STOP. When you Need something you write the function and call them. Node is not a web-server, electron is not a desktop language. The entire JavaScript dev community need a vacation. This is not Evolution, this is involution of JavaScript!", "likes": 0}}, {"topLevelComment": {"id": "UgyGnYOCDp9AL7aogB54AaABAg", "publishedAt": "2018-10-12T17:12:04Z", "author": "sunil kumar", "text": "Nice work gyus", "likes": 1}}, {"topLevelComment": {"id": "UgwD7c-r8HnN2WXbR454AaABAg", "publishedAt": "2018-10-12T16:45:51Z", "author": "Sergio Junca", "text": "how do you do those slide transitions?", "likes": 1}}, {"topLevelComment": {"id": "UgxKoVjfKPOTZJuehPJ4AaABAg", "publishedAt": "2018-10-12T16:33:49Z", "author": "MrJmpl3", "text": "Why ignore Vuejs? ..", "likes": 1}, "replies": [{"id": "UgxKoVjfKPOTZJuehPJ4AaABAg.8mJGAEOgN8W8n7aSw0-n1C", "publishedAt": "2018-11-02T00:20:22Z", "author": "B", "text": "No matter what framework they choose to demo, people would still ask a similar question😉", "likes": 2}]}, {"topLevelComment": {"id": "UgyqTPt1kQsL7PB2Nmx4AaABAg", "publishedAt": "2018-10-12T16:09:54Z", "author": "AMit", "text": "❣️", "likes": 0}}, {"topLevelComment": {"id": "UgwOt-Gk0VzNvsD7eLR4AaABAg", "publishedAt": "2018-10-12T16:09:25Z", "author": "Anar Kərimov", "text": "super", "likes": 0}}]}