{"video": {"id": "E-TUigZPjrg", "title": "Machine Learning without the Hype", "description": "What is artificial intelligence, machine learning, and deep learning mean in general?\nWhen is a rule-based approach the right solution and when do you need machine learning?\nWhat does machine learning mean for time-series data?\nWhat is the difference between supervised and unsupervised learning in this area?\nWhat could an example with an actual dataset look like?\n\nTalk by Philip Krenn at the Voxxed Days Vienna 2018 conference.\n\nThanks to Devoxx for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT52M24S", "likes": "95", "views": "4641"}, "comments": [{"topLevelComment": {"author": "npappo", "text": "love the title!", "likes": 0}}, {"topLevelComment": {"author": "throwthekeyaway", "text": "this is so cool presentation !!", "likes": 0}}, {"topLevelComment": {"author": "Daporan", "text": "I've got some AI/Machine learning videos on my channel. Let me know if there's any you would like to see in detail.", "likes": 1}}, {"topLevelComment": {"author": "Cesare Borgia", "text": "Don't know what the other guy's talking about. I understand him just fine.", "likes": 4}}, {"topLevelComment": {"author": "16000 48366", "text": "I can't understand what he's saying. Sounds like he got a bee sting on the lips. Needs to articulate better.", "likes": 5}, "replies": [{"author": "liproqq", "text": "He's got a thick german accent. Maybe you're not familiar with it.", "likes": 0}, {"author": "Hugo Santos", "text": "His speech is actually easy to understand, I don't see what trouble you could be having.", "likes": 0}, {"author": "Marty", "text": "I didnt have an issue understanding him....but there is an option to add the closed captions", "likes": 1}, {"author": "16000 48366", "text": "amazinglazedonut man you took that really personally huh", "likes": 1}]}]}