{"video": {"id": "Ef07Hhoc5KE", "publishedAt": "2018-02-16T15:59:50Z", "title": "How to write technical blog posts - talk by freeCodeCamp creator Quincy Larson", "description": "Quincy's the editor of Medium's largest technical blog. He shows you how to write and promote your technical blog posts.\n\nTALK\nYou know you should have a tech blog, but how do you get people to actually read it? Quincy, editor of Medium's largest technical publication, will discuss how to create technical blog posts that will impress prospective employers and show off your knowledge, with strategies including establishing social proof, getting syndicated, and packaging your content for easy consumption.\n\nSPEAKER\nQuincy Larson Teacher, freeCodeCamp - follow him at  twitter.com/ossia\n\nTalk was given at Codeland Conference 2017.\n\n-\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT16M1S", "likes": "339", "views": "7119"}, "comments": [{"topLevelComment": {"id": "Ugzu1qqpCsZwgLueJ294AaABAg", "publishedAt": "2022-09-21T06:31:53Z", "author": "Shivam Baghla", "text": "Hey Quincy, thanks for the detailed info. \n\nOne question: Are you talking about YC hacker news here?", "likes": 0}}, {"topLevelComment": {"id": "Ugw5zjBPoZgGVw_4UYx4AaABAg", "publishedAt": "2021-11-08T13:32:07Z", "author": "Alex Muriuki", "text": "Amazing video.", "likes": 0}}, {"topLevelComment": {"id": "UgwuKL5fgidkAhbLhVV4AaABAg", "publishedAt": "2021-07-16T00:24:18Z", "author": "Sofiane bm", "text": "Great Content Quincy as Always", "likes": 0}}, {"topLevelComment": {"id": "UgxBvL-PfcDdGcrAKA94AaABAg", "publishedAt": "2018-02-18T19:00:08Z", "author": "Ph34rNoB33r", "text": "I somewhat disagree with the stock photos. I find them usually distracting (especially if they are generic), making it hard to follow the content. On Medium (and other click-bait powered sites), it seems people make up for lack in substance by adding stock photos, and Medium's reminders to login/join for extra \"fun\" ruin the rest.\n\nAlso, if I'm on mobile, I curse the author for any irrelevant image I downloaded on my somewhat limited data plan.\n\nI *do* appreciate any kind of relevant visualisations (humorous or not). More work than picking stock photos, but they *add* value.", "likes": 1}}, {"topLevelComment": {"id": "Ugx5ttuosz1DEPACdXh4AaABAg", "publishedAt": "2018-02-18T09:37:14Z", "author": "Luca Corsilli", "text": "Great video! Are you considering to add a technical writing section on FreeCodeCamp? Since there is a whole documentation project waiting for contributors, it would be great to take some lesson on how to write technically.", "likes": 1}}, {"topLevelComment": {"id": "UgyyuWQxwmVTQX4Seb94AaABAg", "publishedAt": "2018-02-16T16:06:44Z", "author": "Sunny Paul", "text": "awesome video totally loved it.", "likes": 8}}]}