{"video": {"id": "Eps1paAaLC8", "title": "How to Create a Portfolio Website", "description": "Learn how to create a portfolio website. Portfolios are often essential when looking for a job.\n\nTalk by Stewart Hines at the freeCodeCamp OKC meetup. Thanks to Stewart and Techlahoma for giving us permission to share.\n\nFollow Techlahoma's YouTube channel at: https://www.youtube.com/channel/UCnLf0pfqIpSfKuPZ0e9iiNQ\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT40M55S", "likes": "864", "views": "43817"}, "comments": [{"topLevelComment": {"author": "Talya Reeder", "text": "This guy was funny! Great video.", "likes": 0}}, {"topLevelComment": {"author": "Chris E", "text": "Yikes! Some of these portfolios sucked, they looked like fcc projects", "likes": 0}}, {"topLevelComment": {"author": "unwolfmelightox", "text": "Drew Carey + Kyle Mclaughlin.", "likes": 1}}, {"topLevelComment": {"author": "Dexter Morgan", "text": "LOl  I had the video on  1.5 playback speed and it seemed like you were high on meth .", "likes": 4}}, {"topLevelComment": {"author": "Someguyonline", "text": "The question I have is using a dynamic dns service on a self host web server unprofessional for a portfolio site? Im a full stack hobbyist looking to put myself out there for side work/second job and wondering if I host it myself using my usual dyn service for a url will be offputting to employers. Thanks!", "likes": 1}}, {"topLevelComment": {"author": "Sk Rezwan", "text": "To the point..", "likes": 0}}, {"topLevelComment": {"author": "NodeRealm | Blockchain Gaming", "text": "can't find the site form.ly. Anyone see it?", "likes": 0}}, {"topLevelComment": {"author": "Tee_Air_Raaa", "text": "His audience must have been very serious because he had some really funny moments and no one laughed. Unless the mics just didn't pick it up. But thanks for all the great points!", "likes": 2}, "replies": [{"author": "Chris E", "text": "No that’s just how programmers are sadly", "likes": 0}, {"author": "Sk Rezwan", "text": "teeAIRraaa haha...r8", "likes": 1}]}, {"topLevelComment": {"author": "Ömer Özer", "text": "I suggest you review my new portfolio website :) omerozer.com", "likes": 2}}, {"topLevelComment": {"author": "Shoshana", "text": "Ha Ha business guys are why we often can't work remotely.  They need to hold many (fruitless) meetings, and I walk out with more action items :-)", "likes": 2}}, {"topLevelComment": {"author": "Ervan R Hermawan", "text": "is it the same when we are building company's portfolio website?", "likes": 0}, "replies": [{"author": "Sk Rezwan", "text": "Ervan R Hermawan nope", "likes": 0}]}, {"topLevelComment": {"author": "Chibuzor stanley", "text": "Launching a startup is not an easy task, its something that takes a lot of time, money and effort. To launch it successfully you need to consider a check list that evaluate the image of your business and the viability of your business idea.\r\nBelow are some important points to consider before actually starting up your business;\r\n1.\tHow viable is your business idea\r\n2.\tIs your business plan ready\r\n3.\tHave you chosen the right business name\r\n4.\tIS YOUR WEBSITE READY?\r\n\r\nNow that you have your business idea, Business name and a clear path on how to run your business, it’s time for you to invest in having a creative and a well-structured online presence for your business through your website; a website that will resonate well with your target audience and communicate effectively services that your business tends to offer your clientele.\r\n\r\nREMEMBER, YOU ARE JUST A CICK AWAY FROM OBLIVIOUM, DON’T GIVE YOUR CUSTOMER AND PROSPET THE CHANCE TO GO AWAY ANYTIME SOON.\r\n\r\nOkay, you understand now that you need a creative and responsive website, but how would you get one without splurging your pocket?\r\n\r\nThis is where Bryant comes to the rescue, check out the link below to order for your professional and responsive website that’s tailored to your business niche.\nhttps://goo.gl/K9EfQ8", "likes": 0}}, {"topLevelComment": {"author": "SpringBok401", "text": "I’d still give an opinion on politics, some employers are happy you’re not a Trump supporter.", "likes": 5}, "replies": [{"author": "NaCℓ", "text": "So he can pay you with popsicles instead of adult cash.", "likes": 0}, {"author": "Stewart Hines", "text": "Too true, too true.", "likes": 3}]}, {"topLevelComment": {"author": "Charity Olubunmi Adekoya", "text": "Got a lot of insight. Can I create my own portfolio using HTML and Css?", "likes": 2}, "replies": [{"author": "Stewart Hines", "text": "Yes, you can. I believe in you!", "likes": 2}, {"author": "queen shurima", "text": "yes", "likes": 1}]}, {"topLevelComment": {"author": "AY ZNT", "text": "freeodeCamp is my recourse no. 1 to learn ❤️ *really* ❤️", "likes": 11}}, {"topLevelComment": {"author": "Dennis Loska", "text": "hey guys can you give me some feedback on my portfolio? it's about a week old: dennisloska.com", "likes": 1}}, {"topLevelComment": {"author": "e4r", "text": "Free Code Camp is such a wonderful resource to learn from.\nThank you guys so much.", "likes": 27}}, {"topLevelComment": {"author": "Ouss", "text": "back to basics", "likes": 6}}]}