{"video": {"id": "f4idgaq2VqA", "title": "Jenkins Tutorial – How to Deploy a Test Server with Docker + Linux (Full Course)", "description": "Learn about Jenkins by building a CI/CD pipeline for a web application. Jenkins is an open source automation server which makes it easier to build, test, and deploy software. In this course, you will learn how to build a full dev-ops pipeline using Jenkins, Linode Servers, and other tools.\n\n🔗 Course Readme: https://github.com/gwenf/jenkins-fcc-readme\n🔗 Sign up for Linode with a $100 credit: https://www.linode.com/students\n\n✏️ Gwendolyn Faraday developed this course.  Check out her channel: https://www.youtube.com/c/FaradayAcademy\n\n🏗 Linode provided a grant that made this course possible.\n\n⭐️ Contents ⭐️\n⌨️ (00:00:00) Video Intro\n⌨️ (00:01:33) Course Overview\n⌨️ (00:02:36) What is Jenkins?\n⌨️ (00:08:47) Terms & Definitions\n⌨️ (00:11:58) Project Architecture\n⌨️ (00:13:28) Linode Intro\n⌨️ (00:20:18) Setting Up Jenkins\n⌨️ (00:24:11) Tour of Jenkins Interface\n⌨️ (00:30:33) Installing Plugins\n⌨️ (00:33:39) Blue Ocean\n⌨️ (00:34:55) Creating a Pipeline\n⌨️ (00:42:37) Installing Git\n⌨️ (00:45:15) Jenkinsfile\n⌨️ (00:46:27) Updating a Pipeline\n⌨️ (00:52:05) Jenkins with nom\n⌨️ (00:56:36) Docker & Dockerhub\n⌨️ (01:02:14) Closing Remarks\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H3M10S", "likes": "3436", "views": "120254"}, "comments": [{"topLevelComment": {"author": "Faraday Academy", "text": "Thanks for the opportunity to make this tutorial! DevOps is a lot of fun and I enjoyed getting to create this video 🙂\nLet me know if you have any questions 🤓", "likes": 49}, "replies": [{"author": "Muhammed Enes Baysan", "text": "@Benjamin Bitwarden", "likes": 0}, {"author": "Benjamin", "text": "@Faraday Academy Does anyone know the name of the extension used in 17:44 to generate a password?", "likes": 1}, {"author": "jessica alvarez", "text": "hello im a slow learner with dislexia, ive been learning javascript since april and forgot 99% of what ive learned any advice?", "likes": 0}, {"author": "Ryotsu Kankichi", "text": "@Roman B  Definitely there's a second part coming, as she didn't deploy that image in the container.", "likes": 0}, {"author": "Roman B", "text": "@Ryotsu Kankichi Exactly! What was the point crating second server for Docker when there was nowhere shown how to pull latest image from Dockerhub to the server and show application working! Is there a second part coming?", "likes": 0}]}, {"topLevelComment": {"author": "Anthony Russano", "text": "Thank you!!!", "likes": 0}}, {"topLevelComment": {"author": "Honey Badger", "text": "Great video!! \nI have a question though... 20:09 did you used the the second server ie _freecodecamp-application_", "likes": 0}}, {"topLevelComment": {"author": "yogesh srininivasan", "text": "Great presentation and a good introduction for newbies", "likes": 0}}, {"topLevelComment": {"author": "doctor", "text": "Amazing job! Thank you for such a nice and clean introduction to Jenkins!", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life......", "likes": 0}]}, {"topLevelComment": {"author": "jagadish kumar", "text": "I am using jenkins for cicd, in jenkins under manage Nodes and cloud --> left hand side we get configure cloud.. We usually create cloud instances manually adding ip, name of the slave machines..so that jenkins job could use Is their rest api I could use to create new cloud slave under configure cloud option ???", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life.......", "likes": 0}]}, {"topLevelComment": {"author": "CarlosDnl", "text": "What's is the name of the password gestor that she use?", "likes": 0}}, {"topLevelComment": {"author": "lechf1", "text": "Anyone had error\n\nnpm ERR! code ENOMEM\r\n\r\nnpm ERR! syscall spawn\r\n\r\nnpm ERR! errno -12\r\n\r\nnpm ERR! spawn ENOMEM\n\nafter add command front-end unit test (53:00)?", "likes": 1}}, {"topLevelComment": {"author": "Rakendu Vadana", "text": "Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Anthony K", "text": "hi Gwen, I wasn't able to move past the front-end test section as it was running into a validation error as the vue-jest module in the transform option was not found. Has anyone else run into this issue?", "likes": 0}}, {"topLevelComment": {"author": "DevOps Journey", "text": "Awesome to see. I also just posted a Jenkins Tutorial recently", "likes": 0}}, {"topLevelComment": {"author": "fuuman5", "text": "Nice tutorial. Thank you.\n\nOne question: Every time I push server to the code, your pipeline would build a docker image. Would that fill up the server's filesystem with images or is Jenkins cleaning that up automatically? Or should I put another stage in the pipeline (after pushing it to the hub) to delete the image that was just built?", "likes": 1}}, {"topLevelComment": {"author": "Gabriel Gitonga", "text": "This is amazing content for beginners. Learned and understand what Jenkins can do", "likes": 0}}, {"topLevelComment": {"author": "Jim Odey", "text": "I just literally finished now! Thanks Gwen and freecodecamp! It was fun!", "likes": 0}, "replies": [{"author": "lechf1", "text": "Npm works without error?", "likes": 0}]}, {"topLevelComment": {"author": "Web360.0", "text": "@13:54 downside: this requires payment/credit card for creating a linode account !!!", "likes": 1}}, {"topLevelComment": {"author": "NossaAmorTo Based", "text": "Up", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life.......", "likes": 0}]}, {"topLevelComment": {"author": "Benjamin", "text": "Does anyone know the name of the extension used in 17:44 to generate a password?", "likes": 2}, "replies": [{"author": "fuuman5", "text": "Bitwarden/Vaultwarden. Best selfhosted password manager ever. Using it for years. Amazing stuff. The server, the browser extension and the android app. Perfect.", "likes": 2}]}, {"topLevelComment": {"author": "Angelos Naoum", "text": "Nice tutorial covering Jenkins at a glance. What is not mentioned though is a procedure of deploying an artifact in a server after this has been built from Jenkins. In general this a topic that I have devoted with and I haven't find any smooth way (like using a Jenkins plugin for example) to push your code to a server without just SSH to it and do your magic there with custom bash commands.", "likes": 1}, "replies": [{"author": "Juan Estrada", "text": "It depends. If you use kubernetes, you can upload your newly built image to your image repository, update the corresponding manifest and ArgoCD will automatically deploy it. I've built similar pipelines in which, with Jenkins running inside Kubernetes, it's deployed using Kubernete's rest API.\n\nIf it's static content, you can use your infrastructure's API to update it at some pipeline's step, etc.", "likes": 0}]}, {"topLevelComment": {"author": "Majid Ali Khan Quaid", "text": "Well explained and easy to follow tutorial. Good Work", "likes": 0}}, {"topLevelComment": {"author": "SuMiT MaYaNgLaMbAm", "text": "Can a Arduino uno control 4 motor individsually", "likes": 0}}, {"topLevelComment": {"author": "A D U L T +", "text": "6:11 couldn’t be more true 👏🏽👏🏽 on phase 4.Fo/RAPPORN is seriously redundant at this point! Not to mention tiring. Just watch, once phases 5,6 and 7 start up people will look back on phase *4* and say how it was their favorite phase or how “underrated” or “overhated” it was. Essentially the same crap they pulled with Andrew Garfield saying how he was their favorite *Spider-Man,* as if they weren’t the very same people people who claimed that he was the worst- \n\n[  ] [v] [  ] Apologies for the rant, *this fandom gives me **_a_** migraine sometimes ❤*", "likes": 1}}, {"topLevelComment": {"author": "Chalice", "text": "Can we build our own vpn system ?", "likes": 0}, "replies": [{"author": "WhatsApp    ⁺ ①⑦⓪⑦⑥⑤②⑨③③②‬", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Ahmad Bodayr", "text": "Read about islam people❤🌹", "likes": 0}}, {"topLevelComment": {"author": "eranxbe", "text": "Very useful video, thanks!", "likes": 0}}, {"topLevelComment": {"author": "Njul", "text": "Nice demo!", "likes": 0}}, {"topLevelComment": {"author": "Saint Kredo", "text": "Ну такое себе.. реклама облачных решений..", "likes": 0}}, {"topLevelComment": {"author": "Festivejelly", "text": "Presentation skills good do with some work tbh. Content is good but the delivery is a bit stale. Sounds like shes bored.", "likes": 0}}, {"topLevelComment": {"author": "Andrei Negru", "text": "Hmm.. it's just me noticing you created a separate Linux machine with Docker but never used it ? But nice tutorial to start with Jenkins 👍", "likes": 1}}, {"topLevelComment": {"author": "Santosh Kumar Perumal", "text": "FreeCodeCamp my fav thanks for all the contents some corrections as given below. \n\nMistake at 9:48 the slide says Continuous delivery automatically deploys code to production but that's not right as we need manual approval for Continuous Delivery only in case of Continuous deployment we will  automatically deploy the code to prod. There is a huge difference between Continuous delivery and deployment.", "likes": 0}, "replies": [{"author": "‪ ⁺ ①③⑧⑤ ③⑤⓪②⑧③①‬ WhatsApp", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Juan Peraza", "text": "Hey Gwen! amazing content. :)", "likes": 0}}, {"topLevelComment": {"author": "TUSHAR BHARANE", "text": "@Free Code Camp can you please make a full course on Kubernetes", "likes": 0}, "replies": [{"author": "⁺ ①⑦②⓪②③⑨②⑧⑤① WhatsApp", "text": "Helpline📲📥⬆️\nQuestion can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "thamarai kannan", "text": "Thank you for making this video for learning myself.", "likes": 0}}, {"topLevelComment": {"author": "AiDoka", "text": "Awesome tutorial.  Was super easy to understand and follow along. Thank you Gwen and FCC.", "likes": 8}}, {"topLevelComment": {"author": "Chanpreet Singh", "text": "Never disappoints.", "likes": 0}}, {"topLevelComment": {"author": "Juju Bawa", "text": "Wow wow wow.. Thanks a ton for this 🙏", "likes": 0}}, {"topLevelComment": {"author": "Aaron Baron64", "text": "I wasn't ready for the plin plin plon name drop", "likes": 0}}, {"topLevelComment": {"author": "David", "text": "Thank you, learned a lot!! 👍", "likes": 0}}, {"topLevelComment": {"author": "vishal viswanathan", "text": "Please make more videos on Jenkins .", "likes": 0}, "replies": [{"author": "⁺ ①⑦②⓪②③⑨②⑧⑤① WhatsApp", "text": "Helpline📲📥⬆️\nQuestion can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "Timothy L.J. Stewart", "text": "How is your \"Login\" stage persisted to you \"Push\" stage? Aren't stages isolate environments, or do they persist variables and changes to the next stage?", "likes": 0}, "replies": [{"author": "⁺①③①⑧③⓪③⑥⑦①⑧ whatsap", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Gabriel Rodriguez", "text": "Hooray this course is here!", "likes": 0}, "replies": [{"author": "⁺ ①⑦②⓪②③⑨②⑧⑤① WhatsApp", "text": "Helpline📲📥⬆️\nQuestion can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "Jesus Christ Saves", "text": "THE GOSPEL\r\n\r\nMoreover, brethren, I declare unto you the gospel which I preached unto you, which also \r\nye have received, and wherein ye stand; 2 By which also ye are saved, if ye keep in memory what I preached unto you, unless ye have believed in vain. 3 For I delivered unto you first of all that which I also received, how that Christ died for our sins according to the scriptures; 4 And that he was buried, and that he rose again the third day according to the scriptures:\r\n- 1 Corinthians 15: 1-4 KJV\r\n\r\nGreater love hath no man than this, that a man lay down his life for his friends. - John 15:13 KJV\r\n\r\nSAVALATION \r\n\r\nFor God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\r\n- John 3:16 KJV\r\n\r\nFor God sent not his Son into the world to condemn the world; but that the world through him might be saved. John 3:17\r\n\r\nJesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\r\n- John 14:6 KJV\r\n\r\nNeither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved. Acts 4:12\r\n\r\nFor if, when we were enemies, we were reconciled to God by the death of his Son, much more, being reconciled, we shall be saved by his life. Romans 5:10\r\n\r\nBut he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed. - Isaiah 53:5 \r\n\r\nFor by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. Ephesians 2:8-9 \r\n\r\nAnd saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.\r\n- Mark 1:15 KJV\r\n\r\n\r\nHe that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him.\r\n- John 3:36 KJV\r\n\r\nWho hath saved us, and called us with an holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the world began. 2 Timothy 1:9 \r\n\r\nFor the Son of man is come to seek and to save that which was lost. Luke 19:10 \r\n\r\nThe Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. 2 Peter 3:9\r\n\r\nHe that believeth and is baptized shall be saved; but he that believeth not shall be damned. Mark 16:16\r\n\r\nFor as in Adam all die, even so in Christ shall all be made alive. 1 Corinthians 15:22 \r\n\r\nFor scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die. But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us. Romans 5:7-8\r\n\r\nI am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture. John 10:9", "likes": 0}}, {"topLevelComment": {"author": "Juan Diego Silva Garcia", "text": "Beautiful 😍", "likes": 0}}, {"topLevelComment": {"author": "Aces", "text": "LETSSSSGOOO", "likes": 0}}, {"topLevelComment": {"author": "blazed-space", "text": "❤YES FINALLY!!!! Jenkins!!!!😂🎉🎉🎉🎉🎉😅😅😅😂😭😭😍😍😍", "likes": 1}, "replies": [{"author": "blazed-space", "text": "Btw: when she said security, she wasn’t kidding. I’ve checked many an SSH log to see Chinese or Russian hackers try to brute force my instances with username “jenkins”, so lock down your SSH host (private/public key, no password less login, no password login, additionally change the port)", "likes": 0}]}, {"topLevelComment": {"author": "M H", "text": "Very basic stuff.", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Guy This", "text": "need to explain how to handle secure variables like dockerhub creds in pipelines in more detail, this is a pretty significant possible security flaw irl", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Talking about Computer Science", "text": "Great material and great intro.  Thanks for sharing!", "likes": 0}}, {"topLevelComment": {"author": "TUSHAR BHARANE", "text": "Really thanks a lot free code camp 😌", "likes": 0}}, {"topLevelComment": {"author": "Coding Moments", "text": "Thnx for this video", "likes": 0}}, {"topLevelComment": {"author": "Vivek Kumar", "text": "For a moment,I got confused and thought her to be that hollywood actress,ana de armas and was like....wow,now celebrities r getting into development. 😀", "likes": 0}}, {"topLevelComment": {"author": "Lenin Valenzuela", "text": "Thanks a lot for this, greetings ... by the way such a beautiful eyes je je", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Wallsdonaldfx@gmail⚫com", "text": "I highly recommend ☝☝☝☝☝. In his time at Pacific, he has shown the technical, organizational, and interpersonal skills that make for a truly exceptional administrative assistant. In particular, I know that you’re seeking someone with exceptional customer service and skills, as well as the ability to get up to speed quickly with proprietary software, he offers all these skills, plus adaptability and grace under pressure.", "likes": 13}, "replies": [{"author": "Nora Venilla", "text": "Every bitcoin investor right now is just smiling at\nthe price of bitcoin as it head strong and indeed\nvaluable enough to generating Roi. More persons\nare gonna become millionaires and we have Bitcoin thanks for that.", "likes": 0}, {"author": "Smith 00", "text": "I also trade with Mr Walls Donald , and i must say he makes money making seem a whole lot easier right now I'm a single parent and i pay the bills comfortably since i met Walls he's absolutely amazing and I'd recommend him for any novice in crypto.", "likes": 0}, {"author": "Donald Frank", "text": "@Ava Jocelyn 💯💯", "likes": 0}, {"author": "Donald Frank", "text": "Really 'all know him? I even thought I'm the only one he has helped walk through the fears and falls of trading days ago", "likes": 0}, {"author": "Great Israel", "text": "@Chuks Wayne His name is everywhere, he has really made good name for himself, He's indeed good at what he does.", "likes": 0}]}, {"topLevelComment": {"author": "jonl316", "text": "Thank you!!", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Abdul Hannan Abdul Matheen", "text": "👏🙂", "likes": 0}}, {"topLevelComment": {"author": "B R", "text": "Having to install git/node/whatever on the build servers seems to be not ideal. What if different projects require different software versions? Is the best practice to run those tests in containers?", "likes": 3}, "replies": [{"author": "Angelos Naoum", "text": "Definetely running tests with containers is a good practice as it exempts you from the obvious problems that you will face if not following this procedure. This can be easily configured by having something like the below under the Pipeline scope of Jenkinsfile.\n\n environment {\n        JAVA_TOOL_OPTIONS = '-Duser.home=/var/maven'\n    }\n    agent {\n        docker {\n            image 'maven:3.8.1-jdk-11'\n            args '-v /tmp/maven:/var/maven/.m2 -e MAVEN_CONFIG=/var/maven/.m2'\n        }\n    }\n\nI guess sth equivalent will exist for npm and other platforms as well.", "likes": 1}, {"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "rahmouni mohamed", "text": "So helpfull, thanks a lot", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Abhishek Kumar Jha", "text": "Just what I needed when I needed.", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Harira Normal", "text": "ahh yes, Ol' Man Jenkins'", "likes": 0}}, {"topLevelComment": {"author": "Jhonfreddy15", "text": "I NEEDED THIS. Thanks . There are where few videos about Jenkins .  Nowadays all attention is focus on GitHub actions and other similar products", "likes": 1}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Vrushal Raut", "text": "Thanks a lot most needed ...waiting for so far 😀", "likes": 0}}, {"topLevelComment": {"author": "Ngohcollins jr", "text": "What are the biggest problems using Jenkins?", "likes": 2}, "replies": [{"author": "fallenlights", "text": "Everything", "likes": 1}, {"author": "Jlovechrist", "text": "Becoming pls", "likes": 0}]}, {"topLevelComment": {"author": "Tài Đức", "text": "Could you guys make a data fundamentals full course pls", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 1}]}, {"topLevelComment": {"author": "L Lawliet", "text": "Nice, like+subscribe", "likes": 0}}, {"topLevelComment": {"author": "Pray4ragE", "text": "Been needing this, thanks!", "likes": 1}}, {"topLevelComment": {"author": "Zafar", "text": "Thanks a lot ❤️", "likes": 0}}, {"topLevelComment": {"author": "Rishi Raj", "text": "Gteat Thanks", "likes": 0}}, {"topLevelComment": {"author": "Bunty Rajput", "text": "Awesome 👍", "likes": 0}}, {"topLevelComment": {"author": "naveen gokavarapu", "text": "Very informative video", "likes": 2}}, {"topLevelComment": {"author": "Clinton Hussein", "text": "It's the most desirable tutorial for me right now, thank you very much", "likes": 4}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Asim Al-Tayeb", "text": "great content", "likes": 0}}, {"topLevelComment": {"author": "Sandy 🤪", "text": "Thanks and Great for Upload !!!\nMake a Playlist contains all DevOps related Courses Like AWS , Azure, K8s,terraform,GitLab now Jenkins\nIf possible Pls make Video on Python for DevOps with Automation / Ansible for DevOps . Which will sum-up to all existing DevOps related Courses\n👍👍", "likes": 23}, "replies": [{"author": "freeCodeCamp.org", "text": "Good idea. https://www.youtube.com/playlist?list=PLWKjhJtqVAbkzvvpY12KkfiIGso9A_Ixs", "likes": 12}]}, {"topLevelComment": {"author": "Diman Ranawaka", "text": "Wow❤😍", "likes": 0}}, {"topLevelComment": {"author": "Androidify", "text": "Second 🌚", "likes": 0}}, {"topLevelComment": {"author": "Olumayowa Akinkuehinmi", "text": "Freecodecamp never disappoints.", "likes": 26}}, {"topLevelComment": {"author": "JK Tamizhan Gaming", "text": "1st view and 1st like", "likes": 1}}, {"topLevelComment": {"author": "QueenNSim", "text": "First!", "likes": 0}}]}