{"video": {"id": "f9M6P9IVn7k", "publishedAt": "2015-07-17T09:09:30Z", "title": "Computer Basics 17: How Routers and Packets work", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n   In this video, we go into a little more detail about routers and packets, important concepts to understand about how the internet works.\n  Let's talk more about routers and how they relate to networking.\n  Routers are the things that connect different small area networks.\n  I want to give a metaphor for this: I'm a teacher and I work at a school.\n  Say I have a package that I need to get to someone who works in the district offices.\n  I don't know where she is, I don't know where her office is located, but I know her name.\n  I go to my secretary, like my first router, and I say \\Hey, I need to get this to so-and-so at the district office, can you please help me?\\ and she'll say \\Sure, I don't know exactly where her office is either, but I know the next step, I can get it to the district\\.\n  So she goes on and sends it to the secretary at the district office, the next router.\n  That secretary has no idea who I am or where I am, but she sees the name on the package and knows the end location.\n  What I'm trying to get across here is that each router only has to know its own little network, the stops right next to it.\n  It doesn't have to know the whole internet, but just its own connections.\n  It can take information and say, alright, I don't know exactly where that's going, but I'll pass it along in the right direction.\n  That's really all it takes.\n  Routers can be different sizes, different capacities, but what they do is know their own neighborhood, take the information, and pass it in the right direction.\n  Another thing we'll get into a little later is that the routers don't even have to have the full package of information.\n  If one comptuer is trying to send information to another, the data might get split up between different routers and that's okay.\n  The computers still know how to put the information back together correctly.\n  The little pieces of information that are sent are called packets.\n  Packets are actually little pieces of binary code (drawn on board).\n  This is an example of what packets might look like, a visual representation of the electrical current that the computer can translate into 1's and 0's, which we all know is binary that can represent literally any digital data.\n  These little packets are sent across through routers, and if a file is too large for one packet, it can be broken up into frames (smaller little packets).\n  The frames don't have to take the same route to the end destination.\n  They can take whichever route is open, whichever is fastest, and since they have the end IP address, all of the routers know where to send them.\n  Once they get to the end destination, that computer knows how to put all of the information back together.", "duration": "PT2M54S", "likes": 0, "views": "26812"}, "comments": [{"topLevelComment": {"id": "UggXM0A4t-sgzXgCoAEC", "publishedAt": "2017-06-03T03:31:51Z", "author": "Nam Nguyen", "text": "HOT POTATO ROUTING", "likes": 2}}, {"topLevelComment": {"id": "Ugi2TkhSFCRgCHgCoAEC", "publishedAt": "2016-11-01T07:54:01Z", "author": "Andrew Ligon", "text": "I think this makes sense know when someone's torrenting and once the download is complete you can seed the file or delete it. Is the file that was downloaded send or broken up through all the other seeders router?", "likes": 1}}, {"topLevelComment": {"id": "UggdlmI2_k5ts3gCoAEC", "publishedAt": "2016-09-02T02:47:01Z", "author": "TayOracle", "text": "What happened to lesson 16?", "likes": 14}}, {"topLevelComment": {"id": "Ugi-Z7vlFyRVrngCoAEC", "publishedAt": "2016-07-21T22:42:24Z", "author": "Gabriel Chamon", "text": "Thanks!!", "likes": 0}}, {"topLevelComment": {"id": "UggoPmLVGpFnJngCoAEC", "publishedAt": "2016-06-24T01:11:03Z", "author": "Ryan Garant", "text": "Thanks for putting the time in to make these helpful videos!", "likes": 3}}, {"topLevelComment": {"id": "Ugi7fbaS5hKT-ngCoAEC", "publishedAt": "2016-06-17T00:53:45Z", "author": "Carlos Doe", "text": "I love routers <3", "likes": 1}}, {"topLevelComment": {"id": "UgiLethm3TnaU3gCoAEC", "publishedAt": "2016-06-02T20:22:45Z", "author": "Niko Las", "text": "Pretty solid, thanks!", "likes": 2}}]}