{"video": {"id": "Fw98L-kcRpc", "title": "How To Write User Stories, Epics, & Personas - Dev Life", "description": "User Stories, Epics, and Personas help organize all the needs of a project so it is clear what needs to be done.\n\nThey are used in many developer jobs for planning projects so it is helpful to know what they are and how to create them.\n\nVideo by Anissa Deanna.\n🎥Anissa's YouTube channel: https://www.youtube.com/channel/UCVOKt2XgozvMSnZDZGMdetg\n📷Anissa on Instagram: https://www.instagram.com/anissadeanna/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT7M39S", "likes": "1878", "views": "50722"}, "comments": [{"topLevelComment": {"author": "niraj prasad", "text": "Simple and easy to understand.\nNice one ☺️", "likes": 0}}, {"topLevelComment": {"author": "Eddison Lewis", "text": "Interesting", "likes": 0}}, {"topLevelComment": {"author": "Mercedes Gaillard", "text": "Awesome!!!", "likes": 0}}, {"topLevelComment": {"author": "gia mor", "text": "OMG. life changing  7 mins.\nKeep it up.\nLuv the examples. How could you do it in 7 mins others 30 long boring mins", "likes": 1}}, {"topLevelComment": {"author": "Bellini", "text": "Crystal clear", "likes": 0}}, {"topLevelComment": {"author": "Mandar Joshi", "text": "Wow!! Amazing maam u elucidate it in just 7 min plz make more videos related to project management!!", "likes": 0}}, {"topLevelComment": {"author": "Zakaria Azzahid", "text": "As a learning Business Analyst, i was struggling to write correct User Stories and your video was really helpful for me, Thanks !", "likes": 5}}, {"topLevelComment": {"author": "Jerson Quintero", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Sebastian", "text": "it's amazing how a 7-minute video can make a huge difference in your understanding. Excellent stuff", "likes": 16}}, {"topLevelComment": {"author": "Noel Slater", "text": "Enjoyed this. Explained each item well and yet did it in a short concise manner!", "likes": 1}}, {"topLevelComment": {"author": "Rodolfo Vitangcol", "text": "Business Opportunity in Ruvol\r\n\r\nI have invented a Board Game [still unpublished and not yet out in the market] that I believe is guaranteed to be as challenging and exciting as CHESS.  I called it “RUVOL.”  \r\n\r\nIt is my hope that one day Ruvol may surpass chess as the “Number One Board Game in the World.” \r\n\r\nThe weakness of chess is it always starts in fixed positions that the opening moves become “memorizable.”  In fact, not a few have so mastered the moves that they can play against their opponents “blindfolded.”  It is for this very reason that the great Bobby Fischer introduced his so-called “Fischer Random Chess,” where the starting position of the pieces is “randomized” to make the memorization of openings impracticable.  Fortunately, it is also for this reason that I invented Ruvol where “every game” has been calculated to be a challenging one to play.\r\n\r\nHOW IS RUVOL PLAYED and HOW YOU CAN MONETIZE IT?\r\n\r\nI detailed everything in my YouTube video.  Here is the link:  https://www.youtube.com/watch?v=jcqth0m3-R0\r\n\r\nBIG MONEY POTENTIAL IN RUVOL!\r\n\r\nIt is worthwhile to note that the people who play chess will be the same people who will play Ruvol.  In my Google search, I learned there are around 800 million chess players in the world.  Even just a small percentage of these 800 million is good enough to earn big money from Ruvol either as an ONLINE GAME BUSINESS or as a PHYSICAL PRODUCT DISTRIBUTOR.\r\n\r\nYou may contact me at:  rodolfovitangcol@gmail.com.   \r\n\r\nThanks and God bless!\r\n \r\nRODOLFO MARTIN VITANGCOL\r\nThe Ruvol Inventor", "likes": 0}}, {"topLevelComment": {"author": "Kuncoro Jatikusumo", "text": "what is the difference between User Stories and Problem Statement? I'm still find it difficult to find the difference of those terms. And when to use it?", "likes": 0}}, {"topLevelComment": {"author": "Christie GH", "text": "This is an excellent video; thanks so much for sharing! 😘", "likes": 0}}, {"topLevelComment": {"author": "Ambitioustech_browngirl", "text": "Sniffs and Woofs though! Great concept!", "likes": 0}}, {"topLevelComment": {"author": "Donnete", "text": "Wonderful explanation. Your example book example to describe epics was perfect. Thank you!", "likes": 1}, "replies": [{"author": "Anne Noah", "text": "Exactly!", "likes": 0}]}, {"topLevelComment": {"author": "joj666", "text": "so much what is this what is that on internet no single project user stories => code", "likes": 0}}, {"topLevelComment": {"author": "Alex Hope Stranger", "text": "Can we have more videos like this please? I mean stuff related to Agile PM and BA processes?\nIt was very informative and the presentation is awesome!\nSuper interesting and fun!\nLove your vibes!\nThank you❤️", "likes": 1}}, {"topLevelComment": {"author": "Nahom Berhe", "text": "Thanks! This helps", "likes": 0}}, {"topLevelComment": {"author": "Diogenes Vitali", "text": "So, what is next after a user story? There is a new drill down to say “as a pet owner I would like to add pictures of my pet so I can...” or “as a user I would like to be able to change my password “? \n\nHow does the details after these level of user story work?\n\nMay you tell me more some samples of detail user stories as user requirements?", "likes": 0}}, {"topLevelComment": {"author": "Angelo Torres", "text": "Well done.  Even if this was not the standard explanation, I liked it so much that I will frame my thoughts around this: Personas -> Epics -> Set of User Stories. \n\nIt helped too to think of a user story with this structure:\n\n\"As a <Pet Owner>, \n\nI want to <showcase my pet to other pet owners>, \n\nso that <we can setup play dates for our dogs>\n\nNote: The <we can setup play dates for our dogs> has to WORK with the target audience (the audience looking online to setup dog play dates with this app etc.)\n\nAnd, lastly, Epics can contain many related stories for this audience (audience coming to this app to find other dogs for theirs to play with).  For example, there can be another user story to validate dog sitters. So an EPIC that covers both user stories could be (like the title of a book), \"Allow pet owners to socialize their dogs better, even when they are busy professionals\"\n\nLoved it!", "likes": 1}}, {"topLevelComment": {"author": "Gary knight", "text": "Straight to the point!  Thanks!!!", "likes": 3}}, {"topLevelComment": {"author": "Vince RIP_PUTIN", "text": "Very good and simple definition of user stories", "likes": 2}}, {"topLevelComment": {"author": "Golie A Nyirenda", "text": "Well explained thank you.", "likes": 1}}, {"topLevelComment": {"author": "Studio Zandra", "text": "Short, sweet, and right to the point...thanks!!\nCan you recommend any similarly short and good videos explaining the term Agile?", "likes": 1}}, {"topLevelComment": {"author": "Faradillah Nurul Hikmah", "text": "I wanna know more about this topic, please do more some video as like this. thanks :)", "likes": 2}}, {"topLevelComment": {"author": "Schmuel Tiebra", "text": "Thank you, it is the simplest explanation I've seen for this, this is really the way to reach people looking forward to using Scrum ASAP.", "likes": 2}}, {"topLevelComment": {"author": "Self Taught AI Geek", "text": "Great job with the video. Clear explanations combined with real-life examples ===> better understanding. 😊", "likes": 2}}, {"topLevelComment": {"author": "Md Liaquat Ali", "text": "Your teaching is good enough.", "likes": 0}}, {"topLevelComment": {"author": "Alex Jones", "text": "Thank you for your work.  You did a very awesome job explaining user stories, epics and personas.", "likes": 4}}, {"topLevelComment": {"author": "Kelly Boudreau", "text": "Thank you - very easy to understand. simple. Direct, not a lot of fill words.  Appreciate that.", "likes": 3}}, {"topLevelComment": {"author": "Gifty Ngoe", "text": "Thankyou Very Much for the Ideas you just shared. So helpful.", "likes": 0}}, {"topLevelComment": {"author": "Joel", "text": "Thanks for the heads up. I did learn stuff on agile, but I haven't been applying it to my coding. Hence I spend too much time doing one thing. And it bores me out. kinda killing my vibe", "likes": 0}}, {"topLevelComment": {"author": "Joel", "text": "I am in love with you and your tutorials of course. lol", "likes": 2}}, {"topLevelComment": {"author": "Ankit Singh", "text": "Wow, nice explanation\n Please keep it up", "likes": 3}}, {"topLevelComment": {"author": "Rubens Junior", "text": "Good  explanation! Simple, direct and objective", "likes": 1}}, {"topLevelComment": {"author": "dnvdk", "text": "million dollar idea: Grrrndr (app for hooking up doges who want to reproduce!) :D", "likes": 2}}, {"topLevelComment": {"author": "Tati P", "text": "I am actually having a hard time creating user stories for an app that I am creating. This was helpful because my teacher couldn’t explain to me what a user story is. He just kept saying what is the purpose of the app. Thanks!", "likes": 18}, "replies": [{"author": "LaKisha Atkins", "text": "@Mask Man I humbly disagree. As a former teacher, asking the student a question (one she/he likely knows the answer or has the resources to uncover the answer) sparks critical thinking. Often the answer uncovered by the student IS the answer to their question. Kind of a teach a man...give a man...scenario.", "likes": 0}, {"author": "Mask Man", "text": "Your teacher is bad, doesn't want to teach you the stuff, but still he keeps collecting tuition without hestation !!!", "likes": 1}]}]}