{"video": {"id": "fXhDM1MdVu4", "title": "How to Raise a Tech Family, talk by 15-year-old programmer and her father", "description": "This talk is from Keila Banks and her father Phillip. Keila is a 15-year-old programmer, web designer, and technologist.\n\nFor any system to survive it must figure out how to bring in new members. In this keynote, you'll hear from Keila Banks who since 11 years old (now 15) has been speaking at conferences around the world; and her father Phillip Banks, who's been programming since he was 10 and provided the same path for his children. Along with 3 other sons, they have all been a part of technology efforts and open source communities since their youth. Hear from a teen how you can help grow open source communities and youth involvement from what we've learned along the way.\n\nTalk originally given at the Open Source Leadership Summit 2018.\n\nThis talk is under the creative commons license. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT19M46S", "likes": "43", "views": "1809"}, "comments": [{"topLevelComment": {"author": "Alex", "text": "Long live President Donald J Trump!!", "likes": 2}}, {"topLevelComment": {"author": "ware zit", "text": "I'm only 28 seconds into the video, and I can already tell they have a positive family dynamic.", "likes": 0}, "replies": [{"author": "Banks Family Tech", "text": "Yes we do. Thank you so much for that comment.", "likes": 1}]}, {"topLevelComment": {"author": "Junaid Choudhary", "text": "She is a good speaker btw..", "likes": 0}, "replies": [{"author": "Banks Family Tech", "text": "Thank you. I'll tell her. Here's a new one of a 5 minute talk she did recently. https://youtu.be/z7QykyHIcoU", "likes": 0}]}, {"topLevelComment": {"author": "I3UTM", "text": "How does one do this without a family?", "likes": 3}, "replies": [{"author": "Banks Family Tech", "text": "Hi I just found this video. It's me Phillip Banks from the video. You don't need a family at all. We're trying to spread this all over the country doing this kind of training. email me at phillip@banksnetworking.com and I could help.", "likes": 2}, {"author": "Kanishka Ralasi", "text": "😂", "likes": 0}]}]}