{"video": {"id": "FzlpwoeSrE0", "title": "NoSQL vs SQL – Which Type of Database Should You Use?", "description": "When should you use RDBMS, and when should you use NoSQL?  \nThis course describes the differences between NoSQL and SQL databases as well as when and why to use each kind of database.\n\n🔗 Register for a free Astra DB account to use for this tutorial: https://astra.datastax.com/register/sqlnosql/vi-11\n\n✏️ Ania Kubow developed this course. Check out her channel: https://www.youtube.com/aniakubow\n\n🏗 DataStax provided a grant to made this course possible.\n\n✏️ SQL Tutorial - Full Database Course for Beginners on FreeCodeCamp: https://www.youtube.com/watch?v=HXV3zeQKqGY\n✏️ NoSQL Database Tutorial – Full Course for Beginners on FreeCodeCamp: https://www.youtube.com/watch?v=xh4gy1lbL2k\n✏️ Apache Cassandra Database – Full Course for Beginners on FreeCodeCamp: https://www.youtube.com/watch?v=J-cSy5MeMOA\n✏️ Everything You Need to Know About Storage Attached Indexing in Apache Cassandra | DataStax: https://www.youtube.com/watch?v=D9CUk6YkDaw\n✏️ Enough CQL To Get You Started - Data Modeling with Apache Cassandra | DataStax: https://www.youtube.com/watch?v=mhHM3K-gjeA\n\n⭐️ Contents ⭐️\nIntroduction (0:00)\n01: What actually is a database (2:17)\n03: What is a database management system (5:53)\n04: Demo: Creating a database (6:27)\n05: Common Database Models (9:21)\n06: Relational databases (9:46)\n07: SQL (11:33)\n08: Non-relational databases (16:33)\n09: Pros and Cons: Comparing RDBMS and NoSQL (19:21)\n10: Wide Column Database (31:25)\n11: Document Database (47:38)\n12: Key-Value Database (1:03:51)\n13: Multi-Model Databases (1:21:57 )\n14: Use cases: When to use RDBMS or NoSQL (1:23:12)\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H25M42S", "likes": "2320", "views": "76740"}, "comments": [{"topLevelComment": {"author": "Code with Ania Kubów", "text": "Thank you everyone for all your support and kind words! You can also catch me on my own channel and on instagram :) Check it out here:\nYoutube: https://www.youtube.com/aniakubow\nInstagram: https://www.instagram.com/aniakubow", "likes": 65}, "replies": [{"author": "Kevin", "text": "I'm sure she's not sick of that, yet", "likes": 0}, {"author": "CoolPigeon", "text": "@Егор Екатеринин what are you talking about? Her talking sounds completely normal.", "likes": 1}, {"author": "Егор Екатеринин", "text": "@Sarahmarie Hollenstein it is not about who can do better, why you even asking...", "likes": 0}, {"author": "Sarahmarie Hollenstein", "text": "@Егор Екатеринин  can you do better?", "likes": 1}, {"author": "Thenga Kola", "text": "@Егор Екатеринин lmao tru it looks creepy", "likes": 1}]}, {"topLevelComment": {"author": "Fernando Echevarria", "text": "Super cute", "likes": 0}}, {"topLevelComment": {"author": "Samir Hawaldar", "text": "One of the greatest course I have ever gone through. Thank you #Freecodecamp and #CodeWithAniaKubow 🤩❤️", "likes": 0}}, {"topLevelComment": {"author": "Dclxvi Clan", "text": "Love u, real Filisiti Sm❤oke", "likes": 0}}, {"topLevelComment": {"author": "vitalinov", "text": "great summary! ty", "likes": 0}}, {"topLevelComment": {"author": "shohei", "text": "too long", "likes": 0}}, {"topLevelComment": {"author": "samar taj Shaikh", "text": "Not helpful to me right now. Maybe sometime in the future.", "likes": 0}}, {"topLevelComment": {"author": "Slip Och", "text": "Great video exposing the underlying structures and differences!\n\nMy choice between them always comes down to the number of data tables that need to be related in different or dynamic ways and if any external systems need access to the same data. \n\nIf I have multiple tables that I will be grabbing data from where relationships are defined in different ways depending on what is being requested sometimes with dynamic queries. Then you can create indexes based on these different situations. The other thing is external access to the db by reporting/other external products. If these is true I will use SQL.\n\nIf I am treating the blocks of data more like groups of related objects (either able to be dynamic or non-dynamic schemas) and primarily using it in a custom programming project then I will choose NoSQL for the massively increased speed and ease of use in programming (using a DB that has a .net 6+ library). As no external systems need to hit it (as they would be part of the project) the more 'open' SQL system is not required. Typically I will use a code-based schema, so we have a static schema that is easily modifiable and definable.\n\nI don't use graphql as queries can spiral out massively very quickly ;P", "likes": 3}}, {"topLevelComment": {"author": "Abhirup Paul", "text": "U look like khalisi from game of throne", "likes": 2}}, {"topLevelComment": {"author": "Murilo Lopes", "text": "For your voice alone, the video would be worth it.", "likes": 0}}, {"topLevelComment": {"author": "Michel Salloum", "text": "I can not understand your accent lady Ania", "likes": 0}}, {"topLevelComment": {"author": "bala kumar", "text": "Good", "likes": 0}}, {"topLevelComment": {"author": "satish8299", "text": "Where in Ukraine or Russia do you liev Ania. You look gorgeus. Yes sorry, i am single, i rather would have been raised in India or Indonesia, that is why i am single I guess.", "likes": 0}}, {"topLevelComment": {"author": "123 123", "text": "SQL vs NOSQL is comparing apples with oranges because every NOSQL database is a fruit of its own and for a specific usecase will do a better job than SQL.", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life.....", "likes": 0}]}, {"topLevelComment": {"author": "Normie Cyrox", "text": "Yo denerys back teaching", "likes": 0}}, {"topLevelComment": {"author": "casual anime", "text": "11:28", "likes": 0}}, {"topLevelComment": {"author": "Masbaur Tech!", "text": "I have no patience to hear for an hour! Google already answered it!", "likes": 0}}, {"topLevelComment": {"author": "Riyaz Ali", "text": "You have explained it so well that i have understood in 2 hours but Two years of college teaches me nothing. You are great 👍👍👍👍", "likes": 2}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life.....", "likes": 0}]}, {"topLevelComment": {"author": "Lifting And Coding", "text": "Wealth of info, Ty 👍🏽", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life...", "likes": 0}]}, {"topLevelComment": {"author": "Slingshot88", "text": "Thank you so much for these tutorials!", "likes": 1}, "replies": [{"author": "⁺①⑤⑤⑨⑥⑦②⓪⑥④⓪ WHATSAPP", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Varun Tyagi", "text": "Thank you for creating this. You explained everything really well. Subscribed to your channel too.", "likes": 1}, "replies": [{"author": "Code with Ania Kubów", "text": "Thank you I appreciate it 🙏", "likes": 1}]}, {"topLevelComment": {"author": "smiley / سمايلي", "text": "Amazing work on the explanation, trying it definitely", "likes": 2}}, {"topLevelComment": {"author": "Solid", "text": "Ladies and gentlemen, introducing Ania; The First of her Name, The Unburnt, Breaker of Chains, Mother of Dragons, Khaleesi of the Great Grass Sea.", "likes": 48}, "replies": [{"author": "Saras Subedi", "text": "@Code with Ania Kubów 😂", "likes": 0}, {"author": "Saladin Agent", "text": "Ladies and gentleman I agree with him we learned a lot from her may Allah grant her the highest place in paradise, but be ware ladies and gentlemen, this here is a solid simp, look how he's simping, he could have thanked her in a very normal way but he instead have chosen to simp to her ahahaha.", "likes": 0}, {"author": "Code with Ania Kubów", "text": "🐉👑", "likes": 13}]}, {"topLevelComment": {"author": "Who AmI", "text": "This is just a video I am looking for! Thanks, Ania!!", "likes": 5}, "replies": [{"author": "Code with Ania Kubów", "text": "So great to hear 😀", "likes": 1}]}, {"topLevelComment": {"author": "Lazy Yeti", "text": "https://youtu.be/FzlpwoeSrE0?t=917\nFor SQL, how was it possible to insert and Id of string '013s3' to a column of integer type?", "likes": 1}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Jason Perry", "text": "I'd use anything Ania says to...", "likes": 0}, "replies": [{"author": "⁺①⑤⑤⑨⑥⑦②⓪⑥④⓪ WHATSAPP", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Jesus Christ Saves", "text": "THE GOSPEL\r\n\r\nMoreover, brethren, I declare unto you the gospel which I preached unto you, which also \r\nye have received, and wherein ye stand; 2 By which also ye are saved, if ye keep in memory what I preached unto you, unless ye have believed in vain. 3 For I delivered unto you first of all that which I also received, how that Christ died for our sins according to the scriptures; 4 And that he was buried, and that he rose again the third day according to the scriptures:\r\n- 1 Corinthians 15: 1-4 KJV\r\n\r\nGreater love hath no man than this, that a man lay down his life for his friends. - John 15:13 KJV\r\n\r\nSAVALATION \r\n\r\nFor God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\r\n- John 3:16 KJV\r\n\r\nFor God sent not his Son into the world to condemn the world; but that the world through him might be saved. John 3:17\r\n\r\nJesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.\r\n- John 14:6 KJV\r\n\r\nNeither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved. Acts 4:12\r\n\r\nFor if, when we were enemies, we were reconciled to God by the death of his Son, much more, being reconciled, we shall be saved by his life. Romans 5:10\r\n\r\nBut he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed. - Isaiah 53:5 \r\n\r\nFor by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. Ephesians 2:8-9 \r\n\r\nAnd saying, The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.\r\n- Mark 1:15 KJV\r\n\r\n\r\nHe that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him.\r\n- John 3:36 KJV\r\n\r\nWho hath saved us, and called us with an holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the world began. 2 Timothy 1:9 \r\n\r\nFor the Son of man is come to seek and to save that which was lost. Luke 19:10 \r\n\r\nThe Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. 2 Peter 3:9\r\n\r\nHe that believeth and is baptized shall be saved; but he that believeth not shall be damned. Mark 16:16\r\n\r\nFor as in Adam all die, even so in Christ shall all be made alive. 1 Corinthians 15:22 \r\n\r\nFor scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die. But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us. Romans 5:7-8\r\n\r\nI am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture. John 10:9\r\n\r\nThat if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved. 10 For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation. 11 For the scripture saith, Whosoever believeth on him shall not be ashamed.\r\n- Romans 10:9-11 KJV", "likes": 2}}, {"topLevelComment": {"author": "Fraternitas", "text": "unbelievable levels of attention seeking", "likes": 1}, "replies": [{"author": "CoolPigeon", "text": "i don't understand, what problem do you 2 have with this woman, the video was pretty good.", "likes": 0}, {"author": "merridius2006", "text": "seems like personal branding is more important than coding nowadays. Ask google", "likes": 0}, {"author": "FoxHoundUnit89", "text": "You can put that in your own channel's \"About\" section, you don't have to comment it on other people's videos.", "likes": 1}]}, {"topLevelComment": {"author": "Divya Kumer\n\n", "text": "Putting our time and effort in activities and investments that will yield a profitable return in the future is what we should be aiming for .success depends on the action or steps you take to achieve it.", "likes": 3}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life......", "likes": 0}, {"author": "Divya Kumer\n\n", "text": "@frankcicinelli", "likes": 0}]}, {"topLevelComment": {"author": "System Architect", "text": "wow, so beautiful woman.", "likes": 1}}, {"topLevelComment": {"author": "edwardsicily", "text": "No pineapple on pizza! 42:45", "likes": 1}, "replies": [{"author": "Code with Ania Kubów", "text": "😂😂 - gotta love me some pineapple pizza 🍕", "likes": 1}, {"author": "Sad Penguin", "text": "No pizza without pineapple!", "likes": 1}]}, {"topLevelComment": {"author": "B Singh", "text": "Are you Targeryen ...keep it up", "likes": 2}, "replies": [{"author": "Code with Ania Kubów", "text": "👑🐉", "likes": 1}]}, {"topLevelComment": {"author": "Sirmi98", "text": "Very respectfully i have to say you are a Goddess, that said amazing content", "likes": 0}}, {"topLevelComment": {"author": "Jeremiah Bullfrog", "text": "In my experience, NOSQL is a tinker toy and not useful for any real world scenarios. Sure, an initial design can benefit from these features, but eventually you will need to introduce relationships that don't scale well. So either you layer band-aid upon band-aid, or you re-spin the application with a different data store format. Now maybe therre are some quick-and-dirty utility applications, but are they really better served? Not as much as I have seen.", "likes": 3}, "replies": [{"author": "Jeremiah Bullfrog", "text": "@123 123 Pretty sure they both switched to graph frameworks awhile ago", "likes": 0}, {"author": "123 123", "text": "In my experience you're wrong because Google and Facebook use many NOSQL Databases.", "likes": 0}, {"author": "wenn wenn", "text": "@Pieter Humphrey good to know about Cassendra. Didn't know that. Thanks Pieter", "likes": 0}, {"author": "Pieter Humphrey", "text": "@wenn wenn re: ACID, while it's not needed as often as people think, I agree it's sort of the main job for a DB -- \"hold my data and don't mess it up! :)\".    (Caches like redis excepted).   Note:  full ACID transactions are coming to Apache Cassandra in 5.0 timeframe!", "likes": 0}, {"author": "Pieter Humphrey", "text": "@wenn wenn completely fair point, especially on the relational model / foreign key point.  Denormalizing data (and it's implications for data duplication) can be strange, it was for me at first, I started with spreadsheets, and desktop DBs so the relational model is all I ever knew.   Also, there are a lot of good tools that make working with RDBMS easier or nearly invisible (ORM, etc).      If you think your app will ever scale beyond RDBMS levels, or need to be global / multi-region, it's worth learning other DB models so you don't get stuck with a rewrite later.    Then not only are you learning a new model under pressure, but you have the ETL and migration to deal with as well.", "likes": 0}]}, {"topLevelComment": {"author": "Adnan Hossain", "text": "এমন একটা টীচার পাইলে সারাদিন ওয়েব ডিজাইন শিখতাম। 😶", "likes": 0}}, {"topLevelComment": {"author": "• spacexghost", "text": "Thanks, Ania!", "likes": 3}, "replies": [{"author": "⁺①⑤⑤⑨⑥⑦②⓪⑥④⓪ WHATSAPP", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "sam Arbid", "text": "Any words on backup and restore databases?", "likes": 1}, "replies": [{"author": "whatpp +¹(²⁰¹) ⁵⁶⁴-⁵⁷⁵⁷", "text": "☝️☝️Thanks reaching out to us through commenting On this, Tell Max I referred you to him for a business investment that will change your financial life....", "likes": 0}]}, {"topLevelComment": {"author": "Worldhack.1", "text": "NoSQL is better", "likes": 0}, "replies": [{"author": "Jeremiah Bullfrog", "text": "disagree", "likes": 0}]}, {"topLevelComment": {"author": "Iqbal Singh", "text": "Khalisi...", "likes": 2}, "replies": [{"author": "Code with Ania Kubów", "text": "🐉👑", "likes": 0}]}, {"topLevelComment": {"author": "Code with Guillaume", "text": "Very good comparison. It’s a question that a lot of devs ask 🫲🏻🙏", "likes": 0}}, {"topLevelComment": {"author": "Nayankumar Barwa", "text": "I just started my journey with SQL.", "likes": 9}, "replies": [{"author": "giovanni9107", "text": "Have fun! As part of my job, I do a lot of backend development and designing and querying relational databases can be very satisfying as you get better at it.\nSmall piece of advice: avoid MYSQL if you can, as there are much better free and open source alternatives such as PostgreSQL and even Microsoft SQL Server Express if your app is not too big.", "likes": 1}, {"author": "Nayankumar Barwa", "text": "Pleasse dont ok me    :(", "likes": 0}, {"author": "Josiah Fam", "text": "Ok", "likes": 0}, {"author": "fabatka", "text": "Ok", "likes": 0}]}, {"topLevelComment": {"author": "Vexxer😈", "text": "Love you ania ❤️", "likes": 1}, "replies": [{"author": "⁺①⑤⑤⑨⑥⑦②⓪⑥④⓪ WHATSAPP", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 1}, {"author": "Vexxer😈", "text": "@Code with Ania Kubów big fan ❤️❤️", "likes": 0}, {"author": "Code with Ania Kubów", "text": "❤️", "likes": 1}]}, {"topLevelComment": {"author": "Syrup", "text": "Instant click!!!!!", "likes": 1}, "replies": [{"author": "Code with Ania Kubów", "text": "😍", "likes": 1}]}, {"topLevelComment": {"author": "Feral Cypher", "text": "Watching this now!!  Thanks Ania!!", "likes": 8}, "replies": [{"author": "Feral Cypher", "text": "great content!!  thanks again for the lesson Ania!!", "likes": 0}, {"author": "Code with Ania Kubów", "text": "Thank you!!!", "likes": 1}]}, {"topLevelComment": {"author": "Shardhay Vatshyayan", "text": "Great", "likes": 1}}, {"topLevelComment": {"author": "Abhijeet BADal", "text": "1st", "likes": 1}}, {"topLevelComment": {"author": "ȻօɖɛSɦǟʀᏦ", "text": "Będzie oglądane 👊 Pozdrawiam 🔥", "likes": 1}, "replies": [{"author": "Code with Ania Kubów", "text": "Super!!!", "likes": 1}]}]}