{"video": {"id": "Gaosub7FRf4", "title": "How to Build a Hackintosh - Step-by-Step Guide (Install MacOS Big Sur on PC)", "description": "Save money by building a Hackintosh! Learn how to build a computer with PC parts and install macOS Big Sur using OpenCore.\n\n✏️ Course developed by Beau Carnes.\n\n⭐️ Computer Parts Used ⭐️\n🎉 All of this is close to 1/3rd the price of a Mac Pro with comparable specs!\n🖱 Processor: Core i9 Octa-core i9-9900K | https://amzn.to/3u4n17T\n🖱 Motherboard: Asus ROG Strix Z390-E Gaming Motherboard | https://amzn.to/2R3PX17\n🖱 Graphics card: Sapphire Radeon 11265-05-20G Pulse RX 580 8GB | https://amzn.to/3e7x5aN\n🖱 Ram: HyperX Fury 32GB 3200MHz DDR4 | https://amzn.to/2QyQEji\n🖱 Solid State Drive: Sabrent 2TB Rocket NVMe PCIe M.2 2280 | https://amzn.to/3gKD9HO\n🖱 Case: NZXT H510 | https://amzn.to/3aKAudi\n🖱 Power supply: Corsair CX Series 650 Watt | https://amzn.to/3vx4Zez\n🖱 CPU water cooler: Cooler Master MasterLiquid ML240L RGB V2 | https://amzn.to/3vus9Co\n🖱 Wifi / Bluetooth Card: MQUPIN Wireless PCI-E Card, Fencvi T919 | https://amzn.to/3wU98Kt\n🖱 Monitor: LG 27UN850-W 27 Inch Ultrafine UHD | https://amzn.to/3gLyrcH\n🖱 Trackpad: Apple Magic Trackpad 2 | https://amzn.to/3nz80s1\n🖱 Ethernet cable: https://amzn.to/3aRI31M\n\n🔗 More about the legality: https://dortania.github.io/OpenCore-Install-Guide/why-oc.html#legality-of-hackintoshing\n\n🔗 Learn how to create the USB installer in Windows instead of macOS: https://dortania.github.io/OpenCore-Install-Guide/installer-guide/winblows-install.html#making-the-installer\n\n⭐️ Resources Referenced in Video ⭐️\n🔗 OpenCore Install Guide: https://dortania.github.io/OpenCore-Install-Guide/prerequisites.html#prerequisites\n🔗 Hackintosh compatible hardware / parts: https://dortania.github.io/OpenCore-Install-Guide/macos-limits.html\n\nSoftware needed:\n🔗 OpenCore: https://github.com/acidanthera/opencorepkg/releases\n🔗 ProperTree: https://github.com/corpnewt/ProperTree\n🔗 MountEFI: https://github.com/corpnewt/MountEFI\n🔗 OC-Gen-X: https://github.com/Pavo-IM/OC-Gen-X/releases\n\n💻 Command to make bootable installer for macOS Big Sur:\nsudo /Applications/Install\\ macOS\\ Big\\ Sur.app/Contents/Resources/createinstallmedia --volume /Volumes/MyVolume\n🔗 Find the commands for other versions of macOS here: https://support.apple.com/en-us/HT201372\n\n🔗 Links for SSDTs (make sure to select the correct processor type): https://dortania.github.io/Getting-Started-With-ACPI/ssdt-methods/ssdt-prebuilt.html\n\n💻 Device Properties for Coffee Lake:\nPciRoot(0x0)/Pci(0x2,0x0)\nAAPL,ig-platform-id    07009B3E\nframebuffer-patch-enable    01000000\nframebuffer-stolenmem    00003001\n\n💻 Boot-args:\n-v keepsyms=1 debug=0x100 alcid=1\n\nprev-lang:kbd    en-US:0\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00) Introduction\n⌨️ (2:48) Part 1 - Building the computer\n⌨️ (43:36) Part 2 - Installing macOS Big Sur\n\nProduct links are affiliate links.\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Wong Voon jinq\n👾 hexploitation\n👾 Katia Moran\n👾 BlckPhantom\n👾 Nick Raker\n👾 Otis Morgan\n👾 DeezMaster\n👾 Treehouse\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H6M48S", "likes": "6704", "views": "316959"}, "comments": [{"topLevelComment": {"author": "Beau Carnes", "text": "It was fun building this Hackintosh! The performance is slightly lower than a comparable Mac but the price is WAY lower. Here is the best part: 43:08", "likes": 337}, "replies": [{"author": "العقرب الأحمر اسرار الاسياخ والقطبيه الاستشعارية", "text": "See my comment and replay because this video not perfect answer for 99.9999% people\nWhen you see my comment you will know why", "likes": 0}, {"author": "Indratej Reddy", "text": "@Ethan Hunter I'm ur dad so yes some part of me is you which is why you is me because I'm you your me so together your a meme", "likes": 0}, {"author": "Codefactory", "text": "Cant it run xcode", "likes": 0}, {"author": "Haggai Akumbom", "text": "cool thanks", "likes": 0}, {"author": "Anthony Walker", "text": "@1qq@Indratej Reddy", "likes": 0}]}, {"topLevelComment": {"author": "العقرب الأحمر اسرار الاسياخ والقطبيه الاستشعارية", "text": "You didn't do something good for everyone\nWhere is adding our driver?\nI thought you will explain about making macos about convert drivers from windows to macos or something like that\nYou make lost my time when watching you\nI think building macos thats mean creating devies too for our pc\nWhere is (how build your drivers)?\nI have dell Inspiron 5570 kabylake\nI install and everything but drivers not working so nothing with your experience in this video good for all people\nThe important things didn't explain it \nAm waiting what you will answer me", "likes": 0}}, {"topLevelComment": {"author": "Bíblia Sagrada Online", "text": "Is Steve Jobs teaching to create a hackintosh?", "likes": 0}}, {"topLevelComment": {"author": "Muna M", "text": "Your Au English pist me off .", "likes": 0}}, {"topLevelComment": {"author": "Apichart DeepImpact", "text": "Great guide. I've tried many other guide before and always got stuck somewhere earlier than yours. I have only 1 problem though. At 56:38 on this video, I follow the instruction to change prev-lang:kbd to en-US:0 as string (also tried changing it with Data and use the HEX number provided in the manual). But the boot screen always show up in Russian language which I have no clue. I think I can manage to get the HDD format and continue installing, but very certain that if I kept going like this I will end up having to fill in user name etc. in Russian. So I decided to stop and come here to ask first. This post is over a year old, I suspected that things might have changed by now.\n\nAgain, thank you for the video, it help me get to the point I've never be able to before.", "likes": 0}}, {"topLevelComment": {"author": "Catalin Cazacu", "text": "Is it working with I7 ? Can all the preparing files be done on windows if we dont have a MAC available ?", "likes": 0}}, {"topLevelComment": {"author": "Catalin Cazacu", "text": "Right this is basics of building a computer. The problem is how you download big sur if u dont have a mac already ? All the tutorials I saw nobody post any link for download the OS .", "likes": 0}}, {"topLevelComment": {"author": "jamaican", "text": "he looks alot like a young steve jobs", "likes": 0}}, {"topLevelComment": {"author": "Dsmitti", "text": "Will this work with Monterey in 2022?", "likes": 0}}, {"topLevelComment": {"author": "Travis Lohmann", "text": "I so wanna give this a go on my laptop- an Eluktronics gaming laptop; would this work for that. Additionally- what if you wanted to boot into Windows from time to time, how would that work?\nGreat video!", "likes": 0}}, {"topLevelComment": {"author": "Chipper Levy", "text": "\"click on the magnifying glass, click on the--\" Cmd+(Space) is so much better", "likes": 0}}, {"topLevelComment": {"author": "inraid", "text": "43 minutes wasted on discussing hardware that is    \nlargely irrelevant to building a Hackintosh. It is the      \nsoftware part that is more complex and that really   \nmatters. The hardware could have been covered   \nin 5 minutes. The background soundtrack is very \nannoying and detracts from the presentation.", "likes": 1}, "replies": [{"author": "StarFox", "text": "Also 43 minutes wasted when he says you need a Mac to do this....Should have said this in the first 20 seconds of the video. Thanks for nothing.", "likes": 0}]}, {"topLevelComment": {"author": "TRUSTEE", "text": "Stuck at end random seed 😢then pc restarts", "likes": 0}}, {"topLevelComment": {"author": "BaTTx ", "text": "apfs_module_start:2487 and it hust hangs", "likes": 0}}, {"topLevelComment": {"author": "josphat karanja", "text": "wow!!!! Awesome!!! Happy are Those.....", "likes": 0}}, {"topLevelComment": {"author": "vinnie ng", "text": "thanks, I am not too old to learn it but you are too old to post it and you should teach and post 20 yrs ago ?", "likes": 0}}, {"topLevelComment": {"author": "Jessie James", "text": ".....you use to build computers? your joking right ?", "likes": 0}}, {"topLevelComment": {"author": "Jessie James", "text": "....does that even support Intel still ?", "likes": 0}}, {"topLevelComment": {"author": "N2LRB", "text": "I'd gladly pay someone to do all this. There is just too much that can go wrong with either buying the parts, putting it together and all the software one has to know about and use. I did buy a Mac Mini two weeks ago and took it back to the retailer yesterday. It did weird things (gray screen), reboot by itself. Thanks for the video. And Dude!! get a box cutter. No one uses scissors to open boxes, well not in my age group, LOL.", "likes": 0}}, {"topLevelComment": {"author": "nikolina radecic", "text": "how to shut down a computer with Catalina installed.", "likes": 0}}, {"topLevelComment": {"author": "Ryan J.", "text": "I've been thinking about doing this for a while I have an intel core i9 12900K and RTX 3080 Ti (3.5TB) of storage and 32GB of RAM would my specs work with macOS Big Sur? also just to point out I had the 9900K for 3 years that cpu runs hot also that NZXT case didn't get the best reviews for thermals/airflow but it shouldn't be too bad... also I would have top mounted the rad but that's just my pref, Anyways i'm rambling great video :)", "likes": 0}}, {"topLevelComment": {"author": "k", "text": "No idea why I watched the whole video.", "likes": 0}}, {"topLevelComment": {"author": "Mike Medina", "text": "Hi, I'm getting a blank display in opening config.plist in python3? I followed your instructions carefully.  Please help. Thanks.", "likes": 0}}, {"topLevelComment": {"author": "TCP TECH", "text": "Any Update About intel Xe Graphics and tigerlake", "likes": 0}}, {"topLevelComment": {"author": "Virtualbox Tutorials", "text": "looks so Dope!", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Sherif", "text": "awesome, tnx lady :>", "likes": 0}}, {"topLevelComment": {"author": "Codefactory", "text": "Cant it run xcode", "likes": 0}}, {"topLevelComment": {"author": "Jonatan Tisnado", "text": "Thanks Beau!", "likes": 1}}, {"topLevelComment": {"author": "lee Fish", "text": "There's too much steps to build a hackintosh , maybe buy a real mac is a better idea.", "likes": 0}}, {"topLevelComment": {"author": "GaffGaming", "text": "You can emulate a mac on pc using VMWare with a patch for the \"mac os required\" step.", "likes": 0}}, {"topLevelComment": {"author": "MacTechNexus", "text": "i never expected a video like this to come from FCC", "likes": 0}}, {"topLevelComment": {"author": "Haggai Akumbom", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Tom Sid", "text": "I have a fairly older intel system (i7-4790 + gtx760). Will this be able to run the new version of MacOS? If not, what version can I update to instead? \nI attempted a hackintosh with this system back in 2015 but could never get the darn audio drivers to work. (I believe that was macOS yosemite + unibeast).", "likes": 0}}, {"topLevelComment": {"author": "Игрок Онлайн", "text": "iphone X ios hello screen bypass, after it will have network(with signal)?", "likes": 0}}, {"topLevelComment": {"author": "Peter A Edwards", "text": "@Beau Carnes, never use those horrid transport cable ties use velcro adjustable ties, due to the possibility of them breaking and potentially damage a rather expensive build.", "likes": 0}}, {"topLevelComment": {"author": "Ze Caveman", "text": "Yes my friend", "likes": 0}}, {"topLevelComment": {"author": "Surafel Tariku", "text": "thank you straight to the point", "likes": 0}}, {"topLevelComment": {"author": "মোস্তাফিজুর", "text": "G video", "likes": 0}}, {"topLevelComment": {"author": "StoryBoard", "text": "Great video shame parts memtioned are unavilable at present on amazon", "likes": 0}}, {"topLevelComment": {"author": "Magic Productions", "text": "Hi, any one got an issue with Sapphire RX 580? I used an MSI Z390 Pro Carbon and after the system start it freeze everything! if I disconnect the graphics card all works no freeze. any help please", "likes": 0}}, {"topLevelComment": {"author": "Chris Banana", "text": "@30:15 O.o why install the CPU cooler with the case positioned up... lay the dang thing down..... you remove EVERY bad thing about installing it standing up. And you gain NOTHING by installing it up.... :(", "likes": 0}}, {"topLevelComment": {"author": "pointlesspos", "text": "Can i build as a VM on a windows 10 computer?", "likes": 0}}, {"topLevelComment": {"author": "Magic Productions", "text": "Thank you for sharing your knowledge, my only concern is the fans direction is wrong, I checked MasterLiquid ML240 documentation, it's never mentioned the way you did, I'd love to hear your logic by mounting them the other way around ;) thx", "likes": 2}, "replies": [{"author": "Magic Productions", "text": "Actually I did more research :))) it depends on how many fans you got for extract vs exhaust, since we got already 2 exhaust came with the case NXZT it make sense to install the radiator once as extract to create the balance ⚖️. And it doesn’t affect radiator cooling it’s the same performance.👍🏾", "likes": 1}]}, {"topLevelComment": {"author": "3rdpoly", "text": "I have a pc running win 11, can I create an hackintosh by installing it to a seperate drive on the computer and then just select which to boot from on startup? Monterey OS.", "likes": 0}}, {"topLevelComment": {"author": "TheCladWookie", "text": "How did you just do that, GPU 4 times in a row without even noticing.", "likes": 0}}, {"topLevelComment": {"author": "TheCladWookie", "text": "Phuck Apple.  Everytime someone brings an Mac to me for repair I secretly punch it when they're not looking.", "likes": 0}}, {"topLevelComment": {"author": "stanley smith", "text": "Nice PC build!", "likes": 0}}, {"topLevelComment": {"author": "Paul Patena", "text": "I downloaded macOS Monterey because BigSur is no longer available. When I tried mounting the EFI and choosing the usbDisk, it says no EFI partitions found. Any ideas?", "likes": 0}}, {"topLevelComment": {"author": "shailesh parvatia", "text": "Hi!\nA good tutorial indeed! Thanks a lot.\n\nBy following the steps, when I have click to generate EFI, the OC Gen-X software closed without popping the any massage and, all the folders in EFI are empty.\n\nWhat has been gone wrong??\nPlease help me by your valued reply.\nx", "likes": 0}}, {"topLevelComment": {"author": "Bradley JC", "text": "Do you use After Effects on this hack? If so, how does it handle?", "likes": 0}}, {"topLevelComment": {"author": "Pizza inc.", "text": "“Here’s the GPU and speaking of GPUs here is an intel core i9 GPU”\n**visible annoyance**", "likes": 0}}, {"topLevelComment": {"author": "Mladen Denni", "text": "hay man does this applys to Mac OS Monterey?", "likes": 0}}, {"topLevelComment": {"author": "Anti Maling", "text": "napependo orang mau lihat cara detail instalnyya bukan you pamer isi desktop, lebih lama habis waktu liat kau pamer deskto kupretlaso video ga guna kau ;laso tai", "likes": 0}}, {"topLevelComment": {"author": "Saeed Umer", "text": "So I downloaded the big sur but after the download was completed it prompted me to install it, so i installed it on my usb drive. \n\nCan anyone please guide me for the steps, how to just keep big sur just as a installer rather than installing it", "likes": 0}}, {"topLevelComment": {"author": "hyperpuppy2", "text": "Is it safe to use your actual apple ID on a hackintosh", "likes": 0}}, {"topLevelComment": {"author": "Qwerty Poiuyt", "text": "Almost everywhere it would be illegal to sell a hackintosh you are taking stuff from Apple and pretty much selling it as your own creating a profit plus if its not illegal you can bet as soon as Apple hears about it you're getting sued", "likes": 0}}, {"topLevelComment": {"author": "Scott Rodd", "text": "Hi @FreeCodeCamp - I've built this exact Hackintosh Build and have created the USB Installer for installing MacOS. I've made it up to 59:00 minute mark of this video where I do get the \"Secure Boot Violation\" error. Upon attempt to Clear Secure Boot Keys and selecting Yes, I receive an error message that the \"Secure Variable Update is locked down, try again after System reboot\". I have tried troubleshooting through this message for past two weeks, but have been unsuccessful. Any idea on how to resolve this message? All of my BIOS Settings have been configured and tweaked to how video/guide demonstrates, with the exception of being able to clear boot keys.", "likes": 0}}, {"topLevelComment": {"author": "Vihaan Deo", "text": "What is the total price please tell", "likes": 0}}, {"topLevelComment": {"author": "Richard Cave LBPPA", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Elbay Malik", "text": "I have a question. Can I use MacOS in virtual machine on a Windows (using VMWare) to perform the OC Gen-X part of the procedure?", "likes": 0}}, {"topLevelComment": {"author": "TheDudewithDaMacbook.", "text": "Say, Does this work with EVERY Mac OS ? Or just Big Sur ?", "likes": 0}}, {"topLevelComment": {"author": "Origenic", "text": "This is a great guide, very easy to follow.  I find some guides a bit confusing when steps aren't explained fully.  Would I be able to run the same steps for Monterey?  Or can I install Big Sur and then run the update?  or would that break the installation?", "likes": 2}}, {"topLevelComment": {"author": "Island Cave", "text": "Know people who have a mac, already a non starter for me.", "likes": 0}}, {"topLevelComment": {"author": "Ratchet", "text": "I'm following your guide but stuck on two thing (I'm installing macos Monterey):\n1- If I erase hard drive choose APFS, the installer say the error: You can't using APFS, you need to format to Mac OS Extended Journaled.\n2- I formated the drive and complete install in recovery mode but after pc restart it goto black screen and shutdown. I'm try another macos big sur , error still the same as monterey.\nCan you help me fix this. Thanks", "likes": 0}}, {"topLevelComment": {"author": "CyderEyes X", "text": "Question: Once we install everything the PC will be updating to the last updates like a normal MAC PC?", "likes": 0}}, {"topLevelComment": {"author": "JoeW", "text": "Problem: I only do have a Intel x86 PC for installing! No Apple Hardware around! 😵‍💫", "likes": 0}}, {"topLevelComment": {"author": "ZohnnyBravo", "text": "How stupid this lighting case inside is!", "likes": 0}}, {"topLevelComment": {"author": "Anand Gupta", "text": "Z290E doesn't seem to be available. Any other motherboard choices ?\n\nBtw thanks for taking the time to explain and for such a detailed how-to.", "likes": 1}}, {"topLevelComment": {"author": "Mateusz Wilk", "text": "Should I hide hackintosh information from my employer?", "likes": 0}}, {"topLevelComment": {"author": "Pierre", "text": "I really hope you see this soon!\nI followed your instructions to do this on windows and it boots OK but it asks me to turn on the Mac keyboard and mouse at the start of the install and I can’t proceed further.\n\nAny ideas??", "likes": 0}}, {"topLevelComment": {"author": "KRISHNANDU RANJN ROY", "text": "The tutorial is helpful but I'm unsuccesfull to install macos in my windows laptop. Can anybody help me to install it.? PLEASE....", "likes": 0}}, {"topLevelComment": {"author": "Michel", "text": "Nice job! So does the CPU water cooler run fully automatic or can it be controlled somehow?", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Hassan Noordin", "text": "I have a hard drive with mac os which i took out from an imac. Can i build a hackintosh with it?", "likes": 0}}, {"topLevelComment": {"author": "Michel", "text": "Unfortunately OC Gen-X does not run on my current Sierra 10.12.6, it needs at least 10.13. \nI guess I have to do it the hard way via the OpenCore Install Guide.", "likes": 0}}, {"topLevelComment": {"author": "nikant sharma", "text": "Will it lead to an error if I use the Z390 F gaming instead of the E gaming ?\n\nEven the motherboard available is a 5ghz and not 3.6GHZ \n\nLet me know, thank you soo much ! :)", "likes": 0}}, {"topLevelComment": {"author": "Richard S", "text": "Everything went well until after Big Sur was installed.  I found that it won't boot unless I do it through the USB stick.  Even bios doesn't recognize the Big Sur drive as bootable.  Any help would be appreciated.  Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Rushikesh Mahajan", "text": "Wrong command", "likes": 0}}, {"topLevelComment": {"author": "Jacob", "text": "did not work just booted me back to windows", "likes": 0}}, {"topLevelComment": {"author": "Pastran 416", "text": "hi there, I´ve tried this method but I cant get to work, i made the installer as you show but when i boot it, is passes the verbose and then on my screen appears: \"no signal\" i´ve tried patching the iGPU graphics but it remains \"no signal\" on my screeen instead of the apple logo, my specs: Intel Core i7-10700K Asus Prime z590P, M.2 Seagate 500gb, Corsair Vengueance Pro 32gb\r\ncould you help me to solve this problem in order to achieve installing macOS in my System? please (I´m trying to install BigSur or Monterrey)", "likes": 0}}, {"topLevelComment": {"author": "Bond I Agent 007", "text": "It should  be 32 GB of RAM mentioned at 4:30 😜", "likes": 0}}, {"topLevelComment": {"author": "MrMilanina", "text": "I have a Win PC which has few disks. Is there a way to install this on D disk currently used by Windows (Windows installed on C: of course) and have a dual boot?\nI wouldn't like to go this route and lose my current Windows.", "likes": 0}}, {"topLevelComment": {"author": "lim karhau", "text": "what password require in video 45:38", "likes": 0}}, {"topLevelComment": {"author": "Ilham Hamdani", "text": "Awesome video, any exprience use hackintosh for ios development ? What common problem ?", "likes": 0}}, {"topLevelComment": {"author": "moe v", "text": "This is so dope.!!", "likes": 0}}, {"topLevelComment": {"author": "Dave Storm", "text": "Looks like HP EliteDesks can't boot from a USB in UEFI mode - so this is not possible (since you can't install MacOSX in Legacy). Ugh! 2 days shot to hell. Figures (my 3rd attempt at a hackintosh - installing from a USB drive just doesn't seem to work no matter the BIOS settings on HP and Dells)", "likes": 0}}, {"topLevelComment": {"author": "Doc Daven", "text": "You cannot download Big Sur nor any MAC OS from the App Store!  What's the secret magic trick?", "likes": 0}}, {"topLevelComment": {"author": "SAMA", "text": "My monitor goes to sleep everytime i boot usb", "likes": 0}}, {"topLevelComment": {"author": "Alden Latif", "text": "u are talking too much.", "likes": 0}}, {"topLevelComment": {"author": "loot6", "text": "How to install MacOS on pc \"First of all, you need a Mac\".....ok good start lol...", "likes": 0}}, {"topLevelComment": {"author": "Dicas de MacOS, Linux,  Windows e Android", "text": "A Big Sur hackintosh is a piece of cake, what about a Intel Haswell Monterey Hackintosh?", "likes": 0}}, {"topLevelComment": {"author": "fioletowa.samara", "text": "Hi I've been wondering, does it make sense to install big sur as a nvidia user without drivers? I want to use it mostly for web browsing and occasional use of logic pro", "likes": 0}, "replies": [{"author": "MadeOnEarth", "text": "Last NVIDIA drivers are for 10.13 High Sierra, im using one GTX 1060 6gb no problem's (full metal and quick sync activated) my specs are i7 7700k + 16gb ram + GTX 1060 6gb + 2x Samsung 256gb SSD, it works like a dream since 2017!", "likes": 2}]}, {"topLevelComment": {"author": "Junior Brasil", "text": "I followed all the steps carefully in this video, however, after booting from the pendrive, the machine loads all that step of the black screen with several commands executed and after that the machine simply sleeps, the monitor goes off, the machine remains on and nothing happens after of this... has anyone been through this? I have tested it on several different USB ports(USB2.0, 3.0) and the behavior is the same.\r\nSettings:\r\nMotherboard: Asus Prime H370-plus\r\nProcessor: Intel Core i7 8700 Coffee Lake\r\nRAM memory: 16GB Corsair DDR4 PC4-19200 (2x 08GB Modules)\r\nGPU: (Integrated) Intel UHD Graphics 630 Coffee Lake-S GT2\r\nSSD: Kingston SA400S37240G\r\nAudio: (Integrated) RealTek ALC887 / Intel Cannon Lake-H/S cAVS\r\nNetwork: (Integrated) RealTek RTL8168/8111 PCI-E Gigabit\r\n\r\nHas anyone experienced the same problem?", "likes": 1}, "replies": [{"author": "Giorgos Batista", "text": "That exactly happened to me, but I don't know what to do.. :(", "likes": 0}]}, {"topLevelComment": {"author": "Sunil Krishnan", "text": "I made USB stick for Monterey using createinstallermedia command, EFI partition mounted using opencore configurator and I ejected EFI partition by mistake thinking it was System EFI. Now I'm trying to mount the EFI partition. MountEFI says there's no partition associated with the disk. Opencore configurator is not recognizing EFI partition of the USB stick too.\nAny solution for this?", "likes": 0}}, {"topLevelComment": {"author": "JTaRzAn91", "text": "I knew this guy was a hack once I seen the position of his aio and RAD , rip that pump", "likes": 0}}, {"topLevelComment": {"author": "Best Film", "text": "OC-Gen-X seems like a great idea in theory, but the app itself is a disaster. It crashed without generating an EFI and plist on every system I tried.", "likes": 0}}, {"topLevelComment": {"author": "nona xatiashvili", "text": "I have a constantly changing mac address because of which I cannot configure the Internet with my provider. How to prevent the poppy address from changing?", "likes": 0}}, {"topLevelComment": {"author": "Cruz Gamboa", "text": "i cant get the command part, it fails", "likes": 0}}, {"topLevelComment": {"author": "Dani Harris-Walters", "text": "At 1:01:55 -  I get stuck a apple logo progress bar not even started. Any solutions?", "likes": 0}}, {"topLevelComment": {"author": "Dimitris Roumeliotis", "text": "Ηι, Oc Gen-X, does not make the efi folder to the desktop, i have mojave hackintosh installed, is there an alternative way or a fix to that?", "likes": 0}}, {"topLevelComment": {"author": "PianoMan", "text": "why didn't a config.plist file not show up on my efi folder?", "likes": 0}}, {"topLevelComment": {"author": "666Maeglin", "text": "Just love the extremely low level of technology explanation in your build section..Definitely aimed at the average mac user.. 😀", "likes": 0}}, {"topLevelComment": {"author": "Ron Westerduin", "text": "Thanks, got it to work with this great tutorial!!", "likes": 0}}, {"topLevelComment": {"author": "Adam Fann", "text": "Will OS monterey work on this build?", "likes": 1}}, {"topLevelComment": {"author": "Ayesha Perera", "text": "Hello ,\n\nthanks for this valuable guide . But when i try to install the OS after creating the bootable drive.my mouse and keyboard stops working (mac os boots and come to the installation window then mouse and keyboad not working).  Do you have any idea on how to fix this ?", "likes": 0}}, {"topLevelComment": {"author": "Paul Robinson", "text": "you can use windows to make a mac usb you dont need a mac", "likes": 0}}, {"topLevelComment": {"author": "Maserati Nation", "text": "Can you make a video on how to use USB Port Mapper? My DAC Ports do not work!", "likes": 0}}, {"topLevelComment": {"author": "Hannah Millington", "text": "If I already have Mojave installed on Hackintosh, can I just boot from the USB and install?", "likes": 0}}, {"topLevelComment": {"author": "Bob Griswold", "text": "Where is the Download file link\n for the Mac Big Sur", "likes": 0}}, {"topLevelComment": {"author": "ShadowTheTypo", "text": "I'm Getting a error when trying to boot from the USB.    IOUSBHostDevice:start_block_invoke:Device will not be registered for matching", "likes": 1}}, {"topLevelComment": {"author": "MUHAMMAD RAMZAN", "text": "You rock beau", "likes": 0}}, {"topLevelComment": {"author": "Chakvi Mandeer", "text": "After install mac os BigSur option it loops back after some output o  screen and restart again", "likes": 0}}, {"topLevelComment": {"author": "akash gupta", "text": "i running bid sur  hackintosh on [i5 10400 ]. but i want to run mojave it possible", "likes": 0}}, {"topLevelComment": {"author": "64Bit_Games", "text": "I cannot figure out how to download Big Sur? My MacBookPro M1 is already running Big Sur so the option isn't there for me?", "likes": 0}}, {"topLevelComment": {"author": "Anand Gupta", "text": "Is there any other compatible graphic cards which can be used ?", "likes": 0}}, {"topLevelComment": {"author": "guitar Shred8", "text": "Hello , I just wanna say my outmost aapreciation in job well done. the other videos took me a week without success . kudos to you and the 43.08 unveiling . Anyway, I don't know if you have solution. on this one , it's on me , lol . the EFI did not attach when I installed the macos big Sur, that I cannot remove my usb , if I removed it , it will not boot. very strange . I'm trying to review what I did wrong .. thanks again.", "likes": 0}}, {"topLevelComment": {"author": "Erik Fox", "text": "...omg, i had a hackintosh for 5 years now im on catalina cant upgrade to big sur..multibeast method was sooo easy to do, now this is a rocket science for me, tried once and i had to go back to catalina..it didnt work at all.....so much work with the new install of big sur...im gonna save some money and buy a m1 macmini...😞", "likes": 0}}, {"topLevelComment": {"author": "Chris", "text": "So if I build a hackintosh it will always get updates to each and every new version of Mac OS? Forever? So it’s a cheaper way to have a Mac as long as it lasts? Wow I’m going to get right on that….", "likes": 0}}, {"topLevelComment": {"author": "Blockchain Breakdown", "text": "Total cost is roughly 2,885 However the Wireless PCI-E Card is no longer available..\nAny other recommendations as a replacement?", "likes": 0}}, {"topLevelComment": {"author": "Harsh Raj", "text": "oc grabbed zero system-id for sb facing this error", "likes": 0}}, {"topLevelComment": {"author": "Outlaw Music", "text": "Wow, your the best!! Ive been doing this since Mac \"Leopard\" and this is the first time I go thru the process without a single hiccup. Your the best!! thank you for taking the time to share your knowledge. Allot of people don't realize the frustrations and sleepless nights in front of the computer... for hours... it may have taken you to figure it all out. Plus the time it took you to make the video and edit it. All they see is the finished product, your perfectly well done flawless video. Excellent work bud! Much appreciated.", "likes": 15}, "replies": [{"author": "Jessie James", "text": "its not hard when you buy the correct hardware.", "likes": 0}]}, {"topLevelComment": {"author": "SHIVA KUMAR", "text": "U r Amazing Bro... Thanks a ton", "likes": 0}}, {"topLevelComment": {"author": "Stelian Turcu", "text": "Nice video, but the AIO radiator installed in front of the case is a no go, especially when the top of the radiator is aligned with the cpu.", "likes": 0}}, {"topLevelComment": {"author": "teck 648", "text": "can i install this on 4gb ram pc bigsur specifications - intel core i3-5005U ,4gbDDR3, 256 ssd architecture 64-bit Broadwell, intel wireless ac 3160, intel graphics 5500. I am a home user do not need very high performance just simple and smooth performance like windows .Please tell will it work?", "likes": 0}}, {"topLevelComment": {"author": "TheLordstrider", "text": "Amazing guide but to the point of using OC-Gen-X. sadly this app keeps crashing as soon as i click generate EFI. the EFI folder is created but there is no. Plist inside. the error message is like highway long so... guess i give up. Used on Virtualbox Bigsure OS.", "likes": 0}}, {"topLevelComment": {"author": "xViZUET", "text": "I have the exact same specs as you, is there a way you can share everything to download? I am scared to do everything and get something wrong.", "likes": 0}}, {"topLevelComment": {"author": "Malik Brock", "text": "Too bad I have an 11th gen i7 processor so my architecture is Rocket Lake and it wasn’t on the list.", "likes": 0}}, {"topLevelComment": {"author": "Manvendra Singh", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "MURALEEDHARAN KARUMATHIL", "text": "Hell - Thanks for the guide. I need some help - i have a Dell Optiplex 9010 with the following cnfig. ocket 1\t\t\tID = 0\r\n\tNumber of cores\t\t4 (max 4)\r\n\tNumber of threads\t8 (max 8)\r\n\tManufacturer\t\tGenuineIntel\r\n\tName\t\t\tIntel Core i7 3770\r\n\tCodename\t\tIvy Bridge\r\n\tSpecification\t\tIntel(R) Core(TM) i7-3770 CPU @ 3.40GHz\r\n\tPackage (platform ID)\tSocket 1155 LGA (0x1)\r\n\tCPUID\t\t\t6.A.9\r\n\tExtended CPUID\t\t6.3A\r\n\tCore Stepping\t\tE1/L1\r\n\tTechnology\t\t22 nm\r\n\tTDP Limit\t\t77.0 Watts\r\n\tTjmax\t\t\t105.0 °C\r\n\tCore Speed\t\t3893.5 MHz\r\n\tMultiplier x Bus Speed\t39.0 x 99.8 MHz\r\n\tBase frequency (cores)\t99.8 MHz\r\n\tBase frequency (ext.)\t99.8 MHz\r\n\tStock frequency\t\t3400 MHz\r\n\tInstructions sets\tMMX, SSE, SSE2, SSE3, SSSE3, SSE4.1, SSE4.2, EM64T, VT-x, AES, AVX\r\n\tMicrocode Revision\t0x21\r\n\tL1 Data cache\t\t4 x 32 KB (8-way, 64-byte line)\r\n\tL1 Instruction cache\t4 x 32 KB (8-way, 64-byte line)\r\n\tL2 cache\t\t4 x 256 KB (8-way, 64-byte line)\r\n\tL3 cache\t\t8 MB (16-way, 64-byte line)\r\n\tMax CPUID level\t\t0000000Dh\r\n\tMax CPUID ext. level\t80000008h\r\n\tFID/VID Control\t\tyes \n\nThe installation exists immediately launching the installer wuth exit cide as follows: \n#[EB.LD.OFS|OPEN!]Err(0xE) <\"usr\\\\standalone\\\\OS.img.root_hash\">\n#[EB.RH.LRH|P! Err(0xE) <-EB.LD.LF\n#[EB.BST.FBS|!] Err(0xE) <- EB.RH.LRH\n#[EB.B.WFDW|!WF] Err(0xE) 0\n#[EB|LOG:DT] 2021-09-06T08:46:14\n#[EB|LOG:EXITBS:START] 2021-09-06-T08:46:14 \n\nI used Intel Q370 EFI for booting with clover.\n\nAny clues on this error?", "likes": 0}}, {"topLevelComment": {"author": "bluecement", "text": "Lol @ Videotaping .... One of those anachronistic words", "likes": 0}}, {"topLevelComment": {"author": "Hardik Shah", "text": "Nice one bro, the installation is working smooth. thanks for sharing 🙂", "likes": 5}}, {"topLevelComment": {"author": "Swapan Shridhar", "text": "Getting: \"IOconsoleUsers:GIOScreenLockState 3\" and after that black screen and no video signal. Any idea on what to do ?", "likes": 0}}, {"topLevelComment": {"author": "Varun Gupta", "text": "*CPU* i5 10400\n*M/B* Gigabyte H410M H V2\n*RAM* 8gb DDR4 DRAM 2666MHz CMK16GX4M2A2666C16\n*NVME* A2000 kingston NVMe SSD 500GB\n*SMPS* corsair 450w\n*CABINET* ANT Esports 211tg\nis it good? for windows dualboot big sur", "likes": 0}}, {"topLevelComment": {"author": "Márcio Biaso", "text": "nice video! thanks!", "likes": 0}}, {"topLevelComment": {"author": "Hoopler Nono", "text": "Didn't worked ,Lenovo  V520(10NK) Big Sur, image from MacAir M1 processor", "likes": 0}}, {"topLevelComment": {"author": "MADHURI RAMASHANKAR", "text": "What graphic card are you using?", "likes": 0}}, {"topLevelComment": {"author": "R L", "text": "My macbook pro has an M1 chip which I don't see listed.", "likes": 0}}, {"topLevelComment": {"author": "Robert Underwood", "text": "Question: when you have this installed can you continuously update the software? Does the hackintosh treat it like a valid mac to where I can get the new software updates or will I always have to keep it on the software version I installed?", "likes": 0}, "replies": [{"author": "Nishchal Visavadiya", "text": "@Robert Underwood yupp", "likes": 0}, {"author": "Robert Underwood", "text": "​@Nishchal Visavadiya Oh, So do I need need to reconfigure a hackintosh for every update of macos? Not that I would need to at first, but would eventually want to.", "likes": 0}, {"author": "Nishchal Visavadiya", "text": "@Robert Underwood yes it makes your hackintosh outdated so you have to update newr version of macos as those rolls out", "likes": 0}, {"author": "Robert Underwood", "text": "@Nishchal Visavadiya Wow, I did not know that... From a security perspective would that make your mackintosh more vulnerable to threats if you don't have your system updated?", "likes": 0}, {"author": "Nishchal Visavadiya", "text": "you will get the software updates on your hackintosh but upon installation of those updates some/all functions of you hakintosh break or even worse your hackintosh may not even boot up and you just need a fresh installation of hackintosh again, so don't ever update the hackintosh ever when you get the prompt saying update available.\ni have broke my usb ports due to this silly mostake ; )", "likes": 0}]}, {"topLevelComment": {"author": "dogus sayilir", "text": "I can't boot. any one could hep me? please.", "likes": 0}}, {"topLevelComment": {"author": "No Name sabekuzzaaman", "text": "hello can anyone pls tell me  ???? NVIDIA GeForce GT 1030 ?  This gpu is supported for macosx install process ???", "likes": 0}}, {"topLevelComment": {"author": "Darkwolf Mac Malayalam", "text": "for മലയാളം  Darkwolf mac malayalam", "likes": 0}}, {"topLevelComment": {"author": "Jeff Strong", "text": "My Hackintosh was unique:  MacOS Performa 640CD with a 601/100 running Classic MacOS 8.2 or MacOS X 10.2.8 AND Win10 on its internal amd 586dx4/100 PDS card!", "likes": 0}}, {"topLevelComment": {"author": "Suneel XD", "text": "Steve job destroying his own career via tutorial", "likes": 0}}, {"topLevelComment": {"author": "Rix Fbb", "text": "while in installation proses do u need a net connection ?", "likes": 0}}, {"topLevelComment": {"author": "unintension", "text": "What was the total cost?", "likes": 1}}, {"topLevelComment": {"author": "Lolo Bluemler", "text": "will this run with UAD PCIe cards, or with RME audio PCIe cards?", "likes": 0}}, {"topLevelComment": {"author": "Jonathan Gery", "text": "Fantastic Guide. I was successful repurposing a HP z240 Desktop, i7-6700, 32gb ram, 512gb NvME, and the help of your guide installing the latest macOS 11.5.1. Working so smoothly, Next is to find a decent AMD GPU for added performance!", "likes": 1}, "replies": [{"author": "Ahmet Refik Eryilmaz", "text": "Your best bet is a vega64. Radeon VII would be better but they are usually mined to death (vega is not that much different in that regard though). I still wish I hadn't sold mine back in the day. People don't appreciate how awesome Vega was to tinker with!", "likes": 1}]}, {"topLevelComment": {"author": "mykalimba", "text": "Is there a good reason to spend extra money on an expensive video card if one is only using the machine for coding and basic internet? Just wondering if I can get away with using the onboard video on the motherboard.", "likes": 1}, "replies": [{"author": "GTV", "text": "ya you can get away with on board video probably.", "likes": 1}]}, {"topLevelComment": {"author": "Hector Chavez", "text": "Woohoo I want to do this I just put together a new pc ryzen 9 12-core, 64gb ram, and radeon7 that I got before the shortage of gpu’s", "likes": 0}}, {"topLevelComment": {"author": "Prajiin Haareesh", "text": "In my computer it is stuck in the command line so how to fix it", "likes": 0}}, {"topLevelComment": {"author": "Sabestian Abraham", "text": "hi, while booting its show  AppleUSBHostPort::disconnect: persistent enumeration failures . e:failed to create device. 😩😩😩", "likes": 0}}, {"topLevelComment": {"author": "Photo Shop easy easy", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "kamaboko1", "text": "Nice tut, but an absurdly expensive build.  For this price one might as well just get a decked out Mac Mini M1. Next build should come it at under $1K not including monitor.", "likes": 0}}, {"topLevelComment": {"author": "klbailey", "text": "can anyone help? im getting a acpi error when booting from USB to install..acpi error, AE_NOT_FOUND, No Local  Variables are initialized for method [_SB_]", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Abdelazem", "text": "After Apple logo pink screen (", "likes": 0}}, {"topLevelComment": {"author": "Gump Forest", "text": "People who could do this much won't be using a Mac in the first place. Mac is for the  non-tech  rich who don't know what to do with their money...", "likes": 0}}, {"topLevelComment": {"author": "Mehmet Gündaş", "text": "dialog: what version?\nme: yes", "likes": 0}}, {"topLevelComment": {"author": "ahmed mahmoud", "text": "Can I make my h p z480 hackintoch please", "likes": 0}}, {"topLevelComment": {"author": "discarded", "text": "wait but isnt it illegal? then wont there be problem for big channels like freecodecamp one to promote it? idt apple would like this", "likes": 0}}, {"topLevelComment": {"author": "WiKeP SuNNy", "text": "Big sur install on my pc and work proper but screen colour so weird how to fix it ?", "likes": 0}}, {"topLevelComment": {"author": "XAUGoblin", "text": "Why am I hearing Wacky Jacky voice.", "likes": 0}}, {"topLevelComment": {"author": "Anh Duong", "text": "Windows 11 no.1", "likes": 0}}, {"topLevelComment": {"author": "Arjun B", "text": "So I have a non-Intel Mac(M1). For me, scheme or GUID partition map is not showing. Pls help!!!!", "likes": 0}, "replies": [{"author": "Arjun B", "text": "Fix. When viewing the options, go to view and select show all. And click the upper disk", "likes": 0}]}, {"topLevelComment": {"author": "BahoiTm", "text": "Hi sir! I have a big issue.\nAfter BIOS setup and installation of the Big Sur, and prioritize my NVME first, the NVME won't boot only if the UEFI: USB storage is connected to computer... (An white cursor/line starts to flicker in the upper right corner and then boots to Windows 10)\nAny thoughts? I've done everything correctly, step by step. Thanks in advance!", "likes": 0}, "replies": [{"author": "elneto264", "text": "on the bios you have to set up opencore as default bootup", "likes": 1}]}, {"topLevelComment": {"author": "Emran Ellahy", "text": "Can’t get it to connect with the internet", "likes": 0}}, {"topLevelComment": {"author": "Jason Perry", "text": "How does ANYONE experienced with computers call a CPU a GPU?  Seriously...", "likes": 0}}, {"topLevelComment": {"author": "ibex33", "text": "while installing ram sticks can it be installed either way as long as the notch lines up with the slot?", "likes": 0}}, {"topLevelComment": {"author": "Troy Lewis", "text": "Waste of time just build a PC, works better. I have the same MB on my build  , RX 580 in 2021? why?  because of Mac OS?", "likes": 0}}, {"topLevelComment": {"author": "Darin Basile", "text": "Super helpful. Thank you!", "likes": 1}}, {"topLevelComment": {"author": "iamtim", "text": "Downloads a virtual box", "likes": 0}}, {"topLevelComment": {"author": "K Hanscombe", "text": "Was this the most modern WiFi we can get for now, or just HackinToch friendly? I wanna use w/ an older Tylersburg i5520 (X58 family) dual Xeon (Westmere EP) & Lion or Sierra. I Had Leopard on this 10 yrs ago but I don't recall a many steps unless the DVD I was given was done for me.  Otherwise, I do have an ASUS Z590! / i9-10850. It's a chore to swap the WiFi+BT chip out of it as I have just the single PCI-E in use. Same family as your mobo.", "likes": 0}}, {"topLevelComment": {"author": "Bobby jack", "text": "Incoming **iTS cPU NOt gpU\"", "likes": 0}}, {"topLevelComment": {"author": "Alessandro Tambellini", "text": "What is the exact price for building that hackintosh?", "likes": 0}}, {"topLevelComment": {"author": "Attila Kovacs", "text": "I tried to run macOS on my current setup (asus rog maximus x, intell i7 8700k, 32gb corsair, gtx 1080ti) , but from what I remember is was really slow, I think it recognized only 8mb from the graphic card or memory...do you think was an issue with the setup or the components?", "likes": 0}, "replies": [{"author": "Ariel Richardson", "text": "the last mac os nvidia compatible w your card is high sierra, afther that only amd works", "likes": 0}, {"author": "elneto264", "text": "in my case was the SSD with a normal HDD is slow", "likes": 0}]}, {"topLevelComment": {"author": "aitcH Games", "text": "Please help. I am not getting any display when apple logo come. Big sur 11.4", "likes": 0}}, {"topLevelComment": {"author": "Manoj Varughese", "text": "installed big sur on a 2014 hardware.", "likes": 0}}, {"topLevelComment": {"author": "Yosuke Otsuki", "text": "This is clearly violation of LICENSED APPLICATION END USER LICENSE AGREEMENT. Apple doesn't allow to install thier OS on non Apple hardwares. If you do personally, it's your responsibility. However, if you post a video as freecodeCamp.org, you'd better to think.", "likes": 0}}, {"topLevelComment": {"author": "Ganesh A", "text": "How can you mess up so much on GPU vs CPU? a person who bought those should spell it even if woken up at mdinight!", "likes": 0}}, {"topLevelComment": {"author": "Reinier Tutoriales", "text": "https://youtu.be/GvnIFUu3UMA", "likes": 0}}, {"topLevelComment": {"author": "Daniel Vargas", "text": "Alguna solución a éste rrror? Hackintool v3.5.7\nspctl -master-disable\nmount -UW /\nmount_apfs: volume could not be mounted: Permission denied\nmount: /failed with 66\nkillall Finder", "likes": 0}}, {"topLevelComment": {"author": "Kapil R.", "text": "Sir, you really look like steve jobs himself. Amazing.", "likes": 2}}, {"topLevelComment": {"author": "Mipsy", "text": "That moment when every part you select is a gpu", "likes": 11}}, {"topLevelComment": {"author": "Roshan sadhasanker", "text": "can i install hackintosh in ryzen 5 3500u vega 8 no dedicated gpu.", "likes": 0}}, {"topLevelComment": {"author": "Ajay Shub", "text": "To install mac on PC, you need macOS wao? What about Windows users?", "likes": 1}}, {"topLevelComment": {"author": "Frozen Code", "text": "Next course on SALESFORCE", "likes": 1}}, {"topLevelComment": {"author": "Chong Hong Yi", "text": "Please do a dual boot OS video will appreciate.", "likes": 0}}, {"topLevelComment": {"author": "Nope", "text": "i wish you have a session for clarifying our doubts if yrs any time i m ready and just spare me a couple minutes", "likes": 0}}, {"topLevelComment": {"author": "Safou Abderrahim", "text": "Ahh nooo pointers again 💔", "likes": 0}}, {"topLevelComment": {"author": "Supreme", "text": "to be honest i find clover build easier to do vs OC build but OC provides most customization that i do agree.", "likes": 1}, "replies": [{"author": "S Bharath", "text": "Clover isn't that compactible to protect you from malware and even it can have one", "likes": 0}]}, {"topLevelComment": {"author": "Yorumcu Turk", "text": "Don't worry apple !!! These people accustomed to pay and buy brand instead of build. Especially if it's about apple, they will beg you.", "likes": 0}}, {"topLevelComment": {"author": "O_O", "text": "Steve Jobs alternative", "likes": 0}}, {"topLevelComment": {"author": "rehman arshad", "text": "This might be the last hackintosh guide we may ever see, since apple has now moved on with the M1 architecture!", "likes": 14}, "replies": [{"author": "kilsnacks", "text": "yes but os wise this build will be supported for like 8 more years", "likes": 2}, {"author": "thecashewtrader", "text": "Sed lyf", "likes": 0}, {"author": "thecashewtrader", "text": "☹️", "likes": 0}, {"author": "Casual Gaming & more by Kigama", "text": "Exactly, what I was thinking!", "likes": 0}]}, {"topLevelComment": {"author": "Sergio Cabeza", "text": "Can you  use the App Store ro download and install apps normally?", "likes": 0}}, {"topLevelComment": {"author": "Tony David", "text": "wow this is great", "likes": 0}}, {"topLevelComment": {"author": "Chris Sullivan", "text": "ummm...did anhyone check the prices of the components?  are macs really more expensive than these parts right now?", "likes": 1}, "replies": [{"author": "Chris Sullivan", "text": "@Manas Hejmadi no doubt... But I used to be able to build a great Mac killer for under $1,000...\n. The video card on this isn't even that powerful and is clocking in at almost $750 right now", "likes": 0}, {"author": "Manas Hejmadi", "text": "For the same hardware you're paying much more for a Mac. Especially RAM and solid state storage. However, the M1 CPUs is much better in terms of how it integrated with everything else", "likes": 0}]}, {"topLevelComment": {"author": "Mohneesh Sharma", "text": "make sure apple doesn't see  it", "likes": 0}}, {"topLevelComment": {"author": "Mr White", "text": "Now we can play and work on mac 😘", "likes": 0}}, {"topLevelComment": {"author": "RIJU", "text": "pls dont make ur videos on prenium or paid or removed from channel i havent watch all of ur videos    my humble request to u", "likes": 0}}, {"topLevelComment": {"author": "Devyansh Bhati", "text": "I wish I could hackintosh my laptop(having amd ryzen 5)", "likes": 0}}, {"topLevelComment": {"author": "Shashank A.V", "text": "I don't already own a Mac so can I run the MacOs in a VM and do all this? Or is the Mac Device necessary to do it?", "likes": 0}}, {"topLevelComment": {"author": "Luca Punturiero", "text": "Why when I install MacOS on the pc. load... and then the monitor disconnect? (NO SIGNAL) But the pc is on! Something wrong?", "likes": 0}}, {"topLevelComment": {"author": "Captain C", "text": "this needed to be cleaned up before posting - even though there is more than one way to skin a cat - the EASIEST is always the best - always build as much of the mobo as possible (even cpu cooler) before placing it into case which should be flat on it's side.", "likes": 0}}, {"topLevelComment": {"author": "the_muteKi", "text": "This is really cool. Great video. I would like to build myself a new computer sometime in the near future and knowing that hackintoshes are still relatively easy to source (minus the GPUs, maybe someday...) I'm tempted to buy this kind of setup.\n\nFor anyone who's done this, is it possible to connect a sata disk drive and still have it work? I'm not necessarily seeking any extra space for the Mac, but I do want to have options available so that I can also into Windows and/or even a Linux distro, and having a few extra storage drives would be VERY helpful in that regard.", "likes": 1}}, {"topLevelComment": {"author": "MND", "text": "I don't think there's any support for Nvidia GTX 1070", "likes": 0}}, {"topLevelComment": {"author": "Nicolas Ortiz", "text": "Thanks! I was building a family computer with macOS and I needed it to have about 5tb of space to store photos", "likes": 4}, "replies": [{"author": "Dank Coder", "text": "raw uncompressed photos can be sized anywhere between 20 to 150mb, 5tb seems to be reasonable", "likes": 0}, {"author": "Poliscent", "text": "bro youre underestimating how much 5tb can store lmao", "likes": 1}, {"author": "myname jeff", "text": "why so much space ??", "likes": 1}]}, {"topLevelComment": {"author": "Bunny", "text": "you don't need a mac to do so. It can be done from windows or Linux. But you can't use OPENGENX in there.", "likes": 0}}, {"topLevelComment": {"author": "Mohammad Irfan Kamal", "text": "I wish we can install ios on android phone ☹️ just the way you installed mac os.", "likes": 0}}, {"topLevelComment": {"author": "Murad Ali", "text": "Is it legal to do iOS app/Swift development in Hackintosh?", "likes": 2}, "replies": [{"author": "Mr.Sojek", "text": "@Murad Ali Me neither, I run Hackintosh on my Intel NUC cube and it's great for using Xcode. Don't case about graphic so standard Iris is fine for me.", "likes": 1}, {"author": "Murad Ali", "text": "@Mr.Sojek I don't have any Apple product. \nBut I thought to have an Apple account you first have to buy an Apple product.", "likes": 0}, {"author": "Mr.Sojek", "text": "Yes, it's about having your Apple account valid.", "likes": 0}]}, {"topLevelComment": {"author": "pacman020yahoo", "text": "I hear you know nothing about static electricity.", "likes": 0}}, {"topLevelComment": {"author": "Felix Isaac", "text": "Just when Apple announced MacOS Monterey few days after this video was published. Hope they make an updated video with Monterey instead of Big Sur. However, I believe it should have the same or similar steps, or perhaps install Big Sur and update to Monterey? No clue, haven't personally built a Hackintosh =)", "likes": 2}, "replies": [{"author": "Mugen Studio", "text": "You just need update, like real mac.", "likes": 0}]}, {"topLevelComment": {"author": "Nowest", "text": "Can you please make a link for your EFI folder? Ihave the same specs.", "likes": 1}}, {"topLevelComment": {"author": "ALCH teasuji", "text": "When I put in the command, it returns \"command not found\" for createinstallmedia. Can anyone fix this problem?", "likes": 0}, "replies": [{"author": "Activate Lock", "text": "Well! I was having similar issue but thank my Stars I found breaklock_official who helped me calm", "likes": 0}]}, {"topLevelComment": {"author": "swallowedinthesea11", "text": "Can it play Crysis? \n\n(Sorry, I'm still a 2000s guy)", "likes": 0}}, {"topLevelComment": {"author": "JamesAgar", "text": "Great video would have been good if you also installed a HHD drive as well as some SSD drives as well though.", "likes": 0}}, {"topLevelComment": {"author": "Sandy", "text": "I have a question here initial you had download the Mac OS big Sur right? should I want to boot that to my Pendrive?", "likes": 1}, "replies": [{"author": "Activate Lock", "text": "*I was having comparable issues attempting to complete a task for my activities,, yet thank heavens I was prescribed to breaklock_official on Instagram who helped me in hardly any minutes...I just paid a token* 🤗", "likes": 0}]}, {"topLevelComment": {"author": "SAJID MAHMUD IRFAN", "text": "Make ANIMATION COURSE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE PLEASE", "likes": 0}}, {"topLevelComment": {"author": "AdrenResi", "text": "If you're having trouble installing to a flash drive, try using an external SSD or an SSD adapter. So far my SSD adapter works but five of my flash drives keep giving up on me.", "likes": 5}}, {"topLevelComment": {"author": "Anatole Debierre", "text": "Any alternative to accessing a real Mac? Maybe that those files can be downloaded from Internet?", "likes": 3}, "replies": [{"author": "tanay", "text": "The description has the link to the guide. Go to the website and select the windows guide.\n\nThe link is under resources referred", "likes": 0}, {"author": "Activate Lock", "text": "*I was having comparable issues attempting to complete a task for my activities,, yet thank heavens I was prescribed to breaklock_official on Instagram who helped me in hardly any minutes...I just paid a token* 🤗", "likes": 0}]}, {"topLevelComment": {"author": "Naveen Arur", "text": "Please do a build which cost 1/3 of this", "likes": 1}}, {"topLevelComment": {"author": "Harshet Maruff", "text": "Apple is gonna remove this video", "likes": 0}}, {"topLevelComment": {"author": "CRK Production", "text": "OOMMMGGG really waiting for this video ❤️❤️❤️❤️❤️❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Karsten Sperling", "text": "\"Save money by pirating software!\" 🙄", "likes": 0}}, {"topLevelComment": {"author": "Thru Mi Lens", "text": "USD770 for Rx580! GPU price is a joke now. everything jack up to insane degree.", "likes": 0}}, {"topLevelComment": {"author": "damanwitdahorn", "text": "This video is beyond awesome... Thank u so very much...", "likes": 0}}, {"topLevelComment": {"author": "Olgay Celik", "text": "Soon they will teach us how to launch a rocket into Mars", "likes": 1}}, {"topLevelComment": {"author": "RITESH’S TECH WORLD", "text": "Dude this is so great", "likes": 0}}, {"topLevelComment": {"author": "Carlos Henrique Biscuola de Souza", "text": "I got it at my xeon computer, but not successful in to put Ethernet port to work.", "likes": 0}, "replies": [{"author": "Carlos Henrique Biscuola de Souza", "text": "@Mapheko Moloto I am trying to use in a Rtl8105e (MSI G31M3-V2) an RTL 8100. Kext \nHacking a Sierra edition. I'm aware how crap this hardware is. It is just for fun.", "likes": 0}, {"author": "Mapheko Moloto", "text": "Which kext did you use for Ethernet?", "likes": 0}]}, {"topLevelComment": {"author": "Kalifiye Stajyer", "text": "You shouldnt use water cooling system like this way. Pipes on radiator should be on bottom. Probably, you are hearing some bubling noice at the moment. Placing pipes/pumps on bottom is a must for water cooling. Hope it helps. Good work.", "likes": 0}, "replies": [{"author": "Ahmet Refik Eryilmaz", "text": "benim gözüm görmedi bile onu, eleman daha hangi parçaya ne diyeceğini bilmiyor. Radyatörü yukarıya takmalıydı zaten.\nBen olsam scythe fuma 2 falan kullanırdım bu arada. O soğutucu zaten kötü bir soğutucu, gerek yok artık sıvı soğutmaya. 9900K sıcak işlemci ama sıcaklık probleminin kaynağı zar kalınlığı, dolayısıyla sıvı soğutucunun burada herhangi bir faydası yok.", "likes": 0}]}, {"topLevelComment": {"author": "Priyanshu Sharma", "text": "Ok! This is a pretty great surprise from ffc😮", "likes": 0}}, {"topLevelComment": {"author": "A J", "text": "Write this down before they take it down", "likes": 0}}, {"topLevelComment": {"author": "Mr Zongalou", "text": "34gb of RAM? Full HD for 4k monitor? Why do you need a mac when you can be doing it on Windows or Linux with Opencore?\nI did a tutorial last week on how to do it with windows, unfortunately I did it in arabic but it shows that you don't need a mac anymore", "likes": 1}, "replies": [{"author": "Mr Zongalou", "text": "@Mr Ri well yes but to install MacOS on a pc (Hackintosh) you can do it with Windows or Linux, no need for a Mac anymore as it used to be the case a couple of months ago...", "likes": 0}, {"author": "Mr Ri", "text": "I think it’s for people that want to develop iOS or iPad os apps as you can only use Apple proprietary Xcode to do that.", "likes": 2}]}, {"topLevelComment": {"author": "InfoTricky", "text": "\"Yesterday is history\".\n\"Tomorrow is mystery\".\n\"Today is a gift \".\n\"That's why is called present😎✌️🤟\"", "likes": 12}, "replies": [{"author": "Pratik Gohil", "text": "yesterday was\ntoday is\ntomorrow will not be", "likes": 1}]}, {"topLevelComment": {"author": "steve", "text": "Inflated Steve Jobs: Today, we introduce: Hackintosh.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Rifaldi Kusnawan", "text": "i have installed on acer nitro 7 but the fan extremely loud (cpu temp 40 degree)", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Vicente Obregon", "text": "The only reason macOS \"works\" is because it runs in powerful hardware.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Peachii", "text": "Imagine paying $10'000 for a glorified Dell.", "likes": 12}, "replies": [{"author": "DEATHBOY GAMING", "text": "ik i love macs as much everyone but 6000 dollars for rx680 256 gigs of storage and a 8 core cpu", "likes": 0}]}, {"topLevelComment": {"author": "Eddie O'Connor", "text": "But will it receive updates and patches like a \"normal\" Mac machine?...", "likes": 0}, "replies": [{"author": "Eddie O'Connor", "text": "@Mapheko Moloto Then I thank you for this!..I am wondering if all I would have to do is get ahold of the latest version of MacOS?...(I believe its Monterey at this time!) this is gonna be fun!!....Imagine a Hackintosh with 128GB of RAM and an AMD ThreadRipper!....LOL!", "likes": 0}, {"author": "Mapheko Moloto", "text": "Yes", "likes": 0}, {"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Diko", "text": "After mac mini m1 was released, i think it's cheaper to get a macintosh pc", "likes": 1}, "replies": [{"author": "Mapheko Moloto", "text": "Yes but you are limited , you cannot boot camp if you happen to also use windows unless you use VMWare which is something else for some of us .", "likes": 1}, {"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Henri Bavie", "text": "hello brother thank you for your tutorials please I have a project to create a web application that can diagnose smartphones what advice do you give me thank you", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "krish", "text": "I would not need a hacintosh if already have a mac computer. Tell another way to download macos", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Fahmida Mashura", "text": "Finally, I can make Apple app. Thanks Beau.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "4HG19CS028 PAVAN P", "text": "I think the thing on ssd is thermal pad", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Mohamed Abdi", "text": "I remember doing this back in 2014. Good times", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Dhairya Talsania", "text": "this would be on another level if mutahar from some ordinary gamer would teach us to build.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Ajay Singh", "text": "It is very nice video \n\nBut will you please upload a video on how to mod any linux distribution or any OS", "likes": 1}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "eduArt", "text": "Can i hackintosh my 2012 MacBook Pro to install bigsur? Coz mine stops at Catalina", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "TNT Sharma", "text": "How did you get gpu?", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Mu Az", "text": "How stable is it? i build hackinstonsh on my laptop once with OC but after some days, it stoped booting.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 1}]}, {"topLevelComment": {"author": "zenidith", "text": "this is so nerdy. i love it~!", "likes": 1}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Aleksey Konovalov", "text": "SMBIOS MacBook ???? iMac 19.1 / iMac Pro!!!", "likes": 3}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Vikrant Bhat", "text": "Is that you steve?", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Chris Wilson", "text": "Perfect example of software vs. hardware acumen. My face was cringe during the build but smiling during the install.", "likes": 3}}, {"topLevelComment": {"author": "Martin Skarzynski", "text": "What keyboard do you use with this computer?", "likes": 0}, "replies": [{"author": "Martin Skarzynski", "text": "https://youtu.be/Gaosub7FRf4?t=2550", "likes": 0}, {"author": "Martin Skarzynski", "text": "I think it's an HP keyboard", "likes": 0}]}, {"topLevelComment": {"author": "Dope tech", "text": "Can I use a laptop?", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Fellipe de Moraes", "text": "Cool. I’ll consider this project in the future. I hope it’s not as complex as it looks!", "likes": 0}, "replies": [{"author": "Fellipe de Moraes", "text": "@Jim Crypťo who’s this?", "likes": 0}, {"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "abdou ett", "text": "It's was a lot and fun work. Thank you very much!", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "HexBin Oban", "text": "How about a Arduino, Raspberry or jetson Nano tutorial with breadboards.", "likes": 18}, "replies": [{"author": "freeCodeCamp.org", "text": "Arduino course coming next week!", "likes": 35}]}, {"topLevelComment": {"author": "Geeky Programmer", "text": "Watching this on my MacBook :'( :'(", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Peeetza", "text": "It would have been great if we were told what each cables are for and their names", "likes": 1}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "José", "text": "OMG THANKS I NEED THIS!!!!!!", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "A E", "text": "I actually was able to build it a few months ago. However, never use it. Question for anyone else who has done it security-wise Are there any concerns.", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "gully", "text": "I tried installing macOS Big Sur on VirtualBox. It worked but it was painfully slow. For some reason macOS would not get more than 4mb VRAM. I tried searching for a solution but couldn’t find it. Would love to have it run properly on my W10 laptop to learn how to use it and fiddle around", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Mr. Mehi", "text": "43:10 eargasm", "likes": 13}}, {"topLevelComment": {"author": "Albino Pepegas", "text": "i got the same case this thing collects a lot of dust lol", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Code with Ania Kubów", "text": "This is incredible!", "likes": 47}, "replies": [{"author": "Ify Ugwumba", "text": "@Peachii lol yeah same here just a few too I was glancing through the comments and I saw her post so I decided to like it and recommend to other dev so I guess you are dev too my brother in the craft 😂", "likes": 0}, {"author": "Peachii", "text": "@Ify Ugwumba fan is strong lol I've seen a few of her videos though they're well made", "likes": 0}, {"author": "Ify Ugwumba", "text": "@Peachii I guess u are fan right", "likes": 0}, {"author": "Peachii", "text": "I like your videos", "likes": 1}, {"author": "Ify Ugwumba", "text": "Hey Ania no code today ...... #javascriptCoding please follow she is good", "likes": 3}]}, {"topLevelComment": {"author": "northy Land", "text": "I'd rather run linux them MAC OS.", "likes": 1}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Jonathan Reeves", "text": "Can I use an AMD Ryzen Processor instead of Intel? I already have a really great gaming computer with the comparable AMD specs but before I tried to follow along using it I wanted to be sure I could use that one instead of buying a new mobo and cpu.", "likes": 0}, "replies": [{"author": "Ozker", "text": "@Jonathan Reeves I don't have macOs installed anymore cause I was just testing it out but I saved the open core configs and downloads and stuff so I just gotta throw it onto a usb and dual boot if I want to again.", "likes": 0}, {"author": "Ozker", "text": "@Jonathan Reeves Not sure if links are allowed in comments but search for \"The Complete Hackintosh Guide (2021) - Intel and AMD, no macOS Required!\" on Youtube. It's a video by Brandon Yen. Has all the links for what you need in the description.\nThe config stuff really is a tedious process so make sure to go over it a few times.", "likes": 0}, {"author": "Jonathan Reeves", "text": "@Ozker Do you happen to have a link for one of the guides by chance? I tried to follow along with this tutorial and I was able to make the bootable drive but I think configuring the OC Core settings I might have missed something or did it incorrectly. I will see if I can find a guide but if you have one that you used that worked I would greatly appreciate the link. And thanks for the advice and tips.", "likes": 0}, {"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}, {"author": "Ozker", "text": "Yeah you can do it on ryzen as well. Did it on a 3600 with Catalina and Big \nSur. You can look up guides specifically for Ryzen on YouTube. Make sure it's for Big Sur as older guides, Catalina for example, may not work.", "likes": 0}]}, {"topLevelComment": {"author": "Timankartola", "text": "You are legend sir", "likes": 1}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Mortuum Hagl", "text": "Hello, there will be a JS for Android Dev course?", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P..", "likes": 0}]}, {"topLevelComment": {"author": "Koga Master", "text": ".. completely unexpected", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P....", "likes": 0}]}, {"topLevelComment": {"author": "Refat Shikder", "text": "Hey thanks for your video. I had a problem I am using iGpu but dual monitor isn't working on my hackintosh. Can you help me", "likes": 0}, "replies": [{"author": "Jim Crypťo", "text": "Thank you for watching, for question, guidance and support at anytime. Just DM Me  +1.(.9.1..4). 7..0.4..4.3..3.8..@ W H A T S A P....", "likes": 0}]}, {"topLevelComment": {"author": "Violet", "text": "Linux + sosumi = easy semi-hackintosh;", "likes": 0}}, {"topLevelComment": {"author": "Jf Sf", "text": "The thumbnail has a LOT of soy in it. Textbook soy in fact", "likes": 0}}, {"topLevelComment": {"author": "NewTube Channel", "text": "Course", "likes": 0}}, {"topLevelComment": {"author": "Prasad Ghole", "text": "I should download this before apple 🍎 takes this down", "likes": 0}}, {"topLevelComment": {"author": "Stevo E", "text": "Can you also tell us how to dual boot a Mac OS or a Windows OS from the same machine?", "likes": 0}, "replies": [{"author": "Mapheko Moloto", "text": "Never partition any disk for windows it is very nasty, just install it on different disk and boot it separate from hackintosh disk , when they are installed on the same disk is very risky because any update from windows might affect the hackintosh files especially EFI folder.", "likes": 0}, {"author": "Melina Zhang", "text": "You can go into the disk utility to partition the drive and do Boot Camp or a normal windows install, via a bootable Windows media usb drive.", "likes": 1}]}, {"topLevelComment": {"author": "Sinan Savcı", "text": "How is this hackintosh performance ?", "likes": 0}}, {"topLevelComment": {"author": "Ikenna Paschal Obieze", "text": "Is it possible to set this up on a laptop? I regularly move between countries and would like to carry it along.", "likes": 3}, "replies": [{"author": "Mapheko Moloto", "text": "Yes I have mine on dell inspiron 3580", "likes": 0}]}, {"topLevelComment": {"author": "Noel Thomas Bejoy", "text": "Didn't know you  did hardware stuff too", "likes": 2}}, {"topLevelComment": {"author": "Okey Shourov Roy", "text": "This channel is full of gold", "likes": 1}}, {"topLevelComment": {"author": "Diogo Veigas", "text": "I finally found a nice tutorial", "likes": 1}}, {"topLevelComment": {"author": "Kushal Kumar", "text": "What's so great about MacOS? I am sure Linux is capabale to compete with MacOS.", "likes": 0}}, {"topLevelComment": {"author": "Anand CA", "text": "I'm a hackintosh user for 1 yr now ❤️😁", "likes": 2}}, {"topLevelComment": {"author": "FreeMan37", "text": "Very cool video! I was planning to buy a computer sooner or later, but this fiddling vid changed my mind. Gonna look for parts instead and craft my own!", "likes": 2}}, {"topLevelComment": {"author": "Dan Arboscelli", "text": "I'd be interested to learn how to develop apps for iOS, but there's no way I am overpaying thousands ( or even hundreds ) of pounds for Foxconn hardware. Does anyone know if it possible to use a Hackintosh instead? For learning but also publishing apps too...", "likes": 0}, "replies": [{"author": "Dan Arboscelli", "text": "@Andrew Leonard thanks :-)", "likes": 0}, {"author": "Andrew Leonard", "text": "Yes I do think this is possible. I don’t believe there is a way to tell whether or not something was developed on an authentic Mac or a hackintosh and even if there was I doubt it would really matter. Someone can correct me if I’m wrong", "likes": 0}]}, {"topLevelComment": {"author": "RedVelocity", "text": "Incredible stuff from FCC", "likes": 0}}, {"topLevelComment": {"author": "Rahi Khan", "text": "If I got a dollar for every time he said GPU instead of CPU, I could buy an actual Mac", "likes": 42}, "replies": [{"author": "B3 Z3N", "text": "34gb ram triggered me.... and calling the ssd a hard drive", "likes": 0}]}, {"topLevelComment": {"author": "Gokul", "text": "wow thats new", "likes": 0}}, {"topLevelComment": {"author": "DontMindMe", "text": "That feel when you have a nvidia gpu 😞", "likes": 9}, "replies": [{"author": "DontMindMe", "text": "@MADHURI RAMASHANKAR true but I don’t have a igpu", "likes": 0}, {"author": "MADHURI RAMASHANKAR", "text": "You can disable it via boot-args", "likes": 0}]}, {"topLevelComment": {"author": "DaBrad", "text": "Now I regret having amd chip, they don't run well as a hackintosh", "likes": 0}, "replies": [{"author": "Ozker", "text": "What chip specifically? Hackintoshes have been running fine on Ryzen for forever. It might be a bit finicky with certain motherboards however.", "likes": 0}]}, {"topLevelComment": {"author": "Sheol83", "text": "Thanks for the video and the detailled instructions. But I must say: That‘s a lot of steps just to install a OS which can easily break with the next bigger update. It might be easier just to install a modern Linux distribution and give it a Big Sur theme.", "likes": 5}, "replies": [{"author": "Peeetza", "text": "the purpose for a hackintosh is so that you can work on apple products though", "likes": 8}]}, {"topLevelComment": {"author": "Utkarsh Raj", "text": "Hey u look like jobs \nLol", "likes": 1}}, {"topLevelComment": {"author": "Luan da Costa", "text": "That's awesome, I wish hardware in Brazil was more affordable, this stuff is so freaking expensive.", "likes": 6}, "replies": [{"author": "Patrick Santos", "text": "Vote melhor na próxima eleição", "likes": 3}, {"author": "Um Br perdido", "text": "Eae kk, Brasil é difícil msm", "likes": 2}, {"author": "Mr. Pradana", "text": "Same here in south east Asia", "likes": 2}]}, {"topLevelComment": {"author": "python samurai", "text": "Next step is talk with Apple lawyers. I am serious, guys, download video, Apple will force them to remove it.", "likes": 1}}, {"topLevelComment": {"author": "TheIsoJ", "text": "Thanks 😊", "likes": 0}}, {"topLevelComment": {"author": "Zylops", "text": "So basically you need a mac os to download the software for big sur. \n\nBroke ass me: adios", "likes": 0}, "replies": [{"author": "Paul Santos", "text": "gibMacOS will pull the OSX installer directly from Apple’s servers if you don’t have an Mac computer", "likes": 0}]}, {"topLevelComment": {"author": "Bacon", "text": "Could you do a tutorial on GDScript?", "likes": 0}}, {"topLevelComment": {"author": "Venkatesh27", "text": "Wow you are really awesome 👏", "likes": 0}}, {"topLevelComment": {"author": "AARAV ANAND", "text": "Didn't expect this kind of videos freecodecamp is lub🤩", "likes": 1}}, {"topLevelComment": {"author": "Vineet Kishore", "text": "If I already had a mac os , why tf would i build one again...as asked to install the mac os -_-", "likes": 0}}, {"topLevelComment": {"author": "Anzar Alim", "text": "This video will definitely get 1million view", "likes": 3}}, {"topLevelComment": {"author": "Shubham Singh", "text": "he deserves that hallow light after assembling hacintosh", "likes": 0}}, {"topLevelComment": {"author": "Michael Mantion", "text": "The only thing I don't like about Hackintosh is the mac os and related software.     Put linux on them and they would be great... \n\nYes I understand that the point of a Mackintosh is the crappy mac os.", "likes": 0}}, {"topLevelComment": {"author": "Robert Ra", "text": "Ye, ye, ye, whatever.\nNow do that on AMD CPUs.", "likes": 1}}, {"topLevelComment": {"author": "saurabhggc", "text": "Nothing better than linux (Pop OS!).", "likes": 0}}, {"topLevelComment": {"author": "Mauro Cerino", "text": "I've searched this for years!! Too late now, I bought my Mac 😅.\nBut it's so cool to know that it is really possible!", "likes": 24}}, {"topLevelComment": {"author": "maximum988", "text": "Welp, time to archive all of FCC's videos.", "likes": 1}}, {"topLevelComment": {"author": "Rahul Ahire", "text": "Hey Beau, what do you think about apple silicon vs hackintosh since M1 is way powerful and efficient than PC and their next generation m chips i.e M1x, M2, M3, etc will be even more powerful. So what do you think about the future of hackintosh since now apple is getting cheap with apple silicon.", "likes": 1}, "replies": [{"author": "Rahul Ahire", "text": "@MisterWho let's see how it goes. But I guess if anyone wants to buys apple today, instead of going with hackintosh he/she will go with M1 silicon.", "likes": 0}, {"author": "MisterWho", "text": "As long as nobody finds a way to use other chips with ARM cores as exchange for the apple silicon the hackintosh future looks very bleak. But since the base of OsX is still a derivative of FreeBSD... ;)", "likes": 0}]}, {"topLevelComment": {"author": "Em Ha Tuan", "text": "Hackintosh is imposible in AMD now?", "likes": 0}}, {"topLevelComment": {"author": "ARYAN DAS", "text": "👍", "likes": 1}}, {"topLevelComment": {"author": "ichibandude", "text": "I didn’t know Steve Jobs teaches how to build hackintosh.", "likes": 925}, "replies": [{"author": "Kunwar Singh Parihar", "text": "😂😂😂😂", "likes": 0}, {"author": "random content generator", "text": "Yeah, he would teach……. the one thing that is against him.", "likes": 0}, {"author": "Tom Sid", "text": "Wozniak would, if he wasn't held by contracts.", "likes": 0}, {"author": "Alex", "text": "😂😂😂😂🇨🇦", "likes": 0}, {"author": "Seonxdesign", "text": "😂😂😂", "likes": 0}]}, {"topLevelComment": {"author": "pouria pmd", "text": "*32", "likes": 0}}, {"topLevelComment": {"author": "Akash Singh", "text": "Marvelous...Marvelous ❤️🙏", "likes": 0}}, {"topLevelComment": {"author": "Omkar Terbhai", "text": "How do I format the USB if I don't have a Mac?", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Read the guide here: https://dortania.github.io/OpenCore-Install-Guide/installer-guide/winblows-install.html#making-the-installer", "likes": 0}]}, {"topLevelComment": {"author": "Kyle Lindemann", "text": "This is amazing! Thank you!\n\nCan you do a vieo like this but for making Crypto Mining Rigs?", "likes": 1}}, {"topLevelComment": {"author": "Saifullah Nakih", "text": "Great Thank you so much!! I am using Hackintosh last couple of years and it's great", "likes": 11}, "replies": [{"author": "Dev Sakhuja", "text": "Hey, how's the battery life after installing hackintosh?", "likes": 0}, {"author": "David B", "text": "What’s the point? You can always virtualize ?", "likes": 1}, {"author": "Saifullah Nakih", "text": "@A M Haven’t tried yet.. I am using Catalina for now..some of my friends already using big sur of their core i5 processor notebook.. Will try out later", "likes": 0}, {"author": "A M", "text": "@Saifullah Nakih Were you able to upgrade the MAC OS? I mean all these versions each year, including current one Big Sur?", "likes": 2}, {"author": "Saifullah Nakih", "text": "@Ikenna Paschal Obieze I am using the old version of notebook including core i5 processor and 8gb ram..If you get new version from core i7 give you a good speed..", "likes": 0}]}, {"topLevelComment": {"author": "Indratej Reddy", "text": "Best part: 43:08 haaaaaa", "likes": 0}}, {"topLevelComment": {"author": "nathan white", "text": "\"It's not illegal but it's piracy/copyright infringement according to Apple\" interesting logic.", "likes": 2}, "replies": [{"author": "freeCodeCamp.org", "text": "You can learn more about the legality here: https://dortania.github.io/OpenCore-Install-Guide/why-oc.html#legality-of-hackintoshing", "likes": 2}]}, {"topLevelComment": {"author": "pouria pmd", "text": "*‌‌CPU", "likes": 0}}, {"topLevelComment": {"author": "T-Tech Solutions Islamabad, Pakistan", "text": "Maybe, you will be backlash for this Tut! It’s illegal in the world of Legal world", "likes": 1}}, {"topLevelComment": {"author": "thisdotcs", "text": "I am downloading all FreeCodeCamp video... InCase FCC gets sued by Apple.", "likes": 0}}, {"topLevelComment": {"author": "Amit 🥲", "text": "Performance?", "likes": 0}}, {"topLevelComment": {"author": "HotYeahSus", "text": "Opencore is god", "likes": 0}}, {"topLevelComment": {"author": "Parthkumar Chaudhary", "text": "Yeah I need this", "likes": 0}}, {"topLevelComment": {"author": "Kushal Sinha", "text": "Different Flavor (y)", "likes": 0}}, {"topLevelComment": {"author": "Shamsuddin V.S.M", "text": "Didn't expect that coming\nNow thats cool", "likes": 2}}, {"topLevelComment": {"author": "JPlexer", "text": "I literally am Hackintoshing my PC now whilst this was uploaded", "likes": 0}}, {"topLevelComment": {"author": "Amadioh FIXED", "text": "These videos are awesome and deserve more views, i hate how they have less views than seals farting", "likes": 3}}, {"topLevelComment": {"author": "TID {Technology in Depth}", "text": "How to do it woth windows os?", "likes": 1}, "replies": [{"author": "TID {Technology in Depth}", "text": "@Beau Carnes thanks man ❤️", "likes": 0}, {"author": "Beau Carnes", "text": "@TID {Technology in Depth} It is possible but a little trickier. Here is some information about it: https://dortania.github.io/OpenCore-Install-Guide/installer-guide/winblows-install.html#downloading-macos", "likes": 0}, {"author": "TID {Technology in Depth}", "text": "@Beau Carnes no I'm not saying about installing windows, I'm saying he said \"you need a mac os running device\" so how can it be done in a windows device instead of mac.", "likes": 0}, {"author": "Beau Carnes", "text": "You can build the computer the same way as in this video and then install Windows instead of MacOS.", "likes": 0}]}, {"topLevelComment": {"author": "akosua", "text": "I tried to do this for a month last summer!!!!! Thank you!!!!", "likes": 6}, "replies": [{"author": "akosua", "text": "@Mohammad Talha I never got it to fully install. 😩", "likes": 0}, {"author": "Mohammad Talha", "text": "how did it went?", "likes": 1}]}, {"topLevelComment": {"author": "dry humor", "text": "This is so cool", "likes": 1}}, {"topLevelComment": {"author": "Nir Lama", "text": "first comment can i get a heart please", "likes": 2}, "replies": [{"author": "freeCodeCamp.org", "text": "❤️ :)", "likes": 0}, {"author": "Indratej Reddy", "text": "u got the nobel prize for being first", "likes": 0}]}, {"topLevelComment": {"author": "Indratej Reddy", "text": "Is it Legal to do it?? and what about the performance ?", "likes": 2}, "replies": [{"author": "Indratej Reddy", "text": "@freeCodeCamp.org yeah I agree, but it is a good start for  people like me who want to use mac without paying a  penny.", "likes": 0}, {"author": "freeCodeCamp.org", "text": "It is legal as long as you don't sell it. The performance is a little less but the price is a LOT less.", "likes": 2}, {"author": "NoPenguinsOnKharak", "text": "It is. Depending on hardware it might get you better results.", "likes": 0}, {"author": "Hakim Ramzani", "text": "and also i want to know if it enable the ios development?", "likes": 0}]}, {"topLevelComment": {"author": "Sai Balaji", "text": "Can this method used to build ordinary windows PC??", "likes": 1}, "replies": [{"author": "Lavu Chawla", "text": "Yes u can see my channel I myself has installed on 2012 pc and it works super fast", "likes": 0}, {"author": "freeCodeCamp.org", "text": "You can also follow this guide if you want to build a computer to install Windows on.", "likes": 1}]}, {"topLevelComment": {"author": "Metta WorldDroid", "text": "Freecodecamp …. You guys are absolutely AWESOME.", "likes": 2}}]}