{"video": {"id": "GbivbPy00FU", "title": "Intro to Angular 5 Tutorial", "description": "Introduction to Angular. Angular is a TypeScript-based open-source front-end web application platform led by the Angular Team at Google and by a community of individuals and corporations.\n\nCheck out Dylan Israel's YouTube channel: https://www.youtube.com/channel/UC5Wi_NYysX-LfcqT3Hq9Faw\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT1H41S", "likes": "183", "views": "14378"}, "comments": [{"topLevelComment": {"author": "Mubashira Mubashira", "text": "Plz send ppt and pdf about angular 5", "likes": 1}}, {"topLevelComment": {"author": "pazz", "text": "the API is not working anymore! ):", "likes": 0}}, {"topLevelComment": {"author": "Jack Alvarez", "text": "any one see the irony of his desktop background", "likes": 0}, "replies": [{"author": "Jack Alvarez", "text": "@IncomingLegend exactly 😂", "likes": 0}, {"author": "IncomingLegend", "text": "what? the classical gears that will never work in that position? or is it something else?", "likes": 0}]}, {"topLevelComment": {"author": "silambarasan.s Sethu", "text": "Good for some basic concepts", "likes": 0}}, {"topLevelComment": {"author": "CHBY", "text": "I appreciate the efforts but literally have no idea what's happening here....you're going 100 mph", "likes": 1}, "replies": [{"author": "the reap", "text": "from 30:00", "likes": 0}]}, {"topLevelComment": {"author": "Relaxation museum ", "text": "wow u r going soo fast :/", "likes": 1}}, {"topLevelComment": {"author": "PioneerX", "text": "This wasn't bad but just my thoughts on how to make it better. It would have been better had you done a high level overview of everything @02:04 before jumping into long portions of tedious angular coding where the viewer doesn't yet have the knowledge to fully understand what you're coding and why, what the angular file structure is and why, etc.  Also clearly delineate to the viewer when you're moving on from one topic to the next, it felt very meandering and I was like oh we're on services now? Are we done with components? Jumping back and forth between major topics a lot was confusing.", "likes": 4}}, {"topLevelComment": {"author": "StarGazing", "text": "I hope you will answer this question: The data doesn't load in the select using this code\n \nFOR crypto-form.component.html\n\n<select name=\"\" id=\"cryptos\" class=\"form-control\">\n      <option value=\"\"></option>\n      <option value=\"\" *ngFor=\"let crypto of top100Cryptos\">{{ crypto.name }}</option>\n    </select>. \n\nFOR crypto-form.component.ts\n\n@Component({\n  selector: 'app-cryto-form',\n  templateUrl: './cryto-form.component.html',\n  styleUrls: ['./cryto-form.component.css']\n})\nexport class CrytoFormComponent implements OnInit {\n  top100cryptos;\n\n  constructor(public cryptoservice: CryptoService) { }\n\n  ngOnInit() {\n    this.cryptoservice.getCryptos().subscribe((data) => {\n      this.top100cryptos = data;\n      // console.log(data);\n    });\n  }\n\n}\n\nFOR crypto-service.service.ts\n\nexport class CryptoService {\n  constructor(public http: HttpClient) { }\n\n  getCryptos(){\n    return this.http.get('https://api.coinmarketcap.com/v1/ticker/');\n  }\n}\n I can log it in the console, but the data doesn't load in the select element.  Would you tell me how to fix?", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Did you add the service to app.module.ts? See 26:42.", "likes": 0}]}, {"topLevelComment": {"author": "takutaku takkunn", "text": "why not 6?? why 5 now??", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "Most of the info in this video also applies to 6.", "likes": 0}]}, {"topLevelComment": {"author": "David Basil", "text": "LOL, nobody hires for that", "likes": 1}, "replies": [{"author": "Mohammed Khan", "text": "you are right david, 90 percent are looking for people who can convert existing angular 1 projects into angular 4, And Chris for front end devs I think knowing React is perfectly enough to get a job, but most job posting never ask for just react, know the unit testing framework, know how to make serverless front end applications using aws or firebase. Most angular job postings will require you to know Java and the spring framework or the mean stack", "likes": 0}, {"author": "Chris Kavanagh", "text": "I understand, as I know several Frameworks. I was really alluding to the job market for front end devs. Is Angular the way to go as far as number of jobs in the market?", "likes": 0}, {"author": "David Basil", "text": "90 percent of angular jobs out there are for angular 1", "likes": 0}, {"author": "Mohammed Khan", "text": "also, once you know one framework it doesnt take that long to get to know another, i prefer angular because it was a much easier move from Java to typescript but I will end up learning react because I want to have more tools in my box", "likes": 0}, {"author": "Mohammed Khan", "text": "me? no i work for amex, currently our full stack is spring boot, node, angular 4. I interviewed with many other banks and insurance companies and usually thats the stack, the only time react has come up is when i try for data visualization or startup companies. There are enterprise companies like goldman sachs that are trying out react, as hot as the framework is, it really depends where and what field your trying to get into", "likes": 0}]}]}