{"video": {"id": "gE9bjYpUrNY", "title": "Unity Game Dev Full Tutorial: Infinite Runner", "description": "Learn to create an infinite runner game with Unity in this complete tutorial for beginners.\n\nAssets for Tutorial: \nhttps://github.com/AwesomeTuts/2d-infinite-runner-game\n\n\nTutorial created by Awesome Tuts. Check out Awesome Tuts Youtube channel: https://www.youtube.com/c/awesometuts\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT3H12M57S", "likes": "694", "views": "42483"}, "comments": [{"topLevelComment": {"author": "Justin Anderson", "text": "Why not?\n\nif (Input.GetKeyDown (KeyCode.Space)) { \nJump();\n}", "likes": 0}}, {"topLevelComment": {"author": "Justin Anderson", "text": "Thanks!  More 2D tutorials please.  Maybe a simcity type?", "likes": 0}}, {"topLevelComment": {"author": "Muharrem", "text": "It would be nice if subtitles in other languages ​​were added to the tutorials.", "likes": 0}}, {"topLevelComment": {"author": "Mubeen Bhatti", "text": "when i touch enemy i did not die", "likes": 0}, "replies": [{"author": "Mubeen Bhatti", "text": "what should i do", "likes": 0}]}, {"topLevelComment": {"author": "Finndramere", "text": "whats the difference in performance if you destroy the game object instead of deactivating them?", "likes": 0}}, {"topLevelComment": {"author": "Yusuf Aydın", "text": "1 hours 9 minutes 14 seconds", "likes": 0}}, {"topLevelComment": {"author": "Androgynous blob", "text": "41:03 i know im a year late but right when i try and run it it says \"Member 'GameObject.FindGameObjectsWithTag(string)' cannot be accessed with an instance reference; qualify it with a type name instead\" i tried removing the quotation marks but then it says \"The name 'SideBounds' does not exist in the current context\" Ive proofread everything multiple times and everything is spelled and written correctly, does anyone know how to fix this?", "likes": 0}, "replies": [{"author": "Justin Anderson", "text": "make sure FindGameObjectsWithTag(\"sideBounds\"); matches the name exactly in the hierarchy.\nmake sure SideBounds = GameObject is the same SideBounds as your private GameObject\n\nSideBounds = GameObject.FindGameObjectsWtihTag(\"sideBounds\");\n^private GameObject ------------------------------------------------------ ^Unity Hierarchy name", "likes": 0}]}, {"topLevelComment": {"author": "Alex Y.", "text": "why so much space at the bottom of each class? =O", "likes": 0}}, {"topLevelComment": {"author": "I love IIT", "text": "what is scope  of game development", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Ibtehaj", "text": "Awesome tuts.", "likes": 0}}, {"topLevelComment": {"author": "Máté Kovács", "text": "You forgot to make an Exit Game function -.-\".\n\nSeriously, I don't care how advanced this tutorial is supposed to be, do the damn thing properly!\n\nAnyway, for those who want one, put this function in your main menu manager script:\npublic void QuitGame(){\n  Application.Quit ();\n  Debug.Log (\"Quit Button Pushed\");\n }\n\nCreate a button, latch the manager gameobject to it, and chose the QuitGame function. In the developer you will see the \"Quit Button Pushed\" text appear in your console tab, while in game it will quit properly.\n\nAlso, if you actually build the game it won't work. Firstly, the screen is off because the weird resolution the camera has, so in the title screen you won't see the Jungle Runner animation, and ingame you won't see the score. The only entity it registers are the trees. If your character collides with the bees, ninjas, shurikens, or squirrels, it just ignores them, sometimes pushing them along, if they also have a rigidbody.\n\nIdk if it's just my Unity, but it just seems that this game only works in the editor, not outside of it.", "likes": 1}}, {"topLevelComment": {"author": "Echo Game Plus", "text": "hello bro, can you show how to make game like subway surf no matter how many takes just i want to make similar like that! Thanks", "likes": 0}}, {"topLevelComment": {"author": "Saboor Hamedi (Muhammad)", "text": "Is it java language?", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "C#", "likes": 0}]}, {"topLevelComment": {"author": "Necronomikyle", "text": "Good video so far, I'm just over an hour in. Also I really enjoyed your udemy course. But at 1:16:24 how are you renaming the animation name? I've tried double clicking the text, right clicking and looking for a rename option, and the title in the inspector and can't seem to change any of them.\nMost of my googling led to a lot of \"you can't responses,\" but obviously it is possible.\n\nAny idea what I might be doing wrong, or has anybody had this issue?", "likes": 1}, "replies": [{"author": "Máté Kovács", "text": "Nope. It should have rename option. Make sure that what you want to rename is actually selected (blue or grey bar), then right click it.\n\nAlso, there is a possibility that it's just Unity being a b*tch. Happens sometimes, like when you try to make a script with space in it, but it doesn't allow to drag & drop it anywhere.", "likes": 0}]}, {"topLevelComment": {"author": "Nabeel Tahir", "text": "Make more videos on unity complete 3D game development. Multiplayer Unity game development.", "likes": 0}}, {"topLevelComment": {"author": "Shry uwu", "text": "*I've been looking forward to this...*", "likes": 3}}, {"topLevelComment": {"author": "Mansi", "text": "new to this world❤", "likes": 2}}, {"topLevelComment": {"author": "forgottenvy", "text": "Video on express Js and it's operating on various types of database, please", "likes": 1}}, {"topLevelComment": {"author": "Akash Shetty", "text": "Waited for this ❤️", "likes": 0}}]}