{"video": {"id": "gfmRrPjnEw4", "title": "Assembly Language Programming with ARM – Full Tutorial for Beginners", "description": "Learn assembly language programming with ARMv7 in this beginner's course. 🦾\n\nARM is becoming an increasingly popular language in the world of computer programming. It is estimated that over 200 billion devices contain an ARM chip, making the ARM language valuable to understand. By understanding an assembly language, programmers can have a better understanding of how code is compiled and run, making it possible to create more efficient programs. In addition to this, programmers can work at a lower level, allowing them to write code that interacts with hardware in an efficient manner.\n\n✏️ Scott Cosentino created this course. Check out his YouTube channel: https://www.youtube.com/channel/UC7KBXRtv-EkiOFsRtpBxIbg\n\n💻 Emulator for ARM programming: https://cpulator.01xz.net/?sys=arm-de1soc\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Introduction\n⌨️ (0:01:08) Intro and Setup\n⌨️ (0:03:33) Emulation and Memory Layout\n⌨️ (0:13:22) Your First Program\n⌨️ (0:24:39) Addressing Modes\n⌨️ (0:37:10) Arithmetic and CPSR Flags\n⌨️ (0:48:38) Logical Operations\n⌨️ (0:55:03) Logical Shifts and Rotations Part 1\n⌨️ (1:02:23) Logical Shifts and Rotations Part 2\n⌨️ (1:09:06) Conditions and Branches\n⌨️ (1:19:37) Loops with Branches\n⌨️ (1:29:16) Conditional Instruction Execution\n⌨️ (1:34:36) Branch with link register and returns\n⌨️ (1:41:05) Preserving and Retrieving Data From Stack Memory\n⌨️ (1:49:49) Hardware Interactions\n⌨️ (1:58:07) Setting up Qemu for ARM\n⌨️ (2:07:52) Printing Strings to Terminal\n⌨️ (2:20:26) Debugging Arm Programs with Gdb\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT2H29M32S", "likes": "11709", "views": "745996"}, "comments": [{"topLevelComment": {"author": "Nándor Bacsó", "text": "Might-needed help:\r\nThe POP at 1:48:24 won't actually work, because the pop instructions needs to go in order of the registries. If you wanna pop R9, you have to do it in a separate command before hand. Took me almost an hour to figure out :D", "likes": 1}}, {"topLevelComment": {"author": "Egemen Ozan", "text": "THANK YOU for the beginner friendly approach. Unlike highler level languages, assembly tutorials usually always assume you know a bunch of stuff. With the addition of the simulator this is perfect", "likes": 2}}, {"topLevelComment": {"author": "Si P", "text": "This is the first time learning a new programming language where your first program is not printing \"hello world\"", "likes": 3}}, {"topLevelComment": {"author": "Bill W.", "text": "You’re much better off saving and restoring the registers inside the subroutine so that any changes made to the routine requiring use of another register will only necessitate changes to the routine itself rather than at all the call points.", "likes": 2}, "replies": [{"author": "Bill W.", "text": "I should have also commented that the status registers should be restored upon leaving the subroutine too.", "likes": 0}]}, {"topLevelComment": {"author": "Jumeldi Panca Putra", "text": "Thank you very much for this awesome video tutorial. I really really love this video.", "likes": 0}}, {"topLevelComment": {"author": "Mike Diaz", "text": "May You teach  me from, Compiler/Interpreters directives, \"Please \".\nIn learning \"assembler\".\nAlso, IDE's, \" How to Use\", and All basic\n\"Interpreting  and Compiling\".\nThankYou.", "likes": 0}}, {"topLevelComment": {"author": "Kevin Rickey", "text": "Nice video.   I've loved hand assembling machine and assembler since 1980.  I know the Z80, 6502 and x86 CPUs.  I desire to get into ARM for Android as I also like Linux a whole lot.", "likes": 0}}, {"topLevelComment": {"author": "RAMusic", "text": "why ARM", "likes": 0}}, {"topLevelComment": {"author": "Raymond Reddington", "text": "@1:21:20 How can you store a list of 10 numbers (an array of integers) into a 32-bits register? When an int is 4 bytes so 40 bytes in total (4 * 10 digits), and the register only has 4 bytes? (32 bits)", "likes": 0}}, {"topLevelComment": {"author": "Raymond Reddington", "text": "@49:58 I don't understand how #0xFF (aka 256) AND 22 (0x16) ands up to 16. Please explain :)", "likes": 0}}, {"topLevelComment": {"author": "kerdus legend", "text": "This whole lesson is passively screams \" *don't* \" And \"if you continue, just forget whatever you know about programming because it's useless now\"", "likes": 1}}, {"topLevelComment": {"author": "William Karlsson", "text": "Is there any assembler that uses a logical order of operations for arm ? Like mov source,destination as opposed to mov destination,source ?\nThanks", "likes": 0}}, {"topLevelComment": {"author": "B A", "text": "13:22", "likes": 0}}, {"topLevelComment": {"author": "Manideep Reddy", "text": "OMG. What a tutorial. Standing ovation to you sir.", "likes": 0}}, {"topLevelComment": {"author": "Woosuk Byun", "text": "are s0~31 and d0~d31 also registers?", "likes": 0}}, {"topLevelComment": {"author": "Woosuk Byun", "text": "Thanks so much for the nice contents. I have one question.\nDoes the \"Compile and Load\" function in the emulator mean compiling the ARM language into binaries and loading them into ram(main memory)?", "likes": 0}, "replies": [{"author": "yes", "text": "yes", "likes": 0}]}, {"topLevelComment": {"author": "tyz", "text": "Pm", "likes": 0}}, {"topLevelComment": {"author": "Call me AndoRu", "text": "I have a question: Can you load data stored in a memory location directly onto a register or do you have to always load it's address first\nLike, can you ldr r0, N\nwith N defined in data", "likes": 0}}, {"topLevelComment": {"author": "Patrick Bateman", "text": "Learn if you love to torture yourself", "likes": 0}}, {"topLevelComment": {"author": "Cramarshe", "text": "I'm listening to this while doing goldwork hand embroidery", "likes": 0}}, {"topLevelComment": {"author": "gabehcuoD suoitneterP", "text": "64 or 32 bit architecture?", "likes": 0}}, {"topLevelComment": {"author": "Gabriel Gavrilov", "text": "1:29:16", "likes": 0}}, {"topLevelComment": {"author": "Owl", "text": "This is NOT for beginners!", "likes": 0}}, {"topLevelComment": {"author": "Todd", "text": "I am trying to figure out how to write a summation equation and had a question about. if I wanted to write a summation with out branches, would I just add the equation to whatever times i needed I wanted to calculate? I guess what I am trying to ask too is if you cannot loop, you cannot write code for any amount of the summation. its only fixed? thank you", "likes": 0}}, {"topLevelComment": {"author": "Railfan 9743", "text": "24:20", "likes": 0}}, {"topLevelComment": {"author": "Albi The Second", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Rekt", "text": "the cursor being hidden while recording that course is relly annoying i hope u guys will take that in mind.Thank u for this course <3", "likes": 0}}, {"topLevelComment": {"author": "Josse Ochoa", "text": "OMG, it really worked. Thank you so much!!", "likes": 0}}, {"topLevelComment": {"author": "מי שקורא את זה אין לך חיים יתחת", "text": "Installed, everything works, thanks!", "likes": 0}}, {"topLevelComment": {"author": "EnfoqueJA", "text": "Yoo I am not doing well in studies but still I am here", "likes": 0}}, {"topLevelComment": {"author": "Clifford Mathew", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "LL", "text": "when you push R0 and R1 onto the stack, doesn't the stack pointer now point to where R1 is contained?  and then when you pop from stack  \"POP R0, R1\"    doesn't the value of R1 gets popped into R0?   The later PUSH and POP of R2 supports my suspicion; although the disassembly shows R0 and R1 still got their original values back.    Is there a hidden detail? (such as popping acts in the reverse order, and pushing acts in the direct order; like PUSH {R0, R1} ==> first pushes R0, then pushes R1;     and  POP {R0, R1}==>first pops R1, then pops R0.  Otherwise it could not have supported the pushing and popping of R2 in the subroutine without screwing up R0 and R1 )", "likes": 0}}, {"topLevelComment": {"author": "忘忧草", "text": "讲的太好了", "likes": 0}}, {"topLevelComment": {"author": "Alexandre Vilaça dos Santos", "text": "8 minutes, I said 8 minutes and I already know why a processor is 32 or 64 bit. I'm in love with this course. Thank you very much guys and let's move forward", "likes": 0}}, {"topLevelComment": {"author": "Railroad crossing Fumikiri Animation", "text": "Incredibly informative. As soone with no background in soft other than so Nice tutorialgh school band, I completely understand everytNice tutorialng", "likes": 0}}, {"topLevelComment": {"author": "Srizan Prime", "text": "This was a great boost to my exams.. i'll come back here later... thank u... <3", "likes": 0}}, {"topLevelComment": {"author": "b888", "text": "Can we have an x86_x64 or at least x86 8086 assembly language course?", "likes": 0}}, {"topLevelComment": {"author": "Kumar Priyanshu", "text": "#doubt\nTimestamp:- 43:30\nI typed in the following instructions\nmov r0, #0xffffffff\nmov r1,#1\nsubs r2,r0,r1\nmov r3,#3\nmov R4,#1\nsubs r5,R4,r3\n\nAfter compilation and running, i get the output as you said that it predicts whether the last operation was positive or negative, but here when I convert the values in the register to signed decimal, i get both constant the values as negative, but i expected the r0 to have a big number rather than -1, why or how is this happening?", "likes": 1}}, {"topLevelComment": {"author": "John Palace", "text": "mine just got thermal shutdown", "likes": 0}}, {"topLevelComment": {"author": "B.S Gaming", "text": "more complicated one. your lody needs to soft nice. 808(app) should also fit with the lody and the rythm. snare and percussion", "likes": 0}}, {"topLevelComment": {"author": "B.S Gaming", "text": "What an angel! You save my broken head!", "likes": 0}}, {"topLevelComment": {"author": "SteeqDev", "text": "HOW DID YOU BACK OUT AT  2:18:43  PLZ HELP PLZ PLZ", "likes": 0}}, {"topLevelComment": {"author": "Dhut Lid", "text": "I have enjoyed this course", "likes": 0}}, {"topLevelComment": {"author": "theTertiaryAdjunct", "text": "holy hell this is amazing", "likes": 0}}, {"topLevelComment": {"author": "Bubele Rasmeni", "text": "Your artist na should be \"Kristal Klear\" because that was what I just watched here.", "likes": 0}}, {"topLevelComment": {"author": "Владислав Король", "text": "Ladies and gentlemen, I am here to announce you that now we are suprerior to CPPers and can chase bugs down to the hardware itself.", "likes": 0}}, {"topLevelComment": {"author": "Jeff Nunn", "text": "This is easily one of the best tutorials on coding I have ever watched. Everything is explained well and made easy to understand.", "likes": 6}}, {"topLevelComment": {"author": "Tumwine Isaac", "text": "https://www.youtube.com/watch?v=ZvJqO0VM6o8&t=145s", "likes": 0}}, {"topLevelComment": {"author": "Ragnar Lothbrok", "text": "I like the vid and your teaching style, but arm is not the easiest assembly to learn, I've talk with several arm devs and they say it's actually a lot more sophisticated than ie x86 or AVR", "likes": 0}}, {"topLevelComment": {"author": "Ashhar Kausar", "text": "Great tutorial Scott!", "likes": 0}}, {"topLevelComment": {"author": "salec", "text": "Sorry to point out this, but you are confusing viewers with such interpretation of Little endian and Big endian. First, note that regardless of processor endian-ness, the number in a multi-byte register will always be represented with most significant figure to the left (the way we write numbers on paper). The only difference will be in that which byte is at which address within address range of the register, and that would be important only if we iterate over bytes one at a time (e.g. sending an array of them to a character device in correct order).\nIt is Big endian if the most significant byte is at address offset 0 from the base address of the register (the way we usually write and read numbers).\nIt is Little endian if least significant byte is at address offset 0 from the base address of the register.\n\nApparently, Big endian arrangement comes \"naturally\" from our historical representation of Arab (Indian) numeral numbers, but Little endian is arrangement which had unique advantage: it enabled much cleaner (a single, simpler iterative loop) multi-word arithmetics (addition and subtraction), especially if the numbers were of different lengths (so we would start e.g. adding them  lower parts first, and if there was a carry, we would take it into account in next iteration with higher numeral positions).", "likes": 1}}, {"topLevelComment": {"author": "Ricardo_", "text": "More important to learn how to read assembly code/understand how it works than to write assembly code for most people", "likes": 0}}, {"topLevelComment": {"author": "Starling Media", "text": "I believe they should be \"C\" between Assembly language and High level language", "likes": 0}}, {"topLevelComment": {"author": "Dev Pro", "text": "bruh what am i doing with my life? studying assembly to develop my own freaking os", "likes": 0}}, {"topLevelComment": {"author": "Arnav Saha", "text": "At this point, you guys are just reading my mind unethically on what content I exactly need OMG OMG OMG!", "likes": 0}}, {"topLevelComment": {"author": "lone wolf coding", "text": "hmmm what about risc v an open source architecture", "likes": 0}}, {"topLevelComment": {"author": "Service Rh", "text": "Your video was very helpful, I'm still learning and getting the hang of it still. I'm into House and EDM. I look forward to seeing more of your", "likes": 0}}, {"topLevelComment": {"author": "Dapur Ham", "text": "Thanks for the tutorial 👍👍😍😍", "likes": 1}}, {"topLevelComment": {"author": "check 414s_cybertrustechs on Instagram", "text": "☝🏻☝🏻☝🏻Message the best who can help you out of your hacked wallet,the name is written bodly at the top..", "likes": 0}}, {"topLevelComment": {"author": "check 414s_cybertrustechs on Instagram", "text": "☝🏻☝🏻☝🏻Message the best who can help you out of your hacked wallet,the name is written bodly at the top..", "likes": 0}}, {"topLevelComment": {"author": "Jorge Ferreira", "text": "You got me confused.\nSince when a \"data\" segment is the same as the \"stack\"?\nI'm trying to get acquainted with the ARM architecture and instruction set, but it only took 30 minutes to hear something that goes against everything I learned before.\nCalling \"stack\" to the bulk system memory is against the most basic computer science principles. The \"stack\" name refers to an area of memory with very specific rules of access and usage.\n- With an AND operation it might be really interesting to have the \"Z\"ero flag set by \"ANDS\". Just think working with bitmaps even in high level languages. Not to mention an testing input pins in an embedded system.\n\n1:52:43 - The whole explanation around the \"SWITCH\" equate is a mess. Its perfectly possible to put the hexadecimal constant directly in the \"ldr\" instruction. It would be better explained has a convenience to avoid the \"magic numbers\" symptom along the program code.\nWhy are those peripherals, switches and LEDs, being accessed as if they were memory? Don't bother, I know the answer. But others may not.\n\n2:07:52 and forward\n\"\\n\" interpreted by the operating system as a newline character !?!?!?!??!\nThe \"\\n\" text is interpreted by the assembler (as) as the ASCII control character 'NL' (newline) with code '10' (0x0a). The Operating system, linux or other will send it as is to the device driver that, in a printer os display terminal is translated to a change of line.\n\nThe \"Hello World\" string stored in \"stack\" memory !?!?!?!? Better take a look at the stack pointer to see its pointing somewhere else, probably in a totally different memory region.\nThe \".data\" is placed in a memory region commonly known as \"initialized data\".\n\nI'm out of here.!!!\nThis video is way bellow the \"freeCodeCamp\" quality level that I've found in other videos.", "likes": 1}, "replies": [{"author": "King", "text": "@Jorge Ferreira Thanks 🙏", "likes": 0}, {"author": "Jorge Ferreira", "text": "@King A good resource is something that depends on your level.\nMost of the shortcomings I noticed in this video are not specific to ARM assembly or architecture. What I noticed is a number of technical errors that are transversal to any micro controller or micro processor.\nBut, as you want a suggestion, ... <<< sorry bad link >>> I'll post one here as soon I find the correct one.\nOk here it is https://www.youtube.com/watch?v=2ghL_R5CSaI&list=PLGLfVvz_LVvQu9IwUcpn8KOZsOvoHx8sU&index=3&ab_channel=DerekBanas", "likes": 0}, {"author": "King", "text": "@Jorge Ferreira Sir then please suggest me a good resource for arm language any video. Like any free resource?", "likes": 0}, {"author": "jasneet", "text": "Correct, I also stopped the video after I found some incorrect explanations. Crazy how many people will develop wrong understanding through this", "likes": 0}, {"author": "Jorge Ferreira", "text": "@King I'm speaking straight and correct.\nThe fact that I was looking for an introduction to ARM does not mean I'm a newbie to electronics and computer science. I'm an EE with 30+ years of experience, all the way from the simple diode to the servers. Both in the hardware and software side of things.", "likes": 0}]}, {"topLevelComment": {"author": "Kareem 971", "text": "dude sa lmfao", "likes": 0}}, {"topLevelComment": {"author": "Vicky Hazan", "text": "Great video! now... the GMS soft really distorted in my mac, I searched a couple of tutorials to change in nu Options content settings,", "likes": 0}}, {"topLevelComment": {"author": "Fisayo Daniel", "text": "cool", "likes": 1}}, {"topLevelComment": {"author": "Mehmet Emin Adıyaman", "text": "ITS REALLY WORKED LOL THANK YOU DUDE", "likes": 0}}, {"topLevelComment": {"author": "Dimensions", "text": "https://youtu.be/c3zTSkE8gGA👌", "likes": 0}}, {"topLevelComment": {"author": "Desmond Carelsen", "text": "Thanks sir 😊😊😊😊😊😊😊😊", "likes": 0}}, {"topLevelComment": {"author": "JAIP4SDAMIS", "text": "Bold Move", "likes": 0}}, {"topLevelComment": {"author": "Leandro Gavazza", "text": "And WHAM! Well you're drunk now!", "likes": 0}}, {"topLevelComment": {"author": "Rodrigo Santos", "text": "I am glad that there are people like you, who can help beginner streamers. Thank you brother, I appreciate your support. Always fresh updates", "likes": 5}}, {"topLevelComment": {"author": "곤고논", "text": "Like bro!)", "likes": 0}}, {"topLevelComment": {"author": "William Coburn", "text": "Think of it as space*A lot of it is wasted. Think of it as HOME, there's a lot of learning there. Like a cat some things catch your attention. Sometimes you just don't care!", "likes": 0}}, {"topLevelComment": {"author": "Muller Santa Cruz Carrasco", "text": "Just started using soft soft and I made so of my own soft. I made one I actually really like, but the others are all so trash and so", "likes": 0}}, {"topLevelComment": {"author": "Zo(e)", "text": "OMG, so well explained, I literally thought assembly was this big, daunting thing but you explained it so well!! keep it up <3", "likes": 52}, "replies": [{"author": "jonathan sheppard", "text": "Zo(e) ?", "likes": 0}, {"author": "jonathan sheppard", "text": "Don't you think , Zoe ?\nThese guys are great at showing the simple truth imv", "likes": 0}, {"author": "jonathan sheppard", "text": "so weird the perception that programmers are paranormal aliens and that coding is out of reach to regular folk ?", "likes": 0}]}, {"topLevelComment": {"author": "FRANK R.", "text": "Sa bro", "likes": 0}}, {"topLevelComment": {"author": "Fernando Vaz", "text": "can i do tNice tutorials with the trial version?", "likes": 0}}, {"topLevelComment": {"author": "Ujjwal Sharma Official", "text": "Thanks bro that was really helpful", "likes": 0}}, {"topLevelComment": {"author": "Robinson Larrain", "text": "Wow! You're a natural teacher. I feel like I can do Nice tutorialts now", "likes": 0}}, {"topLevelComment": {"author": "Notoryus Syndrome", "text": "you are not like the others who puts link filled with adds, so u deserve to be subscribed..... thanks for the plugin and all the best for future", "likes": 0}}, {"topLevelComment": {"author": "Chat +¹⁹⁰⁹⁵²⁹¹¹⁷¹ en whatspp", "text": "☝️👆👆\nGracias al contacto en la parte superior por ayudarme a hackear la cuenta de mi compañero infiel.", "likes": 1}}, {"topLevelComment": {"author": "Chat +¹⁹⁰⁹⁵²⁹¹¹⁷¹ en whatspp", "text": "☝️👆👆\nGracias al contacto en la parte superior por ayudarme a hackear la cuenta de mi compañero infiel.", "likes": 1}}, {"topLevelComment": {"author": "rata san", "text": "Haven't watched this at all.\nDoes this work for x86 too? Or it will break at some point?", "likes": 0}}, {"topLevelComment": {"author": "vincent tan", "text": "Absolute G <3", "likes": 0}}, {"topLevelComment": {"author": "junior haufiku", "text": "The only legend I�ve followed their tutorial and it actually worked. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Damian Castellucci", "text": "I wish its get work", "likes": 0}}, {"topLevelComment": {"author": "Roberto Silva Moreno", "text": "TY TY SO MUCH!!!", "likes": 0}}, {"topLevelComment": {"author": "Diego Martínez", "text": "Thank you Sir! TNice tutorials helps  alot !", "likes": 0}}, {"topLevelComment": {"author": "pankaj mittal", "text": "Imagine how much money he would have made if he had ads. There’s 6.6 million views.... he’d be rich", "likes": 0}}, {"topLevelComment": {"author": "Drogarias Pais & Filhos", "text": "Im trying to use soft soft to make an FNF mod and tNice tutorials is really helping!", "likes": 0}}, {"topLevelComment": {"author": "Ashar Ejaz", "text": "I am getting this error : work/asmwFpWbV.s:12: Error: internal_relocation (type: OFFSET_IMM) not fixed up     when trying to follow the code for loops with the tutorial. Any reason why and how to fix it?", "likes": 0}}, {"topLevelComment": {"author": "Lujan Aravena", "text": "Thank youuu so much!!!", "likes": 0}}, {"topLevelComment": {"author": "EDSON PEIXOTO SAMPAIO", "text": "wish tNice tutorials could be", "likes": 0}}, {"topLevelComment": {"author": "woramate thongtan", "text": "you!", "likes": 0}}, {"topLevelComment": {"author": "Y", "text": "This is very well explained", "likes": 0}}, {"topLevelComment": {"author": "Anel Bajrich", "text": "now i am in a good mood", "likes": 0}}, {"topLevelComment": {"author": "Stamate Rodica", "text": "Ti to follow in Toby's foot steps if ya know what I an.", "likes": 0}}, {"topLevelComment": {"author": "Salvador Vasconcelos", "text": "I literally used my 17 minutes to browse through the comnts just to see how people is upset with themselves ahahhahaahah", "likes": 0}}, {"topLevelComment": {"author": "Nikolas Martinez", "text": "Will i watch your channel 24/7 just to look at that beautiful face of yours? *yes*.", "likes": 0}}, {"topLevelComment": {"author": "Utkan Çetin", "text": "I don't even care if you add ads to the download you're just such a goat  ❤️ ❤️ ❤️", "likes": 0}}, {"topLevelComment": {"author": "DJ YOHANS", "text": "I'm not gonna say you do or you don't. I'm not a doctor butttttttttttt...... I had a similar problem when trying to learn new tNice tutorialngs and it helped", "likes": 0}}, {"topLevelComment": {"author": "Luca", "text": "BEEST!!!", "likes": 0}}, {"topLevelComment": {"author": "imran 2008oujda", "text": "Thank you soo much! This helped a lot! ❤️", "likes": 0}}, {"topLevelComment": {"author": "IMP KAKASHI", "text": "Thanks... it's working... Good Job...!", "likes": 0}}, {"topLevelComment": {"author": "Shaikh Kaber", "text": "Thanks bro ho gaya", "likes": 0}}, {"topLevelComment": {"author": "БАТЯ Arin", "text": "thx for soft mate", "likes": 0}}, {"topLevelComment": {"author": "1901 Matty", "text": "Probably the best app from you..", "likes": 0}}, {"topLevelComment": {"author": "Rafia Islam", "text": "Beautiful video", "likes": 0}}, {"topLevelComment": {"author": "ktk fdcs", "text": "h5", "likes": 0}}, {"topLevelComment": {"author": "Phuc Ho Tan", "text": "Thanks man!! You've earned my respect", "likes": 0}}, {"topLevelComment": {"author": "Wellington Morais", "text": "it worked. Thankss sooooo much.", "likes": 0}}, {"topLevelComment": {"author": "hashem darwish", "text": "because its hard doesn't make it impossible! Stay safe! <3", "likes": 0}}, {"topLevelComment": {"author": "Mr Computer", "text": "TNice tutorialS WAS SOOOOOO HELPFUL!!", "likes": 0}}, {"topLevelComment": {"author": "romel morales", "text": "tNice tutorials actually helped", "likes": 0}}, {"topLevelComment": {"author": "Lázaro Franca", "text": "Fire!", "likes": 0}}, {"topLevelComment": {"author": "Armando Roman", "text": "Sir can you be my soft soft master i am the future of soft creation", "likes": 0}}, {"topLevelComment": {"author": "juan garcia", "text": "IT WORKED, THANKS I'VE BEEN LOOKING FOR THIS FOREVER, BUT NO TUTORIAL COULD EXPLAIN IT AS YOU DID", "likes": 0}}, {"topLevelComment": {"author": "Christin Paul", "text": "I must confess that learning how to use the software is what gets  procastinating to start making soft. It scares  lol", "likes": 0}}, {"topLevelComment": {"author": "Brian Gopaul", "text": "Also, I don't like idea of coloring again and again. In soft soft mobile, just pick a color and it colors the track, the soft, and the setuper", "likes": 0}}, {"topLevelComment": {"author": "abaold", "text": "explaining the basics for .", "likes": 0}}, {"topLevelComment": {"author": "All E-Commerce Solution", "text": "Make a 1 hour video of one nice tuto from google", "likes": 0}}, {"topLevelComment": {"author": "CristianDigitalBolivia", "text": "good work king, love you", "likes": 0}}, {"topLevelComment": {"author": "Obed Kwarteng", "text": "and willing nice tutoet League teams and players to chose  as their editor. More money for  tho. It is pretty cool to see the progress I", "likes": 0}}, {"topLevelComment": {"author": "Illza Prokop", "text": "Subscribe and get new updates", "likes": 0}}, {"topLevelComment": {"author": "Bigman Bayramzade", "text": "that was exactly what I needed , thank you so much", "likes": 0}}, {"topLevelComment": {"author": "Jirka Zwinger", "text": "element faild to initialize OpenGl.", "likes": 0}}, {"topLevelComment": {"author": "𝕛𝕦𝕤𝕥 𝕥𝕙𝕒𝕥 𝕡𝕒𝕣𝕥", "text": "Can somebody point me to some real world examples videos?  like, How to connect and how to write code for blinking led etc.", "likes": 0}}, {"topLevelComment": {"author": "Kingsley Uchenna", "text": "Thank you soo much! This helped a lot! ❤️", "likes": 0}}, {"topLevelComment": {"author": "srey oun", "text": "When your download stuck at the 99.9%", "likes": 0}}, {"topLevelComment": {"author": "Hee LeeHar", "text": "i need a tutorial on how to make this kind of videos:)", "likes": 0}}, {"topLevelComment": {"author": "SNIPER DZ", "text": "Thank u for this ❤❤", "likes": 0}}, {"topLevelComment": {"author": "Masonwabe Kotyi", "text": "Worked smoothly, tysm", "likes": 0}}, {"topLevelComment": {"author": "Charleslogs On Instagram", "text": "👍👍👍👍🖕🖕🖕Thank you for helping me to get my bitcoin wallet and the funds back. I brought a credit card log with a good balance from him. He is a best hacker I know and very trustworthy. He sell cc, fullz, Bank log Drops and Bitcoins script to hack all bitcoin wallet 💯💯", "likes": 0}}, {"topLevelComment": {"author": "GenSy", "text": "It's late af but Ima watch tNice tutorials and buy soft soft tmrow get to work", "likes": 0}}, {"topLevelComment": {"author": "Ella Emon", "text": "My GMS soft really electric and notNice tutorialng like a app. Any tips how to fix?", "likes": 0}}, {"topLevelComment": {"author": "𝙍𝙤𝙇𝙇𝙔𝙏𝙊𝙊𝙇 𝙤𝙣 𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢.", "text": "really sir you have done so much good, with your trusted and reliable services", "likes": 0}}, {"topLevelComment": {"author": "𝙍𝙤𝙇𝙇𝙔𝙏𝙊𝙊𝙇 𝙤𝙣 𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢.", "text": "really sir you have done so much good, with your trusted and reliable services", "likes": 0}}, {"topLevelComment": {"author": "𝙍𝙤𝙇𝙇𝙔𝙏𝙊𝙊𝙇 𝙤𝙣 𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢.", "text": "really sir you have done so much good, with your trusted and reliable services", "likes": 0}}, {"topLevelComment": {"author": "nero boois", "text": "you're a great teacher, love the simplicity, with details! subbed!", "likes": 9}, "replies": [{"author": "jonathan sheppard", "text": "True enough nero", "likes": 0}]}, {"topLevelComment": {"author": "jesus miguel carrasco requejo", "text": "The timing for when it went out was perfect. Like it was planned", "likes": 0}}, {"topLevelComment": {"author": "Gerson Pantaleão", "text": "TOP! Thank you! Hack works", "likes": 0}}, {"topLevelComment": {"author": "Md A", "text": "Beautiful", "likes": 0}}, {"topLevelComment": {"author": "Blah bhal", "text": "man I missed this kind of tutorials lol. Great work here, thanks!!!", "likes": 0}}, {"topLevelComment": {"author": "Ma Isabel Almogia", "text": "top de mais ajudou muito", "likes": 0}}, {"topLevelComment": {"author": "Iftekhar Rousseau", "text": "TNice tutorials was a fantastic beginner's guide, straight to the point, very clear. As a long-ti teacher I can tell you are quite apt at teacNice tutorialng!", "likes": 0}}, {"topLevelComment": {"author": "Jcmc_Oficiall🎙🎶", "text": "Dude, this is the only video that works. Thanks for posting!", "likes": 0}}, {"topLevelComment": {"author": "Mdarif khan", "text": "nice video", "likes": 0}}, {"topLevelComment": {"author": "John Ndivo", "text": "I been through loads of video's about soft . but you are the best thanks for your video's.", "likes": 0}}, {"topLevelComment": {"author": "brecht mels", "text": "I'm not sure about tNice tutorials, but if you wanna fix it open GMS. Then in the GMS, there's a light blue screen with a lot of buttons and other stuff.", "likes": 0}}, {"topLevelComment": {"author": "SMY TECH-THE DOMESTIC LIFE", "text": "hahsdhahah good", "likes": 0}}, {"topLevelComment": {"author": "Ahmetrin", "text": "aswell. anwNice tutorialle, here, you have to color kick in track, color the kick in setuper, and color the kick in soft. Thats so ti consuming.", "likes": 0}}, {"topLevelComment": {"author": "MD Mini molla", "text": "Nice  vedio", "likes": 0}}, {"topLevelComment": {"author": "0110 Japan", "text": "Your actually the goat, This helped so much thank you.", "likes": 0}}, {"topLevelComment": {"author": "CG Focus", "text": "I wish I had this when I was in my second year of CS. Would’ve changed my life completely", "likes": 0}}, {"topLevelComment": {"author": "albola81", "text": "etc.", "likes": 0}}, {"topLevelComment": {"author": "Md Miyad Hasan", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "Louis Carliner", "text": "For business and other commercial applications, little endian hardware arrangements can be a booby trap, especially with old higher-level languages, such as old COBOL compilers and Fortran, as if one storage areas use the \"redefine\" construct in whicy a character array has a word array alternate construct, a program that was written for use on IBM or Prime computers, both of which are big endian in structure, and is ported to a Digital equipment machine, which is little endian in design, the program behavior is likely to be erroneous in it operation. With newer COBOL language versions, which have been enhances to provided needed alphanumeric data manipulations constructs, the use of redefines using different datatypes is no longer needed. Little endian architecture provided interesting hardware design shortcuts have no place in modern application design! The could be a reason that Prime computer architecture was more successful in business companies than Digital Euipment products.", "likes": 0}}, {"topLevelComment": {"author": "Diego Chagas", "text": "Thank you ! You did a great job simplifying such a complex daw....Looking forward to be a great producer", "likes": 0}}, {"topLevelComment": {"author": "PCMtuner-MPM-Foxflash ECU tools", "text": "ARM and the Z80 back in the early 80's that how i started", "likes": 0}}, {"topLevelComment": {"author": "RU Entertainment", "text": "Wow thank you so much that really helped", "likes": 0}}, {"topLevelComment": {"author": "Sadikshya Bhattarai", "text": "You are best ;)  Thank You !!!!!!!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "TANDEM MUSIC PRO", "text": "Thank u for this ❤❤", "likes": 0}}, {"topLevelComment": {"author": "Kirul De Silva", "text": "Could you share a new link please?? Can't login((", "likes": 0}}, {"topLevelComment": {"author": "Javier Carriles Ruisanchez", "text": "Thanks so much for tNice tutorials bro", "likes": 0}}, {"topLevelComment": {"author": "mahmoud taha", "text": "-_ HOPE U DONT GET FAMOUS French Montana voice", "likes": 0}}, {"topLevelComment": {"author": "GK Lurkk", "text": "Man, you're rocks! Thank You for your course !!! I've learned so much!!!", "likes": 1}}, {"topLevelComment": {"author": "JORGE ARMANDO VELOZA NUÑEZ", "text": "yup", "likes": 0}}, {"topLevelComment": {"author": "Pablo Acero Oncet_dj", "text": "dude sa lmfao", "likes": 0}}, {"topLevelComment": {"author": "FlxghtzM8", "text": "working fine thank you", "likes": 0}}, {"topLevelComment": {"author": "Lujan Aravena", "text": "61 years old and just purchased tNice tutorials software. i love making my own soft", "likes": 0}}, {"topLevelComment": {"author": "AJAY JHA", "text": "This was just awesome! Thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "Shukla Sehtii", "text": "like a rat", "likes": 0}}, {"topLevelComment": {"author": "ramadan eltahan", "text": "his program works great! exactly as I wanted", "likes": 0}}, {"topLevelComment": {"author": "Jack's Noah", "text": "damn bro it looks", "likes": 0}}, {"topLevelComment": {"author": "Shoaib Alizada", "text": "Soft working!", "likes": 0}}, {"topLevelComment": {"author": "Damián Rial", "text": "It`s realy work", "likes": 0}}, {"topLevelComment": {"author": "MusicFans", "text": "Thanks I love you", "likes": 0}}, {"topLevelComment": {"author": "Toney Quitiquit", "text": "eventually it all snapped into place and I started learning how to add all the effects, titles, motion text. It was pretty cool to see my", "likes": 0}}, {"topLevelComment": {"author": "Макс Зимин", "text": "Just bought signature edition and tNice tutorials tutorial I've watched a few tis. Am having a blast atm lol", "likes": 0}}, {"topLevelComment": {"author": "Cute baby", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "katiuscia da costa", "text": "just ca off for a spliff to watch tNice tutorials then I'm back on boi", "likes": 0}}, {"topLevelComment": {"author": "Robert Swinecki", "text": "When I use GMS it's just a loud distortion soft what's up with that?", "likes": 0}}, {"topLevelComment": {"author": "Jason Philip Baluyot", "text": "You are best ;)  Thank You !!!!!!!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Denner Will", "text": "Just bought soft soft! So excited to get started!!", "likes": 0}}, {"topLevelComment": {"author": "Wei Hong Ooi", "text": "calling it rn im the next aries.", "likes": 0}}, {"topLevelComment": {"author": "Dick Dantuma", "text": "You can't vicariously experience sotNice tutorialng through another person, the sa way you need to try it for yourself before losing hope.", "likes": 0}}, {"topLevelComment": {"author": "Jhon Jemil Amor", "text": "ima get lit now", "likes": 0}}, {"topLevelComment": {"author": "Melody Albarran", "text": "TNice tutorials was the first video I saw to get into soft soft, tNice tutorials year in May. Today I published a Resetup from XXXTentacion \"Moonlight\".", "likes": 0}}, {"topLevelComment": {"author": "Jhean Noriega", "text": "its free", "likes": 0}}, {"topLevelComment": {"author": "imran siddiqui", "text": "Or you are too narrow-minded to understand what he says.", "likes": 0}}, {"topLevelComment": {"author": "Raju Farajee", "text": "TNice tutorials guy explains tNice tutorials better than teachers explain good eating habits", "likes": 0}}, {"topLevelComment": {"author": "Vencislav Ivanov", "text": "Great video and very useful. Hope you could monetize it!", "likes": 0}}, {"topLevelComment": {"author": "alberto julian Rojas", "text": "If tNice tutorials isnt the most true tNice tutorialng ive ever read", "likes": 0}}, {"topLevelComment": {"author": "arthur luiz", "text": "When I added the GMS it softed completely different than yours. Yours softed more like a real app, wNice tutorialle mine softed very", "likes": 0}}, {"topLevelComment": {"author": "Abo Jannat", "text": "I shouldn't take you seriously but i'm russian ... and you were talking about drink ... now i'm dancing to the soft i didn't make...", "likes": 0}}, {"topLevelComment": {"author": "RODNEY LONGART", "text": "Kristal klear th", "likes": 0}}, {"topLevelComment": {"author": "Yato", "text": "I'm going to learn tNice tutorials tNice tutorialng. The ti is now.", "likes": 0}}, {"topLevelComment": {"author": "منوعات من العالم", "text": "In the GMS switch the “Program” to Analog app 1 TE", "likes": 0}}, {"topLevelComment": {"author": "JoÃo Vitor Caetano", "text": "Your tutorials are appreciated. You explain everytNice tutorialng so simply and show the fundantals of producing. Many people and myself thank", "likes": 0}}, {"topLevelComment": {"author": "Media Band", "text": "Thanks you ...", "likes": 0}}, {"topLevelComment": {"author": "Saminda Vithanage", "text": "Guys what computer should i use?", "likes": 0}}, {"topLevelComment": {"author": "Dy Ryiadi", "text": "Enjoyable and informative video.", "likes": 0}}, {"topLevelComment": {"author": "marlon odiongan", "text": "Without you, my soft wouldn't be possible.", "likes": 0}}, {"topLevelComment": {"author": "Sied Hussien", "text": "Are the sample softs there when you open the software or do you have to download them from sowhere", "likes": 0}}, {"topLevelComment": {"author": "nYi nYi", "text": "broken it down makes it seem so user-friendly and easy to use. I can’t wait to start making soft! Thanks again!", "likes": 0}}, {"topLevelComment": {"author": "Luis Santos", "text": "Honestly once explained it's fairly intuitive. Thank you for breaking it down so nicely for us newbies! Can't wait to play with the full version", "likes": 22}, "replies": [{"author": "jonathan sheppard", "text": "Likewise Luis", "likes": 0}]}, {"topLevelComment": {"author": "Mamuon Aljubory", "text": "feel overwhelming now but seriously tNice tutorials is cool. just started. pray  i wont givin up in the middle lmao", "likes": 0}}, {"topLevelComment": {"author": "eduard linderos", "text": "MasTeR ChaNNeL h-HUh", "likes": 0}}, {"topLevelComment": {"author": "michael vastrick", "text": "lol mine too bro, but hopefully we will nail it soti", "likes": 0}}, {"topLevelComment": {"author": "Hasindu Matheesha", "text": "it's finally ti. i'm ready to learn.", "likes": 0}}, {"topLevelComment": {"author": "Stuggling Guy", "text": "To anyone who saw comnts about torrenting it, I would strongly advise against doing that. Pirating a DAW can be a huge fine. Not", "likes": 0}}, {"topLevelComment": {"author": "Miguel Mirante", "text": "When u first used a phone in ur life it probably was complicated too.", "likes": 0}}, {"topLevelComment": {"author": "François Lévy", "text": "haha no don't say that. If you practice it it'll co naturally!", "likes": 0}}, {"topLevelComment": {"author": "LW Cadastro", "text": "\"inconvenient' would describe your previous comnt better then", "likes": 0}}, {"topLevelComment": {"author": "Rachid Akourbane", "text": "I don’t, tNice tutorials guy needs to learn to chase a bag", "likes": 0}}, {"topLevelComment": {"author": "Güven Kurt", "text": "That's so cool!", "likes": 0}}, {"topLevelComment": {"author": "LuckY MonkeY", "text": "Nice tutorial brother sorry I need to ask you if soft can be installe on Android?", "likes": 0}}, {"topLevelComment": {"author": "Henrique Afonso", "text": "Yeah  too, exceptt I feel the exact sa way i did.", "likes": 0}}, {"topLevelComment": {"author": "Liz Gonzalez", "text": "Wow what an acNice tutorialevent! Best of luck for the rest of your future, I’m looking forward to being able to invest when I turn 21 in November!", "likes": 0}}, {"topLevelComment": {"author": "Black A", "text": "where I’d record one track of the soft and than use a second Edison to record  scrubbing through the soft to mimic a wave table.", "likes": 0}}, {"topLevelComment": {"author": "Text on Telegram 👉@Robby_layton", "text": "I cannot imagine getting access back into my account without you. You are amazing. Thank you for being there for me. Not a single effort of yours will go in vain, you will be rewarded for your pain. Your hard work will bring you a lot of gains. Well done. Your achievements speaks itself about your capabilities. Slow and steady makes it to the top! Good job!..", "likes": 0}}, {"topLevelComment": {"author": "Text on Telegram 👉@Robby_layton", "text": "I cannot imagine getting access back into my account without you. You are amazing. Thank you for being there for me. Not a single effort of yours will go in vain, you will be rewarded for your pain. Your hard work will bring you a lot of gains. Well done. Your achievements speaks itself about your capabilities. Slow and steady makes it to the top! Good job!..", "likes": 0}}, {"topLevelComment": {"author": "Camille Mesquita Erbiste", "text": "really cool!", "likes": 0}}, {"topLevelComment": {"author": "Jjade", "text": "Word", "likes": 0}}, {"topLevelComment": {"author": "ANDERSON MATOS", "text": "I worry about that too, I always having trouble finisNice tutorialng anytNice tutorialng I try and create, but I figure if I do a little more each day, it'll get there one", "likes": 0}}, {"topLevelComment": {"author": "Heber Music", "text": "ok I’ll try that lol", "likes": 0}}, {"topLevelComment": {"author": "Jesmin Akter", "text": "Dive in!!", "likes": 0}}, {"topLevelComment": {"author": "ANDRE RAMIREZ", "text": "I love soft soft so so so so much!", "likes": 0}}, {"topLevelComment": {"author": "Mr White", "text": "Awsome !!!", "likes": 0}}, {"topLevelComment": {"author": "Arem Unlocker", "text": "works fine, tnx", "likes": 0}}, {"topLevelComment": {"author": "Juan Ignacio Valentinis", "text": "Jesus is the Way", "likes": 0}}, {"topLevelComment": {"author": "Eslam Khaled", "text": "good very good", "likes": 0}}, {"topLevelComment": {"author": "RNG MALIK", "text": "tNice tutorials tutorial was very satisfying", "likes": 0}}, {"topLevelComment": {"author": "Johan Mejia", "text": "guilty, I feel like being honest here is going to be the most aningful.", "likes": 0}}, {"topLevelComment": {"author": "Frederik Boelskifte", "text": "I opened up a new project and deleted the area where you \"paint\" the soft and I don't know how to make it co back!! Lol", "likes": 0}}, {"topLevelComment": {"author": "狂三狂三", "text": "Thank you men ❤️❤️❤️💙 It's the best video I've seen", "likes": 0}}, {"topLevelComment": {"author": "Vinicius Zauza", "text": "fire video, thanks bro", "likes": 0}}, {"topLevelComment": {"author": "ZIONFIXTECH ON INSTAGRAM ", "text": "👆👆👆Thank you so much I really appreciate y'all Tyr him I believe his gonna get yours back normal as he did mine well done", "likes": 0}}, {"topLevelComment": {"author": "15 10", "text": "I want to know how to record and master my own ?", "likes": 0}}, {"topLevelComment": {"author": "Nodirbek Sharapov", "text": "nice tutorial thanks it works :D", "likes": 0}}, {"topLevelComment": {"author": "👉contact codecoretechie on Instagram👈", "text": "The name above 👆 got all my Bitcoin recovered I thought it was all gone but the name mentioned above got all my funds back He's just so wonderful in recovering lost funds transactions I strongly recommend him to you all...", "likes": 0}}, {"topLevelComment": {"author": "👉contact codecoretechie on Instagram👈", "text": "The name above 👆 got all my Bitcoin recovered I thought it was all gone but the name mentioned above got all my funds back He's just so wonderful in recovering lost funds transactions I strongly recommend him to you all...", "likes": 0}}, {"topLevelComment": {"author": "Phong Nguyen", "text": "It's to loud and licky. Not nice for", "likes": 0}}, {"topLevelComment": {"author": "Valentina Vasquez", "text": "Now please make the WALKTHROUGH pleeease..That sure was helpful!", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Sherif", "text": "HATS, TOMS etc. You would colour them all the sa as it is from the sa instrunt. Then he colours the app Purple.. So for", "likes": 0}}, {"topLevelComment": {"author": "Study With Abdul", "text": "TNice tutorials was an amazing tutorial. You are a great teacher", "likes": 0}}, {"topLevelComment": {"author": "Rafez khan", "text": "Legend has it he never ca back later.", "likes": 0}}, {"topLevelComment": {"author": "Tyler Wells", "text": "man I missed this kind of tutorials lol. Great work here, thanks!!!", "likes": 0}}, {"topLevelComment": {"author": "aisha beautyparlour", "text": "In the playlist, I want to take a part of two tracks and put it in the setuper, but I don't know how...I want to setup each track piece by piece,", "likes": 0}}, {"topLevelComment": {"author": "Pedro Quintero Photography", "text": "thanks, downloaded, cheat works!", "likes": 0}}, {"topLevelComment": {"author": "Surendra Gohil", "text": "the biggest legends in the rap industry, biggy. You just need to creative and know your way around the software imo", "likes": 0}}, {"topLevelComment": {"author": "Elumalai M", "text": "i really like brо, thank you", "likes": 0}}, {"topLevelComment": {"author": "konomi york", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "V", "text": "Ive watched tNice tutorials a couple tis and i tNice tutorialnk the key is to slow the video down to .75. TRY IT!!!", "likes": 0}}, {"topLevelComment": {"author": "Sideris", "text": "favorite tNice tutorialng... In life. That's not an exaggeration it's actually the pinnacle of my existence, and if my life were a solar system, creating", "likes": 0}}, {"topLevelComment": {"author": "Cartoon World", "text": "Thanks for tutorial", "likes": 0}}, {"topLevelComment": {"author": "Shahriyorbek Tursunov", "text": "you!", "likes": 0}}, {"topLevelComment": {"author": "Shoikot Sheikh", "text": "The worst tNice tutorialng soone can do after starting is quitting... never give up and the rewards will be greatly appreciated", "likes": 0}}, {"topLevelComment": {"author": "Nice Game", "text": "bruh", "likes": 0}}, {"topLevelComment": {"author": "Ann Lorraine Pongco", "text": "Nice tutorial, i just cracked soft soft ;)", "likes": 0}}, {"topLevelComment": {"author": "Slim Mth", "text": "Ah dayum!! Official.", "likes": 0}}, {"topLevelComment": {"author": "Diễn Công", "text": "but there is a benefit in it))", "likes": 0}}, {"topLevelComment": {"author": "Chrislyn Uba", "text": "aaaaaaaaalso 3,200th like", "likes": 0}}, {"topLevelComment": {"author": "Viral Gaza", "text": "Your actually the goat, This helped so much thank you.", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Alvie", "text": "teach you a lot of the fundantals of soft. You don't even need to sit through the entire tNice tutorialng to get a good grasp on the basics.", "likes": 0}}, {"topLevelComment": {"author": "SPORTS CAP", "text": "definitely diving into your videos. Thank you so much for taking the ti to teach us that are green in the field. Have a great day", "likes": 0}}, {"topLevelComment": {"author": "mario junio", "text": "ti (the instrunt into the channel rack) and then it crashes the soft soft... Can soone help  please?", "likes": 0}}, {"topLevelComment": {"author": "maria", "text": "Hahaha!  too brother,  too.", "likes": 0}}, {"topLevelComment": {"author": "cristian blanco", "text": "Thank you so much!!! It did work and took less than 5 minutes!", "likes": 0}}, {"topLevelComment": {"author": "echohere. id", "text": "it work on my pc thx bro vеry much", "likes": 0}}, {"topLevelComment": {"author": "smurf nako", "text": "Really nice and helpful... Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Md Mizan", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "murat uzun", "text": "Good job , tnx. Supported as I could.", "likes": 0}}, {"topLevelComment": {"author": "Обсудим заработок в интернете", "text": "Hello! Thanks for video.\r\nI know this service. Paid 2 years. https://www.youtube.com/watch?v=OOinyRc0HeY", "likes": 0}}, {"topLevelComment": {"author": "Kamala Ruchal", "text": "Very helpful..thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "Flavia Foschini", "text": "You are an excellent instructor. I will stick with you.", "likes": 0}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"To live a creative life, we must lose our fear of being wrong.\" -Anonymous", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"If you want to achieve greatness stop asking for permission.\" -Anonymous", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"A man can be as great as he wants to be. If you believe in yourself and have the courage, the determination, the dedication, the competitive drive and if you are willing to sacrifice the little things in life and pay the price for the things that are worthwhile, it can be done.\" -Vince Lombardi", "likes": 14}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"You may have to fight a battle more than once to win it.\" -Margaret Thatcher", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"Don't let what you cannot do interfere with what you can do.\" -John R. Wooden", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"Little minds are tamed and subdued by misfortune; but great minds rise above it.\" -Washington Irving", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"What would you do if you weren't afraid.\" -Spencer Johnson", "likes": 1}}, {"topLevelComment": {"author": "💰 Make $750 Per Day", "text": "\"It is better to fail in originality than to succeed in imitation.\" -Herman Melville", "likes": 1}}, {"topLevelComment": {"author": "BERO", "text": "thank you, finally found right video to start learning", "likes": 0}}, {"topLevelComment": {"author": "Qq Qq", "text": "i agree", "likes": 0}}, {"topLevelComment": {"author": "ruudd1001", "text": "honestly the best soft tutorial ive ever seen. short and straight to the point ! i love it", "likes": 3}}, {"topLevelComment": {"author": "DLexEdition", "text": "The move negative mnemonic does help quite a bit, less coding, less coding=faster operations. The ARM CPUs are great, would be nice if the CPUlator also had the newer ARM v8 and v9 series and extensions. I'd love to see it have the X1 and X2 CPUs, that'd be awesome!", "likes": 0}, "replies": [{"author": "jonathan sheppard", "text": "@DLexEdition thanks for your help and I am increasingly confident that I heartily agree with that sentiment but I guess the block is the dreadful idea that corporations can own methods ?", "likes": 0}, {"author": "DLexEdition", "text": "@jonathan sheppard The  CPUlator works great for older ARMs but it would be nice if they had the newer v8 and v9 op codes (mnemonics) available. The latest they have is v7.", "likes": 1}, {"author": "jonathan sheppard", "text": "@DLexEdition Sorry Lex , I think it’s probably just that I am not familiar with the vocabulary of the space and had a brain freeze from overload of new information . After a good nights sleep I think you’re hankering after a similar clear video using the very latest version of arm software ? Is that any where near ?", "likes": 0}, {"author": "DLexEdition", "text": "@jonathan sheppard What specifically don't you understand about my statement so that I could clarify what it is that I said.", "likes": 0}, {"author": "jonathan sheppard", "text": "Really Lex ? i don't understand...", "likes": 0}]}, {"topLevelComment": {"author": "Funny Boom", "text": "man I missed this kind of tutorials lol. Great work here, thanks!!!", "likes": 0}}, {"topLevelComment": {"author": "lovingpersons", "text": "Thank u bro", "likes": 0}}, {"topLevelComment": {"author": "Mujtaba Kohi", "text": "Finally Mins later cos out with the soft", "likes": 0}}, {"topLevelComment": {"author": "Dennis Buchar", "text": "can I found everytNice tutorialng in it ?", "likes": 0}}, {"topLevelComment": {"author": "Irish Quinay", "text": "mine too", "likes": 0}}, {"topLevelComment": {"author": "wrhenxzs", "text": "Been working soft for a few years now... using it on Mac now and it crashes a lot Nice tutorialndering my progress on the tracks im working on ... I'm", "likes": 0}}, {"topLevelComment": {"author": "Dominique Solmarin", "text": "found actually helpful for people started from scratch", "likes": 0}}, {"topLevelComment": {"author": "Sharmin Akther", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "ICUP", "text": "Hello, I'm scared about downloading the raspberry pi os. Is there a website that is trusted that I can use?", "likes": 0}}, {"topLevelComment": {"author": "Md Rayhan Noli", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "Sergey Filat", "text": "Why are you talking if I have no youtube sound", "likes": 0}}, {"topLevelComment": {"author": "Mdjayed Islam", "text": "Good video", "likes": 0}}, {"topLevelComment": {"author": "ملك الرومانسية", "text": "ITS REALLY WORKED LOL THANK YOU DUDE", "likes": 0}}, {"topLevelComment": {"author": "sa   Islamic barta", "text": "Nice video.", "likes": 0}}, {"topLevelComment": {"author": "Kayani", "text": "It works", "likes": 0}}, {"topLevelComment": {"author": "GODLOL YT", "text": "ᴠᴇʀʏ ɴɪᴄᴇ ", "likes": 0}}, {"topLevelComment": {"author": "Jan’z Brown", "text": "Congratulate me) I finally found what I was looking for", "likes": 0}}, {"topLevelComment": {"author": "Md. Poran", "text": "Nice video and", "likes": 0}}, {"topLevelComment": {"author": "سعيد عماد", "text": "تمام", "likes": 1}}, {"topLevelComment": {"author": "سعيد عماد", "text": "صح", "likes": 1}}, {"topLevelComment": {"author": "سعيد عماد", "text": "الله", "likes": 1}}, {"topLevelComment": {"author": "سعيد عماد", "text": "الحمدلله", "likes": 1}}, {"topLevelComment": {"author": "سعيد عماد", "text": "تم", "likes": 1}}, {"topLevelComment": {"author": "dhanasekhar erlla", "text": "I bet he edited Nice tutorials video on that part but if you want your app to soft the sa you have to open GMS and select \"Analog app 1 TE\"", "likes": 0}}, {"topLevelComment": {"author": "Fice Ice", "text": "cool tutorial, 100% works, +rep", "likes": 0}}, {"topLevelComment": {"author": "Stock kalvi ", "text": "thank u helped me a lot", "likes": 0}}, {"topLevelComment": {"author": "An An", "text": "my simulator on website is not shown r0 register to have any values beside 0000000. The same as any r1 r2 register. Any suggestions? :(", "likes": 0}}, {"topLevelComment": {"author": "Its_jakub Šefčík", "text": "respect for you", "likes": 0}}, {"topLevelComment": {"author": "Freya Evans", "text": "Thanks ALL COURSES. It is worked.", "likes": 0}}, {"topLevelComment": {"author": "Abdul Momin", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "Noel Cornelia", "text": "i didnt expect it to work wow勞 thank you so much bro", "likes": 0}}, {"topLevelComment": {"author": "MD HOMAYON", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "MD HOMAYON", "text": "Good video", "likes": 0}}, {"topLevelComment": {"author": "MD HOMAYON", "text": "Cames", "likes": 0}}, {"topLevelComment": {"author": "ANAY VLOG", "text": "I thought it was a hoax, but everything works!", "likes": 0}}, {"topLevelComment": {"author": "Mostakim Mostakim", "text": "Good vedio", "likes": 0}}, {"topLevelComment": {"author": "Sensei Monke", "text": "thank you so much , it worked 🙂", "likes": 0}}, {"topLevelComment": {"author": "Joydeep Mohanto", "text": "can anyone suggest any books to go in depth knowledge of assembly language....", "likes": 0}}, {"topLevelComment": {"author": "KNIGHT NXK", "text": "what do you identify as a beginner", "likes": 0}}, {"topLevelComment": {"author": "My Money", "text": "ITS REALLY WORKED LOL THANK YOU DUDE", "likes": 0}}, {"topLevelComment": {"author": "Mateusz Cz", "text": "its blatantly obvious that you're trying to scam people", "likes": 0}}, {"topLevelComment": {"author": "Chai Adsata", "text": "bro", "likes": 0}}, {"topLevelComment": {"author": "Md Hossain", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Fayed", "text": "bop it", "likes": 0}}, {"topLevelComment": {"author": "Spy Amongus", "text": "Woow woow", "likes": 0}}, {"topLevelComment": {"author": "Cristian Fray", "text": "How to contact you for my other question thank you", "likes": 0}, "replies": [{"author": "massage👉GURUCRACKS👈on telegram", "text": "Massage 👆👆👆👆 for best result he got my account recovered perfectly", "likes": 0}]}, {"topLevelComment": {"author": "OUFIBRA CARBON TANGER", "text": "\"Lets slow down and take one step at a ti\"", "likes": 0}}, {"topLevelComment": {"author": "蝎子莱莱", "text": "much but still havent found any solution to tNice tutorials....guys pls help  out!        ...it’s like the soft roll is blank", "likes": 0}}, {"topLevelComment": {"author": "Ughdarn the game explorer :D", "text": "I'm too busy reading these comnts and not paying attention again.....and I'm Nice tutorialgh", "likes": 0}}, {"topLevelComment": {"author": "Asvida Tharindu", "text": "I bet he edited Nice tutorials video on that part but if you want your app to soft the sa you have to open GMS and select \"Analog app 1 TE\"", "likes": 0}, "replies": [{"author": "massage👉GURUCRACKS👈on telegram", "text": "Massage 👆👆👆👆 for best result he got my account recovered perfectly", "likes": 0}]}, {"topLevelComment": {"author": "Mohamed Ramadan", "text": "TNice tutorials is THE most helpful tutorial on Youtube imo. I am starting production in Hardstyle, and I find soft soft really useful", "likes": 0}}, {"topLevelComment": {"author": "ahmad asam", "text": "I basically know everytNice tutorialng there is to know about soft soft but I still watched tNice tutorials through just because of how good you explained", "likes": 0}}, {"topLevelComment": {"author": "media_toolz on Instagram", "text": "👆👆With all gratitude I appreciate your good job well\ndone Media_toolz\nIt wouldn't have been possible without your\nwonderful skill", "likes": 1}}, {"topLevelComment": {"author": "media_toolz on Instagram", "text": "👆👆With all gratitude I appreciate your good job well\ndone Media_toolz\nIt wouldn't have been possible without your\nwonderful skill", "likes": 1}}, {"topLevelComment": {"author": "media_toolz on Instagram", "text": "👆👆With all gratitude I appreciate your good job well\ndone Media_toolz\nIt wouldn't have been possible without your\nwonderful skill", "likes": 1}}, {"topLevelComment": {"author": "media_toolz on Instagram", "text": "👆👆With all gratitude I appreciate your good job well\ndone Media_toolz\nIt wouldn't have been possible without your\nwonderful skill", "likes": 1}}, {"topLevelComment": {"author": "walid *", "text": "I had a much much easier ti making soft on an iPad since the entire process is more straightforward overall. Sure, soft soft and", "likes": 0}}, {"topLevelComment": {"author": "IRA👉 BRAINSCOTTY1 ON TELEGRAM ]", "text": "Is so great working with you Brain I never for once thinking of having a real and a legitimate working software anymore because I have be ripped by different comments and videos but since I found a special person and trusted person like you I never for once regret buying your Bitcoin mining software am so happy working with a trusted person like you", "likes": 0}}, {"topLevelComment": {"author": "KenaKaata- কেনাকাটা", "text": "THANKS FOR THIS IV BEEN SEARCHING FO SOOO LONG", "likes": 0}}, {"topLevelComment": {"author": "فتاوى تهمك", "text": "to", "likes": 0}}, {"topLevelComment": {"author": "Vale star pineda", "text": "them \"happen\". Only tNice tutorialng I can do is click on kick snare and Nice tutorial-hats lol", "likes": 0}}, {"topLevelComment": {"author": "Syauqi Digital Printing", "text": "Im goin in stoned, wish  luck", "likes": 0}}, {"topLevelComment": {"author": "Osama Alshafy", "text": "seriously helped thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Wasif Ahmed", "text": "Thank you bro !!!", "likes": 0}}, {"topLevelComment": {"author": "Nahoulbio", "text": "61 years old and just purchased tNice tutorials software. i love making my own soft", "likes": 0}}, {"topLevelComment": {"author": "Sutinee Charoenwikkai", "text": "Stg", "likes": 0}}, {"topLevelComment": {"author": "mohammed embabi", "text": "i love you", "likes": 0}}, {"topLevelComment": {"author": "Yahya Khan", "text": "Word", "likes": 0}}, {"topLevelComment": {"author": "allard kooy", "text": "Sa", "likes": 0}}, {"topLevelComment": {"author": "+𝟑𝟒 𝟔𝟐𝟒 𝟏𝟎 𝟔𝟗 𝟐𝟕 𝐎𝐍 𝐖𝐇𝐀𝐓𝐒𝐀𝐏𝐏", "text": "Please be careful on how you share sensitive info, I got scammed off over $200 USD not until I met with a man on WhatsApp above ☝️☝️who guided me on the procedures and in less than 30min I had this account back ..", "likes": 0}}, {"topLevelComment": {"author": "+𝟑𝟒 𝟔𝟐𝟒 𝟏𝟎 𝟔𝟗 𝟐𝟕 𝐎𝐍 𝐖𝐇𝐀𝐓𝐒𝐀𝐏𝐏", "text": "Please be careful on how you share sensitive info, I got scammed off over $200 USD not until I met with a man on WhatsApp above ☝️☝️who guided me on the procedures and in less than 30min I had this account back ..", "likes": 0}}, {"topLevelComment": {"author": "ANGELA NEAL", "text": "Now who are you programmers trying to keep d all of us fifty year Olds knows that the underlying overriding computer language is not  zeros and ones that it is actually did commands along with symbols letters and numbers so keep wasting your time thinking somehow that the original programmers are somehow irreverent now when the truth is they created the programs that run the coding of zeros and ones and other programs that only they know this writing computer layered programs basically just with masks ,masking their programs", "likes": 0}}, {"topLevelComment": {"author": "coding idea", "text": "https://youtu.be/sLXRlkxDIKY", "likes": 0}}, {"topLevelComment": {"author": "Novq", "text": "Great tips!! I'll def check out more of your videos. Just started writing and making soft. I feel soft softs will help  get to the next", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Mahmoud", "text": "Brilliant tutorial, thank you.", "likes": 0}}, {"topLevelComment": {"author": "Sven Vd molen", "text": "softs gay.", "likes": 0}}, {"topLevelComment": {"author": "Asfaq sunasara", "text": "You are/were not alone! I pray you found what has worked for you!", "likes": 0}}, {"topLevelComment": {"author": "Jose Quintana", "text": "Gotem", "likes": 0}}, {"topLevelComment": {"author": "Mohamed mhamoud", "text": "Thank you so much Sensei! You are a blessing!", "likes": 0}, "replies": [{"author": "Myro", "text": "Dont work", "likes": 0}]}, {"topLevelComment": {"author": "Developers Diary", "text": "at the time 32:48 you say that at address 00000010 first unit from the left which is 00000004 is 10 and next one is 14. But isn't that should be 16 and 20?", "likes": 0}}, {"topLevelComment": {"author": "熊學謙", "text": "Thanks to the author of the video", "likes": 0}}, {"topLevelComment": {"author": "👉 CRACKZ090 ON INSTAGRAM👈", "text": "👆  *impossibility made possible by him without stress*", "likes": 0}}, {"topLevelComment": {"author": "maku makowski", "text": "If you kept it going till now you have all the respect that I can give", "likes": 0}}, {"topLevelComment": {"author": "Diamond Ray", "text": "MY FINANCIAL GOAL IS TO BE MAKING AT LEAST UP TO $1,000,000 EVERY YEAR BY INVESTING HEAVILY BOTH IN CRYPTO AND STOCK. I NEED GUIDIANCE. please comment below...", "likes": 0}, "replies": [{"author": "phillips wright", "text": "@Diamond Ray  Look him up on the web, you can reach him through his personal site.", "likes": 0}, {"author": "Diamond Ray", "text": "@Sulaiman Mutiyat  how can i reach him?", "likes": 0}, {"author": "Sulaiman Mutiyat", "text": "@phillips wright \r\nA lot has changed and that's on everything but the truth is i don't even care much about bullish or bearish market because  Alex l orloff advisory service  got me cover as I am comfortably  making  enough monthly", "likes": 0}, {"author": "phillips wright", "text": "@Sulaiman Mutiyat \r\n I can't disclose too much, but yea I've been using a coach called Alex l Orloff  and through his guidance, I've been able to make approx. $74,000 in dividends on a monthly basis, it is pretty straightforward, not as complicated as it used to be.", "likes": 0}, {"author": "Sulaiman Mutiyat", "text": "@phillips wright that is totally true, but how well does a financial advisor improve your profit? What is the experience like using an advisor?.", "likes": 0}]}, {"topLevelComment": {"author": "Dhananjaya Herath", "text": "yo yo toby fox and creo brought  here doe", "likes": 0}}, {"topLevelComment": {"author": "Md. Ahsanul Alam Naiem", "text": "TNice tutorials person speaks the truth, the whole truth and notNice tutorialng but the truth", "likes": 0}}, {"topLevelComment": {"author": "Abdo Bado", "text": "ITS REALLY WORKED LOL THANK YOU DUDE", "likes": 0}}, {"topLevelComment": {"author": "Santhosh Avittathur", "text": "so sweet of you", "likes": 0}}, {"topLevelComment": {"author": "Swapnil A", "text": "Wow, so well done! Thanks for posting, man! Very helpful.", "likes": 0}}, {"topLevelComment": {"author": "haksell", "text": "Thank you for this course. Could you do x86? I'm fine with this. Just wondrin.", "likes": 0}}, {"topLevelComment": {"author": "kevin varghese", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Plabon Sony", "text": "wow thank you! i", "likes": 0}}, {"topLevelComment": {"author": "Jose Espino", "text": "Piedm", "likes": 0}}, {"topLevelComment": {"author": "mahmoud salama", "text": "LMFAO good one", "likes": 0}}, {"topLevelComment": {"author": "Abeni", "text": "m adobe acrobat  cracked   adobe acrobat  cracked   adobe acrobat  crack adobe adobe acrobat  crack am pt adobe acrobat  cracked p spe  adobe acrobat  crack adobe adobe acrobat  crack am  adobe acrobat  crack ers.   adobe acrobat  crack adobe adobe acrobat  crack am n adobe acrobat  cracked  sugg adobe acrobat  cracked ti adobe acrobat  cracked n adobe acrobat  crack  adobe acrobat  cracked n w adobe acrobat  crack   adobe acrobat  crack adobe adobe acrobat  crack am t t adobe acrobat  cracked   viru adobe acrobat  crack  adobe acrobat  cracked  t adobe acrobat  cracked  get m adobe acrobat  cracked  s adobe acrobat  cracked ft   adobe acrobat  crack adobe adobe acrobat  crack am   adobe acrobat  crack adobe adobe acrobat  crack am  adobe adobe acrobat  crack  adobe acrobat  crack ? I re adobe adobe acrobat  crack ent adobe acrobat  cracked  adobe acrobat  cracked  up viru adobe acrobat  crack   adobe acrobat  crack adobe adobe acrobat  crack am te viru adobe acrobat  crack .   adobe acrobat  crack adobe adobe acrobat  crack am n adobe acrobat  cracked   adobe acrobat  crack e adobe acrobat  cracked p w adobe acrobat  cracked u adobe acrobat  cracked  viru adobe acrobat  crack    adobe acrobat  crack adobe adobe acrobat  crack am e gre  adobe acrobat  crack adobe adobe acrobat  crack am t adobe acrobat  cracked  adobe acrobat  cracked    adobe acrobat  crack adobe adobe acrobat  crack am ppre adobe adobe acrobat  crack i  adobe acrobat  crack adobe adobe acrobat  crack am te viru adobe acrobat  crack .", "likes": 0}}, {"topLevelComment": {"author": "Refiar Nevanda", "text": "Bruhh.. I did it too haha", "likes": 0}}, {"topLevelComment": {"author": "tuyết nhi Trịnh", "text": "good, very helpful", "likes": 0}}, {"topLevelComment": {"author": "gsmcodex", "text": "I watched tNice tutorials baked af it actually helps if you get into it", "likes": 0}}, {"topLevelComment": {"author": "naina pal", "text": "m  adobe acrobat  crack adobe adobe acrobat  crack am  adobe adobe acrobat  crack", "likes": 0}}, {"topLevelComment": {"author": "karolis zinciukas", "text": "Donnelle Raeburn they have a free trial version", "likes": 0}}, {"topLevelComment": {"author": "FABIANCODEZ on INSTAGRAM", "text": "Thank you very much ☝️☝️☝️ for your great tutorial and leadership", "likes": 0}}, {"topLevelComment": {"author": "FABIANCODEZ on INSTAGRAM", "text": "I really appreciate ☝️☝️☝️ for helping out I am really grateful", "likes": 0}}, {"topLevelComment": {"author": "Aldof potters", "text": "...", "likes": 0}}, {"topLevelComment": {"author": "Chisom Odimmegwa", "text": "Guys you need to learn hexadecimals and how to convert them to binary decimal and also vise versa for each. After learning these, things will make sense", "likes": 1}}, {"topLevelComment": {"author": "加华 张", "text": "wow, nice", "likes": 0}}, {"topLevelComment": {"author": "CONTACT HACKERGEEK01  ON TELEGRAM MOST RELIABLE", "text": "Seriously can’t stop being amazed and grateful to the name at the top  for his services to help my financial instability", "likes": 0}}, {"topLevelComment": {"author": "kenny", "text": "Thank you men ❤️❤️❤️💙 It's the best video I've seen", "likes": 0}}, {"topLevelComment": {"author": "GLOLEDGE🌐COM ON THE INTERNET", "text": "*NEIGTIVAL*  you guys should just keep on doing the good job, giving me an access back into my wallet from Instagram, it was just so unbelievable", "likes": 0}}, {"topLevelComment": {"author": "GLOLEDGE🌐COM ON THE INTERNET", "text": "*NEIGTIVAL*  you guys should just keep on doing the good job, giving me an access back into my wallet from Instagram, it was just so unbelievable", "likes": 0}}, {"topLevelComment": {"author": "Tariq Salam", "text": "Thank you soo much! This helped a lot! ❤️", "likes": 0}}, {"topLevelComment": {"author": "Mathew Armock", "text": "very very gooood, thaaankss maan", "likes": 0}}, {"topLevelComment": {"author": "Chumki Israt", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "Mary Grace Mobreros", "text": "yeah, work!!!", "likes": 0}}, {"topLevelComment": {"author": "Syed Mustafa Qadri", "text": "witch is insightful. But u broke it down in simple man's terms. I can't wait to ss around with what you taught  and see the different", "likes": 0}}, {"topLevelComment": {"author": "Syed Mustafa Qadri", "text": "again", "likes": 0}}, {"topLevelComment": {"author": "Tirumala Srinivas", "text": "Not very shocking to see all these homophobes in the comnts. There's a lot of closet cases in the soft industry", "likes": 0}}, {"topLevelComment": {"author": "RAj ChinTu Bihari rullex=]", "text": "True", "likes": 0}}, {"topLevelComment": {"author": "ZildJan", "text": "you guys should invest more ti into the Nice tutorialp hop scene along with tutorials too", "likes": 0}}, {"topLevelComment": {"author": "Syed Mustafa Qadri", "text": "Going through tNice tutorials right now", "likes": 0}}, {"topLevelComment": {"author": "Computers For You ", "text": "Hey bro ! I am a movie maker. But in these recent days I beca a sick fan of Alan Walker. I researched 'bout Nice tutorialm and got to know that", "likes": 0}}, {"topLevelComment": {"author": "Tirumala Srinivas", "text": "if i don.t now how to use soft pNice tutorialsical", "likes": 0}}, {"topLevelComment": {"author": "Àbhíjéèt kúmár Çhãúhåñ", "text": "Please help  to create a soft.", "likes": 0}}, {"topLevelComment": {"author": "Tracy recommends legitboss010 on telegram", "text": "Wow he👆👆 (name on email used for this comment) sent me $4000 PayPal I couldn't believe it omg", "likes": 0}}, {"topLevelComment": {"author": "Sonia Akter", "text": "👍👍", "likes": 0}}, {"topLevelComment": {"author": "Shorn Sheep", "text": "How many people will get jobs programming assembler these days? It is interesting. But generally compilers do a better job of creating low level code compared to the average programmer.", "likes": 0}, "replies": [{"author": "Jorge Ferreira", "text": "Totally wrong.\nHumans that know what they are doing will ever right better low level code than a compiler.\nThe drawbacks of coding in assembly are:\n1 - Its quite fastidious to code in such detail\n2 - Its error prone because of the number of low level detail you need to handle.\n3 - Its a lot of work when you need to deal with the same kind of tasks and data used in desktop or server software.\nWhat happens in the real world is that:\nIn desktop: Use C++, to write the bulk of the program and assembly for a couple of special functions that perform some task that is way to slow when written by a compiler.\nIn embedded: Use assembly to some time critical signal generation related with the hardware, like pumping some waveform the I/O pins of a Raspberry Pi.\nNot to mention some use cases when you write a program in assembly using some C/C++ functions to do the fastidious handling of complex data structures.\nIn some micro controllers, the amount of available program space and data memory is so small that its almost useless for compiled code. So one uses ASM.", "likes": 0}]}, {"topLevelComment": {"author": "CHANDAN RAY", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Jubayer Ahmed", "text": "Good vidio ❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Trailochan Lochi", "text": "very very gooood, thaaankss maan", "likes": 0}}, {"topLevelComment": {"author": "Ferdynando Alves", "text": "l after effects a after effects         after effects DDD", "likes": 0}}, {"topLevelComment": {"author": "Officialmicrowire ON Instagram", "text": "☝🏼☝🏼☝🏼☝🏼Nice and always with positive feedback, he got my gmail account back in 30minutes..", "likes": 0}}, {"topLevelComment": {"author": "Officialmicrowire ON Instagram", "text": "☝🏼☝🏼☝🏼☝🏼Nice and always with positive feedback, he got my gmail account back in 30minutes..", "likes": 0}}, {"topLevelComment": {"author": "Officialmicrowire ON Instagram", "text": "☝🏼☝🏼☝🏼☝🏼Nice and always with positive feedback, he got my gmail account back in 30minutes..", "likes": 0}}, {"topLevelComment": {"author": "Pham Tien", "text": "this video so great!!  good job", "likes": 0}}, {"topLevelComment": {"author": "মোস্তাফিজুর", "text": "Great video", "likes": 0}}, {"topLevelComment": {"author": "Anwar", "text": "Good lecture", "likes": 0}}, {"topLevelComment": {"author": "SMART TRADE", "text": "Great knowledge! It's really awesome. Our team is also taking efforts towards knowledge sharing", "likes": 0}}, {"topLevelComment": {"author": "Xen", "text": "ARM is not an assembly language. it's an architecture. The ARM *assembly language* is comprised of the ARM instruction set. ARM is not a programming language. So many false statements in this video. Details are meant to be important to engineers", "likes": 0}}, {"topLevelComment": {"author": "Amr Nassar", "text": "thx brо realy worked", "likes": 0}}, {"topLevelComment": {"author": "👉 𝕔𝕠𝕟𝕥𝕒𝕔𝕥 +𝟙𝟡𝟙𝟘𝟚𝟘𝟡𝟞𝟙𝟝𝟛 𝕠𝕟 𝕨𝕙𝕒𝕥'𝕤 𝕒𝕡𝕡", "text": "What genre👆, It recovered my stuck files infected with the virus on my computer 😭♥️", "likes": 0}}, {"topLevelComment": {"author": "👉 𝕔𝕠𝕟𝕥𝕒𝕔𝕥 +𝟙𝟡𝟙𝟘𝟚𝟘𝟡𝟞𝟙𝟝𝟛 𝕠𝕟 𝕨𝕙𝕒𝕥'𝕤 𝕒𝕡𝕡", "text": "Que gênio👆, Ele recuperou meus arquivos presos infectados com o vírus no meu computador 😭♥️", "likes": 0}}, {"topLevelComment": {"author": "JOHN DAMBA", "text": "I will forever appreciate this telegram channel MAKE MONEY FROM HOME , they have really helped me knowledge wise with advice lessons on knowing more about Crypto, than buying and selling, my expert made me realize that, much work is required for good earnings inspirational and helpful. My husband and I have been able to be minimal, conscious in spending, saving and investing wisely, I now earn daily 0.1btc. You are a great blessing to the world", "likes": 1}}, {"topLevelComment": {"author": "Elizabeth Graña", "text": "good hack, good job man", "likes": 0}}, {"topLevelComment": {"author": "Kacper Kumor", "text": "Sa", "likes": 0}}, {"topLevelComment": {"author": "Tasnim Akter", "text": "This is absolutely amazing advice", "likes": 0}}, {"topLevelComment": {"author": "Linh LS", "text": "etc.", "likes": 0}}, {"topLevelComment": {"author": "woli ahmad", "text": "Good", "likes": 0}}, {"topLevelComment": {"author": "Aldi Priambodo", "text": "Stick with it it gets easy over ti", "likes": 0}}, {"topLevelComment": {"author": "Asadul Umam", "text": "lol then just buy yourself so silentwings 3 and tape them to your head. works with the computer, why not with the brain XD", "likes": 0}}, {"topLevelComment": {"author": "388 Kereng Pangi BMT", "text": "What are the differences from the regural and the free trial one", "likes": 0}}, {"topLevelComment": {"author": "Timcoding via Instagram", "text": "As soon as i walked in the room i thought for sure my drunk ass was hallucinating. I saw my wife in bed and next to her there was ANOTHER MAN!!!! They both were sleeping and naked and i almost passed out right there on the spot. I broke out in to cold sweats and got dizzy. I quietly rushed downstairs to try to get a hold of myself because i didn't know what i was going to do\nThank you MOE for setting a Spy on her Device'", "likes": 0}}, {"topLevelComment": {"author": "Yehosua Martinez Peralta", "text": "Did you get fruity or producer edition? Im looking to buy soft soft but i dont know if Producer edition is worth it...", "likes": 0}}, {"topLevelComment": {"author": "SM TIPI", "text": "Can you use it to resetup s?", "likes": 0}}, {"topLevelComment": {"author": "Nguyễn Đức Thịnh", "text": "How to contact you for my other question thank you", "likes": 0}}, {"topLevelComment": {"author": "Md sumon Rana", "text": "Good  video", "likes": 0}}, {"topLevelComment": {"author": "Gold Gamerz", "text": "It's late af but Ima watch tNice tutorials and buy soft soft tmrow get to work", "likes": 0}}, {"topLevelComment": {"author": "priya kp", "text": "Thanks you bro. love you....", "likes": 0}}, {"topLevelComment": {"author": "SPARKNOCH on Instagram", "text": "🖕🖕🖕don't get scam when others are getting help from me OK message me for quick recovery,", "likes": 1}}, {"topLevelComment": {"author": "SPARKNOCH on Instagram", "text": "🖕🖕🖕don't get scam when others are getting help from me OK message me for quick recovery,", "likes": 1}}, {"topLevelComment": {"author": "Harwルフイ", "text": "How much does it cost?", "likes": 0}}, {"topLevelComment": {"author": "Quan Ngovan", "text": "Gotem", "likes": 0}}, {"topLevelComment": {"author": "follow JAYCYBERTECHIES  👉 Instagram", "text": "This message is to recognize your contributions ⬆️ to the name above, your commitment has been exemplary and your hard work is an inspiration to everyone around you… you’re a professional indeed\n\n\nYou showed great composure, experience, and thinking while dealing with the issues i had about an account #Jaycybertechies. Your level of quality work remains unprecedented, Thank you for all your help. Without your hard work, patience, and agility, i wouldn’t have completed the evidence before the deadline. \nYou rock #Jaycybertechies!, Thanks :yougotthis", "likes": 0}}, {"topLevelComment": {"author": "👉 DINUXHACKS ON INSTAGRAM 👈", "text": "So thankful for fast deleting of iCloud activation lock permanently for my iPhone XR with no photo and documents lost", "likes": 0}}, {"topLevelComment": {"author": "TOH_SPY_ ON INSTAGRAM", "text": "👆👆👆\nContact the name above, he just got mine fixed successfully.", "likes": 0}}, {"topLevelComment": {"author": "TOH_SPY_ ON INSTAGRAM", "text": "👆👆👆\nContact the name above, he just got mine fixed successfully.", "likes": 0}}, {"topLevelComment": {"author": "stephane salord", "text": "I can't believe its working! keep it up! Shared everywhere! You deserve it!", "likes": 0}}, {"topLevelComment": {"author": "Роман Иванов", "text": "love it!", "likes": 0}}, {"topLevelComment": {"author": "ZbiiQ", "text": "By the way this is the greatest tutorial anybody has ever had. Thanks a lot!", "likes": 13}, "replies": [{"author": "jonathan sheppard", "text": "Now that IS a bold statement Z", "likes": 0}, {"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}]}, {"topLevelComment": {"author": "TEXT 👉 MACINOHACK ON TELEGRAM", "text": "When I say thank you A, I mean it from my heart sir for helping me achieve so much in my life, you where there from start,. a heartfelt thanks to you sir", "likes": 0}}, {"topLevelComment": {"author": "TEXT 👉 MACINOHACK ON TELEGRAM", "text": "When I say thank you A, I mean it from my heart sir for helping me achieve so much in my life, you where there from start,. a heartfelt thanks to you sir", "likes": 0}}, {"topLevelComment": {"author": "👉 CRACKZ090 ON INSTAGRAM👈", "text": "*Now I know why everyone is talking about he’s 👆him he’s a genius*", "likes": 0}}, {"topLevelComment": {"author": "ABDELALI BAYTAR", "text": "thank you very much, my brother", "likes": 0}}, {"topLevelComment": {"author": "hansana sinhapitiya", "text": "mata danaganna puluwanda,product eke price eka sinhalen \"Ru. \" kiyala watenne nathuwa Rs kiyala watenna hadana widiya?", "likes": 0}}, {"topLevelComment": {"author": "ZAINAL ABIDIN", "text": "Cool! Downloaded))", "likes": 0}}, {"topLevelComment": {"author": "bidyapoti singha", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Josephine Hawkins", "text": "Wow, watching how they grew one cup in less than a month was admittedly shocking, I used what I talked about the other day, and well it actually took about 6 weeks for them to totally grow by two cups, I just go’ogled Mika Klopsworth and now the looks I get are so worth it.", "likes": 0}}, {"topLevelComment": {"author": "GLOBAL-WORLD", "text": "SOLVE PROBLEMS EURO-UNION AND ASIA\nРЕШИТЬ ПРОБЛЕМЫ ЕВРОСОЮЗА И АЗИИ\n-------------------------------------------------------------------------------\nевропа может закупать газ и нефть из региона азии \nеurope can buy gas and oil from the аsian region", "likes": 0}}, {"topLevelComment": {"author": "Danny Zan", "text": "I don’t believe 👆Gratos1 can really help he really show and give me the best program I can now do what ever I want now with the money earn from his program you’re the best software provider I ever meet am just having my glad happiness i met you you’re really a life changer and will always make the use of your software program and make more more money on my investment…", "likes": 0}}, {"topLevelComment": {"author": "👉 CRACKZ090 ON INSTAGRAM👈", "text": "*The recommendations above👆 is the best in this*", "likes": 0}}, {"topLevelComment": {"author": "request👉5ispy 👈 on Instagram", "text": "I'm a living testimony after many attend #dolby_hack got my work done successfully, request him for any hacking Jobs to help you he's so professional when it comes to hacking. .", "likes": 1}}, {"topLevelComment": {"author": "request👉5ispy 👈 on Instagram", "text": "I'm a living testimony after many attend #dolby_hack got my work done successfully, request him for any hacking Jobs to help you he's so professional when it comes to hacking. .", "likes": 0}}, {"topLevelComment": {"author": "Sumon Bappy", "text": "good", "likes": 0}}, {"topLevelComment": {"author": "george cop", "text": "I learned assembly on x86(both Intel and AT&T) and I clicked this video to get into ARM. Left with a good impression.", "likes": 0}}, {"topLevelComment": {"author": "Zahnpasta mit Fluorid Macht Schlau", "text": "Nice, with Assembly it takes me only 600 line of code to create a segfault in my \"Hello World!\" program.", "likes": 0}}, {"topLevelComment": {"author": "David Ricardo Ordinola Guevara", "text": "ya no existe el link", "likes": 0}}, {"topLevelComment": {"author": "Alexis Junior", "text": "Thanks:)", "likes": 0}}, {"topLevelComment": {"author": "Shohag Sumon", "text": "Nice", "likes": 0}, "replies": [{"author": "Лида", "text": "Я", "likes": 0}]}, {"topLevelComment": {"author": "bernadette jotie", "text": "Your actually the goat, This helped so much thank you.", "likes": 0}}, {"topLevelComment": {"author": "Honey Dhee Flores", "text": "I have been making soft for about 3 years, but I thought it might be a good idea to take a refresher course by watcNice tutorialng tNice tutorials video.", "likes": 0}}, {"topLevelComment": {"author": "GMD MANOJ SAI DEVI BHASKAR REDDY GOLUGURI", "text": "was very understandable for . You were so detailed and it made all these new tNice tutorialngs way less intimidating", "likes": 0}}, {"topLevelComment": {"author": "GG", "text": "Are you using Producer edition?? What do y'all recomnd if I want to make s but not record my voice or tutorial?", "likes": 0}}, {"topLevelComment": {"author": "Feri Indra Lesmana", "text": "tNice tutorials is detailed, its amazin thanks man!", "likes": 0}}, {"topLevelComment": {"author": "Ivan Roca", "text": "Yummy", "likes": 0}}, {"topLevelComment": {"author": "Tan Thien Nguyen", "text": "Tot zum Leben geweckt werden  ?", "likes": 0}}, {"topLevelComment": {"author": "Tan Thien Nguyen", "text": "Beispiel trocknet zum Wasser & Gegenteil auch ?", "likes": 0}}, {"topLevelComment": {"author": "Tan Thien Nguyen", "text": "Haben Sie noch anderen Beruf ?", "likes": 0}}, {"topLevelComment": {"author": "Tan Thien Nguyen", "text": "Haben Sie schon als Politik Wissenschaften Medizin Erfinder zum Reichtum ?", "likes": 0}}, {"topLevelComment": {"author": "Md Sumon Mahamud", "text": "Very Nice", "likes": 0}}, {"topLevelComment": {"author": "Tan Thien Nguyen", "text": "Programmiering können alles machen ? Unglaublich mit Babies", "likes": 0}}, {"topLevelComment": {"author": "TitanFoxy", "text": "I've been looking for this for so long, thanks man", "likes": 0}}, {"topLevelComment": {"author": "Hari Ram", "text": "THANKS ALOT MA MAN IT WORKED FOR ME SURE TOOK A WHILE BUT ITS GREAT ", "likes": 0}}, {"topLevelComment": {"author": "HypnoTizer", "text": "Great stuff thanks!", "likes": 0}}, {"topLevelComment": {"author": "Shitposter", "text": "My friends like this crack  and so do I.", "likes": 0}}, {"topLevelComment": {"author": "Kis- Beat", "text": "Really work", "likes": 0}}, {"topLevelComment": {"author": "45 Cordic", "text": "verilog pls", "likes": 0}}, {"topLevelComment": {"author": "Chelsea keyes", "text": "Nice rapper", "likes": 0}}, {"topLevelComment": {"author": "Shokhbozbek Khalimjonov", "text": "Thank you so much! It work!", "likes": 0}}, {"topLevelComment": {"author": "bannu vinnu", "text": "Loool. I legit spend 6 years using gms before finally getting serum. I was making blown out saw softs and exporting them to Edison", "likes": 0}}, {"topLevelComment": {"author": "Raina Gupta", "text": "In the setup, appreciate the videos! Maybe a dumb question but is there a way to export content in mono in soft20?", "likes": 0}}, {"topLevelComment": {"author": "Massage 👉babs_tools👈on Instagram", "text": "👆👆👆Não consigo expressar como me sinto agora filho , sua dedicação e capacidade de trabalho que você colocou na recuperação da conta é 100 , não é a primeira vez que trabalho com você , mas você sempre consegue me deixar pasmo , muito bem💯", "likes": 2}}, {"topLevelComment": {"author": "Massage 👉babs_tools👈on Instagram", "text": "👆👆👆Não consigo expressar como me sinto agora filho , sua dedicação e capacidade de trabalho que você colocou na recuperação da conta é 100 , não é a primeira vez que trabalho com você , mas você sempre consegue me deixar pasmo , muito bem💯", "likes": 0}}, {"topLevelComment": {"author": "Munna Majumder", "text": "good advice", "likes": 0}}, {"topLevelComment": {"author": "bitty 😊 CHAT loginregain On Instagram", "text": "☝️An opportunity to prove how good he is . His competence,speed,accuracy and honesty left me with no choice then to recommend and rate him ❤️", "likes": 1}, "replies": [{"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}]}, {"topLevelComment": {"author": "bitty 😊 CHAT loginregain On Instagram", "text": "☝️An opportunity to prove how good he is . His competence,speed,accuracy and honesty left me with no choice then to recommend and rate him ❤️", "likes": 0}}, {"topLevelComment": {"author": "Hakeem Kahlil —DM RICCHDAWG ON TELEGRAM—-", "text": "Thank ya for working beyond hours and resolving the issue of my cloning card, especially since everyone had left in the middle of the process but you still help me out *Ricch dawg* you deserved being crowned 🫱🏽‍🫲🏿", "likes": 0}}, {"topLevelComment": {"author": "Moreila Rodriguez", "text": "Que instructivo este video, muy informativo enseña mucho.", "likes": 0}}, {"topLevelComment": {"author": "lukanus222", "text": "OMG THANKS SO SO MUCH THIS HELPED!!!", "likes": 0}}, {"topLevelComment": {"author": "Siddharth Sharma", "text": "Just here to jam on this tutorial :D", "likes": 0}}, {"topLevelComment": {"author": "shashank parsi", "text": "great tutorial, it would be helpful if you can cover all other modules as well (example: seven segment display,display etc)", "likes": 12}, "replies": [{"author": "jonathan sheppard", "text": "seek and ye shall find )", "likes": 2}]}, {"topLevelComment": {"author": "MacDonald Manana", "text": "Im glade to see that what i learnt at A level during the data presentation & computer architecture topics is actually applicable in programming... i am sooo happy    really happy!:)", "likes": 0}}, {"topLevelComment": {"author": "Bashir Ahmed", "text": "Good device", "likes": 0}}, {"topLevelComment": {"author": "Ray", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Lucas alves da silva", "text": "This channel is the absolute best", "likes": 0}}, {"topLevelComment": {"author": "Ben Dah", "text": "Poorly designed course. Not for beginner. The author considers so many evident, jump ahead of basic concepts to address more complex ones. Don't waste your time with this course, unless you have learned the basic of assembly programming somewhere else", "likes": 1}}, {"topLevelComment": {"author": "ณัฏฐพล กิจรัตน์ธันยากร", "text": "thank you very very very much, you help me a lot", "likes": 1}}, {"topLevelComment": {"author": "Modivational Media", "text": "Thanks!", "likes": 1}}, {"topLevelComment": {"author": "James Goforth", "text": "10:20 my computer science instructors disagree they say F is 16 represented in decimal not 10, that makes absolutely no sense.", "likes": 1}}, {"topLevelComment": {"author": "adelarsq", "text": "This is gold! Thanks for share!", "likes": 2}}, {"topLevelComment": {"author": "Prema T", "text": "python interview questions https://www.youtube.com/channel/UClhDUKK7KiF319r71vPg8qQ?view_as=subscriber", "likes": 0}}, {"topLevelComment": {"author": "kisfuge Gergo", "text": "I'm here for ARM but this man give me ASMR.\n\nBut also this course was very helpful. Thanks for free videos like this.", "likes": 2}}, {"topLevelComment": {"author": "Bilguunbat bilguun", "text": "What's up brother i need your help \nI am buy Dell i3 and i cant change this computer display language . \nThis computrr only one dipslay language (Chinese) \nI can't change this language Do you help me? how to change display language?", "likes": 0}}, {"topLevelComment": {"author": "👉Contact bevan_cyberkey on Instagram", "text": "🔝He retrieved my deactivated account I vouch for his services💯", "likes": 0}}, {"topLevelComment": {"author": "JMC Presents", "text": "checked - everything is clean", "likes": 0}}, {"topLevelComment": {"author": "Johnny Alcázar", "text": "ty for the tutorial", "likes": 0}}, {"topLevelComment": {"author": "Mahnaz Moradi", "text": "This is cool VIDEO!!! Thanks for sharing ...", "likes": 0}}, {"topLevelComment": {"author": "William Shami", "text": "I haven't watched the whole video yet but from the comments it seems like this will be a good one. I'm taking an ARM assembly course in university right now so hopefully this will help me learn everything efficiently and effectively. I've practically given up on my prof lmao so this is pretty much one of my last hopes of learning assembly well.\n\nUpdate: I'm about 1/3 of the way through the video now and I have learned so much more from this video than I have from any of my university lectures. I love how straightforward the teaching style is, it really makes it easier to absorb all the information.", "likes": 10}, "replies": [{"author": "Egemen Ozan", "text": "exactly lol! University is a joke. \n\nJust gonna get my diploma and be done with it", "likes": 0}, {"author": "dirt friend", "text": "an entire course in university and it didnt teach you anything? that sounds like a real... _shami_", "likes": 1}, {"author": "Костя Бондаренко", "text": "good luck dude", "likes": 2}]}, {"topLevelComment": {"author": "Slim Msb", "text": "i wish i had this last year", "likes": 0}}, {"topLevelComment": {"author": "DAVID GREGORY KERR", "text": "is it not ./qemu", "likes": 0}}, {"topLevelComment": {"author": "DAVID GREGORY KERR", "text": "What about having the end of list being -1 or 0xffffffff", "likes": 0}}, {"topLevelComment": {"author": "DAVID GREGORY KERR", "text": "What ARM doesn't have is a register like %%cx so you can do ...\nI am using AT&T Assembler\n\n\n__asm__ __volatile__(\nmov $15,          %%r15\nmov $4,            %%cx\nshll  %%cl,       %%r15\nmov %%r15,    %0\n:\"=m\"(0)\n:  \"m\"(0)\n:\"cx\",\"r15\"\n);", "likes": 0}}, {"topLevelComment": {"author": "DAVID GREGORY KERR", "text": "I the ARM M1 and ARM M2 chips had a on chip FPU then I would consider moving to an Apple Mac Desktop solution or sourcing an New Old Stock Archimedes but the software would be very hard to get, if only there was a way to handle IEEE754 long doubles in ARM Assembly Language.", "likes": 0}}, {"topLevelComment": {"author": "Robin Deatherage", "text": "Unless your tied into Assembly through either C or C ++, most language development will fail. Why? \n\nFor starters the underlying Unix or  Mimicked Unix base is already tied into the file system, the graphics windowing system either x19 or win32 and utilizes the cut, copy and paste utilities. \n\nAll programing in Assembly will not advance anything the C languages have already taken over forty plus years to test, implant and make useful for all languages. So unless your doing Assembly as a hobby, would be your thing. Otherwise it's a lost cause. \n\nAlso languages such as CPython and Rust are both C and C++ respectfully are the exception to that rule. And just imagine, both are an already compiled language processing loop long before their token streams are processed. Rust uses the backdoor of the GCC Compiler which makes it C based and needs no conversion to Assembly whatsoever. Imagine that, a token stream being read into a loop, processed then executed by an already compiled language which requires no assembly because it's running in Machine Binary.", "likes": 0}}, {"topLevelComment": {"author": "Nathan Young", "text": "Finally, I get to learn what I've always wanted to learn. Thank you so much.", "likes": 1}}, {"topLevelComment": {"author": "Eijent Wun", "text": "Assembly is and was the Reason why the Amiga OS was so snappy light and the Best OS on any machine until OSX Tiger/Snow Leopard", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@2:27:35\nI don't understand..\nif one memory address can store\n4 bytes of data..\nwhy only 1byte is used?\nfor example 104 for 'h' character\nand then 101 for 'e' is in the next 4bytes of address", "likes": 0}, "replies": [{"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "I noticed the gap between addresses is now only 1bit\nbecause 0xa0=160\nwhile 0x98=152\nwhy in the cpulator we need to offset\n4address spaces to get to the next element in the array\nwhile this time only offset one address space?", "likes": 0}]}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@1:51:31\nis that a physical address or virtual address?\nfor the hardware devices", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@54:37\nif i tried\nand r0,#0\n\nr0=00000000", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@50:25\nwhy i do this:\n\nmov r0,#0xff\nmov r1,#22\nand r2,r0,r1 // i get 22 in register 2\n\nif i do:\n\nmov r0,#0xff\r\nmov r1,#22\r\nand r2,r1,r0 // here i put r2 in front r1  i still get 22 in register 2 also\n\nif i try in python:\na=255\nb=22\nprint(a and b) #get 22\nprint(b and a) #get 255", "likes": 0}, "replies": [{"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "oh so i got this one is bitwise operator and and or not logical operator", "likes": 0}]}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "i tried also svc #0 after mov r7,#1 and it also work ; svc stands for \"supervisor call\"", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "why you always said \"ten\" when it's actaully sixteen", "likes": 0}}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@33:51 \nhow does the register distinguish\nbetween address to jump to or a data?", "likes": 0}, "replies": [{"author": "Orizon", "text": "with the brackets means to the data, without address", "likes": 0}]}, {"topLevelComment": {"author": "Astaghfirullahalzim Astaghfirullahalzim", "text": "@10:10 \ni thought for a 32-bit cpu..\none address of the RAM can hold 32-bits data\nbut one address line actually can store only 1 byte?", "likes": 0}}, {"topLevelComment": {"author": "Damon Martin", "text": "You should do SIngle Instruction Multiple Data SIMD next as a follow up series to assembly and cover Vectorisation", "likes": 0}}, {"topLevelComment": {"author": "Wasantha Ramanayake", "text": "I just fell in love with assembly programming.", "likes": 0}}, {"topLevelComment": {"author": "Erik Gaming", "text": "x64 plz", "likes": 0}}, {"topLevelComment": {"author": "Richard Burrows", "text": "cool", "likes": 0}}, {"topLevelComment": {"author": "Some Random Guy", "text": "Brings back traumatic memories of my microprocessor class (68000 of course)", "likes": 0}}, {"topLevelComment": {"author": "Richard Burrows", "text": "cool", "likes": 0}}, {"topLevelComment": {"author": "John Bond", "text": "I don't think I am willing to take such a risc.", "likes": 1}}, {"topLevelComment": {"author": "Todd B", "text": "Ah, good, old hand crafted assembly.   I'm retired now but we used an ARM in products for about 6 years before I left.  We used C compiler for most of the firmware.", "likes": 0}}, {"topLevelComment": {"author": "My Hobbies", "text": "Assembly with AVRs please.", "likes": 0}}, {"topLevelComment": {"author": "Be Foodie", "text": "Thanks, now I can write my own Ransomware in asm without getting catch by AV", "likes": 0}}, {"topLevelComment": {"author": "Arturo Beristain", "text": "I remember a guy saying C has better performance than Assembly and of course is not as assembly is closer to machine code, in the other hand the obvious advantages of C and any other higher lever languages will be the coding time.", "likes": 0}}, {"topLevelComment": {"author": "Palmit", "text": "commenting for my own learning reference. in the registers, 8 places (zeroes initially). each \"zero\" is 4 bits (8x4) = 32 bit. or they are 8 bit each (64 bit). or better explained as \"WORD\". however:  A WORD is 32 bits or in 64 bit processor(cpu) WORD is 64 bits. 32 bit or 64 bit, that's the max that can be stored in a REGISTER. -- still learning differentiating between the two in asm. Also BITS Not BYTES as i had previously thought.", "likes": 1}}, {"topLevelComment": {"author": "Musa Laroussi", "text": "I am familiar with x86 and I find it fun learning ARM.", "likes": 0}}, {"topLevelComment": {"author": "Isaac Clark", "text": "You seem to be calling regular memory a stack.  The stack is usually memory addressed using that stack pointer with push and pop operations.   If this is different in ARM, then that might be worth pointing out.", "likes": 4}, "replies": [{"author": "Pičiguz Pjenti", "text": "@goldman Why so rude?", "likes": 1}, {"author": "Isaac Clark", "text": "@goldman Who are you?  I am going to continue to make comments as I see fit.  I really don't care if you don't like that.", "likes": 2}, {"author": "goldman", "text": "He is one man trying to cover a topic developed over decades by thousands of engineers. If you have a point to make, go make a video or shut your hole", "likes": 0}]}, {"topLevelComment": {"author": "web3 wizard", "text": "Crazy good stuff lately", "likes": 0}}, {"topLevelComment": {"author": "Robert Rush", "text": "CPULator available as an offline browser app?\nAnyway, good vid.", "likes": 0}}, {"topLevelComment": {"author": "Wingate-Using Cyber_Agency on telegram is real", "text": "I'm honor to have you  around in this hard time thanks you for always supporting and helping me to get bitcoin to the fullest…❤️", "likes": 0}}, {"topLevelComment": {"author": "Wingate-Using Cyber_Agency on telegram is real", "text": "I'm honor to have you  around in this hard time thanks you for always supporting and helping me to get bitcoin to the fullest..❤️", "likes": 0}}, {"topLevelComment": {"author": "Xernan Peninoy", "text": "wow", "likes": 0}}, {"topLevelComment": {"author": "MR. H.", "text": "Hello, nice training, any recommanded document for Assembly in ARM ? thanks...", "likes": 1}}, {"topLevelComment": {"author": "Maksim Brazhnikov", "text": "Inner mind directed Energy Weapons target 1% of human population via 9 mile high drone set by project mandate colloquialy known as 'Grim Reaper' of which iconic resemblance symbol known as the death sorcery cast is relative to the scythes familiar shape to the gamma radiation power sign that looks alot like a crooked backwards 7 numeral digit. The 9 mile high Unmanned Aerial Vehicle of Surgeon General's Grim Reaper U.S Navy Air force branch skyborg skynet surveillance is set in motion of physical and fully non linear Gauss Laser of 70kV capacity run in 9 phases of consecutive 100 ampere projecting heavy particle disturbance capable force operated by means of G.O.R.G.O.N. S.T.A.R.E 10²⁴ Hz emitting G.O.D. force play that acts as a clandestine form of heavily classified atmosphere watch gravity gun harrasment that intervenes due to existence of smoking sources and their elemental deterrent of management stability containment and otherwise reliability and dependable safety standards of layered atmospheric maintenance of climate control and earth control processes stemming from sound and smooth environmental aerial conditions. Smoking fire depending on the chemical propellant friction issuance is targeted by U.S\n Navy drone fleet operated by MQ9 R.E.A.P.E.R. autonomous drone sky guardian proprietary doctorate of very comlplex political continuos cover up led by Pentagon tribune as defense against insurgency of 🚬 ng's potentially hazard induction directly unbalancing the stability of atmospheric coverage quality that inevitably concerns us all as severe inner system death causing 🤖 parasite of atrocious hidden military air force Geoscape Operations Radioactive Gamma Observation Neutrinics 🔫 of Ghost\\Gaussian Field Disturbance and full blown mind control abductions mixed as dark suggestive paranormal activity concerning the worldwide inevitable system imprisonment via unexpected attacks by microsatellite stalking utilized by Satellite Topography AirForce Recursive Equation field of fully unjust unexplainable worst matrix stripping of individual's self preservation and independence. Remote Electric Autonomous Population Exterminators Registry is what is responsible for stupid cover ups set by political think tanks coined under think tanks such as 'Schizophrenia' and Havanna Syndrome.\nThe song \"Seasons Don't fear the Reaper\" is a reference to MQ9 Reaper and RQ4 Global Hawk of their fully automated life assignment to eradicate human population due to use of unstable energy projections caused by carbon monoxide. Religion is the worst evil there is. Raytheon is the owner of this universe we live in. General Atomics is it's grid rulebook and earth resinence is set to affect even you likely by age 86 due to natural genetic mutation viewed as biological treason and thus enacting this long untouched topic of how satellite neural deliberate terrorism is the cause of our inability to live an eternal life. Reject religious groups and all forms of very deadly social stripping of this unwavering dark truth of what the Special Forces of Covert Operations disclosed to my dodged indirect remarks of how I am not possed by stupid archaic notions such as 'witchcraft' but find myself belayed by unexpected neutrino debilitating rejection as if my body's gravity support has been canceled. Hence why its called 'cancer'. For I fear the Reaper and deeply loathe the Jews and Christians. Be smart. There are way too many forms of electrical covert deformative gaussian field disfigurement and variety of bodily molecular Disturbance to be descriptively understood by regular language. That is one huge X Ray gun under the nose of General Atomics Remote Piloted Drones. It has zombified me before and forcibly rejected my mental survival instinct by such covert assault that is all set and bombarded by atmospheric conditional safekeeping trust breech case log read by trinity of satellites monitoring Earth's seismic activity and perverting me into a 'mysteriously I'll subject category' It will get you by age 111 86% chance. Churches are wicked sources. Here is truth for you and please go look at the drone yourself instead of BLM my sorry white refuge into your intellectually degrading social disgrace governing this nation as a form of population church sovereignty instead of plain and  difficult attempt to lea n science and languages rather than cult force of inditement of human population technological maintenance and white respect for the stars instead of black cult projects ravaging our resource understanding and physical activity ownership credit and supporting base honesty instead of inverting the \"+' symbol to enforce social literate anti earth anarchy and liberal tryranny I witness. \n\nwww.mp3juices.cc for free mp3 downloads\nListen to Uriah Heep song called \"Lady In Black\" and \"come away Melinda\"", "likes": 0}}, {"topLevelComment": {"author": "THPT Ngọc Lặc Official", "text": "great video", "likes": 1}}, {"topLevelComment": {"author": "justinbmichael", "text": "Tried to watch Arm-y of dead, but learned how to code instead. Thank you for this video, the flow of material was seamless.", "likes": 0}}, {"topLevelComment": {"author": "Javier Gomez", "text": "This is genial l love assembly", "likes": 0}}, {"topLevelComment": {"author": "Mohit Solanki", "text": "Is assembly language useful nowadays?", "likes": 0}, "replies": [{"author": "Memory Access Violation", "text": "Assembly can be useful if you need very high performance code. Otherwise, I'd use C or a mix of both :D", "likes": 0}]}, {"topLevelComment": {"author": "مریم عابدی", "text": "Hi thank you, I would be appreciate if you speak a little bit slowly because it is hard for non Native language to understand you completely. In setting I found speed 75% which is too Slow and also hard to follow too for me. 🌺❤️", "likes": 0}}, {"topLevelComment": {"author": "Éric Bischoff", "text": "I thinks that what is called the \"stack\" here, is the data segment instead.\nIn the video, the emulator confirms this as =list is indexed on the PC register, not on the stack pointer SP.\nAt   29:11    ldr r0,[pc, #-4]\nYou can also see in the source code that this program accesses the data segment, because \".data\" is used.", "likes": 0}, "replies": [{"author": "Éric Bischoff", "text": "@Christopher Gabriel Right. Thanks for the precision that explains the negative sign I missed. I have corrected.\n\nThat was not my point though. My point was, it's not the \"stack\" as the speaker says.", "likes": 0}, {"author": "Christopher Gabriel", "text": "The program counter is actually pointing two instructions ahead [1], hence ldr r0, [pc,#-4] loads the value at address 4 (8-4 = 4) into r0. Notice the negative immediate offset. CPUlator does not show the correct content for the PC in the register view but the inline comment of that instruction \"; 4\" shows the correct address for the indirect load. At memory address 4 you have the value 8, which is the actual address of the list as you already mentioned.\n[1] ARM Architecture Reference Manual ARMv7-A and ARMv7-R edition", "likes": 0}]}, {"topLevelComment": {"author": "muhammad Ali", "text": "Is there a vd about Intel's assembly?", "likes": 0}}, {"topLevelComment": {"author": "Rashid Bin Zaiyed", "text": "Please make a video on computer science engineering... cause I'm really passionate about cs engeneering, but because of the financial struggles...i am unable to attend the college ... Those videos means alot to me and people like me, your help will be appreciated...may God bless us all with abundance...", "likes": 4}}, {"topLevelComment": {"author": "Aviv zachary", "text": "can you please do a MIPS toturial pleaseeeeeee", "likes": 0}}, {"topLevelComment": {"author": "Rob Watson", "text": "Oh damn now I really understand pointers in C and appreciate them.", "likes": 1}}, {"topLevelComment": {"author": "Chacha Marwa", "text": "i had no any plan to add any language to my brain arsenal this year as i used to do in previous years but here we are. am goin to watch this in a chunk of 37 Minutes per week for 1Month, and i will be good to walk alone by myself and progress more.", "likes": 0}}, {"topLevelComment": {"author": "Shaswat Dube", "text": "Thanks", "likes": 0}, "replies": [{"author": "Shaswat Dube", "text": "Would appreciate more to see contents like ARM, Embedded and microcontroller related!", "likes": 0}]}, {"topLevelComment": {"author": "All EGY", "text": "1 50", "likes": 0}}, {"topLevelComment": {"author": "Mantorp", "text": "Pure gold!", "likes": 0}}, {"topLevelComment": {"author": "CrepsDelic", "text": "21:05 \"Compile and Load\", press F5 if you missed it.", "likes": 0}}, {"topLevelComment": {"author": "Deesto", "text": "For the transcript: s/stuck memory/stack memory/g  ;)", "likes": 0}}, {"topLevelComment": {"author": "Jo Wilson", "text": "god I love assembly languages.  it's so oddly empowering to be that close to the metal, you really feel like you're getting down into the computer in a fundamental way.  thank you so much for this!  maybe I'm weird but I love to watch this kind of thing for fun", "likes": 37}, "replies": [{"author": "roy Yung", "text": "@Sara I would think that neural. Networks would be better achieved with processors so each node could constantly reconfigure itself dynamically rather than be reprogrammed when changes occur", "likes": 1}, {"author": "roy Yung", "text": "@Sara udemy has FPGA courses available. But i dont know what your intent is to learn. FPGAs are sort of a single use type of thing, like a DAC..it doesnt use logic the way a microprocessor does, rather you \"hardwire\" logic circuits together. It not really called \"programming\" as you know it.\nWhat is your interest in FPGAs?", "likes": 1}, {"author": "roy Yung", "text": "@Sara i like to work as a minimalist, seeing how much power & functionality I can squeeze out of a processor. I dont like higher level languages as it takes you away from the processor and forces you to rely on huge libraries and bloated code. I like to make my own tiny libraries & macros for PIC, TI etc.", "likes": 1}, {"author": "roy Yung", "text": "@Sara have you done any work with Z80s, 8080s etc?\nGetting involved with GPUs, FPGAs right away can be daunting. GPUs were built for one thing in mind, to manipulate polygons and do all the math thats associated with it. Think of how you would write a tiny/efficient method to draw a line from point A to point B on a screen at any angle. U need to make it super fast as well.", "likes": 1}, {"author": "Sara", "text": "@roy Yung sid, what do you suggest for folks who are just learning about fpga’s, asics, gpu’s and the like? What chips, programs, compilers, etc do you suggest?", "likes": 1}]}, {"topLevelComment": {"author": "cometmace", "text": "Great lecture.  It brings me back to my days doing IBM 360 Assembler in the mid-'70s.  I've got to think of a reason to use this.  It would be fun.", "likes": 3}, "replies": [{"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}, {"author": "Éric Bischoff", "text": "I think you just gave the right reason 🙂.", "likes": 1}]}, {"topLevelComment": {"author": "Richard Eigenmann", "text": "This is such a helpful introduction to assemply language programming. I loved it! Last time I did Assembler was on the 6502 processor back in the 1980ies... I love the emulator in the webpage. Makes following what is going on really easy.\nHowever, the hello world program didn't work for me on my Raspberry Pi. I think that is because the example is for a 32bit processor and my Pi is 64bit. The names of the registers have changed and the numbers for the syscalls are also different! Here is the modified version that works: \n\nglobal _start\n_start:\n        MOV X0,#1\n        LDR X1, =message\n        LDR X2, =len\n        MOV W8, #64\n        SVC #0\n\n        MOV X0, #0\n        MOV W8, #93\n        SVC #0\n\n.data\nmessage:\n        .asciz \"Hello World\\n\"\nlen = .-message", "likes": 17}, "replies": [{"author": "Marcel Facoory", "text": "How do I reach your coach/ mentor??", "likes": 0}]}, {"topLevelComment": {"author": "Vivine tanada", "text": "thanks so much", "likes": 0}}, {"topLevelComment": {"author": "Bigfoot", "text": "28:40 VERY STRANGE when I compile the exact same assembly code and run it though a debugger, R0 contains the address of a pointer to the list, not the address of the first element. Can't trust this emulator", "likes": 2}, "replies": [{"author": "SerBallister", "text": "Then you must have declared a pointer variable some how ? LDR R0,=List will loads the address of label, it cannot create a temporary variable with the address of List in there and give you a pointer to that. That needs a programmer to explicitly set that up.", "likes": 0}]}, {"topLevelComment": {"author": "Ancestrall", "text": "Thank you so much !! Assembly tutorials were missing on this channel and now my wish came true", "likes": 7}}, {"topLevelComment": {"author": "Novaius", "text": "I was trying to get myself to learn C. This video is so neat I'm now intrigued in ARM Assembly instead now.", "likes": 7}, "replies": [{"author": "Éric Bischoff", "text": "There are some common points. For example, pre-increment *++p and post-increment *p++ are very close to their ARM equivalents.", "likes": 2}]}, {"topLevelComment": {"author": "Keep Secret", "text": "Videos are OK but personally, I much prefer a written tutorial....and I will not use Twitter either ;-)  Perhaps you could write a book on this topic. I am searching for a book now.", "likes": 0}}, {"topLevelComment": {"author": "Karan Singh", "text": "Please make the video on MATLAB.", "likes": 0}}, {"topLevelComment": {"author": "A P", "text": "The reason it's actually worth learning here on youtube with guys that prepared these instruction videos is that they genuinely put the effort in making a structure and making sure they point/explain every aspect of what they use to write these codes themselves. Which makes these videos incredibly useful and efficient, thanks for the free knowledge!", "likes": 188}, "replies": [{"author": "Egemen Ozan", "text": "@T I agree, uni is a joke", "likes": 0}, {"author": "jonathan sheppard", "text": "Free knowledge = free everything\nWe believe in abundance", "likes": 0}, {"author": "Al,Arachnid", "text": "@Mr Man l0llollllll\nPpl6pl\n3\nR\n\nRlll0\nLllllLllp\nL y\nL\nPl\nP0 to 00 pp\nL", "likes": 0}, {"author": "Chuck Nunn", "text": "@Mr Man ee", "likes": 0}, {"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}]}, {"topLevelComment": {"author": "Sai venkat Bala badruni", "text": "I have learnt about arm instruction set in our clg but it haven't made sense for some reason and the keil environment created more confusion. After watching this all things came into a track I especially liked the the website that used for the simulation which help me to understand the things better when compared to the complex env in keil IDE. I would really suggest this tutorial for absolute beginners to get started or to clear up their basis. I am really looking forward this kind of tutorials in the future. It would be really helpful scott if say what to do after this what to learn next or practice to gain more knowledge.", "likes": 8}, "replies": [{"author": "Sai venkat Bala badruni", "text": "@jonathan sheppard Yes, that online ide is best place to practice", "likes": 0}, {"author": "jonathan sheppard", "text": "Keil looks a bit old skool imperial corporate :- maybe that's the reason ;?)", "likes": 0}, {"author": "Sai venkat Bala badruni", "text": "@jonathan sheppard yeah kinda true", "likes": 0}, {"author": "jonathan sheppard", "text": "a lot of college and university courses are a waste of time and money nowadays isn't it ?", "likes": 1}]}, {"topLevelComment": {"author": "AMAECHI CHINEDUM", "text": "Thanks sir", "likes": 0}}, {"topLevelComment": {"author": "2620-ezakk", "text": "Thanks for the course!! It really helps", "likes": 2}}, {"topLevelComment": {"author": "Akh2", "text": "This is perfect! Would love to see x86 next", "likes": 1}}, {"topLevelComment": {"author": "chen derek", "text": "I remembered last year this tool was developed for ECE243 in UofT. It's great to see it being used here too.", "likes": 1}}, {"topLevelComment": {"author": "aname", "text": "28:00 memo", "likes": 0}}, {"topLevelComment": {"author": "pescator", "text": "I'm studying ARMv8 in my course, is it a lot different from this ? (AArch 64)", "likes": 0}, "replies": [{"author": "Éric Bischoff", "text": "yes and no - register name changes, you can use 64 bit words, and the linux system calls change ; there are also other details ; but in general you can jump from one to the other pretty easily", "likes": 0}]}, {"topLevelComment": {"author": "Prashant Kumar", "text": "\"Hlw guys....\"\n<h1>Anyone here from CS, Heyy bro please help me to create a javaProject through database connectivity..</h1>\n<p> please help anyone...\nI completed my bachelor's from maths, so everything new for me (persuing mca (2sem) )\n But i feel quite comfortable and enjoyed myself when i learn something new here.. But practically i am not able to create without any help </p>", "likes": 0}, "replies": [{"author": "IIIlllII", "text": "you forgot the html tag wrapper", "likes": 0}, {"author": "Prashant Kumar", "text": "I will surely complete this course afterb my project submission...\nTill then i don't want give my time to any other tec. And thanks for this course", "likes": 0}]}, {"topLevelComment": {"author": "Base2", "text": "Here because I exploit hardware and need to learn this. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Thành Vinh Nguyên Tô", "text": "Damn this channel is great", "likes": 0}}, {"topLevelComment": {"author": "Lava Gaming", "text": "is it possible to make a game using this ?", "likes": 0}}, {"topLevelComment": {"author": "Shahrukh Tramboo", "text": "Greta tutorial, Please a course for x86 assembly language too", "likes": 0}}, {"topLevelComment": {"author": "Dominic Amoako Baah", "text": "Finally", "likes": 0}}, {"topLevelComment": {"author": "Sergio Galarza", "text": "please help reporting the spam bot in comments if you see it. thank you.", "likes": 1}}, {"topLevelComment": {"author": "goowatch", "text": "Next video, similar info but for RISC-V.\n\nThank you!", "likes": 2}}, {"topLevelComment": {"author": "SkyTechBits", "text": "ARM has been around for a very long time and is very fast. I first learned assembly language in general on a Z80 processor in 1985. I clicked on here because I would really like to get into it with ARM this time. RISC is much pretty efficient and fast.  Thanks for sharing this information.", "likes": 37}}, {"topLevelComment": {"author": "Paul Mac Giolla Caoine", "text": "Are there many jobs in knowing ARM?", "likes": 2}}, {"topLevelComment": {"author": "Saad Ali", "text": "Sir please make a complete course on Internet of things with aurdino and raspberry pi with different sensors", "likes": 1}}, {"topLevelComment": {"author": "Iden Ticlla", "text": "assembly with intel please it would be absolutely awesome", "likes": 1}}, {"topLevelComment": {"author": "abdul hakim", "text": "Finally i can tweak my m1 chip🙂", "likes": 1}}, {"topLevelComment": {"author": "Praveen B A", "text": "Hello Team, can you please train us on 5G NR development in Linux. Physical Layer development", "likes": 5}, "replies": [{"author": "Oleg Xvhdzvhh", "text": "Автор и не могу центр на на на на на на Ы сельского совета находится на расстоянии его на на на на наи неук удалось завершить задание его на на на на на на как и не выбрать типа выбратьтипа цк выбратьтипа длятся по его того чтобы ходить мааывугккпеимо зерка альбом был из них как вами некрИко так не криком А а а а а а а как вам всем мире включая после выкыукн кек как и к  Увсексек вышел ц видео уже не ук Укра уины А уже не ук Украины и не ук Украины и витрин и такие", "likes": 0}]}, {"topLevelComment": {"author": "Joshua kar", "text": "Whoaaaaa!!!!", "likes": 1}}, {"topLevelComment": {"author": "Kayotic gamer", "text": "Thanks For Everything This Channel Has Ever Done", "likes": 2}}, {"topLevelComment": {"author": "Bernard Neal", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "z", "text": "thanks for posting but what can you do with it in a practical way?", "likes": 2}}, {"topLevelComment": {"author": "elman gazayi", "text": "Great😃", "likes": 1}}, {"topLevelComment": {"author": "Ojas dillikar", "text": "PLease do for x86", "likes": 1}}, {"topLevelComment": {"author": "Feynman C", "text": "thank you", "likes": 1}}, {"topLevelComment": {"author": "Taül Guedí", "text": "It's true. This chanel is the best thing ever.", "likes": 2}}, {"topLevelComment": {"author": "Cees Timmerman", "text": "\"sp\" is \"stack pointer\" etc. I guess the site lacks tooltips for that because people who dislike memorizing acronyms would use a compiler to write optimized machine code.", "likes": 1}, "replies": [{"author": "Cees Timmerman", "text": "@KimTGF Iirc, Minix is in all Intel CPUs and MicroPython works for chips as well.", "likes": 0}, {"author": "KimTGF", "text": "Yeah, nowadays using assembly isn't that efficient anymore as it is a difficult language to work with. Embedded C is what is popular now to run microcontrollers and for microprocessors we are now able to install a lightweight os on them instead of working with only assembly/c.", "likes": 0}]}, {"topLevelComment": {"author": "Ian Thompson", "text": "Love assembly, it's hard core and therefore not for the faint hearted but boy is it rewarding!", "likes": 9}}, {"topLevelComment": {"author": "Prosper Omiponle", "text": "It’s a bit sad that this is only getting uploaded AFTER my last day of my ARM Assembly class in College 🫠", "likes": 55}, "replies": [{"author": "Akpeghughu Andrew", "text": "Q", "likes": 0}, {"author": "JohnD", "text": "Don't worry. If you become a computer programmer, you will have to keep studying and learning new things every year for the rest of your working life. 😂", "likes": 2}, {"author": "Mykull", "text": "I don't mean to be rude but I wanted to ask if you have any resources left from that class you could share?", "likes": 1}, {"author": "ANUR GAMER FF", "text": "@k okjjjkijjj", "likes": 0}, {"author": "ANUR GAMER FF", "text": "@k are not there are important oo . Mu b a d o d pkmok", "likes": 0}]}, {"topLevelComment": {"author": "Pen Lavits", "text": "Could have used this when I started Microp.", "likes": 1}}, {"topLevelComment": {"author": "Poncipp", "text": "Awesome Content", "likes": 1}}, {"topLevelComment": {"author": "CODE TANK", "text": "Laravel Tutorial\nhttps://youtu.be/VMurRopJ8GY", "likes": 1}}, {"topLevelComment": {"author": "ApertureChromaKey", "text": "Great! Now I'm going to completely rewrite all of the software on my phone and write all the firmware and software by myself. Should be a fun project.", "likes": 8}, "replies": [{"author": "Leul Mamo", "text": "I guess you want to murder your phone lol", "likes": 0}]}, {"topLevelComment": {"author": "Shivendra P. Singh", "text": "X64 please", "likes": 1}}, {"topLevelComment": {"author": "Moon Dev", "text": "the algorithm will someday give this channel the love it deserves. i can not believe the wealth of knowledge here.", "likes": 3}}, {"topLevelComment": {"author": "mk47", "text": "wish i had these tutorials when i was starting out back in the days.", "likes": 10}}, {"topLevelComment": {"author": "Nomie Ngasa", "text": "Can we please get a tutorial on Mendix Low code development. Been waiting for ages for a tutorial on that", "likes": 2}}, {"topLevelComment": {"author": "Hahn Onimus", "text": "Wow! Finally 💪", "likes": 1}}, {"topLevelComment": {"author": "Francisco Olivares", "text": "Literally yesterday i was interesed in learning asm and now this video drop. Incredible", "likes": 4}, "replies": [{"author": "Rip Van Winkle", "text": "Same lol!", "likes": 0}, {"author": "Milan Jovancevic", "text": "Same as me hahah", "likes": 0}]}, {"topLevelComment": {"author": "Mohammad Torikul Islam", "text": "Thanks your man. you are provided this kind of video which are really helpfull.", "likes": 1}}, {"topLevelComment": {"author": "Ekene", "text": "Put this man in the computer science hall of fame", "likes": 4}}, {"topLevelComment": {"author": "Humberto Rodrigues", "text": "Thanks!", "likes": 3}}, {"topLevelComment": {"author": "Anupam Dasgupta", "text": "Can you make a tutorial on programming a intel microprocessor with assembly language?", "likes": 1}}, {"topLevelComment": {"author": "Dev Channel", "text": "In contrast a x86 Assembler like NASM would be nice as tutorial too!", "likes": 4}}, {"topLevelComment": {"author": "Ruthvik Sai", "text": "Really great video 🙂\nHoping for x86 Assembly soon!!", "likes": 18}}, {"topLevelComment": {"author": "Vishal Kulkarni", "text": "more videos on blockchain", "likes": 1}}, {"topLevelComment": {"author": "Alejandro Damas", "text": "thank you a lot\ntengo un proyecto en mente con una vieja tablet sun4i, quisiera personalizar el firmware ya que el fabricante no la actualizó\n\nsu fundamento en el curso me llega bien\nno hablo inglés pero si lo comprendo, su dicción es muy clara", "likes": 2}}, {"topLevelComment": {"author": "OwO", "text": "Please, bless us with 32 bit / x64 bit intel assembly as well. Big fan btw", "likes": 5}}, {"topLevelComment": {"author": "Kaden Sapp", "text": "I was googling this last night and was disappointed that they didn’t have a course… and then 8 hours later they drop one", "likes": 1}}, {"topLevelComment": {"author": "OwO", "text": "Holy!!! Such a great timing!!!!", "likes": 1}}, {"topLevelComment": {"author": "Sprigs", "text": "Course for x86?", "likes": 2}}, {"topLevelComment": {"author": "DraGnoZ", "text": "Wben is solid works course coming?", "likes": 1}}, {"topLevelComment": {"author": "Raymond Goldman Seger", "text": "Anything lower than C is not worth learning unless you are planning to make a terminator.\n\nBut nice video though, love it.", "likes": 3}, "replies": [{"author": "IIIlllII", "text": "I came here because I need it for microprocessors", "likes": 0}, {"author": "Armaj Roy", "text": "If you ever get on to develop operating system or embedded programming learning C and assembly is pivotal.", "likes": 0}, {"author": "Saucy Squad", "text": "True though", "likes": 0}, {"author": "DashNode", "text": "Embedded microcontroller and their (often) limited memory resources... Sometimes you need to squeeze every bit of performance (e.g. critical interrupt handlers) or limit the number of instructions your program uses in order to meet memory requirements. An extreme example would be the PIC10F200 and its 384 bytes of program flash + 16 bytes of RAM. But when memory is not a big problem (which is the case even in the lowest range of ARM MCU's), C can be used and produce very good results performance-wise, I agree. Appart from this, assembly language is a nice way to get familiar with your processor's architecture/hardware, though.", "likes": 6}, {"author": "OwO", "text": "@Chris Omondi you are a man of culture bruv. Respect.", "likes": 1}]}, {"topLevelComment": {"author": "arif muttaqin", "text": "This is good, I hope Freecodecamp would make x86 next", "likes": 10}, "replies": [{"author": "Calculator", "text": "Better would be RISC-V", "likes": 1}]}, {"topLevelComment": {"author": "RIJU", "text": "hit like if u have 8085 and 8086 in ur sem exam", "likes": 1}}, {"topLevelComment": {"author": "Sreejish Nair", "text": "Kindly make a video series on how to develop your own Operating system", "likes": 7}}, {"topLevelComment": {"author": "Bret Hagen", "text": "absolutely incredible. please keep learning free", "likes": 3}}, {"topLevelComment": {"author": "Jorge Rivera", "text": "Dear friends can you explain in a normal words what means Assembly lenguage..?", "likes": 3}, "replies": [{"author": "Ray Bod", "text": "Normal language… assembler tells a processor what to do step by step… like multiple this number at this memory location by this number at this memory location,  go to this line of instructions to do next, stop.  It’s using the most basic instructions possible.  Why?  Because it’s as efficient as can be and there are no limitations.  Anything that can be programmed, can be programmed in assembler.  Down side, it takes a long time to program, errors can be catastrophic and difficult to find.", "likes": 1}, {"author": "KEEP SMILING", "text": "Low level language are easily understood by computer but not humans and higher level language like phyton Are easily understood by humans but won't work for low level hardware (as expected by c)", "likes": 0}, {"author": "KEEP SMILING", "text": "Assembly language is Low-level programming language (Nowadays C and C++ language is considered to be a low level language. 8051 microcontroller or arm 7 are basically written in C language.) that can communicate directly with a computer's hardware. I think language which can be easily understood / readable by humans .", "likes": 0}]}, {"topLevelComment": {"author": "TOXIC MODS", "text": "Thank You. now i can continue my game cheating :). How do i learn armv8?? i suck at it", "likes": 3}}, {"topLevelComment": {"author": "Mohamad Bo-Hamad", "text": "Love from 1st sight\n\nThank you, yet to see the complete vid", "likes": 3}}, {"topLevelComment": {"author": "Jorge Rivera", "text": "Yes this channel is GREAT..!\nMany thanks  great people..!", "likes": 3}}, {"topLevelComment": {"author": "نسيم", "text": "A.Wanna more 2 hours not good for assembly", "likes": 3}}, {"topLevelComment": {"author": "Jerry S", "text": "My nightmare", "likes": 3}}, {"topLevelComment": {"author": "Atul Kumar", "text": "🙏", "likes": 0}}, {"topLevelComment": {"author": "Icarus", "text": "awesome", "likes": 1}}, {"topLevelComment": {"author": "Αυƚυɱɳ", "text": "I have been waiting for this a loooong time", "likes": 0}}, {"topLevelComment": {"author": "Harsha Fartale", "text": "Thank you soo much!! ❤️", "likes": 1}}, {"topLevelComment": {"author": "Daniel Addotey", "text": "Thank you for this course 😭😭👍🏽", "likes": 2}}, {"topLevelComment": {"author": "Eduardo Sanchez", "text": "🎉 yeeeeesssss!!!!", "likes": 1}}, {"topLevelComment": {"author": "ISERT", "text": "Can you pls make a tutorial for fusion360", "likes": 0}}, {"topLevelComment": {"author": "biao long", "text": "armv7 ？？", "likes": 2}}, {"topLevelComment": {"author": "USMColdies", "text": "History will eventually recognize this channel as the groundbreaking phenomenon it is", "likes": 439}, "replies": [{"author": "Toshima Rembert", "text": "@mixxxer kkkk", "likes": 0}, {"author": "NEW MOVIE KA GHR", "text": "@Guilherme Emetério 0", "likes": 0}, {"author": "NEW MOVIE KA GHR", "text": "@k 0", "likes": 0}, {"author": "Sam Sam", "text": "Mo", "likes": 0}, {"author": "Sam Sam", "text": "@Guilherme Emetério ..l9", "likes": 0}]}, {"topLevelComment": {"author": "Fakeha Butt", "text": "It's 20 views and 65 likes... How it's possible? 🤔", "likes": 2}, "replies": [{"author": "IIIlllII", "text": "microservices, that are updating differently", "likes": 0}, {"author": "Eduardo Sanchez", "text": "slow counting algorithm's because of checks", "likes": 2}]}, {"topLevelComment": {"author": "Jesse Jason", "text": "Finally 😂❤️‍🔥 We really appreciate this guys. ❤️", "likes": 1}}, {"topLevelComment": {"author": "Priyanshu Sharma", "text": "Finally programming language for Chad's.", "likes": 3}}, {"topLevelComment": {"author": "Theresraj Claudius", "text": "At last,...", "likes": 0}}, {"topLevelComment": {"author": "Akanimoh Osutuk", "text": "I don’t even know what to say", "likes": 3}}, {"topLevelComment": {"author": "koohii", "text": "Thanks, this is for me!", "likes": 1}}, {"topLevelComment": {"author": "bibianomauro", "text": "Now we're talkin'", "likes": 1}}, {"topLevelComment": {"author": "Arthur D'Aquino", "text": "Man. I was waiting for this for so long!!!", "likes": 3}}, {"topLevelComment": {"author": "Dhruvkumar Patel", "text": "❣️", "likes": 1}}, {"topLevelComment": {"author": "Mergen Studios", "text": "ong yes", "likes": 0}}, {"topLevelComment": {"author": "ISERT", "text": "Hello I have learned many languages from you thanks for your support.😊", "likes": 9}}, {"topLevelComment": {"author": "BADBOY GAMER", "text": "Thanks for everything Free code camp... 🙏🙏🙏", "likes": 3}}, {"topLevelComment": {"author": "Rajatava Mahajan", "text": "Eagerly waiting for this ♥️🔥", "likes": 5}}]}