{"video": {"id": "GJJc1t0rtSU", "title": "Deep Reinforcement Learning in Python Tutorial - A Course on How to Implement Deep Learning Papers", "description": "In this intermediate deep learning tutorial, you will learn how to go from reading a paper on deep deterministic policy gradients to implementing the concepts in Tensorflow. This process can be applied to any deep learning paper, not just deep reinforcement learning.\n\nIn the second part, you will learn how to code a deep deterministic policy gradient (DDPG) agent using Python and PyTorch, to beat the continuous lunar lander environment (a classic machine learning problem).\n\nDDPG combines the best of Deep Q Learning and Actor Critic Methods into an algorithm that can solve environments with continuous action spaces. We will have an actor network that learns the (deterministic) policy, coupled with a critic network to learn the action-value functions. We will make use of a replay buffer to maximize sample efficiency, as well as target networks to assist in algorithm convergence and stability.\n\n🎥 Course created by Phil Tabor. Check out his YouTube channel: https://www.youtube.com/channel/UC58v9cLitc8VaCjrcKyAbrw\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Introduction\n⌨️ (0:04:58) How to Implement Deep Learning Papers\n⌨️ (1:59:00) Deep Deterministic Policy Gradients are Easy in Pytorch\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://www.freecodecamp.org/news", "duration": "PT2H57M11S", "likes": "4461", "views": "264638"}, "comments": [{"topLevelComment": {"author": "Priyanshu", "text": "Why is it in my recommendation after 3 years. I wish this was recommended earlier.", "likes": 1}}, {"topLevelComment": {"author": "Shadowcross", "text": "Nv", "likes": 0}}, {"topLevelComment": {"author": "Manuel Novella", "text": "This guy is a master! Do check its own Youtube channel. Thanks to him my undergraduate final project went so well.", "likes": 1}}, {"topLevelComment": {"author": "Enroot", "text": "Hello, thank you for your tutrial. I have only one issue. I tried to replicate your code, but I have an error \"cannot import name 'plotLearning' from 'utils'\". Do you have any idea how can I fix that?", "likes": 0}, "replies": [{"author": "Enroot", "text": "@Yahaya Muhammed Awwal not realy, but you can still plot the graph using matplotlib, hope it helps, if you need the code i will provide it", "likes": 0}, {"author": "Yahaya Muhammed Awwal", "text": "have u resolved it experiencing same thing here", "likes": 0}]}, {"topLevelComment": {"author": "Yair Phyo", "text": "😀😀", "likes": 0}}, {"topLevelComment": {"author": "Thiago Coura", "text": "Hi, I don't know if you the right person, and I'm an ignorant in machine learning. This being said I would like to know just a simple question to justify if i jump in the world of ML. The problem is the development of question answer system. Think in a project with many disciplines with 200-300 people where the information is dynamic spread in many documents and wiki's and the data change along the time. Is it possible to have a question and answer system with natural language that can understand the progression of time. 2 pieces of information had a relationship in the past but now they are not related and the system refrain on the actual question to mix the past information with the new one. The system can show how the question changed along time but not infer relationships of past events with actual ones.", "likes": 0}}, {"topLevelComment": {"author": "Sai Srinivas Murthy Narayanam", "text": "using the code piece state = state[np.newaxis,:] is giving an error ValueError: Cannot feed value of shape (3,) for Tensor TargetActor_9/inputs:0, which has shape (None, 3)\ncan anyone help me with this ?", "likes": 0}}, {"topLevelComment": {"author": "Chris OA", "text": "yea man...im in some super deep rabbit hole of programming videos while eating candy. Idk how I got here.", "likes": 1}}, {"topLevelComment": {"author": "B.S Gaming", "text": "Thank you for tNice tutorials video. I just downloaded soft soft and I was so, so lost. I couldn't even figure out how to make a soft. Your video", "likes": 0}}, {"topLevelComment": {"author": "that_endo", "text": "why did i wake up to this", "likes": 0}}, {"topLevelComment": {"author": "David Hughes", "text": "You don't spy on other human beings or their broadcasted thoughts. Especially a human that created the universe that you reside in.", "likes": 1}}, {"topLevelComment": {"author": "Imran Q", "text": "Amazing!", "likes": 0}}, {"topLevelComment": {"author": "Ansup Babu", "text": "Priceless stuff", "likes": 0}}, {"topLevelComment": {"author": "2007", "text": "woke up to this lol", "likes": 0}}, {"topLevelComment": {"author": "Martin Cervantes", "text": "Hello, I'm trying to decompose all the problem and I have a question when you use OUActionNoise based on Ornstein-Uhlenbeck process\n x = (\r\n            self.x_prev\r\n            + self.theta * (self.mu - self.x_prev) * self.dt\r\n            + self.sigma * np.sqrt(self.dt) * np.random.normal(size=self.mu.shape)\r\n        )\n\n\nI check the equations of OU process but I dont know how this \"np.sqrt(self.dt)\" is a valid implementation of a differential.", "likes": 0}}, {"topLevelComment": {"author": "Keith Mason", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "ChessRecap", "text": "Thank you this is an amazing tutorial , but i want to ask you about the traveling thief problem , and about that environment if i want to sovling by deep reinforcment learning..... can you  give me some advice about this approach???", "likes": 1}}, {"topLevelComment": {"author": "Satyendra Shukla", "text": "Thank you so much.\nI have one question, implementing D3QN in dynamic environment, where obstacles are continuously moving, how one can  implement it on hardware. And which one is better DDPG or D3QN  in the scenario started above.", "likes": 4}}, {"topLevelComment": {"author": "Jasmin", "text": "where can I find this paper nd what is it called?", "likes": 1}}, {"topLevelComment": {"author": "HERA Bidas", "text": "Perfect", "likes": 0}}, {"topLevelComment": {"author": "yashodeep chikte", "text": "This dude sucks", "likes": 0}}, {"topLevelComment": {"author": "Akshay Aradhya", "text": "41:00 I dont think you need to wait a million steps. If you minibatch size is 64 then you just need to wait  64 steps. Right ?", "likes": 0}}, {"topLevelComment": {"author": "Armeline Dembo Mafuta", "text": "Hello, I need help with a paper  \" A new Deep-Q-Learning-Based Transmission Scheduling Mechanism for the Cognitive Internet of things\". How can I contact you, inbox?", "likes": 0}}, {"topLevelComment": {"author": "Thijs van den Hout", "text": "Why not use an IDE to see typos before running it?", "likes": 0}}, {"topLevelComment": {"author": "Meaningful Name", "text": "Where did you get your brain?", "likes": 0}}, {"topLevelComment": {"author": "Hossein Haeri", "text": "At 43:01, you say: \" i is each element of that minibatch transitions\" which is wrong. i is just the index of the reply memory, i.e. state i+1 follows after state i.\nAnd thanks for your great explanation. helped me a lot.", "likes": 0}, "replies": [{"author": "HaZe", "text": "\"Sample a random minibatch of N transitions from R\" right above the equation, and you say that i is not an element of that minibatch transition? Lol?", "likes": 0}, {"author": "Laha Ale", "text": "really? then how you loop over the entries by index i? (of course,  if you doing with matrix then i is  not need, but given the pseudo code,  I think it is more reasonable to consider it as the index of the element in the minibatch)", "likes": 0}]}, {"topLevelComment": {"author": "Debayon Dhar Chowdhury", "text": "Where is the code of this video?", "likes": 1}}, {"topLevelComment": {"author": "masoud masoumi moghaddam", "text": "This is actually a video tutorial with so much academic quality. \nI am really amazed by this video and ability to implement a paper in this pace.\nWould plz keep up your good job?\nThanks bro.", "likes": 26}, "replies": [{"author": "KiddBrand", "text": "Oooooooo", "likes": 0}, {"author": "KiddBrand", "text": "Ooooooo", "likes": 0}, {"author": "KiddBrand", "text": "Ooo", "likes": 1}, {"author": "KiddBrand", "text": "Poooo", "likes": 0}]}, {"topLevelComment": {"author": "Fktu diablo", "text": "2:45:50 Michael Jackson still alive guys", "likes": 3}}, {"topLevelComment": {"author": "Liu daniel", "text": "Hi, i have run the code, but it did not converge at all. So I waana to know your hyperparameter's setting. Thanks a lot =-=", "likes": 0}}, {"topLevelComment": {"author": "Vandan Gorade", "text": "Please make more videos on implementing research papers on your channel😃", "likes": 14}, "replies": [{"author": "pmarcowski", "text": "I'll", "likes": 2}]}, {"topLevelComment": {"author": "Hejar Shahabi", "text": "I really like to learn python, and I have a question what is this video about? cause I didn't get anything", "likes": 0}, "replies": [{"author": "Sushrit Pasupuleti", "text": "It's about implementing an ML model from a research paper from given math equations and info.", "likes": 2}]}, {"topLevelComment": {"author": "Omar ElKhatib", "text": "thanks please more like those read scientific papers .", "likes": 0}}, {"topLevelComment": {"author": "Boris the Blade", "text": "Phil youre a fucking legend", "likes": 1}, "replies": [{"author": "Boris the Blade", "text": "I forgot to say thank you\n Thank you for this amazing video.", "likes": 1}]}, {"topLevelComment": {"author": "Dev Isle", "text": "Awesome! Looking to learn more and post on my channel.", "likes": 0}}, {"topLevelComment": {"author": "GShan", "text": "Its very advanced for me i guess (still watched watched for 20mins) ... Hope to get some advice from phil for beginners... To really reach to a level of implementing papers....any advice on learning road path would be helpful. Have subscribed to your channel also.Thanks Phil. :)", "likes": 6}, "replies": [{"author": "Machine Learning with Phil", "text": "Thanks for subbing! Check out my RL course on my channel to get started. Just search for Reinforcement Learning Jump Start", "likes": 0}]}, {"topLevelComment": {"author": "Connor Shorten", "text": "Thank you! This is an incredible Reinforcement Learning tutorial!", "likes": 37}, "replies": [{"author": "Yair Phyo", "text": "@Machine Learning with Phil 😀", "likes": 0}, {"author": "Yair Phyo", "text": "@Machine Learning with Phil ❤️", "likes": 0}, {"author": "Yair Phyo", "text": "@Machine Learning with Phil 😀😀", "likes": 0}, {"author": "Yair Phyo", "text": "@Machine Learning with Phil 😀", "likes": 0}, {"author": "Yair Phyo", "text": "😀", "likes": 0}]}, {"topLevelComment": {"author": "No Reason Channel", "text": "Reminded of Sherlock's assistant.", "likes": 1}}, {"topLevelComment": {"author": "Deepak S.M.", "text": "Thank u for this video :D\n\n\n\n\nAre u a brother of Bucky Roberts (thenewboston) ?", "likes": 3}, "replies": [{"author": "Machine Learning with Phil", "text": "hah! I am not, but I was an avid consumer of his content many years ago.", "likes": 1}]}, {"topLevelComment": {"author": "Adamu Fura Suleiman", "text": "Bunch of thanks 🙏", "likes": 0}}, {"topLevelComment": {"author": "Alvin Kuruvilla", "text": "This looks awesome\nBut I have a question, do you think this could be applied to website fingerprinting, where an ai is able to figure out the port and server information as you visit a website to make sure it's secure?", "likes": 3}, "replies": [{"author": "Machine Learning with Phil", "text": "I think applying RL to that would be possible, and an interesting niche case. Depending on how large you made the action space, DDPG may or may not be a good algorithm to leverage.", "likes": 0}]}, {"topLevelComment": {"author": "Hüseyin Yıldız", "text": "Thanks soo much you Bro ;) New Magicians in Future They are Coders,Programmers,Engineers and All Designers.", "likes": 0}}, {"topLevelComment": {"author": "JAVAAID - Coding Interview Preparation", "text": "interesting..!!", "likes": 1}}, {"topLevelComment": {"author": "xo xo", "text": "Awesome! This is what I was waiting for. Super thank you! \n\\( ö )/", "likes": 3}}, {"topLevelComment": {"author": "Arunarka Mukhopadhyay", "text": "Thank you!!", "likes": 0}}]}