{"video": {"id": "GwHX6FM-BHw", "title": "Developer Career Questions ANSWERED (featuring a bunch of experienced developers)", "description": "A bunch of experienced developers will answer your questions about a career in software development. \n\nThe questions:\n❓ (00:22) Will AI ever replace developers?\n❓ (04:20) What is the best way to learn programming?\n❓ (08:57) What if everyone was a programmer?\n❓ (12:37) Am I too old to learn programming?\n❓ (15:40) Is a computer science degree worth it?\n❓ (21:26) How does programming influence your health?\n❓ (25:23) Do you need to know math?\n❓ (28:45) How long does it take to become a junior developer?\n❓ (32:43) Which programming language should you choose first?\n❓ (38:24) How to motivate yourself to study?\n\nFeaturing the wisdom of the following developers:\n\n➡ Delia Lazarescu, Software Engineer at Google\n🔗 https://www.youtube.com/c/TheTechUnicorn\n\n➡ Gerald Versluis, Senior Software Engineer at Microsoft\n🔗 https://www.youtube.com/GeraldVersluis\n\n➡ Ania Kubow, Software Developer and Course Creator\n🔗 https://www.youtube.com/aniakubow \n\n➡ Marius Espejo, Senior Software Engineer\n🔗 https://www.youtube.com/channel/UCDpd-qEwAI9wglx4tsEBAtw\n\n➡ Ave Coders, ML Engineer\n🔗 https://youtube.com/c/avecoders\n\n➡ Mama Samba Braima Nelson, Software Engineer\n🔗 https://www.youtube.com/c/amigoscode\n\n➡ Gwendolyn Faraday, Principal Software Engineer at Relevize'\n🔗 https://youtube.com/c/FaradayAcademy\n\n➡ Nana Janashia (TechWorld with Nana), DevOps Engineer & Trainer\n🔗 https://www.youtube.com/c/techworldwithnana\n\n➡ Gift Egwuenu, Frontend Developer & Content Creator\n🔗 https://www.youtube.com/channel/UCgUgg53iJX1pdabUxpkgozA\n\n➡ Jack Herrington, Principal Web Developer\n🔗 https://www.youtube.com/c/JackHerrington\n\n➡ Jesse (codeSTACKr), Developer Advocate\n🔗 https://youtube.com/codestackr\n\n➡ James Perkins, Developer Advocate\n🔗 http://www.youtube.com/learntocodewithjames\n\n➡ Gio (ProgramWithGio), Full-Stack Web Developer\n🔗 https://www.youtube.com/programwithgio\n\n➡ Islem (CoderOne), Full-Stack Developer and Content Creator\n🔗 https://www.youtube.com/c/coderone\n\n➡ Jon Wood, .NET Web Developer and Content Creator\n🔗 https://www.youtube.com/c/JonWood\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT47M22S", "likes": "2087", "views": "53754"}, "comments": [{"topLevelComment": {"author": "Quincy Larson", "text": "These devs put in the reps at the keyboard. They spend a lot of time thinking about software engineering concepts and how to best teach them. Do yourself a favor and subscribe to each of their channels (listed in this video's description). I've subscribed to all of them – in some cases for years – and am a better developer for it.", "likes": 48}, "replies": [{"author": "Asim Khan", "text": "I was a subscriber for some of them. Now I subscribed to the rest of them. Thank you Quincy. ❤", "likes": 2}]}, {"topLevelComment": {"author": "Rafeed Muhammed ", "text": "Tech world with nana girl or boy?", "likes": 0}}, {"topLevelComment": {"author": "Sajid Husain", "text": "And what about physics. Is it necessary for programming?", "likes": 0}}, {"topLevelComment": {"author": "josephine kwakye", "text": "You guys are the best. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Tajjamal Abbas", "text": "Heads on team F.C.C\nI love to watched this video over and over💕💕💕💕", "likes": 0}}, {"topLevelComment": {"author": "The feral engineer", "text": "41... Been studying C/C++, C#, XAML, Unity, JavaScript, Blazor, asp.net, php for about a year", "likes": 0}}, {"topLevelComment": {"author": "C J", "text": "Yes", "likes": 0}}, {"topLevelComment": {"author": "Techie Tush", "text": "When AI will replace developers, it will become skynet 😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁", "likes": 1}}, {"topLevelComment": {"author": "Kunal Vohra", "text": "It is the phase where we deny ai is not evolving everything.. very soon we will know", "likes": 0}}, {"topLevelComment": {"author": "Ali", "text": "Thanks 😎", "likes": 0}}, {"topLevelComment": {"author": "Bulelani Botman", "text": "as an inspiring software developer living in south africa, i definitely looked at and pretty much researched the self-taught landscape of the job market and if it applies for me and it does. immediately when you have diploma or less you aren't even considered for that job so that prompt of \"is a cs degree worth it?\" it might be not worth it in the context of people living in first world countries like the us and uk but for many of us, i feel disheartened that i may never get a job with this diploma i am currently about to finish", "likes": 2}}, {"topLevelComment": {"author": "Lamphrangmi Lamin", "text": "Freecodecamp 💟❤️", "likes": 0}}, {"topLevelComment": {"author": "Eddie Jaoude", "text": "Great collab video! Love this!", "likes": 1}}, {"topLevelComment": {"author": "nσєl v αвrαhαm", "text": "Day by day, I am loving my GitHub copilot more than my friends at my school🤣. My opinion is also the same. AI will not replace humans. More than like a replacement, it will act as a best companion of humans while developing new things.", "likes": 0}}, {"topLevelComment": {"author": "smackhead", "text": "\"Which programming language to choose first\" ASM and C.  Followed by your oo of choice. The thing is people these days think they need to 'learn' a language but it doesn't work that way. Understand the fundamentals (Assembly language - architecture dependant I know - or C with low level memory considerations) and almost any other language is simply a matter of syntax. You don't \"learn\" a  programming language in the same way an English speaking would have to learn German or Russian... Many of us get cold called for jobs about languages we don't even know about but can pick up with a few reference guides. Anyone that 'learns' a language is doing it wrong.", "likes": 4}}, {"topLevelComment": {"author": "CoderOne", "text": "Great video everyone <3", "likes": 0}}, {"topLevelComment": {"author": "GiveMeCoffee", "text": "This was very informative, thank you!", "likes": 0}}, {"topLevelComment": {"author": "earthian", "text": "\"unless of course AI becomes self aware, at which point we will have bigger things to worry about than our jobs\" .... couldn't have said it better", "likes": 16}, "replies": [{"author": "Rahul Rachh", "text": "😆😆😆", "likes": 0}]}, {"topLevelComment": {"author": "Andrew Cabiso", "text": "<3 Thank u so much for thisss vid @Freecodecamp. Aspiring webdev here. Love lots from Philippines.", "likes": 0}}, {"topLevelComment": {"author": "Denis Leonard", "text": "don't study, build stuff\r\n> study what you need as you are building stuff to build the stuff\r\n> constructivist learning\n43:43", "likes": 2}}, {"topLevelComment": {"author": "PABLO PALLAVICINI", "text": "If history teaches us one thing, it's that when there is a consensus among most people, they are usually wrong. I didn't think AI would replace developers any time soon, but now Im not so sure anymore.", "likes": 4}, "replies": [{"author": "Kirai Shiren", "text": "Why you are not so sure? Codex and tabnine are great tools and to be used by software engineers not to be despised or scared of it..\nAlso I don't think that history teaches us that at all. There is a big difference between what large group of experts says and what some group of the public. Sure, experts are not flawless in their predictions, opinions and estimations, especially when it comes to opinion of one expert, but when the opinions are gathered from many different people working closely or loosely in some field, the estimates are often very close to truth.\nTo conclude from data like OECD report from 2021 about influence of automation and AI shows us how often all these tech has much smaller influence in terms of impacting one job but it is pervasive which means that almost all jobs are somewhat influenced by AI and automation software.", "likes": 3}]}, {"topLevelComment": {"author": "Milan Qii", "text": "I am from India", "likes": 0}}, {"topLevelComment": {"author": "Aadarsh Baral", "text": "Wow! I discovered so many creators  from this video", "likes": 1}}, {"topLevelComment": {"author": "Gerald Versluis", "text": "This turned out so great! Glad I could be a part of this amazing posse! Thank you for having me", "likes": 5}}, {"topLevelComment": {"author": "Code 649", "text": "“Will AI replace developers?”\n\n😂 who do you think made AI?", "likes": 0}, "replies": [{"author": "Code 649", "text": "@Gerald Versluis it’s not like I had anything else to overthink about today 😐🤣", "likes": 1}, {"author": "Gerald Versluis", "text": "Or maybe the AI is making us say this… 🤔", "likes": 0}]}, {"topLevelComment": {"author": "Zor", "text": "thanks for re-uploading this precious one! i thought it was permanently removed.", "likes": 0}}, {"topLevelComment": {"author": "The Hacker", "text": "Anitakubow nailed AI in its head.", "likes": 0}}, {"topLevelComment": {"author": "Aditya Ghimire", "text": "Lovely, I gained so much info. Thank you very much for your efforts.", "likes": 0}}, {"topLevelComment": {"author": "TwentyEightO'one", "text": "*\"Everybody learns at different pace, everybody learns different ways\"*\n\nDa Dum Tsss!", "likes": 3}}, {"topLevelComment": {"author": "alim uddin", "text": "Is there a course", "likes": 0}}, {"topLevelComment": {"author": "Charles Ludwig", "text": "Wasn't this uploaded a while back?", "likes": 0}, "replies": [{"author": "Gerald Versluis", "text": "It was! But this one is improved!", "likes": 0}]}, {"topLevelComment": {"author": "Ming Hann", "text": "AI will replace frontend developer, soon ", "likes": 2}, "replies": [{"author": "raianmr", "text": "This is already happening. People don't like to talk about this but covid is actually more of a catalyst than a cause, people are losing jobs everywhere and the fact that businesses are restructuring to get more work done with less people employed is just a symptom of the web bubble bursting. The web isn't going anywhere, just how it didn't go anywhere after the dotcom bubble burst, the people involved, however, are about to be butchered. AI is just a buzzword, the more general idea of automation has been in the process for a looong time.", "likes": 0}, {"author": "Vs Sm", "text": "Already almost there.", "likes": 1}]}, {"topLevelComment": {"author": "Reil Waystation", "text": "Ai will replace recruiters", "likes": 3}}, {"topLevelComment": {"author": "Lazar Ristic", "text": "This is digital gold! Thank You for your time and desire to help!", "likes": 1}, "replies": [{"author": "Gerald Versluis", "text": "Glad you like it!", "likes": 0}]}, {"topLevelComment": {"author": "Varun Varun", "text": "Oh thank you for this video though it's a reuploaded one", "likes": 0}}, {"topLevelComment": {"author": "Just a regular gamer", "text": "Game of thrones line was top teir", "likes": 0}}, {"topLevelComment": {"author": "ALEXANDER TEN", "text": "I know almost all of  bloggers in a video ㅋㅋㅋ", "likes": 0}}, {"topLevelComment": {"author": "One", "text": "These are the most robotic people ever.", "likes": 1}}, {"topLevelComment": {"author": "Vishal Oza", "text": "Thank you for this awesome dev career Q&A !! Very informative with different perspectives !", "likes": 1}}, {"topLevelComment": {"author": "Faraday Academy", "text": "Thanks for interviewing me for this video! ❤❤❤", "likes": 4}}, {"topLevelComment": {"author": "Cole Drain", "text": "Great video, but most of the questions were beginners focused, intermediate+ were kinda left out.", "likes": 1}}, {"topLevelComment": {"author": "Black Mage", "text": "How do we go from Jr to Sr ? \nFrom looking at interviews for Jr, and job requisites, it seems you gotta be an expert for Jr Level. What is expected of you to move forward?", "likes": 0}}, {"topLevelComment": {"author": "Tech Unicorn", "text": "Thanks for the feature 🥰 Loved all the responses! For anyone scared that AI is coming for our jobs- it likely won’t be in our lifetime. Wanted to give full context, so I don’t scare anyone 😅", "likes": 14}, "replies": [{"author": "Kirai Shiren", "text": "Technology is not at all progressing fast. It is one of the myths of today's world and Kurzweil \"law pf accelerating returns\" has been disproved by other scientists who also pointed out how unscientific are his claims and how many times he's been wrong. Also many times I see confusion (even in so called experts) about the terms AGI (artificial general intelligence) and ASI or ASGI (artificial super general intelligence). For some of these read Modis or Huebner work, Rodney Brooks blog about his and some other predictions and when in around 2016 LeCun was interviewed by IEEE spectrum or OECD report from 2021 about automation and influence of AI. It should give you much more broad perspective and some data about how the real progress was and is at present. If somewhere we can see fast progress if for sure NLP (natural language processing) or computer vision since deeplearning approaches and advances in hardware like gpu has made these two subfields' progress great.", "likes": 3}, {"author": "lara.kiseleva", "text": "@Tech Unicorn Tell her i referred you to her ☝️", "likes": 0}, {"author": "lara.kiseleva", "text": "🌕🌕🌕\n      ＋𝟏𝟒𝟎𝟕𝟕𝟖𝟕𝟗𝟑𝟓𝟕", "likes": 0}, {"author": "Tech Unicorn", "text": "@Elias KOUAKOU Well, I agree it evolves exponentially & terrifyingly fast. Ray Kurzweil’s “Law of Accelerating Returns\" explains this evolution of technology very well & predicts the singularity in the next decade 😅 but the timeline depends on many variables, from legal regulations to who & how many are developing AI…so it’s unlikely we would allow that to happen in our lifetime. Unless we completely lose control of development or have a plan like UBI in place 👀", "likes": 1}, {"author": "Elias KOUAKOU", "text": "You have no idea how fast technology evolve.", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Bin Attique", "text": "Why we need Macbook to code?", "likes": 0}, "replies": [{"author": "raianmr", "text": "Macs aren't a a must if you want to code. However, there are some reasons as to why they're popular in some cases. Of course, developing for Apple owned platforms is a case. But aside from that, they are also extremely popular in generally successful businesses that can afford macs for their employees. People get macs in this case because they offer a middleground between the other two options - Windows and GNU/Linux: Windows is inconvinient af for development and linux distros generally lack an unified set of competent tools already set up for their users. \n\nThat being said, Apple isn't your friend and there are many limitations to their platforms. For instance, I'm into graphics programming and gamedev and Apple is downright hostile to the tools and apis I'm supposed to work with. This is why gaming in mac is practically dead and without a bright future.", "likes": 1}, {"author": "Vs Sm", "text": "You don't, but it definitely makes your life easier and nicer. For Apple apps you do need a mac.", "likes": 2}]}, {"topLevelComment": {"author": "Slay Z", "text": "Which one is better between BSc in computer science & informatics and computer & mathematics", "likes": 0}, "replies": [{"author": "Vs Sm", "text": "Math always gives your more choices.", "likes": 2}]}, {"topLevelComment": {"author": "Soumadip Banerjee", "text": "❤️ FCC rocks! 😁", "likes": 2}}, {"topLevelComment": {"author": "Gift Egwuenu", "text": "Thanks for the feature 🥰", "likes": 4}}, {"topLevelComment": {"author": "Damian Danev", "text": "All of them are wrong. What they really mean to say is that, its not gonna happen in your lifetime, so if you are asking because you are worried about your career, don't be! However... AI is like agent Smith form the matrix. There is no place it can't go, it's inevitable! Only a matter fo time before it reaches levels that human programmers can't fathom.", "likes": 2}, "replies": [{"author": "raianmr", "text": "This is what happens when people ask for expert opinions on one field from experts on another field. None of these people are experts in sociology or economics - and they have less of an incentive to convey in their answers ideas like people getting paid less for more work than the '80s, or how the process of automating all jobs possible has been in the making for a long time. What I truly find unfortunate is how platforms like freecodecamp operate in a manner that's completely devoid of any real life context. They never ask people to unionize, they never talk about all the cons of working in tech, they never talk about how to detect if you're being exploited or paid less than you should be, and so on. Freecdecamp has this weird aura of toxic opositivity and we're here taking a sip of it just to cope with the harsh reality where we know deep down that learning some cool new technology is barely enough to find some stability is our lives.", "likes": 0}]}, {"topLevelComment": {"author": "Marius Espejo", "text": "Awesome to see the variety of perspectives! Thanks for having us on the channel FCC!! 🙏😄", "likes": 13}}, {"topLevelComment": {"author": "2544982009", "text": "This video was uploaded like two month ago and then deleted it and uploaded again", "likes": 0}}, {"topLevelComment": {"author": "Nitish V K", "text": "Well said👍", "likes": 0}}, {"topLevelComment": {"author": "The Blinking Brownie", "text": "Eh I feel like AI will replace developers, just not anytime soon", "likes": 2}, "replies": [{"author": "Vs Sm", "text": "@raianmr Poor countries are never prepared for a change. But if rich countries don't progress the poor ones will have no chance either. The richer the country the more it can support those who cannot catch up.", "likes": 1}, {"author": "raianmr", "text": "​@Vs Sm I know for a certainty that things will get better in the future. As we speak, workers like us are either unionizing or advocating for unions. We are who make the world tick and nothing will ever change that. That being said, my concern was for the people in between revolutions. I come from a poor country, from the part of the world that supplies some of the cheapest labor. And I know for a fact that people here aren't prepared for a change of this magnitude. But of course, tech is not necessarily bad and I wasn't trying to be some anti-science conspiracy theorist if that's what I came off as.", "likes": 1}, {"author": "Vs Sm", "text": "​@raianmr It’s not the first time the humanity is going through a tech revolution. Nobody died cause computers replaced typewriters. There will be new occupations people will learn.", "likes": 0}, {"author": "raianmr", "text": "tech doesnt make people go jobless, businesses do. as ai matures, businesses will come up with better ways to get more work done with less and less people employed. you wont find any content on this channel that actually deals with these issues in a serious manner because 1) these experts aren't experts in sociology and economics and 2) no one likes a downer", "likes": 1}, {"author": "Vs Sm", "text": "You may want to be concerned with development automation more than with AI.", "likes": 1}]}, {"topLevelComment": {"author": "Dikumon", "text": "As its been more than a year of me coding I have googled such questions a lot of times and watching a video getting answered by experienced people is actually pretty helpful 😅 🤝", "likes": 2}, "replies": [{"author": "smackhead", "text": "The internet has been publicly available since at least the mid 90's. There were engines before google you know. Before that people simply bought books because it was an area of interest to them. Not rocket science.", "likes": 0}, {"author": "Vs Sm", "text": "Imagine, there was no Google before. Experience people were not available either.", "likes": 1}]}, {"topLevelComment": {"author": "Code with Ania Kubów", "text": "<3", "likes": 11}}, {"topLevelComment": {"author": "Luther Luffeigh", "text": "3:50 😂😂 the truth", "likes": 3}}, {"topLevelComment": {"author": "Vinh Nguyen", "text": "This is very good content, and yes age is not a factor. There is a woman in Japan in her 80 programming games. What's your excuse. Also yes you need to love it or else it will not work. Also programming is very useful no matter what career you're in. Thanks for the great content. SERIOUSLY THIS IS THE BEST REALISTIC CONTENT ON  BECOMMING  A PROGRAMER.  It's the opposite of what everyone else on YouTube says. LOL THANKS TO ALL THE DEVELOPERS ON HERE. VERY MATURE AND REALISTIC.", "likes": 9}}, {"topLevelComment": {"author": "Coding Is Fun", "text": "Thanks", "likes": 4}}, {"topLevelComment": {"author": "VerbrannteNetzhaut", "text": "Thank you this video was so encouraging, currently studying cs :)", "likes": 1}}, {"topLevelComment": {"author": "pravat Yadav", "text": "This is good", "likes": 0}}, {"topLevelComment": {"author": "Esteban Obilinovic", "text": "why does it end so suddenly?", "likes": 1}}, {"topLevelComment": {"author": "Lazar Ristic", "text": "Thank You, everyone!", "likes": 0}}, {"topLevelComment": {"author": "benson kamau", "text": "thanks very much  for these kinds of videos i guess now am a junior developer 6months  done", "likes": 1}, "replies": [{"author": "little WOLF", "text": "bro tunaeza get in touch aje? am currently learning js", "likes": 0}]}, {"topLevelComment": {"author": "Learner Innovator", "text": "I expected the camera man to go inside his mouth and stomach, it would be amazing..", "likes": 0}}, {"topLevelComment": {"author": "Rookie", "text": "Love it! Very valuable content! You guys are all amazing. Heroes! 💯", "likes": 3}, "replies": [{"author": "Gerald Versluis", "text": "Guys and girls! Glad you liked it!", "likes": 0}]}, {"topLevelComment": {"author": "محمد عبدالله", "text": "I hope, after I weigh you, add the translation to the Arabic language in translating the course or the video so that we can understand what you are saying. Thank you for the wonderful effort you are making for us.", "likes": 2}}, {"topLevelComment": {"author": "James Perkins", "text": "Thanks for having me on the video <3", "likes": 5}}, {"topLevelComment": {"author": "Amin Adan", "text": "Just what I needed", "likes": 1}}, {"topLevelComment": {"author": "Raja Sekh", "text": "Is any college degree is required to be a software engineer and get job in big tech companies", "likes": 3}, "replies": [{"author": "Vs Sm", "text": "@Azrael First of his Name It depends on what you call \"doing well\". All of my colleagues have at least B.Sc. degrees.", "likes": 2}, {"author": "Azrael First of his Name", "text": "@Vs Sm Define proper education because I know ppl without a Computer Science degree doing well because of experience and having certifications", "likes": 0}, {"author": "Vs Sm", "text": "In 99% of cases you cannot become a software engineer without a proper education.", "likes": 1}, {"author": "Azrael First of his Name", "text": "@Raja Sekh Anytime Goodluck", "likes": 0}, {"author": "Raja Sekh", "text": "@Azrael First of his Name Thank you sir", "likes": 2}]}, {"topLevelComment": {"author": "codeSTACKr", "text": "Will AI ever replace developers?? NO! 😂", "likes": 43}, "replies": [{"author": "I'M HERE", "text": "@Rang V \nCan code what? Anyone can code but can anyone make something useful?", "likes": 1}, {"author": "Rang V", "text": "There's the new AI from deep mind that can code", "likes": 1}, {"author": "Giveaway", "text": "Will AI ever replace developers??  YES, i will make that product.", "likes": 7}]}, {"topLevelComment": {"author": "Lasitha Dilshan Thilakarathna", "text": "Thanks 👍", "likes": 2}}, {"topLevelComment": {"author": "sandeep kumar", "text": "Thanks!", "likes": 5}}, {"topLevelComment": {"author": "Heavil Gaming", "text": "I waited for this kind of video for a long 🔥", "likes": 5}}, {"topLevelComment": {"author": "Ave Coders", "text": "Oh, yes!", "likes": 5}}, {"topLevelComment": {"author": "Mubashir Shehzad", "text": "Thanks mate, much appreciated", "likes": 2}}]}