{"video": {"id": "H9CSWMxJx84", "title": "Code Asteroids in JavaScript (1979 Atari game) - tutorial", "description": "In this JavaScript tutorial, you will learn to create the 1979 Atari game Asteroids from scratch using vanilla JavaScript.\n\n⭐️Contents⭐️\n\n⌨️1. (0:00) Spaceship creation\n💻JavaScript Template: https://drive.google.com/file/d/1W8vbBTBFf7gBTnZ04bNSy6ywRgRSSeQN/view\n💻Part 1 Code: https://drive.google.com/file/d/1Gpwsi3LroGM0A0kJCwET-DA9JN1rx8ME/view\n\n⌨️2. (33:55) Astroids creation\n💻Part 2 Code: https://drive.google.com/file/d/1Pw4_n4xpuinuNZMpbvu2-1McRtOmOH-B/view\n\n⌨️3. (58:40) Collision Detection and Explosions\n💻Part 3 Code: https://drive.google.com/file/d/1G7uwqyL1rMUHYUN_ogH7Zx3oHr0jZIs9/view\n\n⌨️4. (1:19:09) Shooting Lasers and Asteroid Destruction\n💻Part 4 Code: https://drive.google.com/file/d/1xJj9OnoXm1kuZyDVnmO9JyMB6e9CSGje/view\n\n⌨️5. (1:48:13) Levels, Lives, and Game Over\n💻Part 5 Code: https://drive.google.com/file/d/1Wbq90vAfeH1E5HJdQwZjqD-QVZ2EdsA9/view\n\n⌨️6. (2:10:10) Scoring and Saving Data Locally\n💻Part 6 Code: https://drive.google.com/file/d/1tcdbbODVojY-Uhzdb_kG51H1NWibyRSP/view\n\n⌨️7. (2:20:24) Sound Effects and “Music”\n💻Part 7 Code: https://drive.google.com/open?id=1tmjvMKxCcJeyTpi5pI6A8cgVxwWnyPXn\n\n🔈 Sounds: https://drive.google.com/file/d/1iSykdpBCc7xafRFHrdH0mH4TeR5ansAc/view\n\n\nTutorial from Mt. Ford Studios. Check out their channel for more great tutorials: https://www.youtube.com/channel/UCYGcMtRTLWQHgLq4V3bP3sA\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT2H45M33S", "likes": "1644", "views": "78902"}, "comments": [{"topLevelComment": {"author": "Richard Lew", "text": "If I may ask, how did you get your ship to reappear on the other side of the page when it goes to the edge?", "likes": 0}}, {"topLevelComment": {"author": "Aaron Strauff", "text": "How do I setup to run the code ?😅 I have installed VS code but not able to run it..", "likes": 0}}, {"topLevelComment": {"author": "pleasetakemyadvice", "text": "acceleration is 5 pixel per second, per frame   \nnot 5 pixel per second per second", "likes": 0}}, {"topLevelComment": {"author": "John Solly", "text": "I found one bug that the tutorial didn't cover. If you die before a level is complete, the music tempo doesn't reset. I fixed this by resetting the tempo in the gameOver function.\n            function gameOver() {\n                ship.dead = true;\n                text = \"Game Over\";\n                textAlpha = 1.0;\n                music.tempo = 1.0;\n                \n            }", "likes": 2}}, {"topLevelComment": {"author": "John Solly", "text": "Wonderful tutorial! Perfect amount of explanation and pace.", "likes": 0}}, {"topLevelComment": {"author": "Chris Cannon", "text": "ERROR HERE AND WITH SOURCE FILES. Concerns part 7 audio. Adding the lasers audio is fine but the problem is with next step - adding the explode audio, Safari and Firefox now return an error in console and no sound is played. The warning is: \"Autoplay is only allowed when approved by the user, the site is activated by the user, or media is muted.\" and then followed by this error: \"Uncaught (in promise) DOMException: The play method is not allowed by the user agent or the platform in the current context, possibly because the user denied permission.\" These errors only appear if the ship explodes before you fire your lasers. If you fire a laser then there is no error and sound plays. Also if you manage to progress to the next step of development and add music files then you get the error straight away as soon as the page loads. Presumably the error is a security feature that means sound doesn't auto play by default until the user properly interacts with it first. Unless there is a work around then you cannot complete this tutorial to the end. Currently Chrome doesn't throw an error and haven't tested MS Edge. The source files also throw these errors. Also I swapped around the keys used and the spacebar key is deemed as a legitimate interaction but the arrow keys are not. Presumably a work around might involve building in a \"Push Fire To Start\" feature.", "likes": 0}}, {"topLevelComment": {"author": "Syd Williams", "text": "i am using this template for my senior project does anyone know how to turn the triangle into a circle and save a player's score on a separate page?", "likes": 0}}, {"topLevelComment": {"author": "Flxxfin", "text": "lol the thumbnail spelled asteroids wrong, they spelled astroids lol", "likes": 0}}, {"topLevelComment": {"author": "Flxxfin", "text": "ugh, I have ocd and the triangles not working and im abt to literally go insane", "likes": 0}}, {"topLevelComment": {"author": "JenishIsSoJenish", "text": "Width of my line is not changing. No matter what I set it. Can someone help?", "likes": 0}}, {"topLevelComment": {"author": "Matthew Cuciti", "text": "Just a quick suggestion: try using requestAnimationFrame instead of setInterval. That'll result in smoother animation. Great Video!", "likes": 1}, "replies": [{"author": "Programmer-X31", "text": "Can you tell me more about it?", "likes": 0}]}, {"topLevelComment": {"author": "coding Club", "text": "I am wondering what color theme are you using for Visual Studio Code", "likes": 0}}, {"topLevelComment": {"author": "Ender Danger", "text": "so good! (you)", "likes": 0}}, {"topLevelComment": {"author": "Code, Games & Draw", "text": "thank you for teaching us!!", "likes": 0}}, {"topLevelComment": {"author": "ikwillet", "text": "I loved this!!!!", "likes": 0}}, {"topLevelComment": {"author": "Brandoku", "text": "I had a project back in high-school where we had to alter a game and i chose asteroids and my teacher said we had to change the looks of the game by changing the picture the code asks for i tried for a whole week to tell my teacher the stuff in the code was drawn out not a picture and my teacher was so convinced that was not possible and it has to be a picture like jpeg or something me not knowing code at all at the time i felt as if the class wasn't going to get me anywhere if my teacher didn't know anything so I backed out of that class, just minutes into this video I learnt more than i did in the months I was in that class", "likes": 0}}, {"topLevelComment": {"author": "Al M", "text": "Great tutorial although I won't be switching from C# and Unity after watching all that. I'm in my 50s now and haven't got enough life left for doing anything in JavaScript.", "likes": 1}}, {"topLevelComment": {"author": "Learn Basics & More", "text": "why is the if (ship.dead){\n                        return\n                       }\nnot working", "likes": 0}}, {"topLevelComment": {"author": "Jeff D", "text": "Is there an extension you are using in VS code that is autofilling or giving suggestions for canv.getContext etc?  Its not showing in my VS code and I have kite installed.", "likes": 0}}, {"topLevelComment": {"author": "Antony Abhilash", "text": "Really helpful. Very much easy to understand even for a noob. One of the geat tutorials I have ever seen.", "likes": 0}}, {"topLevelComment": {"author": "Reach [GD]", "text": "time stamps?", "likes": 0}}, {"topLevelComment": {"author": "Evan Douglas", "text": "1:37:10\nclimax", "likes": 1}}, {"topLevelComment": {"author": "mushymushy19", "text": "could you give me some documentary about the trigonometry you are using. i don't want to use code i don't understand. thx like the video tho", "likes": 0}}, {"topLevelComment": {"author": "Neverleanse", "text": "how can I put an image background on the canvas instead of a black screen?", "likes": 1}}, {"topLevelComment": {"author": "Danny L", "text": "please do a video of this but with python! thanks!", "likes": 0}}, {"topLevelComment": {"author": "A A", "text": "How did you learn to get this good and natural at coding like you're writing english?", "likes": 2}}, {"topLevelComment": {"author": "Mikebrolo", "text": "Thanks!!! very good tutorial very helpful!!!", "likes": 0}}, {"topLevelComment": {"author": "Bart", "text": "Great game, thanks for the tutorial, how can I go about in adding a Pause state ??", "likes": 3}, "replies": [{"author": "Felix van Hattum", "text": "it wouldn't be a traditional pause menu, but you could map a keydown event to the p key which causes a window.confirm method to come up", "likes": 0}]}, {"topLevelComment": {"author": "Taylor McClenny", "text": "Any idea why the color formatting here is different than mine?  Is there an extension to improve the formatting/readability for JS?  \n\n\nMine is mostly blue.  The functions and properties don't really standout, so finding errors is taking me a little longer.  ex. \"ship.lasers[i].x\" is all blue on mine, whereas it's blue, purple, red, and white above.", "likes": 0}}, {"topLevelComment": {"author": "Danny L", "text": "Does anyone have the link to video where asteroids is programmed in python and with an included artificial intelligence bot towards the end of the video?", "likes": 0}}, {"topLevelComment": {"author": "Сергей Туманов", "text": "Thank you for the lesson!", "likes": 1}}, {"topLevelComment": {"author": "bigchunk1", "text": "I don't know if your errors are intentional or not, but i'm learning a lot from them. Very well made tutorial!", "likes": 1}}, {"topLevelComment": {"author": "ExiaDude", "text": "I kinda want the game to fill the screen. How do I do that?", "likes": 0}, "replies": [{"author": "ExiaDude", "text": "@Hajar Assim Thanks!", "likes": 0}]}, {"topLevelComment": {"author": "devil man", "text": "good tutorial except i cant even make a simple black box", "likes": 0}}, {"topLevelComment": {"author": "Андрей Д", "text": "how to understand this formula  ship.x - ship.r * (2 / 3 * Math.cos(ship.a) + Math.sin(ship.a)). what is the meaning of it", "likes": 1}, "replies": [{"author": "Bek Brace", "text": "@bigchunk1 Thank you, I was also  looking for an answer to that", "likes": 1}, {"author": "bigchunk1", "text": "It's basically the unit circle in trigonometry where ship.a is theta and ship.r is your radius. With it, your ship can turn while preserving its relative form in the x/y plane.", "likes": 2}]}, {"topLevelComment": {"author": "lardosian", "text": "Can make a tutorial for R-Type?!!", "likes": 0}}, {"topLevelComment": {"author": "d1mmat", "text": "One of the best and most complete lessons I 've ever seen on YouTube! Clear speech, always to the point, clean code with remarks for almost everything, progressive difficulty, fast only when needed, good sense of humor... Thank you Sir for this great tutorial, it is the least that I can do!", "likes": 22}}, {"topLevelComment": {"author": "David Hayes", "text": "Excellent tutorial very well presented. Many Thanks.. very easy to follow along", "likes": 1}}, {"topLevelComment": {"author": "刘金玉编程", "text": "js strong", "likes": 1}}, {"topLevelComment": {"author": "My Reviews", "text": "Yeah, I'll be at this level in 2060 😂", "likes": 17}}, {"topLevelComment": {"author": "kenyasman86", "text": "Couldnt we just use SVG for the shapes? And skip the trig?", "likes": 1}, "replies": [{"author": "Derek Oware", "text": "He used the calculate the other functions like the moving and the rotation, using svgs would be another pain to go through when animating", "likes": 1}, {"author": "Harjit Singh", "text": "Now where's the fun in that ;)", "likes": 0}]}, {"topLevelComment": {"author": "Se", "text": "It would be good to show us the game finished at the beginning of the video. Ta have a good reference of what the goal is. Good video tho.", "likes": 5}, "replies": [{"author": "Andrés Barroso", "text": "Or you could manually skip the video to the end.", "likes": 0}, {"author": "Jeffrey Eggink", "text": "true but he kinda does for the last minute and a half. he goes up a level and shows motion with sound and score.. could have went longer though i guess", "likes": 0}, {"author": "Se", "text": "@Jeffrey Eggink does not matter if you are coding Pong or Mario Bros.  It's always a good thing to show how your project looks like once is finished.\n\nBut hey, still being a good video!", "likes": 2}, {"author": "Jeffrey Eggink", "text": "Its asteroids dude, put 1979 asteroids in youtube search bar. BAM that's what the goal is.", "likes": 1}]}, {"topLevelComment": {"author": "Steve's teacher", "text": "Thank you so much, this was SUPER and I learned so many things along the way :)))", "likes": 4}}, {"topLevelComment": {"author": "Henning Stahl", "text": "Amazing! Precise and easy to understand. Thanks for this one.", "likes": 2}}, {"topLevelComment": {"author": "Joel Rivers", "text": "I don't understand. I can follow line by line with what seems like exact punctuation. I run the code and it doesn't work... Copy and paste the code from the linked files and it works... This is what makes solo learning a pain in the tail. Annoyed....", "likes": 2}, "replies": [{"author": "kenyasman86", "text": "Somewhere, deap in your code....you missed a letter :( . No matter how many times you comb through, you miss it. Then, 2 days later, you set back down, and its the first thing you see ;)", "likes": 0}, {"author": "Rey Rodriguez", "text": "The thing is, when it comes to programming, bugs appear. You can THINK you typed everything letter for letter, but in reality, you put too many closing brackets or spelled a variable wrong. This is why it is important to use debugging. Like Ajdin Masic mentioned, open up the console in google chrome or what ever browser you're using. It'll tell you if there are any errors. If nothing pops up, then that means everything is working fine, but the game logic is flawed on your part. This part is a little more complicated, but use console.log() to output certain things relating to the problem. If your shim isn't slowing down, use console.log() to ouput the friction amount, the speed amount before and after friction is applied, and also if friction is being applied. From there, you can view the data and see exactly what is happening in the code. This is essential for every developer, as nothing always goes exactly as you planned. Good luck with everything.", "likes": 0}, {"author": "Ajdin Masic", "text": "Right click in Google Chrome and click inspect and then go to the console and it'll tell you what you're doing wrong. Or you can hit Ctrl + Shift + I and go to console.", "likes": 0}]}, {"topLevelComment": {"author": "LDT7Y", "text": "1:02:57 - Where has the code for // center dot gone??? Was I supposed to delete this at some point? : /", "likes": 0}, "replies": [{"author": "Kenneth Pace", "text": "end of section 1", "likes": 0}]}, {"topLevelComment": {"author": "Korbinian Schneider", "text": "Super tutorial and thanks for creating and uploading such great content! To be honest, at first i also had some problems with the trigonometry for drawing the ship. Here another variant which is easier to understand (at least for me). This method uses the respective radian measure for the alignment (two times PI equals 360 degrees of a complete circle in radian):  \n\nctx.moveTo(  \n ship.x + (ship.r * Math.cos(ship.a)), \n ship.y - (ship.r * Math.sin(ship.a))\n);\nctx.lineTo(  \n ship.x + (ship.r * Math.cos(ship.a + ((3/4)*Math.PI))), \n ship.y - (ship.r * Math.sin(ship.a + ((3/4)*Math.PI)))\n);\nctx.lineTo(  \n ship.x + (ship.r * Math.cos(ship.a + ((1+(1/4))*Math.PI))),\n ship.y - (ship.r * Math.sin(ship.a + ((1+(1/4))*Math.PI)))\n);\n\nFor further infos simply google: \"Trigonometry Unit circle\".", "likes": 5}, "replies": [{"author": "Alexandr Škaryd", "text": "Since i didnt understand his method of creation of the rear points i went similar way too.", "likes": 1}, {"author": "Dice Jones", "text": "Lmao you could’ve used ctx.rotate()", "likes": 0}, {"author": "Андрей Д", "text": "how to understand this formula  ship.x - ship.r * (2 / 3 * Math.cos(ship.a) + Math.sin(ship.a)). what is the meaning of it", "likes": 1}]}, {"topLevelComment": {"author": "Random Internet User", "text": "Awesome! Super easy to use :D", "likes": 0}}, {"topLevelComment": {"author": "william pelletiervslol", "text": "not working plz help\nps: i use notepad", "likes": 0}, "replies": [{"author": "bigchunk1", "text": "I use Atom it works fine. Should work ok in notepad or sublime as well. Did you name your file .html?", "likes": 0}, {"author": "paraglide01", "text": "Visual Studio is free to download.", "likes": 1}, {"author": "Kat Baker", "text": "You need to use eclipse", "likes": 0}]}, {"topLevelComment": {"author": "Jobin Tweets", "text": "Any way to know more about the trigonometry used in the game?", "likes": 0}, "replies": [{"author": "paraglide01", "text": "Google?", "likes": 4}]}, {"topLevelComment": {"author": "Charlike Mike Reagent", "text": "Super fun game, yup :D Pretty great time developing and playing it!", "likes": 2}}, {"topLevelComment": {"author": "muktesh Deshpande", "text": "awesome. I will be waiting for more like these from scratch vanilla JS projects.", "likes": 0}}, {"topLevelComment": {"author": "Colloidal Silver", "text": "is taking everyone else 3 days?", "likes": 4}, "replies": [{"author": "bigchunk1", "text": "I've spent the better part of a week on it, and i'm only halfway. I'm probably slow though but that's ok i'm getting a lot out of it.", "likes": 1}]}, {"topLevelComment": {"author": "Dhanushu Uzumaki", "text": "Its really amazing. If possible can you do a video or article explaining the math too?", "likes": 0}, "replies": [{"author": "Harjit Singh", "text": "Polarcut 888 I'm 18 and currently in college (goinh to university next year), i am currently studying cyber security.", "likes": 1}, {"author": "Harjit Singh", "text": "Polarcut 888 I'll be honest, I'm better at discrete mathematics than i am at programming, but that's because I've always been better at maths then programming. But there are people who are better at programming than they are at discrete mathematics. I guess if comes down to how you think: mathematically or computationally. Sometimes i struggle with programming even though i am studying computer science, but i do my research and make sense of things which helps alot.", "likes": 1}, {"author": "Harsh Shinde", "text": "And btw thanks for that last bit of extra knowledge not a lot ppl share that", "likes": 1}, {"author": "Harsh Shinde", "text": "@Harjit Singh thanks again man! I see you helping people,god bless you,hope you become big 1 day,how old are you? And what is your qualification?", "likes": 1}, {"author": "Harjit Singh", "text": "Polarcut 888 also, this is optional and NOT essential, but programming is deeply related to the field of discrete mathematics. So if you feel more mathematically inclined then you should try to study this interesting field too.", "likes": 1}]}, {"topLevelComment": {"author": "Manuel González Martínez", "text": "Part 7 code link is broken, it points to part 5 code, it is the same URL.", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "Whoops. Just updated. Thanks.", "likes": 3}]}, {"topLevelComment": {"author": "asdf", "text": "Really good tutorial. Please please keep up the awesome work", "likes": 1}}, {"topLevelComment": {"author": "Khalid Hashimeh", "text": "Hands down..you are a true master..thank you..", "likes": 0}}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "Thank u for this awesome video", "likes": 1}}, {"topLevelComment": {"author": "Andrew Kim", "text": "destroy all the ste(ROIDS)", "likes": 2}}, {"topLevelComment": {"author": "patrik knoerr", "text": "It gets better and better. Still not done watching Connect Four, now something even more interesting !", "likes": 0}}, {"topLevelComment": {"author": "prsion", "text": "How and where  we can download materials that lesson?", "likes": 0}, "replies": [{"author": "CEROSER", "text": "LLIO?!_OI79ITЬ?! You can just check the description, which magically has information", "likes": 2}]}, {"topLevelComment": {"author": "Paras Arora", "text": "I will also try this!!!....amazing simple and full of knowledge✌☺👍", "likes": 10}}, {"topLevelComment": {"author": "Safwat Rashik", "text": "*Awesome👏👏*", "likes": 2}}]}