{"video": {"id": "hBxs3wEZyAs", "title": "Computer Basics 14: Content Delivery Networks", "description": "A Content Delivery Network is a system of distributed servers (network) that deliver webpages and other Web content to a user based on the geographic locations of the user, the origin of the webpage and a content delivery server.\n\nThe goal of a CDN is to establish higher quality network connections.\n\nCDNs accomplish this by providing effective routes between their own servers that can fast-track users to their destination, or if its faster and/or cheaper, another copy of that website destination that is being hosted on another server. \n\nThis concept and type of service is not new, but is becoming more popular as the internet grows. \n\nWebsites contract and pay a CDN service, who in turn pays an internet provider to use their servers for their data.\n\nAn example of CDNs are Google's Hosted Libraries. -- https://developers.google.com/speed/libraries/#jquery\n\nGoogle hosts these libraries so that your users can load them into your own site much more quickly than if you host them yourself. \n\nThere's a chance the user's browser is even storing a cached version from visiting a previous page, making the process even quicker. If you aren't familliar with the term 'cache', don't worry, we'll cover that in future videos.\n\nAs a user, you probably use CDNs all the time without realizing it. \n\nAs a developer, you may want to use CDNs like google libraries to help your page load more quickly.\n\nAs a company, a CDN would be useful if you want your product or site to reach users more efficiently in the larger scheme of their network and the internet as a whole.", "duration": "PT2M14S", "likes": "259", "views": "22270"}, "comments": [{"topLevelComment": {"id": "UgxmTMewBndlYGtuoTR4AaABAg", "publishedAt": "2018-03-14T04:09:09Z", "author": "jsphschmtt", "text": "http://www.globaldots.com/content-delivery-network-explained/", "likes": 1}}, {"topLevelComment": {"id": "UgwZLiWQ2i5J2b7-52B4AaABAg", "publishedAt": "2017-12-19T11:27:03Z", "author": "Frank Cambell", "text": "Thanks for a great video! For the audience, if you are new to CDN - I recommend trying CDN77 (https://www.cdn77.com/) - they offer a 2-week trial and you don't need any credit card.", "likes": 0}}, {"topLevelComment": {"id": "Ugg8cEEMtodrhHgCoAEC", "publishedAt": "2016-08-31T16:58:13Z", "author": "Wayne York", "text": "Thx a lot , it's helpful~", "likes": 3}}, {"topLevelComment": {"id": "UgjWVuCJdWNsxngCoAEC", "publishedAt": "2016-06-17T19:35:38Z", "author": "K", "text": "Mam your videos are easy to understand. Just put some depth into it. Good work", "likes": 2}}, {"topLevelComment": {"id": "UgjcXuRt9ParangCoAEC", "publishedAt": "2015-12-05T23:43:29Z", "author": "vudshpreyk", "text": "Thank you very much for this great explanation about CDN's!", "likes": 2}}]}