{"video": {"id": "hCxvp3_o0gM", "title": "Using Parcel Bundler with React", "description": "Parcel is a web application bundler that offers blazing fast performance with zero configuration compared to webpack. In this video, we will create a basic React project using Parcel Bundler.\n\nTutorial from Nick Karnik. Check out his YouTube channel: https://www.youtube.com/channel/UClCm-WAOgN6XLwCpefSVezg\n\nNick on Twitter: https://twitter.com/theoutlander\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT11M14S", "likes": "256", "views": "10536"}, "comments": [{"topLevelComment": {"author": "Tepung Goreng", "text": "No config? Even faster? Woahhhj", "likes": 0}}, {"topLevelComment": {"author": "Yashin Hussain", "text": "Thankyou your video relived me of my problem. Thanks and keep up the good work", "likes": 0}}, {"topLevelComment": {"author": "Francisco J. Burtin", "text": "I got this error:parcel : The term 'parcel' is not recognized as the name of a \r\ncmdlet, function, script file, or operable program. Check the        \r\nspelling of the name, or if a path was included, verify that the \r\npath is correct and try again.\r\nAt line:1 char:1\r\n+ parcel src/index.html\r\n+ ~~~~~~\r\n    + CategoryInfo          : ObjectNotFound: (parcel:String) [], C \r\n   ommandNotFoundException\r\n    + FullyQualifiedErrorId : CommandNotFoundException", "likes": 0}}, {"topLevelComment": {"author": "Avi Mehenwal", "text": "And how does parcel deal with image compression and svg optimizations?", "likes": 1}}, {"topLevelComment": {"author": "Avi Mehenwal", "text": "it looks good. Does it work at ease with Typescript? I might use it in my next project", "likes": 0}}, {"topLevelComment": {"author": "Meleeman", "text": "me rn", "likes": 0}}, {"topLevelComment": {"author": "codewithnacho", "text": "This was awesome! Wish you kept doing more tutorials for parcel. :D", "likes": 0}}, {"topLevelComment": {"author": "Rick", "text": "I'm going to create an emmet plugin that slaps you when you try to wrap a block element in a div for no $%#@$%ing good reason.", "likes": 0}}, {"topLevelComment": {"author": "Eric Noguchi", "text": "HMR does not work for me unless add\r\n\r\n\r\nif (module.hot) {\r\n  module.hot.dispose(() => {});\r\n\r\n  module.hot.accept();\r\n}", "likes": 0}}, {"topLevelComment": {"author": "CASMANWHAT", "text": "❤️Die Webpack.", "likes": 5}, "replies": [{"author": "Tepung Goreng", "text": "Hahah", "likes": 0}]}, {"topLevelComment": {"author": "rct999", "text": "I did this with typescript, and it was amazingly easy. Just point script src to an tsx file and create tsconfig.json with:\n\n{\r\n    \"compilerOptions\": {\r\n      \"jsx\": \"react\",\r\n      \"allowSyntheticDefaultImports\": true\r\n    }\r\n  }", "likes": 0}}, {"topLevelComment": {"author": "VisualFutureOfMusic", "text": "I got a dependency resolution error. The only difference I saw between my and your environment was the use of pnpm in place of npm, which (also following your suggestion to install parcel-bundler at both global and local scopes) I thought might be impacting it's behavior. Hence, your package.json contents at the time of calling \"parcel src/index.html\" would have been helpful.\n\n(As it turns out, I had to install and import 'prop-types', as these appear to have been transferred out of the original react package - and which subsequently worked. See:\n\nhttps://reactjs.org/blog/2017/04/07/react-v15.5.0.html#migrating-from-react.proptypes)", "likes": 0}}, {"topLevelComment": {"author": "DrT1MA", "text": "Hello,  i have a problem (\\src\\index.html: URI malformed\r) , you now how fix it? Sorry for my english)", "likes": 0}}, {"topLevelComment": {"author": "Les", "text": "What vscode extensions do you use or recommend?", "likes": 0}, "replies": [{"author": "Nick Karnik", "text": "Les I’m using Webstorm in this video. I haven’t customized VSCode much so I’m not sure if there’s an extension to make it look like WS. It would be a good one to create :). In my newer videos where it’s just the client side, I use CodeSandbox.io.", "likes": 0}]}, {"topLevelComment": {"author": "Bryce Kilker", "text": "This was really helpful. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Mateja Petrovic", "text": "Parcel is an amazing tool especially for newcomers because they can get a react app up and running in seconds! It really makes the whole process faster, more approachable and enjoyable. With everything taken into account Parcel can have a great impact on developer happiness.", "likes": 7}}, {"topLevelComment": {"author": "Vedran Mandić", "text": "\"Make webpack obsolete...\" that was bold :/", "likes": 12}}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "Thank u for this awesome video", "likes": 1}}, {"topLevelComment": {"author": "Ephrey Ilunga", "text": "Please,  is PARCEL equal to Webpack ? Or can I really use Parcel instead of Webpack ?", "likes": 1}, "replies": [{"author": "Ephrey Ilunga", "text": "Nick Karnik  thank you ! That is exactly the answer I needed. Appreciate that !", "likes": 0}, {"author": "Nick Karnik", "text": "Ephrey Ilunga  I'm not sure if I understand the question correctly, but I'm going to attempt to answer it. My suggestion is to search for the parcel-bundler github issue tracker and go through active issues (if you are curious about known issues). However, my recommendation is to just try Parcel and get a feel for it. I am not keeping up with their issues so you won't hear from me about it. Hope that answers it.", "likes": 1}, {"author": "Ephrey Ilunga", "text": "Nick Karnik  , thank you for your quick reply ! I will definitely try it out and see how it works for me. One last  question, how will I be noticed when you will found out the web sockets issue came from and sort it out ?", "likes": 0}, {"author": "Nick Karnik", "text": "Hi Ephrey! Parcel is definitely ready to be considered a replacement for Webpack, IMO. I've used it in about 20 projects of various sizes so far for various clients and we haven't had any issues. Once a student of mine had ran into an issue related to web sockets, so I would recommend checking their issue tracker to see if something stands out. Either way, you should experiment with it to see if it works for you. It will take less than 10 minutes.", "likes": 2}]}, {"topLevelComment": {"author": "Fabrizio Tofanelli", "text": "This video is amazing! For some reason, I wasn't going for Parcel field, but now, I'm more than convinced to use it every day =)", "likes": 2}}, {"topLevelComment": {"author": "Mobin92", "text": "Seriously what is wrong with web development!? Could we please stop reinventing fricking basic tools and frameworks all the time!?", "likes": 6}, "replies": [{"author": "Ephrey Ilunga", "text": "I totally agree with you !! But this one is a Gold !!!", "likes": 4}, {"author": "Dextroyer Of Worlds", "text": "the difference between this and webpack is this has 0 configuration dude!! its way simpler than webpack", "likes": 3}]}]}