{"video": {"id": "IDsEEMkG9uY", "title": "Computer Basics: Chips and how Moore's Law works", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n  We discuss what constitutes a chip and why technology gets cheaper every year.\n  In this video we are going to be talking about chips and something called Moore's Law.\n  You've probably noticed over the last 10 or so years, if you're going to go buy an MP3 player, you can get a lot more storage for a lot lower price.\n  You probably have even done the thing where you're at the store and you think, \\Well, I can get one now, or I could wait 6 months and see how far the price has dropped\\ which might sound ridiculous but this is actually a trend that's been happening for a long time.\n  Let's talk about what makes a chip.\n  A chip is full of these little things called transistors, which are switches that can either be a 1 or a 0 (noticing a theme here?).\n  All of these transistors fit onto a chip, and that's how it stores information.\n  What makes these chips larger/faster is the amount of transistors on a single chip.\n  Moore's Law is the observation that the amount of transistors fit on each chip has doubled every two years since 1965.\n  This is important because it's making technology more affordable and accessible.", "duration": "PT1M10S", "likes": 0, "views": "22770"}, "comments": [{"topLevelComment": {"author": "Harshvardhan", "text": "Every 18 months.", "likes": 0}}, {"topLevelComment": {"author": "Francisco Ibañez III", "text": "Is this supposed to be the episode 14 of this series?", "likes": 0}}, {"topLevelComment": {"author": "User Google", "text": "Did she really not realize that her shirt is provocative and distracting? Hard to believe this is not done on purpose", "likes": 2}, "replies": [{"author": "Franklin", "text": "there's always that one loser", "likes": 0}, {"author": "Speed", "text": "Then I recommend you take this as a chance to practice eye contact.", "likes": 4}]}, {"topLevelComment": {"author": "Rahul Ranjan", "text": "Seriously man! I can't concentrate.. 😅 😅 Look at her big ****", "likes": 2}}, {"topLevelComment": {"author": "Omarko", "text": "why don't you putting videos anymore actually your explanation is very good", "likes": 0}}, {"topLevelComment": {"author": "Ashish Kumar Pandey", "text": "thanks mam for all series", "likes": 2}}, {"topLevelComment": {"author": "Gunasekaran T", "text": "please continue this series", "likes": 1}}, {"topLevelComment": {"author": "ルーカス", "text": "Moore's Law is restricted by quantum limit.", "likes": 2}, "replies": [{"author": "Speed", "text": "Which is? I haven't heard of that before.", "likes": 0}]}, {"topLevelComment": {"author": "Topsoil Depletion Awareness (closing the loop)", "text": "I have a big recommendation. Each lesson in FCC should have multiple exercises instead of just one so individuals who don't fully understand a lesson can get extra practice. FCC can make it so that individuals still get their brownie point after completing the first exercise in each lesson and the extra exercises are just optional.", "likes": 3}}, {"topLevelComment": {"author": "Satish Meghavvarnam", "text": "Like your explanation!", "likes": 2}}, {"topLevelComment": {"author": "COC Epic War Replays", "text": "i like CHIPS", "likes": 7}}]}