{"video": {"id": "iJKCj8uAHz8", "title": "Learn Bootstrap 5 and SASS by Building a Portfolio Website - Full Course", "description": "Learn Bootstrap 5 and Sass by building a portfolio website. Bootstrap is one of the most popular CSS frameworks and Sass is one of the most popular preprocessors for CSS.\n\n✏️ Course from Patrick Muriungi. Check out his channel: https://www.youtube.com/channel/UCEtlYWZil1WbX2LoqF2qocQ\n🐦 Patrick on Twitter: http://twitter.com/itsmuriungi\n\n💻 Code (completed project): https://github.com/MuriungiPatrick/Bootstrap-5-portfolio-template\n💻 Code (theming-kit.html): https://github.com/MuriungiPatrick/Bootstrap-5-Theming-Kit\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Part 1: Intro to Website Project       \n⌨️ (0:02:13) Part 2-1: SASS Setup\n⌨️ (0:19:27) Part 2-2: Customizing Bootstrap                       \n⌨️ (0:35:39) Part 3: File structure\n⌨️ (0:43:32) Part 4: The Navbar Section\n⌨️ (1:13:25) Part 5: The Intro Section\n⌨️ (1:57:00) Part 6: The Companies Section\n⌨️ (2:11:11) Part 7: The Services Section\n⌨️ (2:41:20) Part 8: Testimonials Section\n⌨️ (3:11:10) Part 9: The FAQ Section\n⌨️ (3:20:13) Part 10: The Portfolio Section\n⌨️ (3:45:21) Part 11: Getting Started Section\n⌨️ (4:10:24) Part 12: The Footer Section\n\n⭐️ Resources ⭐️\n🔗 SASS: https://sass-lang.com/guide\n🔗 Bootstrap 5: https://getbootstrap.com/docs/5.0/getting-started/introduction/\n🔗 Google fonts: https://fonts.google.com\n🔗 Fontawesome: https://fontawesome.com/start\n🔗 Tablericons: https://tablericons.com\n🔗 Bootstrap icons: https://icons.getbootstrap.com\n🔗 Illustrations: https://www.manypixels.co/gallery\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Wong Voon jinq\n👾 hexploitation\n👾 Katia Moran\n👾 BlckPhantom\n👾 Nick Raker\n👾 Otis Morgan\n👾 DeezMaster\n👾 Treehouse\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT5H2M23S", "likes": "10040", "views": "371846"}, "comments": [{"topLevelComment": {"author": "zaqqeus", "text": "This was a fruitful journey. Much appricited 🙏", "likes": 0}}, {"topLevelComment": {"author": "Exalted Archer", "text": "Hi, how appear the theming kit on your project? I cant find it", "likes": 0}}, {"topLevelComment": {"author": "sloth", "text": "Lol.  I'll stay away from node with that BlackLivesMatter BS.", "likes": 0}}, {"topLevelComment": {"author": "Kosovo is Serbia", "text": "There are definitely things that should be explained/pointed out. The purpose of the tutorial should be why something happens and what could be the possible errors and not just - hey, look at me making a webpage. I usually don't comment on videos like this and I am grateful for the github code, but this should have been better. 2.5/5", "likes": 0}}, {"topLevelComment": {"author": "développeur 47", "text": "How to ?    .......I want to buy a Template and modify with my info, change logo, firebase, color, a-z", "likes": 0}}, {"topLevelComment": {"author": "arjun", "text": "The tutorial is pretty much he typing the code and no explaination on why he wrote, he is simply explaining what he is typing like dude we can see what your are typing, tell us why you wrote that particular code in the first place. if you are a beginner then you will find this tutorial pretty hard. Because he did this video for free we cannot complain. My advice would be to avoid this tutorial if you are a beginner who don't know css or bootstrap.", "likes": 1}}, {"topLevelComment": {"author": "Joshua Sunday", "text": "👎", "likes": 0}, "replies": [{"author": "j_s_bxpert", "text": "why?", "likes": 0}]}, {"topLevelComment": {"author": "Pavlina Psarsky", "text": "I learned a lot, thank you!", "likes": 1}}, {"topLevelComment": {"author": "Sam Duss", "text": "at the end with all this setup i feel like would have been fater building from no bootstrap no sass lol", "likes": 1}}, {"topLevelComment": {"author": "suhaib The coder", "text": "21:22", "likes": 0}}, {"topLevelComment": {"author": "GeKtoRiX", "text": "This is my favorite project. Patrick, create a more complex project using additional libraries. Your faithful follower)", "likes": 1}}, {"topLevelComment": {"author": "DEV @ Creative Touch", "text": "I get error:\n\nError: $color: \"var(--bs-primary-rgb)\" is not a color for `rgba'\n\nWhen trying to compile please help", "likes": 0}}, {"topLevelComment": {"author": "Zulfiker Yahya", "text": "thanks for giving the opportunity to learn something special", "likes": 1}}, {"topLevelComment": {"author": "Lucas Cayo", "text": "Thanks for the video! very usefull", "likes": 0}}, {"topLevelComment": {"author": "Dheep Shemare", "text": "Does anyone know the moment he imports google fonts?", "likes": 0}}, {"topLevelComment": {"author": "Sarkar Ahasan Pervez", "text": "when and how to add the theming-kit.html file, why to hide that process, why, it's an incomplete video, please this process or removed this video from youtube.", "likes": 0}}, {"topLevelComment": {"author": "sumar junaid", "text": "how did uh complete the project... it only works in the live server not in the browser... the stylings arent applied", "likes": 1}}, {"topLevelComment": {"author": "Mansour", "text": "Thanks for the course .\nHow can i use the glightbox as npm package ??", "likes": 1}}, {"topLevelComment": {"author": "chaitanya bhallamudi", "text": "is autoprefixer working for you guys??", "likes": 0}}, {"topLevelComment": {"author": "Raul Martinez", "text": "Hello, \nIn the sass setup can I do the same for sublime text ?", "likes": 0}, "replies": [{"author": "Raul Martinez", "text": "hello, i was able to download node js and I was able to compile sass to CSS but im not sure if my set up is correct but it does save the files correctly one for scss and the other to compile to CSS \nI saw another video on compiling CSS it didn't require node js it used \"build system\" and I think its trying to duplicate both compiles \nthank you", "likes": 0}]}, {"topLevelComment": {"author": "Super", "text": "Hi Patrik I am facing an issue whenever I reopen the project it shows some thing like below\n\n$ npm run compile:sass\r\n\r\n> bootstrap5@1.0.0 compile:sass\r\n> sass --watch scss:assets/css\r\n\r\nError: Can't find stylesheet to import.\r\n  ╷\r\n1 │ @use 'custom' as *;\r\n  │ ^^^^^^^^^^^^^^^^^^\r\n  ╵\r\n  scss\\sections\\_navbar.scss 1:1  @use\r\n  scss\\style.scss 12:1            root stylesheet\n\nI have installed three times fro beginning Please help me out here...\n\nThanks in Advance", "likes": 0}}, {"topLevelComment": {"author": "Samuel Lucier", "text": "When stack on mobile, \"Web Development\" title in the \"Services Section\" should be on top the illustration but I can't seem to do that except with flex box but I don't want to use flex box", "likes": 0}}, {"topLevelComment": {"author": "strax", "text": "19:41 , where did that file theming-kit suddenly come from ? How in this world can someone make setting up this complicated !!!!!", "likes": 0}}, {"topLevelComment": {"author": "Caique Ludemann", "text": "I feel it might be better to watch a tutorial on bootstrap with a slower approach before watching this. Obviously this guy knows what he's doing, but he isn't much into explaining the why's and how's as to how bootstrap, sass or anything else works. Seems more like a \"watch me build a portfolio site\" than a \"let's build a portfolio site\".", "likes": 2}}, {"topLevelComment": {"author": "Atikur Rahman Atik", "text": "Excellent! I'm very appreciate for your tutorials. everybody should watch this tutorials to achieve a good knowledge on sass. May happy and long life.", "likes": 1}}, {"topLevelComment": {"author": "allison posey", "text": "Finished this in 2 days. I learned a lot especially in setting up bootstrap and sass. But what you did was not the best practice using bootstrap and sass. But for the sake of learning and free content, this video was great.", "likes": 3}, "replies": [{"author": "fname lname", "text": "@KanDoAllThings The only thing I can think of is you should use @use instead of @import. But it's kind of a moot point because BS5 uses import anyway, so you'll have @imports in your project anyway unless you use the CDN.", "likes": 0}, {"author": "KanDoAllThings", "text": "Can you then explain what is the best practice in using Sass and Bootstrap?", "likes": 0}]}, {"topLevelComment": {"author": "Julio Cesar", "text": "Completed this project in almost 20 days, a HUGE learning about boostrap and CSS/SASS. Thanks for the explanations!", "likes": 1}}, {"topLevelComment": {"author": "Mohammad Jewel", "text": "Which extension do you use to comment?", "likes": 0}}, {"topLevelComment": {"author": "Maikel Iriarte", "text": "Hi. I am doing this project tuorial but something is happening to me that when I write the code for the navbar background It gets compiled but doesn't get applied in my index.html. I don't know What I could have done wrong!", "likes": 0}, "replies": [{"author": "allison posey", "text": "im having the same problem", "likes": 0}]}, {"topLevelComment": {"author": "evelyn", "text": "Hey, I'm curious how he wrote the multi-line comment at the beginning of each section of the html file. It seems like he finished it just by pressing some keys at one time, and the single-line comment immediately turned into a multi-line one?", "likes": 1}, "replies": [{"author": "agostinho soberano", "text": "i want to know it", "likes": 0}]}, {"topLevelComment": {"author": "Dmitrii Sergeev", "text": "Thank you a lot !!!!", "likes": 1}}, {"topLevelComment": {"author": "Lawrence Wong", "text": "Lovely tutorial! Slowly working through it. I am trying to get the navbar to work on responsive but when I click the hamburger menu, nothing shows up. Any ideas?:D For reference, its at 1:09:55 of the navbar tutorial section.", "likes": 0}, "replies": [{"author": "Dark Samurai", "text": "You need to add the javascript of the bootstrap", "likes": 0}]}, {"topLevelComment": {"author": "Aderogba Mary", "text": "Please i can't find npm in fontawesome, what should i do?", "likes": 0}}, {"topLevelComment": {"author": "Martins Oluwatobi", "text": "my background color is not working after this tutorial,  dont understand what is going on", "likes": 0}}, {"topLevelComment": {"author": "Xander Juneau", "text": "Thanks for making a 5 hour long video and not taking 20 seconds to explain that we need to download the js files for bootstrap and add them to the assets folder. Using npm install did not create this folder. I had to follow your instructions for setting everything up, four times.", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "Hello Xander, Try linking with cdn", "likes": 0}, {"author": "Xander Juneau", "text": "Furthermore, there clearly must be something missing as I've reached the end of the Navbar section twice now and when the page resizes to that of mobile, the dropdown menu does not appear. I'm questioning whether all the other comments are legit because I am having far too many issues following this.", "likes": 0}]}, {"topLevelComment": {"author": "Iman Shokryeh", "text": "amazing", "likes": 0}}, {"topLevelComment": {"author": "Qashif Peer", "text": "Completed this project after almost 10 days, with in-between breaks. Every aspect of it was awesome. Thank you for this wonderful course.", "likes": 10}}, {"topLevelComment": {"author": "Sujan Nepal", "text": "I completed this tutorial in 10 days. I found this tutorial very awesome. I learned a lot from this. Thanks to the creator...", "likes": 1}}, {"topLevelComment": {"author": "vardelly Marly", "text": "Hello here, I have created  different  components for customization and then started writing my code. unfortunately when I realise that one component or section is missing I create it and run compile:sass, but this one is not compiled. it seems to simply be  ignored. can somebody help ?", "likes": 0}}, {"topLevelComment": {"author": "Dominika Papierska", "text": "How do you make comments at the beginning of the sections in html look like that? is that some VSC extension?", "likes": 0}}, {"topLevelComment": {"author": "L. Seçil Tuncay", "text": "great tutorial!thanks.", "likes": 0}}, {"topLevelComment": {"author": "Christopher McDonalde", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "balqis wildan", "text": "Just started the video and upon installing autoprefixer, I noticed the dependencies updated only to include autoprefixer but not postcss-cli. So, now I've got 3 dependencies when I run the package.json file in my editor (sublime) whereas Patrick here, has 4. What am I missing? Anyone experiencing the same?", "likes": 0}}, {"topLevelComment": {"author": "Distrik", "text": "i cant install fontawsome with npm, it doesnt have the option anymore", "likes": 0}}, {"topLevelComment": {"author": "Julio Cesar", "text": "24:29 - Why if I wrote the @import line on the TOP of _custom.scss my theming-kit does NOT update?? Just when I write it down on bottom side it works. I didnt catch this one. :/", "likes": 0}, "replies": [{"author": "Julio Cesar", "text": "(to whom it may concern) Update... ok, I got it in another video, its because I need to write the variables FIRST and the import command will update the bootstrap.scss file with my new information AFTER.", "likes": 0}]}, {"topLevelComment": {"author": "Mugiira Kimathi", "text": "This is great Patrick. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Borno Ahmed", "text": "He is just doing as he pleases. he does not have the ability to teach.", "likes": 0}}, {"topLevelComment": {"author": "Griffin Kirkland", "text": "learning from the bests", "likes": 0}}, {"topLevelComment": {"author": "Samuel Baseke", "text": "I have just finished coding along. One the best instructors here on YouTube.", "likes": 0}}, {"topLevelComment": {"author": "Camiel Gauthier", "text": "Just finished and loved every minute of it.  Site works and looks great....one issue.. I was not sure if it was my own content what parts needed to be uploaded so they would work on an actual domain setup.  I was able to upload everything needed so I could actually use my fire tab, ipad and iphone to see how things look and respond.  Menu does not open, accordion does not toggle and testimonials arrows do not work from slide to slide.  Offline with server created from VSCode works just fine but kind of puzzling that nothing would work from there.  I also tried and use samples from bootstrap and create my own navbar area just for it also not to work for a toggle...What am I doing wrong..is BS5 not supported on many browsers yet", "likes": 1}, "replies": [{"author": "Camiel Gauthier", "text": "@Patrick Muriungi Thanks so much for responding...I had to use a CDN then the custom CSS and JS files that were created during tutorial and it seems to have fixed the issue but not too sure if that is the best way to achieve that....I am assuming if my custom CSS file is after the CDN the styles will overide the CDN file.", "likes": 1}, {"author": "Patrick Muriungi", "text": "Check the Bootstrap 5 version & JS you're using should be same. some components do not work if they're not of the same.", "likes": 0}]}, {"topLevelComment": {"author": "Anne Z", "text": "Excellent in-depth course about Bootstrap 5. Thank you very much for your time and sharing it with us!", "likes": 1}}, {"topLevelComment": {"author": "Hector H. Rivera", "text": "Awesome work! thank you so much!! one of the best tutorials I've ever seen.", "likes": 1}}, {"topLevelComment": {"author": "henry nnonyelu", "text": "I did everything you did while setting up the dev environment but I didn't see the Theming-kit.html file in mine.", "likes": 1}, "replies": [{"author": "strax", "text": "same , did you find out how to get it ?", "likes": 0}]}, {"topLevelComment": {"author": "goodoldmusic", "text": "company", "likes": 2}}, {"topLevelComment": {"author": "2ODD  عالم العجائب", "text": "Thanks so much I have learned a LOT from You Sir. God Bless - I wont forget you once I get paid on my first Work", "likes": 1}}, {"topLevelComment": {"author": "Nojus Stankevičius", "text": "46:01 from where did js folder came to assest, can somebody help ?", "likes": 0}}, {"topLevelComment": {"author": "Tatti Tatooo", "text": "How did the bootstrap file occured in the bootstrap coustomizing part ..\nIt was not there in the sass setup part....\nReally confused, pls reply to this comment.", "likes": 0}, "replies": [{"author": "ETH", "text": "check the last line in _custome.scss file", "likes": 0}]}, {"topLevelComment": {"author": "Rasaq sodiq", "text": "Another question, why us the webfonts folder copied to assets. We already installed bootstrap, why do we have to add the js folder again to assets.\n\nDo we need to go through all these onboarding process for every project\n\nWhy are the icons having default primary color?\n\nThank you very much", "likes": 0}}, {"topLevelComment": {"author": "Savio Fernandes", "text": "Should the git bash be running while editing index.html? I am not able to see any changes to the navbar after making edits", "likes": 0}}, {"topLevelComment": {"author": "Rasaq sodiq", "text": "why is there !default in the bootstrap variables and why are we removing it in our customization", "likes": 0}}, {"topLevelComment": {"author": "Ajinkya More", "text": "This is what I was looking for. Quality content. Awesome work Patrick, thanks a ton!", "likes": 1}}, {"topLevelComment": {"author": "Guestaba Louis Arnaud SAVADOGO", "text": "So amazing and well explained. You saved me a lot of reading.lol. thanks", "likes": 1}}, {"topLevelComment": {"author": "Hem Raj Bhatt", "text": "if you use @import in main scss file you dont need to include all file of scss it will work for all", "likes": 0}}, {"topLevelComment": {"author": "Ntšoereng Ntšoereng", "text": "How can I create a popping up swipeable image gallery instead of the video in the hero section using GLightBox?", "likes": 0}}, {"topLevelComment": {"author": "Maya Parnell", "text": "where did the \"theming-kit.html\" file come from?  when was it added in terms of steps?  what does it do?  I think I missed it....I just saw it there once we got to Customizing Bootstrap.", "likes": 0}, "replies": [{"author": "iHak0", "text": "You can find it in the description of this video. The goal was to prepare the template for the project. Bootstrap values ​​were overwritten with other colors, for example. It is not a \"must\" step. It was an idea or a solution from the project owner. It also saved quite a bit of time and to be honest it was a good idea too.", "likes": 2}]}, {"topLevelComment": {"author": "TutoGameplay", "text": "buenas alguien pudo instalar por npm el Font Awesome 6", "likes": 0}}, {"topLevelComment": {"author": "Rahul Gauniyal", "text": "Great tutorial", "likes": 2}}, {"topLevelComment": {"author": "oluchukwu nna", "text": "This is a crash course", "likes": 1}}, {"topLevelComment": {"author": "RKPinata", "text": "This guy doesnt know how to explain the reasoning behind what he does. Do this do that, tadaa. Also doesnt even properly show the steps, I followed exactly what he does and still sometimes doesnt work properly because he doesnt show some installation process so I had to figure out by myself. I only learnt to cpy what he does, and not what I can do with bootstrap. Pretty much a waste of time", "likes": 1}}, {"topLevelComment": {"author": "Dina Noya", "text": "hi, for some reason I can't run compile:sass on the terminal, checked the package.json file if I had any typos but all looks good. would appreciate any help", "likes": 0}, "replies": [{"author": "iHak0", "text": "Sorry for the late answer. You can try a workaround. If you are using vscode try to install the live sass compiler. Not the most downloaded one. There is one more with less download count. Because the one with many downloads hasn't received any updates since 2018. Therefore, for example \"@use\" will not work. So please download the other version. They look the same from the icon only that there are fewer downloads. Then just click on \"Watch Sass\" and the whole thing will work without \"compile:sass\".", "likes": 2}]}, {"topLevelComment": {"author": "Uibu Desu", "text": "I followed to steps to customize the accordian button but it doesnt work. why????", "likes": 0}}, {"topLevelComment": {"author": "Etienne Robert", "text": "Hi Patrick, does sass create the bootstrap.js too or was it imported in the project and put in the assets/JS folder manually?", "likes": 0}}, {"topLevelComment": {"author": "Nick Rodriguez", "text": "I am struggling to get my dropdown classes from the bootstrap website to work. It looks like i need the poppersjs library, which seems to be included in the bootstrap5 npm install. Using this frame work do I need to add anything to _custom.scss file or anything to get the dropdown, dropdown-toggle, dropdown-menu classes to work?", "likes": 0}, "replies": [{"author": "Nick Rodriguez", "text": "It looks like bootstrap.bundle.min.js is in the nodes_modules package, but i have to reference the script directly from the head of my html. This works but glad to get advice on a cleaner way or maybe a reference in this tutorial that I must have missed for adding more bootstrap components. Thank you! for this tutorial it has been really helpful!!!", "likes": 0}]}, {"topLevelComment": {"author": "Motivated By Pain", "text": "Awesome course Patrick!! I definitely learned a lot from your great explanations and different ways you showed us how to do things. I am very grateful for learning Bootstrap from a master like you. All the best and I can't wait to see the next course.", "likes": 0}}, {"topLevelComment": {"author": "Samsus Salekin", "text": "Consolas, 'Courier New', monospace", "likes": 0}}, {"topLevelComment": {"author": "Samsus Salekin", "text": "'Cascadia Code'", "likes": 0}}, {"topLevelComment": {"author": "Sifatul Rabbi", "text": "The video was great but it was really hard to understand his accent.", "likes": 2}, "replies": [{"author": "henry nnonyelu", "text": "Thats your business.May be you should do one with Queens English.", "likes": 0}]}, {"topLevelComment": {"author": "Fernanda Piña", "text": "Excelent tutorial! Thank you so much", "likes": 1}}, {"topLevelComment": {"author": "Sumirin", "text": "just completed the course and I must say that I'm quite impressed! love the way you order things, makes it more clear. thank you so much!", "likes": 6}}, {"topLevelComment": {"author": "Programming School", "text": "Thanks A Lot", "likes": 1}}, {"topLevelComment": {"author": "RAGAV N G SEC 2020", "text": "HELP!\nsomeone help me out when i try to do the linear gradient thing in navbar it doesn't reflecting in index.html whatever changes I make in navbar doesn't reflect back in index.html why?", "likes": 0}}, {"topLevelComment": {"author": "Motivated By Pain", "text": "This is the second time I'm trying to follow this course but I cannot use the \"@use 'custom' \" without getting an error and whatever I try to change it just doesn't work. Can someone help? I tried everything on stackoverflow and still no fix.", "likes": 0}}, {"topLevelComment": {"author": "Sushant Dhimal", "text": "I wonder how he generates the comments at 46:46  ? Anyone help me with this.", "likes": 1}, "replies": [{"author": "NGAN WEI LOONG", "text": "CTRL + / if u still need", "likes": 0}]}, {"topLevelComment": {"author": "Nix_limits 104.9", "text": "i wonder where the theming-kit came from cx i can't seem to automatically generate like u did. but thanks for the course though", "likes": 1}}, {"topLevelComment": {"author": "Sajidur Rahman Sahib", "text": "wow mentor patric..", "likes": 1}}, {"topLevelComment": {"author": "Anang Yoga", "text": "thank\nyou\nso\nmuch!\n\nMuriungi <3", "likes": 1}}, {"topLevelComment": {"author": "Joju Thomas", "text": "Hi Patrick, I'm having trouble while installing  \"npm run compile:sass\" getting the following error. (I'm struck here at your video 15.21). Could you please help me..\n\nnpm ERR! code EJSONPARSE\r\nnpm ERR! path C:\\Users\\Joju\\Desktop\\Bootstrap-v5/package.json\r\nnpm ERR! JSON.parse Unexpected token \"j\" (0x6A) in JSON at position 0 while parsing near \"j{\\n  \\\"name\\\": \\\"boots...\"\r\nnpm ERR! JSON.parse Failed to parse JSON data.\r\nnpm ERR! JSON.parse Note: package.json must be actual JSON, not just JavaScript.\r\n\r\nnpm ERR! A complete log of this run can be found in:\r\nnpm ERR!     C:\\Users\\Joju\\AppData\\Local\\npm-cache\\_logs\\2022-01-19T13_49_34_049Z-debug.log", "likes": 0}}, {"topLevelComment": {"author": "Peter Mujuni", "text": "amazing course", "likes": 1}}, {"topLevelComment": {"author": "mwape G", "text": "I have a question: how do we create an effect on the portfolio section such that clicking or hovering over the buttons will show the user which portfolios  belong to specific categories/sections", "likes": 3}}, {"topLevelComment": {"author": "Ankit Mishra", "text": "_navbar.scss changes are not getting compiled. changes made to it is not working. please help.", "likes": 0}}, {"topLevelComment": {"author": "ΑΘΑΝΑΣΙΟΣ ΧΑΛΚΙΩΤΗΣ", "text": "Great tutorial. Learned a lot. Keep up the good work!", "likes": 1}}, {"topLevelComment": {"author": "Lost Native", "text": "Thanks a lot Patrick very helpful!", "likes": 1}}, {"topLevelComment": {"author": "Ajay Thakur", "text": "Thank you  very much for you worderfull video", "likes": 1}}, {"topLevelComment": {"author": "Smriti Gupta", "text": "I love when he says 'pakege'!😄 & sass is sus🤫 got a feeling of among us😁", "likes": 1}}, {"topLevelComment": {"author": "Smriti Gupta", "text": "Thanks A Lot I have just started the video and I am Happy that to learn bootstrap and it's customization I only need to know html & css rn, and sir will make me learn more, yay, now let me continue my video! :D\nEdit1: Even more Happy he's doing on Windows10, :D\nEdit2: Great he's using GitBash, I have it! :D", "likes": 1}}, {"topLevelComment": {"author": "sumayea blash", "text": "Thank you sir...amazing video\n\nHow can I go to any section by nevbar heading  without getting an error (can not get)..i want to scrolling in the same page?!", "likes": 0}}, {"topLevelComment": {"author": "sethrandalldev", "text": "Great course! I changed up some stuff and got a great portfolio now. I'm excited to show it off and start building more projects with some of the tools I learned.", "likes": 5}}, {"topLevelComment": {"author": "Rafael Oliveira", "text": "Hi, at the Nav Bar Section 48:04, you have put a class \"justify-content-end\", bur, for some reason, that class don't appear in my project. Someone have some ideia whi this is happening?", "likes": 0}, "replies": [{"author": "Rafael Oliveira", "text": "My css file has the class \"justify-content-end\", but, for some reason, the content of my nav is not justifying for the right", "likes": 0}]}, {"topLevelComment": {"author": "Royal Blue", "text": "I am having a challenge with Testimonials left:50% transform:translate(-50%, -50%). The picture is not getting centered as demonstrated. Did l miss anything here?", "likes": 1}}, {"topLevelComment": {"author": "Oumaima Naciri", "text": "Thank you Patrick and free code academy", "likes": 1}}, {"topLevelComment": {"author": "Reshma R", "text": "How to download source file of javascript", "likes": 1}}, {"topLevelComment": {"author": "Coffee & Music", "text": "Does anyone know how to add transition in carousel?", "likes": 0}}, {"topLevelComment": {"author": "طريق الهدى", "text": "We need your help 🙏 https://youtu.be/_TNa3Gr10cA", "likes": 0}}, {"topLevelComment": {"author": "CHITUS💙⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻", "text": "I just finished watching the whole course! It's so amazing how the final product turned out to be!", "likes": 1}}, {"topLevelComment": {"author": "A Sp", "text": "It was AWESOME. Thanks a lot  Patrick . Love from iran", "likes": 1}}, {"topLevelComment": {"author": "Chisomo Moyo", "text": "How to double like a YouTube tutorial. Its amazing : -)", "likes": 1}}, {"topLevelComment": {"author": "James Allen", "text": "This is hands down the best tutorial on Bootstrap 5 and Sass on youtube, i've learned so much about Sass in this tutorial, i completed the whole thing, watching you typing every command with you. Also you are a master in Emmet, the best i've seen, I'm trying to get all those shortcuts down and its helped a lot watching and trying what you did. Thanks so much, job well done, I realize how much time you've put into this tutorial and I for one am thankful.", "likes": 12}}, {"topLevelComment": {"author": "8 koi", "text": "YES Exactly what got my attention!! they looks sooooo powerful!!!", "likes": 2}}, {"topLevelComment": {"author": "tomas matusek", "text": "would be good if someone make any tutorial/course for explainat all about the (as / ** /, and many more) \nhttps://youtu.be/iJKCj8uAHz8\n\nBecause it realy terrible not understand that, and only fallowing tutorials, We need someone who realy will explain us every details, and why it working like that, and where we can find solution for the problem, because we will face many problem like that  in our future :)\nThanks all :)", "likes": 2}}, {"topLevelComment": {"author": "SavageStyle", "text": "I can't handle this accent, it is terrible", "likes": 0}}, {"topLevelComment": {"author": "murali krishna", "text": "Brother, I regularly follow this channel... your videos are amazing to improve my knowledge. It will very useful in application design and development.", "likes": 1}}, {"topLevelComment": {"author": "MrPink", "text": "Question. When i put index.html in the sections folder, why wasent my nav bar working?? But as soon as i pulled it out of that folder it worked???", "likes": 1}}, {"topLevelComment": {"author": "Cingiz Hemidov", "text": "great tutorial!", "likes": 1}}, {"topLevelComment": {"author": "Sara Ch", "text": "How to install it as a laravel project and make it happen??", "likes": 1}}, {"topLevelComment": {"author": "MrPink", "text": "what add-on are you using for the HTML text. Because the code is much easier to read with that add-on.", "likes": 1}}, {"topLevelComment": {"author": "md najmul hasan", "text": "u r so nice", "likes": 1}}, {"topLevelComment": {"author": "Mariaasteria Shaw", "text": "Some good sometimesbad", "likes": 1}}, {"topLevelComment": {"author": "Mannar Hielal", "text": "03:42:39 h4 and all headers are already block elements, no need for display:block", "likes": 0}}, {"topLevelComment": {"author": "Barrientos Cardenas Lino Fernando", "text": "I love your page when i get my first job i wanna give you a great donation for your amazing job", "likes": 1}}, {"topLevelComment": {"author": "kasper kat", "text": "Guys, I have a problem with the Intro Part 5.  It doesn't show up (not rendering). I used the source code.   Please help.  Thanks", "likes": 0}}, {"topLevelComment": {"author": "Nate K", "text": "Will this work for mobile web browsers as well?", "likes": 1}}, {"topLevelComment": {"author": "Jainendra Bhiduri", "text": "It is very hard.\nI am good at html and css so why i need to learn this.", "likes": 1}}, {"topLevelComment": {"author": "V S", "text": "Thank you! I have learned a lot of informations and built my own project.", "likes": 1}}, {"topLevelComment": {"author": "ACE", "text": "Thank you... You're a really great tutor...", "likes": 1}}, {"topLevelComment": {"author": "Mannar Hielal", "text": "question: why did we install autoprefixer package? Boostrap v5 uses it already out-of-the-box. no?\n\naccording to docu:\nBootstrap uses Autoprefixer (included in our build process) to automatically add vendor prefixes to some CSS properties at build time. Doing so saves us time and code by allowing us to write key parts of our CSS a single time while eliminating the need for vendor mixins like those found in v3.)", "likes": 0}}, {"topLevelComment": {"author": "Cheap Fun Steam Games", "text": "I love his teaching style. Reminds a lot of Traversy Media style. No fluff, just clear and concise.", "likes": 4}}, {"topLevelComment": {"author": "SepehrGoodMan", "text": "pls use a faster laptob", "likes": 1}}, {"topLevelComment": {"author": "Henry Muhindi", "text": "im on it,thanks", "likes": 1}}, {"topLevelComment": {"author": "Martin Dwyer", "text": "Just finished coding along through this video.  I was able to work along and develop a template with my own images and color schemes with no problem.  The Sass setup with npm was excellent, and the integration with Bootsrap v5.0 amazing.  It may take you  a few dozen pauses of the video to stay on track, but I highly recommend coding along with this video.  It is excellent for both Sass and Bootstrap v5.0", "likes": 36}, "replies": [{"author": "ivan milenkovic", "text": "why using Node here? can't we just set up without Node?", "likes": 0}, {"author": "Sara Ch", "text": "How to install it as laravel project?", "likes": 0}]}, {"topLevelComment": {"author": "Sedana Yoga", "text": "Awesome course!!! but still wondering how can we do the section comment like in 1:13:55 in vscode?", "likes": 1}}, {"topLevelComment": {"author": "jael kyle", "text": "I don't see that theming kit anywhere", "likes": 1}}, {"topLevelComment": {"author": "azan shaikh", "text": "yoooo this is so cool. Like learning bootstrap in wakanda", "likes": 0}}, {"topLevelComment": {"author": "Dime Tra", "text": "⭐️ Course Contents ⭐️\n⌨️ (@) Part 1: Intro to Website Project       \n⌨️ (@) Part 2-1: SASS Setup\n⌨️ (@) Part 2-2: Customizing Bootstrap                       \n⌨️ (@) Part 3: File structure\n⌨️ (@) Part 4: The Navbar Section\n⌨️ (@) Part 5: The Intro Section\n⌨️ (@) Part 6: The Companies Section\n⌨️ (@) Part 7: The Services Section\n⌨️ (@) Part 8: Testimonials Section\n⌨️ (@) Part 9: The FAQ Section\n⌨️ (@) Part 10: The Portfolio Section\n⌨️ (@) Part 11: Getting Started Section\n⌨️ (@) Part 12: The Footer Section", "likes": 8}}, {"topLevelComment": {"author": "Doza de Trezire", "text": "Does anyone know how to make the autoprefixer work in this project? Because we have installed it just like Patrick did in this video, but we didn't use it. Thank you very much!", "likes": 0}}, {"topLevelComment": {"author": "Doza de Trezire", "text": "2:32:32 , why do you add: -webkit prefix to the background-clip property if we allready installed the autoprefixer at the beggining of the course? Shouldn't that autoprefixer be enough so that we dont have to think about adding prefixes??", "likes": 0}, "replies": [{"author": "Doza de Trezire", "text": "@Ivar Know Thank you very much Ivar... I've run the command that you told me, but it gives me this error message: Error [ERR_MODULE_NOT_FOUND]: Cannot find package 'postcss' imported from C:\\WEBSITES\\Dorel Visan\\node_modules\\postcss-cli\\index.js\n  I have to mention that i've installed the autoprefixer package at the beggining of the project, just like in this course. Do you have any idea why it gives me this error?", "likes": 0}, {"author": "Ivar Know", "text": "You've to run this command > npx postcss (path).css --use autoprefixer -d build/", "likes": 0}]}, {"topLevelComment": {"author": "mensursonic", "text": "I was kinda bothered by how the services section looks like on smaller devices, being that you have the content, then 2 pictures/illustrations one after another, then another content, which seemed off. \nSo after some googling I've come up with this solution:\n\n1. In the web development content, change the class of a row to row--1, should be directly after the START WEB DEVELOPMENT CONTENT comment.\n2. Nest this code in services like this:\n\n .services {\n\n   .row--1 {\n    display: flex;\r\n    flex-direction: row;\n\n\r\n\r\n    @include media-breakpoint-down(sm) {        \r\n        flex-direction: column-reverse;\r\n        \r\n        }\r\n    }\n}\n\nI don't know if this is the best approach but it works and looks much better in my opinion.", "likes": 5}, "replies": [{"author": "goodoldmusic", "text": "That works, thank you. But for me it adds spaces on left and right sides on the second picture when I add row--1. I added a separate class instead and now it's perfect.", "likes": 1}, {"author": "Jeffery Newton", "text": "Thank-you for sharing..", "likes": 1}]}, {"topLevelComment": {"author": "Richard Draws Stuff", "text": "Brilliant Tutorial. Thank you for the content.", "likes": 2}}, {"topLevelComment": {"author": "Sebastian Slapa", "text": "He is not Patrick XD", "likes": 0}}, {"topLevelComment": {"author": "Mohammad Rafiee", "text": "why not using the integrated terminal in vs code!!!", "likes": 0}}, {"topLevelComment": {"author": "Benjamin A. Boyce", "text": "Everything works fine as I follow along, until I get to 57:03 and I get error: undefined mixin. I have checked and double checked, even started over from the beginning twice and I cannot resolve the error.", "likes": 0}}, {"topLevelComment": {"author": "W M", "text": "I took a full-stack bootcamp and still learned a lot of new tricks! I like your use of Emmet, nesting, keeping all the styling in separate sheets. You have a style library, now anyone can snip paste and modify any section of the page. Great work!!", "likes": 6}}, {"topLevelComment": {"author": "Abhilash Matukumalli", "text": "This is just awesome, can you try creating a course with (React JS, Bootstrap5, Sass). Thanks in advance.", "likes": 4}}, {"topLevelComment": {"author": "Konstantinos", "text": "What an amazing tutorial. Well done sir.", "likes": 2}}, {"topLevelComment": {"author": "waffletube", "text": "Any particular reason you choose to use the console terminal vs the VS Code terminal?", "likes": 1}}, {"topLevelComment": {"author": "Elikem Daniels", "text": "Hello. I presume one does not need to use PurgeCSS in this case. Your thoughts?", "likes": 0}}, {"topLevelComment": {"author": "Abhinav Pal", "text": "can anyone tell me how he select all default at the timeline 25:13", "likes": 1}}, {"topLevelComment": {"author": "Samiul Islam", "text": "The only probelm i'm having right now is some of the buttons (Submit and Back to top) are not getting their primary colors pink, they're the default bootstrap 5 color (blue). How can I fix this?", "likes": 1}}, {"topLevelComment": {"author": "Behind the Scene", "text": "to be practice soon !!", "likes": 1}}, {"topLevelComment": {"author": "Geekyyouths", "text": "Hi Patrick and colleagues, after writing the script compile:sass, when running npm, keeps on throwing error, \"error scss: no such file or directory\" yet I have it. What maybe the problem", "likes": 1}, "replies": [{"author": "Remonetized。org", "text": "If you did the same thing as me, you came back to it the next day and it doesn't work, right? You need to change the directory, use the command on the next paragraph, but change to wherever you put your folder\ncd c:/xampp/htdocs/portfolio\n\nThen run the command again\nnpm run compile:sass", "likes": 0}]}, {"topLevelComment": {"author": "Karel Čančara", "text": "The gradient did not work for me in the navbar - at around 46:12, but I managed to solve it using @use AND @forward. \n\nHere is how:\n\n\r\nBased on another video \"Stop using @import with Sass\" I:\r\n1) Created 2 extra files in Components and Sections called \"_index.scss\"\n\r\n\r\n\n2) In Components it contains:\r\n@forward \"animations\";\r\n@forward \"buttons\";\r\n@forward \"mixins\";\r\n@forward \"typography\";\r\nand in Sections:\r\n@forward \"navbar\";\r\n@forward \"intro-section\";\r\n@forward \"companies\";\r\n@forward \"services\";\r\n@forward \"testimonials\";\r\n@forward \"faq\";\r\n@forward \"portfolio\";\r\n@forward \"get-started\";\r\n@forward \"footer\";\r\n\r\n\n3) Then in style.scss I only have:\r\n@use \"custom\";\r\n\r\n@use \"Components\"; //importing components \r\n@use \"Sections\"; //import sections\r\n(instead of the things in  (0:35:39) Part 3: File structure )\r\n\r\n\nThat's it! Now the gradients finally works for me :)", "likes": 1}, "replies": [{"author": "Mariaasteria Shaw", "text": "I'm insulted how they both think I'm so dumb that I won't know", "likes": 0}, {"author": "Omowaye Osward", "text": "Hi Karel, could you expatiate more on what you did because I don't seem to understand it", "likes": 0}]}, {"topLevelComment": {"author": "ADITYA KUMAR", "text": "Can anyone help me out with Bootstrap - hemmingkit.html . I'm not able to load it onto my vs . does anyone know how to do it ??", "likes": 0}}, {"topLevelComment": {"author": "Tunde Alan", "text": "Thanks, this is so helpful", "likes": 1}}, {"topLevelComment": {"author": "giannitelli roberto", "text": "great video and content. I am a complete beginner and every step takes me probably double the time it should (when I am lucky) but I am so grateful for your channel!!!", "likes": 2}}, {"topLevelComment": {"author": "MC Stats", "text": "Hello guys, I encountered this error while importing bootstrap.scss to _custom and use it inside style.scss      \n\nError: 0.2rem and 0 are incompatible.\r\n  ╷\r\n9 │       $return: append($return, max($value, 0));\r\n  │                                    ^^^^^^ 0.2rem\r\n  │                                            ━ 0\r\n  ╵\r\n  node_modules\\bootstrap\\scss\\mixins\\_border-radius.scss 9:36   valid-radius()\r\n  node_modules\\bootstrap\\scss\\mixins\\_border-radius.scss 20:20  border-radius()\r\n  node_modules\\bootstrap\\scss\\_reboot.scss 322:3                @import\r\n  node_modules\\bootstrap\\scss\\bootstrap.scss 17:9               @import\r\n  scss\\_custom.scss 2:9                                         @use\r\n  scss\\style.scss 2:1                                           root stylesheet\r\n\n\nPLEASE HELP ME TO SOLVE THIS ISSUS. THIS TRIGERED ON 22.15 MINUTES @vaxa code @ItsMuriungi", "likes": 0}}, {"topLevelComment": {"author": "THE HAM CHRONICLES", "text": "thanks for this vid, please what app did you use for your live viewing", "likes": 0}}, {"topLevelComment": {"author": "Yash Rathod", "text": "Hi for some reason the sandwhich menu button doesn't respond and open all the page options for me. Could someone help me out?", "likes": 0}, "replies": [{"author": "Aleksandra Wójcik", "text": "I have the same issue and the hamburger menu works only locally, not when uploaded on GH Pages", "likes": 0}]}, {"topLevelComment": {"author": "isaac martinez", "text": "Thanks, what theme do you use?", "likes": 0}}, {"topLevelComment": {"author": "PIYUSH TIWARI", "text": "Can I host the bootstrap website via GitHub? Reply", "likes": 1}}, {"topLevelComment": {"author": "Ariplaygames", "text": "Does anyone know why it might not be compiling my scss to css automatically? Im at around 18:30 of the video and it compiles, but I have to run the command everytime even tho it says its watching. HELP PLEASE!", "likes": 0}, "replies": [{"author": "kasper kat", "text": "Check your script in pkg json.  It should look like   \"compile:sass\": \"sass --watch --style compressed  scss:  assets/css\",   AND check your spelling and paths.", "likes": 0}]}, {"topLevelComment": {"author": "Tomyam Family", "text": "does anyone know what kind of theme/ extensions that he use? my VS code isn't that responsive like his,\n\nFor example : \n- my vscode doesn't automatically create images logo folder icon when i name the folder \"images\"\n- my vscode doesn't show snipped of justify classes when i type justify like him in 48:33\n\nThanks!", "likes": 0}}, {"topLevelComment": {"author": "Aadarsh Naik", "text": "Why is my accordion not working in live server?", "likes": 0}}, {"topLevelComment": {"author": "KUNAL PRASHANT PATIL", "text": "nav-link color is not changing on hover . Can anyone fix this ? Hey vaxa code sir  at least teach us complete tutorial  .", "likes": 0}}, {"topLevelComment": {"author": "md bicky", "text": "thanks for this course Muriungi ❤🎉 took a lot of time to complete this course thanks  mate keep up the good work", "likes": 3}}, {"topLevelComment": {"author": "Ruan S. P.", "text": "Thank you very much !", "likes": 1}}, {"topLevelComment": {"author": "Yash Rathod", "text": "The span nested class doesn't seem to add the square box in my navbar...would appreciate any help. thanks!", "likes": 0}}, {"topLevelComment": {"author": "Geekyyouths", "text": "Hello, thanks so much. Question please. My style.scss compiled successful but as I launched it in the browser, it only displayed HTML without design. Please help me here. Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Coding wallah", "text": "20:02 how this file come thats has .html extension", "likes": 1}}, {"topLevelComment": {"author": "RyzYLR", "text": "I really don't get the whole SASS Setup , it is so confusing ! Can someone explain in detail how to do it ? I mean I have the Live Sass Compiler extension on VS , isn't that enough ?", "likes": 2}, "replies": [{"author": "RyzYLR", "text": "@RISHAV KUMAR Hey ! Thank you very much for your quick answer ! Well, what I don't understand is the following:\n1. Do I have to download Git BASH or can I use VS Terminal ?\n2. Is it mandatory to download Node to recreate the project ?\n3. About dart-sass if I have the Live compiler extension on VS , is it enough ? Or should I download dart-sass anyway ?\n4. Bootstrap and FontAwesome , do I have to integrate it through npm or can I just link it with CDN ?\nSo sorry about all these questions , I am just getting started and I really want to recreate this project .\nThank you very much , it is really nice of you to help me out !\nCheers !", "likes": 0}, {"author": "RISHAV KUMAR", "text": "Sass mainly works on the concept of indentation. If you can be more specific what were the concept you didn't understand then it would be easy for us to help you out.\n\nLet us know.", "likes": 1}]}, {"topLevelComment": {"author": "CHRIST CONTENT", "text": "Kenya to the world. Proud of you Pato.", "likes": 1}}, {"topLevelComment": {"author": "Ahmed Ibrahim", "text": "hey i dont understand where did you get that file caled theming____.html from :'(", "likes": 2}, "replies": [{"author": "Ahmed Ibrahim", "text": "@RISHAV KUMAR oo thanks ! did not know that ! \nokey all try and get back to the course \nthanks a loot 💜💜", "likes": 0}, {"author": "RISHAV KUMAR", "text": "Link is given in the video description to download the theming kit. Please download it form there and after downloading move it to the project folder.\n\nHope it helps.", "likes": 2}]}, {"topLevelComment": {"author": "Roseanna M", "text": "This is a great class. The sass compiler didn't work the next day and nothing changed. I'm not the most computer literate and  I got as far as the Intro section when I noticed the typography didn't change. Thanks and keep coding! I truly learned a lot so far but I'm not sure about the sass compiling thing. I need to look into that more.", "likes": 0}}, {"topLevelComment": {"author": "MRRealReapeR", "text": "is this video enough for those who has no idea about sass or bootstrap?", "likes": 0}, "replies": [{"author": "MRRealReapeR", "text": "@RISHAV KUMAR thanks ill do", "likes": 0}, {"author": "RISHAV KUMAR", "text": "Ummm, I think so. But if you have a basic idea how both of these technologies work, it would be less frustrating for you to grasp the concepts explained in this video.\n\nYou can watch 1-2 tutorials to get a basic idea about SASS and Bootstrap. I also got confused so I tried to learn more about SASS on other videos. Then I came back to this vides.\n\nHope it helps.", "likes": 0}]}, {"topLevelComment": {"author": "Natalia", "text": "Hi, thank you ! I amde with you  some website !! \n\nI am wondering if you now andy easy backend to connect with this page ?", "likes": 0}}, {"topLevelComment": {"author": "Cody Crenshaw", "text": "Great tutorial Patrick!  I really enjoyed it and learned a lot!", "likes": 3}}, {"topLevelComment": {"author": "The Hell Desk", "text": "Bootstrap sucks", "likes": 0}, "replies": [{"author": "The Hell Desk", "text": "@Le Heisenberge Too much unecessary markdown and there is a better way today. Bootstrap in 2015 yes bootstrap in 2021 no.", "likes": 1}]}, {"topLevelComment": {"author": "Colette Wilson", "text": "Just finished the tutorial and have truly learned a lot. Thank you Patrick for taking the time to do and share this with everyone, really is very appreciated, especially to a newbie like me, much respect!", "likes": 24}}, {"topLevelComment": {"author": "Louis Akambase", "text": "Pls how do I run my code on the browser", "likes": 0}}, {"topLevelComment": {"author": "Jesse Girier", "text": "Don't know when and how installing the themingkit to get the index file ?", "likes": 0}}, {"topLevelComment": {"author": "SpeedBreaker", "text": "Very helpful no bullshit pure content", "likes": 1}}, {"topLevelComment": {"author": "Coding wallah", "text": "In 2:41:00 the responsive in motog is not perfect the order of images should be change because both images are directly to each other", "likes": 0}, "replies": [{"author": "Leonardo Romero", "text": "Trying to solve this too", "likes": 0}]}, {"topLevelComment": {"author": "Colette Wilson", "text": "It's worth noting that you get an error rgb and rgba functions misinterpret CSS variables as a single value instead of their output value. A temporary workaround is to change the rgba to RGBA in uppercase this seems to fix the problem. Sass will ignore the uppercase and CSS will parse it just fine.", "likes": 1}}, {"topLevelComment": {"author": "KHAN FAYSAL", "text": "please give another video customize bootstrap with react and react-bootstrap.\nThanks.", "likes": 1}}, {"topLevelComment": {"author": "Mr. Surge", "text": "46:48 , How did you do that?", "likes": 0}}, {"topLevelComment": {"author": "Haley", "text": "The accordion section isn't working for me.  I transfer over the lines of code and disables the CSS in the browser for me. I still try to change the icons and the CSS still doesn't work. Any idea why I would be having this problem?", "likes": 0}, "replies": [{"author": "Benjamin A. Boyce", "text": "I had the same problem, then I downloaded \"theming-kit.html\" up in the description and I started all over again and it worked.", "likes": 0}]}, {"topLevelComment": {"author": "Francisco Martínez Ramos", "text": "One correction: It's COMPANIES, not CAMPANIES. You made that mistake the whole video.", "likes": 1}, "replies": [{"author": "Patrick Muriungi", "text": "Thanks. I didn't notice", "likes": 1}]}, {"topLevelComment": {"author": "James Dean", "text": "I'm having an issue with .menu in _navbar, when I add the class in HTML in place of bg-primary. The navbar turns all white. I tried adding the color variables directly into the _navbar file. I even put .menu in the style.css file along with the color variables (dropping $, adding--) in root, and then adding the primary and secondary in .menu and assigning the color values, in order to test...  and still stays white. There are no other .menu classes in the css and I looked at the other classes listed in the relevant HTML but I can't work out why it's not showing the linear-gradient. I'm guessing there is some sort of conflict and it's defaulting to white or transparent. Any hints would be appreciated.", "likes": 2}, "replies": [{"author": "Karel Čančara", "text": "OK! Had the same problem and solved it! (but I don't 100% understand how :D)\n\nSo based on another video \"Stop using @import with Sass\" I:\n1) Created 2 extra files in Components and Sections called \"_index.scss\"\n\n2) In Components it contains:\n@forward \"animations\";\r\n@forward \"buttons\";\r\n@forward \"mixins\";\r\n@forward \"typography\";\n\nand in Sections:\n@forward \"navbar\";\r\n@forward \"intro-section\";\r\n@forward \"companies\";\r\n@forward \"services\";\r\n@forward \"testimonials\";\r\n@forward \"faq\";\r\n@forward \"portfolio\";\r\n@forward \"get-started\";\r\n@forward \"footer\";\n\n3) Then in style.scss I only have:\n@use \"custom\";\r\n\r\n@use \"Components\"; //importing components \r\n@use \"Sections\"; //import sections\r\n(instead of the things he adds in  (0:35:39) Part 3: File structure )\n\nThat's it! Now the gradient works for me :)", "likes": 2}, {"author": "James Dean", "text": "Figured it out. For some reason Git Bash encountered an error and had stopped compiling. Ran compile:sass again and it works again.\nnpm ERR! code ELIFECYCLE & npm ERR! errno 255", "likes": 0}, {"author": "James Dean", "text": "@Patrick Muriungi Thanks, but didn't work. It changed color when using bg-primary. So I don't know... going back over everything from the beginning. Doesn't seem to be anything I'm missing though. Even tried using @import instead.", "likes": 0}, {"author": "Patrick Muriungi", "text": "There are various options to style the navbar.\n\n1) add !important tag on ( .menu )classes to override the navbar style.\n2) style .navbar\n\nhas to do with specificity.\n\nHope this works.", "likes": 1}, {"author": "James Dean", "text": "Actually none of the formatting works. I double checked the @use as well. It's pointing to the right file. I tried the other combinations for namespaces as well besides *; custom  and c.", "likes": 1}]}, {"topLevelComment": {"author": "S. M. Saifullah", "text": "Great content!!!\n\nOne query. In the 'Latest Work' section you have created some buttons namely 'All, Website, Design, Mock up'. I thought they are for filtering the works. Aren't they?", "likes": 4}}, {"topLevelComment": {"author": "KingCh1ll", "text": "This video taught me a LOT about sass! Thank you so much!!", "likes": 10}}, {"topLevelComment": {"author": "Nick Stoliarov", "text": "what extension he is using for comments?", "likes": 0}}, {"topLevelComment": {"author": "iDevElixir", "text": "Hey, Thanks a lot for creating the amazing course. I have a query about saas, is it possible to edit scss file from live running website? I mean how can we compile scss on live server?", "likes": 2}, "replies": [{"author": "Gerald Waweru", "text": "Edit then re-deploy", "likes": 0}]}, {"topLevelComment": {"author": "YOHA", "text": "invalid sass identifier. help", "likes": 0}}, {"topLevelComment": {"author": "Colette Wilson", "text": "Hi Patrick thanks for the tutorial! I have run into a problem around 26:45 started changing the custom.scss to the pink and purple colours but when I view the live preview, the colours have not changed. What am I doing wrong? Thanks", "likes": 4}, "replies": [{"author": "Geekyyouths", "text": "Got it working,, thanks but now the changes are not being reflected in browser like nav bar color(funny enough my first live preview did not come with blue primary it came with purple) then accordion also not working", "likes": 0}, {"author": "Geekyyouths", "text": "@Patrick Muriungi pliz help me here, when am running npm run compile:sass, bash throws an error,\" error reading scss: no such file or directory\" yet I have the files, pliz help me. Thanks", "likes": 0}, {"author": "Benjamin A. Boyce", "text": "@Patrick Muriungi got it working- thanks!!!", "likes": 1}, {"author": "Patrick Muriungi", "text": "@Benjamin A. Boyce Have you  \n1) imported _custom.scss inside style.scss?\n2). Have you compiled the style.scss?\n3). Is your script running when you make the changes?", "likes": 1}, {"author": "Patrick Muriungi", "text": "​@Benjamin A. Boyce once you clone the repo,you need to cd to the cloned folder. so on you terminal/bash/cmd just type cd Bootstrap-5-Theming-Kit. then run npm install to install the dependencies which includes bootstrap.", "likes": 1}]}, {"topLevelComment": {"author": "Calspan", "text": "So far this is great and exactly what I need.  I do have one question. at the 46Min mark, you are including the bootstrap js bundle.  Where did you download that from and is it a best practice to manually insert that into your assets folder?  I'm just curious why we wouldn't reference the bootstrap js folder in the node_modules directory like we did for the CSS files.  Any elaboration there would be very helpful.  Thank you for putting this together.", "likes": 6}, "replies": [{"author": "Remonetized。org", "text": "@Patrick Muriungi Thank you for this awesome tutorial! One question, I've probably done something stupid but the javascript (accordion button) isn't working in the theming-kit. I can reference the cdn but that seems to undo the customization. Any idea what I'm doing wrong?\nEDIT: nvm, I got it working. I must have messed up the path to the CSS.", "likes": 1}, {"author": "Patrick Muriungi", "text": "I mentioned somewhere in the video the different options you can reference the JS.\n i had to cut that part how I downloaded.\n\noption 1: link the JS from node_modules\noption 2: use cdn\noption 3: download source files", "likes": 1}]}, {"topLevelComment": {"author": "Kevin Lama", "text": "can you HELP ME!! When I use the \" @use '..custom' as *;  \" my styles are lost when I open index.html in the broswer????", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "make sure the path to custom.scss is correct.\nmaybe @use 'custom' as *;", "likes": 0}]}, {"topLevelComment": {"author": "Nick Stoliarov", "text": "guys, how did he click on some lines of code and started typing on different lines at the same time, can you please let me know how to do it, thank you 2:32:55", "likes": 0}, "replies": [{"author": "Nick Stoliarov", "text": "@Patrick Muriungi alt key doing it", "likes": 0}, {"author": "Nick Stoliarov", "text": "@Patrick Muriungi thanks!", "likes": 0}, {"author": "Patrick Muriungi", "text": "hold down ctrl key and click the parts you want", "likes": 1}]}, {"topLevelComment": {"author": "Citizen Citroen", "text": "in 0:19:27 i didn't notice how you add bootstrap js code, assume you put a direct script link in html ?", "likes": 0}}, {"topLevelComment": {"author": "Emre Denizeri", "text": "in someway custom css class such as btn-rounded doesn't work for me...", "likes": 0}}, {"topLevelComment": {"author": "frog fox", "text": "What is the shorcut to make a comment in HTML like the video at 46'45", "likes": 0}}, {"topLevelComment": {"author": "Hopscotch Rayuela", "text": "This tutorial is amazing, thank you very much. I would like to know if it is possible to follow a similar path but using a django project instead working with node.js. I'm not sure how to do something like that, but my project is in django.", "likes": 2}}, {"topLevelComment": {"author": "Claudio l", "text": "I followed all the steps but the accordions buttons are fixed", "likes": 0}, "replies": [{"author": "Claudio l", "text": "@Ja De thanks it works", "likes": 0}, {"author": "Ja De", "text": "Change the script src at the bottom of theming_kit to point to the bundle.min.js inside node_modules. Like this - \"node_modules/bootstrap/dist/js/bootstrap.bundle.min.js\". Or create a js folder inside assets and copy paste the bootstrap js files in there including bundle.min.js.", "likes": 0}]}, {"topLevelComment": {"author": "tuan anh", "text": "Hi guys, at 32:55 It seems like my collapse button not working. Can someone help me.", "likes": 0}}, {"topLevelComment": {"author": "Revv Nijaa", "text": "Getting image over flow froblem in services section", "likes": 0}}, {"topLevelComment": {"author": "Alexander Tien", "text": "Thanks you very muchhh!!! I learned a lot of things. Greate job! Best wishes for you and your family!   <3 <3 <3", "likes": 3}}, {"topLevelComment": {"author": "wizzacx", "text": "People facing difficulties in loading the bootstrap javascript in theming-kit \n\nEDIT AS FOLLOWING : \n\nUnder the script tag in Theming-kit.html Replace : \n\n<script src=\"assets/js/bootstrap.bundle.min.js\"></script>\r\n <!-- <script src=\"assets/js/popper.min.js\"></script> -->\n\nwith ::\n\n<script src=\"./node_modules/bootstrap/dist/js/bootstrap.min.js\"></script>\r\n    <script src=\"./node_modules/@popperjs/core/dist/umd/popper.min.js\"></script>\n\nOR\n\n\nMake a Dir as \"js\" inside assets folder and paste the above js files from node modules.\n\nvoila. Clean Console Happy Developer.", "likes": 0}}, {"topLevelComment": {"author": "Revv Nijaa", "text": "Font awesome dosnt work what to do 1:03:55 how font awesome.css file in asset appears \nI done manually but it doesn't work", "likes": 0}}, {"topLevelComment": {"author": "Alex Okeyo", "text": "Done", "likes": 1}}, {"topLevelComment": {"author": "Nick Stoliarov", "text": "who can help me, I am on minute 34:34, and I think I did all that he said but my bar isn't changing, is only minus circle, when I click it doesn't change to plus circle.", "likes": 0}, "replies": [{"author": "Blender Defender", "text": "@Nick Stoliarov Ok, glad I could help", "likes": 0}, {"author": "Nick Stoliarov", "text": "@Blender Defender first:)", "likes": 0}, {"author": "Blender Defender", "text": "@Nick Stoliarov Which one, the first or the second solution?", "likes": 0}, {"author": "Nick Stoliarov", "text": "@Blender Defender that what it was, I am newbie haha thank you!", "likes": 0}, {"author": "Blender Defender", "text": "Or, you might also have inserted the code for minus twice.", "likes": 0}]}, {"topLevelComment": {"author": "Datcomgaming", "text": "when I create classes it doesn't change the result in live server", "likes": 0}}, {"topLevelComment": {"author": "Rahique Osman", "text": "Vs code has a sass compiler \nso do we need to install dart sass ?\nor installing dart sass is the standard?", "likes": 2}, "replies": [{"author": "Rahique Osman", "text": "@Patrick Muriungi Thank you for the reply brother", "likes": 2}, {"author": "Patrick Muriungi", "text": "by the time i was doing this video no vs code sass compiler supported the new module system that import using the @use at rule. But you can still use sass compiler if you use the @import instead of @use.", "likes": 4}]}, {"topLevelComment": {"author": "Revv Nijaa", "text": "How to get theming kit html", "likes": 0}, "replies": [{"author": "Blender Defender", "text": "Look in the description", "likes": 0}]}, {"topLevelComment": {"author": "Miracle Ugorji", "text": "This is a great tutorial and I am using it to learn bootstrap and sass for the first time. But I have this issue where I can't get my hover effects to work like in the video. Why is this so? For the JavaScript script, I copied the cdn bundle from bootstrap page since the author did not show how he downloaded his own. Could this be the reason?", "likes": 3}}, {"topLevelComment": {"author": "vardelly Marly", "text": "Helo, it seems that you didn't cover the over effect or focus effect  on navbar link, I tried it but it doesn't work. Can you please help. My navbar has also dropdodown menu, I also wanted the dropdown bg to similar to the navbar one.", "likes": 2}}, {"topLevelComment": {"author": "Afzal Mahmud Hridoy", "text": "If possible do another one with tailwinds", "likes": 1}, "replies": [{"author": "Doza de Trezire", "text": "@Patrick Muriungi  Hello Patrick..any idea how i can use the autoprefixer? Because you used the background-clip propretry and you've put the -webkit- autoprefixer manually. Since we installed the autoprefixer, how can we make it work in our case? Thank you! You've done a great job!", "likes": 0}, {"author": "Patrick Muriungi", "text": "noted", "likes": 1}]}, {"topLevelComment": {"author": "Afzal Mahmud Hridoy", "text": "Very very helpfull. Thank you free code camp.", "likes": 2}}, {"topLevelComment": {"author": "Luiz Cipriano", "text": "how did u comment like that in the html with those '' /////////////////////////////// '' ?? is so cool", "likes": 1}, "replies": [{"author": "Richard Krone", "text": "I too would like to know this.", "likes": 0}]}, {"topLevelComment": {"author": "Rodrigo Yanez", "text": "I like the way you work, very orderly and structured, excellent, thank you very much, I have learned by watching this tutorial.", "likes": 8}}, {"topLevelComment": {"author": "Dion Maloku", "text": "How do i get the js files inside the assets file can anyone tell me?", "likes": 1}, "replies": [{"author": "EpicNicknameFail Tunchi", "text": "ANYONE?", "likes": 0}]}, {"topLevelComment": {"author": "surya aytha", "text": "How will we get - \"theming-kit.html\" at 19:37. Can anyone tell me how to get it", "likes": 2}, "replies": [{"author": "Patrick Muriungi", "text": "the file is available. check the link on the description", "likes": 0}]}, {"topLevelComment": {"author": "SoStylised", "text": "great video, thanks for the help", "likes": 1}}, {"topLevelComment": {"author": "Haaris Sultan", "text": "Why is the accordion not working for me? Its as if there is no javascript to allow it to open and close when clicked?", "likes": 0}}, {"topLevelComment": {"author": "Tanish Panjwani", "text": "Thank you very much, for your amazing work.", "likes": 2}}, {"topLevelComment": {"author": "Roberto Benedit", "text": "27 millons of thanks! Now, I understand Bootstrap and Sass percfectly! Fist time I use them!", "likes": 4}}, {"topLevelComment": {"author": "Juan Dotcom - Internet Guide", "text": "I keep getting an undefined error when I compile sass: 320 │ @include _assert-ascending($grid-breakpoints, \"$grid-breakpoints\"); the error points to the _variables.scss file. What am I doing wrong?", "likes": 0}}, {"topLevelComment": {"author": "know IT", "text": "How did the theming-kit.html appear from", "likes": 0}}, {"topLevelComment": {"author": "Rajat Sengupta", "text": "how can i make it live ??", "likes": 0}}, {"topLevelComment": {"author": "Abdel-Rahman Husam", "text": "I just finished watching the whole course! It's so amazing how the final product turned out to be!", "likes": 33}}, {"topLevelComment": {"author": "Ole King Kinga", "text": "Lot of love from Kenya bro. great help", "likes": 2}}, {"topLevelComment": {"author": "All About Games", "text": "@Vaxa Code we appreciate you brother, great to see a fellow kenyan winning in ICT", "likes": 4}}, {"topLevelComment": {"author": "Kosmogenesis", "text": "25:10\nHow did he delete all of them at once like that?", "likes": 2}, "replies": [{"author": "wizzacx", "text": "You can also do the same by\n\nSelect the code which has multiple instances  then\nWindows :: Ctrl + F2 -> ( your command )\n\nMac:: Control + F2 -> ( your command )", "likes": 2}, {"author": "Marek Firlit", "text": "ctrl + d and delete", "likes": 2}]}, {"topLevelComment": {"author": "Shashidhar Gr", "text": "Don't forget to update the proper path for \"bootstrap.bundle.min.js\" in theming-kit.html. It should be something like <script src=\"/node_modules/bootstrap/dist/js/bootstrap.bundle.min.js\"></script> after we install bootstrap 5 using npm.", "likes": 5}, "replies": [{"author": "J MO", "text": "hello dude, and if i want to upload my project to netlify, what should i do with the js file?", "likes": 0}, {"author": "Natalia Gonzalez", "text": "I don't think that path in the theming-kit.html needs to be changed if you add the compiled JS files (downloaded from Bootstrap) into the \"assets\" folder.  Just create a subfolder named \"js\" and add all those compiled JS files into it", "likes": 0}, {"author": "Richard Krone", "text": "Ah, Thank you! This was a missing bit in the video.", "likes": 0}]}, {"topLevelComment": {"author": "yohannes gezahegn", "text": "why is the theming -kit.html not appearing in my vs code", "likes": 0}}, {"topLevelComment": {"author": "Miguel Jimenez", "text": "I try to install bootstrap, but in the console appear bash: /c/Program Files/nodejs/npm: No such file or directory", "likes": 0}}, {"topLevelComment": {"author": "Kelvin Ndisi", "text": "How do add the styled comments in vs code?", "likes": 0}}, {"topLevelComment": {"author": "AbeerOfficial", "text": "1:42:29 custom and mixins don't work without importing. but why does animation work without importing ?", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "animations.scss is imported on syle.scss start from 40:52", "likes": 0}]}, {"topLevelComment": {"author": "Shahriar Bhuiyan", "text": "My button is not working what is the problem i couldn't find it out. \nI tried to put the button icon but the button icon doesn't start working properly", "likes": 0}}, {"topLevelComment": {"author": "Ajay Martin", "text": "the Accordion, nav and all toggle button are not working for me i even copied the source code from the discription still its not working", "likes": 1}}, {"topLevelComment": {"author": "John Roby", "text": "there was none reason what so ever to replace the metatag...just saying..", "likes": 1}}, {"topLevelComment": {"author": "Hamza Usma", "text": "Hello Beau, First of all I wanna thank you verry mutch for this and the others course. I have a little problem when reproducing this exercise. In the intro section when I add the glightbox component, I dont get the video in a pop-up, it is displayed below the intro-section in the same page. Please help, and thank one more time", "likes": 1}, "replies": [{"author": "Karel Čančara", "text": "Ok, I figured it out.... I found out that the link to CSS was the problem - because when I removed it, the result was still the same - it always pushed the video below.\n\nTurns out that my href in the link with the lightbox started with a forward slash like this: href=\"/assets/...\"\nI deleted the forward-slash and it works now.", "likes": 2}, {"author": "Karel Čančara", "text": "Same here... :/", "likes": 0}]}, {"topLevelComment": {"author": "Mista Winta", "text": "I can't get the carousel buttons to work. I have the JS files downloaded, and I have the script on the index.html files, but they still aren't working. The hamburger button works, so I'm confused why these buttons don't work. I tried looking at the source files for the completed project, but he just has the script that goes to bootstrap.bundle.js, just like me, but he doesn't have the glightbox scripts. So I'm wondering if there is a script missing. Any ideas?", "likes": 1}, "replies": [{"author": "Mista Winta", "text": "I found out the problem: bootstrap has different buttons depending on the carousel type. Make sure that this is your button code:\n\n<button class=\"carousel-control-prev\" type=\"button\" data-bs-target=\"#carouselExampleControls\" data-bs-slide=\"prev\">\r\n                      <span class=\"carousel-control-prev-icon\" aria-hidden=\"true\"></span>\r\n                      <span class=\"visually-hidden\">Previous</span>\r\n                    </button>\r\n                    <button class=\"carousel-control-next\" type=\"button\" data-bs-target=\"#carouselExampleControls\" data-bs-slide=\"next\">\r\n                      <span class=\"carousel-control-next-icon\" aria-hidden=\"true\"></span>\r\n                      <span class=\"visually-hidden\">Next</span>\r\n                    </button>\n\n(this is before you edit the style of the buttons at the end)", "likes": 1}]}, {"topLevelComment": {"author": "Hargunbeer Singh", "text": "lol you have a heavy accent", "likes": 0}}, {"topLevelComment": {"author": "Vineet Sakargayen", "text": "accordion buttons are not collapsing and expanding in my project.\nanything which is clickable i.e. the hamburger menu or the carousel buttons nothing is working. all other things are changing only the clickable items are not. Help ME!", "likes": 0}, "replies": [{"author": "Mista Winta", "text": "you need to download the compiled CSS and JS files from getbootstrap.com > download", "likes": 1}]}, {"topLevelComment": {"author": "Alireza Hajebrahimi", "text": "I was never able to fully understand bootstrap. TailwindCSS is much simpler, detailed, and understandable compared to bootstrap", "likes": 0}}, {"topLevelComment": {"author": "Coisa de Dev", "text": "Awesome! But i have a doubt, how i made the buttons filters?", "likes": 0}}, {"topLevelComment": {"author": "Genos the Great", "text": "I hate bootstrap but I'm learning it for school \nThanks", "likes": 0}}, {"topLevelComment": {"author": "Joshua Musau", "text": "Nice to see a fellow Kenyan making moves!", "likes": 6}}, {"topLevelComment": {"author": "AL FAJRI PUTRA PRATAMA", "text": "what is extension to autocomplete class in bootstrap v5? pls help to answer, thanks", "likes": 0}, "replies": [{"author": "Ngọc Cẩn Nguyễn", "text": "IntelliSense for CSS class names in HTML", "likes": 1}]}, {"topLevelComment": {"author": "bharath kumar", "text": "In 45:50... how to get the js bundle...", "likes": 1}}, {"topLevelComment": {"author": "Reuben Dickson", "text": "HELP PLEASE! Thanks for this wonderful tutorial. I've been following it step by step. I got lost at the \"Customize Bootstrap\" session as I couldn't find the 'theming-kit.html' file in the project. Any help please?", "likes": 2}, "replies": [{"author": "Tae", "text": "@Flávio Henrique Thank you !", "likes": 1}, {"author": "Reuben Dickson", "text": "@Flávio Henrique Alright. Thanks a lot", "likes": 2}, {"author": "Flávio Henrique", "text": "I know Reuben, It is the same for me, but don't worry with this themeing-kit. It is Just a demonstration to see changes with an example. U can make your page If you continuing watch the vídeo.", "likes": 2}, {"author": "Julieth Castro", "text": "@Flávio Henrique Thanks! It was getting complicated for me because I don't even speak the language, I didn't understand anything, thanks again!", "likes": 1}, {"author": "Flávio Henrique", "text": "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbFpPYl9GalFLdW03eHcxeFhPczhLeXFwNFZKZ3xBQ3Jtc0ttVmJoMzVWNEpEZWhXU1Zrd3dldmdXVWtoODh3ekpsV0lPRVlBamdoZjliTlNmUmUtT0ZVbmtMRk1oWjBZZkhSallfZkFkTTk4dGdfc3lCYzFxcW4zSXlVdWo4YU12MXF5R09yTkRfSDBDR0ZrRGxIcw&q=https%3A%2F%2Fgithub.com%2FMuriungiPatrick%2FBootstrap-5-Theming-Kit", "likes": 1}]}, {"topLevelComment": {"author": "Juan Cruz Gonzalez", "text": "45:50 i don't have de js folder, just css\nneed some help!!", "likes": 1}, "replies": [{"author": "EpicNicknameFail Tunchi", "text": "I am wondering the same think. Anyone got an idea? :D", "likes": 1}]}, {"topLevelComment": {"author": "Free Giver", "text": "I love this, the guy is great at teaching. How then can to this project be uploaded live on WordPress for example ? Thanks with lots of love ❤️", "likes": 1}, "replies": [{"author": "Козьмин Виктор", "text": "I think you sould \"to google\" something like \"make wordpress theme with bootstrap\"", "likes": 0}]}, {"topLevelComment": {"author": "Roberto Benedit", "text": "How do you do de comments like in the 46:48 min? (centered and with all de /)  someone knows?", "likes": 0}}, {"topLevelComment": {"author": "Michael Riccelli", "text": "I like this approach. Much simpler than trying to use a gulp or grunt set up. I also like the architecture of creating a theme-kit and using that as a reference to customize those particular bootstrap styles.", "likes": 21}, "replies": [{"author": "Dev Adn", "text": "I think I will include this technique in my workflow once I will learn adobe xd", "likes": 0}]}, {"topLevelComment": {"author": "Earl Pascual", "text": "Just want to thank Patrick for this wonderful video! made me learn that SASS truly is a powerful tool to use :)", "likes": 6}}, {"topLevelComment": {"author": "Roane Williams", "text": "Learn Bootstrap 5 and SASS...\n\nStep 1: Learn Node js", "likes": 6}, "replies": [{"author": "Richard Krone", "text": "Yes this project requires some very basic package management tools and their basic usage. I also struggled for a few hours at the start of the project getting it working and learning the very minimal basic of NPM and NODEJS. I do not think of this time as wasted as I am sure I can use it going forward. \n\nI do feel that the video author did a decent job of addressing the project's basic tool-chain setup which is a 100% better than many tutorial videos.\n\nI hope that your comment was less negative and more sarcastic and humorous. :)", "likes": 0}, {"author": "Ilham Hamdani", "text": "Actually you just need the NPM from nodejs package it's necessary to install the dependencies,", "likes": 0}, {"author": "Supreme-ERG", "text": "You don't really need to 'learn' it, it's not like a language. However you need to learn the modules, Node is just a JS framework, but you can do everything the guy in the video did without Node.js", "likes": 1}]}, {"topLevelComment": {"author": "Mohamad Mohamad", "text": "\"SAVEE LET  SEE\"", "likes": 0}}, {"topLevelComment": {"author": "heartbeathero", "text": "I was wondering how you made <!-- start the intro section --> jump to 3 lines of commented code.", "likes": 0}, "replies": [{"author": "Remonetized。org", "text": "I think that might be the 'Prettier' extension but I'm not sure.", "likes": 0}]}, {"topLevelComment": {"author": "Ian Kamande W", "text": "fellow kenyans.", "likes": 1}}, {"topLevelComment": {"author": "Captain Anunnaki", "text": "I did exactly what you did but I get the error: Can't find stylesheet to import.\n\n@use '../node_modules/@fontawesome/scss/brands/scss\n\nscss\\fontawesome.scss 1:1 root stylesheet\n\nAnyone have any Idea what might be wrong??\nThanks in advance for answering my noob question it means a lot! <3", "likes": 1}, "replies": [{"author": "Captain Anunnaki", "text": "@Patrick Muriungi Actually I just found the problem, it was that the file fontawesome.scss has to be in the root folder not in scss I must've misunderstood that. Thanks for taking the time thou!", "likes": 1}, {"author": "Captain Anunnaki", "text": "@Patrick Muriungi There is a semicolon at the end I must've not put it here.", "likes": 1}, {"author": "Patrick Muriungi", "text": "going by what you have provided you need to close that with a semicolon\n@use '../node_modules/@fontawesome/scss/brands/scss\r\n\r\nscss\\fontawesome.scss;", "likes": 0}]}, {"topLevelComment": {"author": "Agic Suad", "text": "Which extension is that for shortcuts? I tried so many times to fix this, but it's not working. My snippets are not working at all. When I hit the tab, it simply won't work. which are the ones that you are using? Patrick?", "likes": 0}, "replies": [{"author": "Agic Suad", "text": "@Patrick Muriungi ty", "likes": 0}, {"author": "Patrick Muriungi", "text": "emmet is doing all this", "likes": 0}]}, {"topLevelComment": {"author": "Manpreet kaur", "text": "dont kow why , but bootstrap mediaquery not working", "likes": 0}}, {"topLevelComment": {"author": "Hakeem Ajibolu", "text": "Great tutorial by Patrick and FCC. BTW, the accordion in the theming-kit.html isn't working, anybody know why?", "likes": 4}, "replies": [{"author": "fname lname", "text": "@Geekyyouths The links by default were 'src=\"/node_modules/'.. but on my computer (windows 10, vscode, xampp, chrome) it didn't work. Take out the initial forward slash to make it 'src=\"node_modules/' see if that works for you.", "likes": 0}, {"author": "Geekyyouths", "text": "@Rida Yousufzai do we adjust all the two scripts at the bottom? Pliz help me", "likes": 0}, {"author": "Petr Matejcek", "text": "Thank you!", "likes": 0}, {"author": "Hakeem Ajibolu", "text": "@Paul Mercer Worked for me as well! Thank you very much!", "likes": 1}, {"author": "Rida Yousufzai", "text": "@Paul Mercer Wowwwa wowwwa wowwwaa Thankkk you, I was facing the same problem. Fixed Thank God. Thank you..", "likes": 1}]}, {"topLevelComment": {"author": "Kalpesh Wani", "text": "Sir how to host in live server this prj", "likes": 0}}, {"topLevelComment": {"author": "Nischal Shrestha", "text": "Hello, do we need to install DART? or can we do it with live_sass_compiler?", "likes": 0}}, {"topLevelComment": {"author": "sebastian manco", "text": "guys, who know which extension use for snippets in bootstrap?", "likes": 0}, "replies": [{"author": "Remonetized。org", "text": "Bootstrap 5 snippets. But it seems to leave out containers which are required", "likes": 0}]}, {"topLevelComment": {"author": "Bharat Kafle", "text": "thank  you", "likes": 0}}, {"topLevelComment": {"author": "Zero Haste", "text": "justify-content-end does not seem to work for me. Can anyone help?", "likes": 0}, "replies": [{"author": "Thomas P", "text": "@Liri worked like magicccc! Thanks a lot! I've just read the docs now and it made perfect sense what me-auto did🎉", "likes": 0}, {"author": "Liri", "text": "@Thomas P I removed 'me-auto' from  <ul class=\"navbar-nav me-auto mb-2 mb-lg-0\"> and it worked for me.", "likes": 0}, {"author": "Thomas P", "text": "I too had this problem. Have you resolved the issue?", "likes": 0}]}, {"topLevelComment": {"author": "Halumination", "text": "32:59 why i cant pop down when i press the button? do you know why?", "likes": 1}}, {"topLevelComment": {"author": "Prasad Babu", "text": "I know basic html and css, can i proceed with this video?", "likes": 1}}, {"topLevelComment": {"author": "Weslei", "text": "22:52 How does he see the file with 127.0.0.1:5500 before ? I can't do it", "likes": 2}, "replies": [{"author": "Weslei", "text": "@Yogender Pal Ok the button go live was not showing because I hadn't the extension \"Live Server\". Thanks !", "likes": 1}, {"author": "Yogender Pal", "text": "go to theming-kit.html file -> right-click while remaining in the file ->go live", "likes": 1}]}, {"topLevelComment": {"author": "Cesar Sanchez Sanchez", "text": "Excellent and beautiful project, but you did not teach us how to filter the portfolio section.", "likes": 2}, "replies": [{"author": "Richard Krone", "text": "I was wondering if I missed this in the video. I would love to see an addendum video for this feature.", "likes": 1}]}, {"topLevelComment": {"author": "Orrin Ahola", "text": "What is the shortcut he is using to make the banner comment sections a la <!---/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/-/ ???  I know about ctrl-k ctrl-c for regular commenting.", "likes": 0}}, {"topLevelComment": {"author": "Simisoluwa Dada", "text": "I did everything but when I used custom in my 'style.scss' file nothing changed in my style.css file. What do I do?", "likes": 0}, "replies": [{"author": "pant13", "text": "@Patrick Muriungi @import \"../node_modules/bootstrap/scss/bootstrap.scss\" this doesn't work for me. My node_modules has no bootstrap file inside of it", "likes": 1}, {"author": "Simisoluwa Dada", "text": "​@Patrick Muriungi Yes I did just that. I typed \"@use 'custom';\" in the style.scss file and opened the style.css to the side. It's still the same. What could be the problem?", "likes": 0}, {"author": "Patrick Muriungi", "text": "@Simisoluwa Dada you need to import the _custom module to style.scss ( @use 'custom' as *) remember bootstrap.scss is inside _custom.scss", "likes": 0}, {"author": "Simisoluwa Dada", "text": "@Patrick Muriungi Like I said, I did exactly what you did but when I opened style.css to the side, nothing changed. Where did everything come from? How did the content of the style sheet just appear?", "likes": 0}, {"author": "Patrick Muriungi", "text": "@Simisoluwa Dada start from 21:49 on how I created it", "likes": 0}]}, {"topLevelComment": {"author": "Akshay Joshi", "text": "PLEASE HELP.\n\nAt 19 mins, when he started to customize botstrap files, where did that theming-kit.html file come from?", "likes": 12}, "replies": [{"author": "Akshay Joshi", "text": "@DanceClips Thank you mate.", "likes": 1}, {"author": "DanceClips", "text": "here is a link to the code\nhttps://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbFpPYl9GalFLdW03eHcxeFhPczhLeXFwNFZKZ3xBQ3Jtc0ttVmJoMzVWNEpEZWhXU1Zrd3dldmdXVWtoODh3ekpsV0lPRVlBamdoZjliTlNmUmUtT0ZVbmtMRk1oWjBZZkhSallfZkFkTTk4dGdfc3lCYzFxcW4zSXlVdWo4YU12MXF5R09yTkRfSDBDR0ZrRGxIcw&q=https%3A%2F%2Fgithub.com%2FMuriungiPatrick%2FBootstrap-5-Theming-Kit", "likes": 0}, {"author": "DanceClips", "text": "here is a link to the code\nhttps://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbFpPYl9GalFLdW03eHcxeFhPczhLeXFwNFZKZ3xBQ3Jtc0ttVmJoMzVWNEpEZWhXU1Zrd3dldmdXVWtoODh3ekpsV0lPRVlBamdoZjliTlNmUmUtT0ZVbmtMRk1oWjBZZkhSallfZkFkTTk4dGdfc3lCYzFxcW4zSXlVdWo4YU12MXF5R09yTkRfSDBDR0ZrRGxIcw&q=https%3A%2F%2Fgithub.com%2FMuriungiPatrick%2FBootstrap-5-Theming-Kit", "likes": 3}]}, {"topLevelComment": {"author": "Derek", "text": "Love the video, but it doesn't show how to create the theming-kit.html file.", "likes": 0}}, {"topLevelComment": {"author": "Xafie Islam", "text": "I Need Logo and Images...", "likes": 0}}, {"topLevelComment": {"author": "Manpreet kaur", "text": "who is facing problem in intro section like me That display-2--intro , its alignment is in right;,,...why so/Anybody", "likes": 0}}, {"topLevelComment": {"author": "Ayo Codes", "text": "i thought we was going to make the portfolio category buttons work?", "likes": 3}, "replies": [{"author": "Antonio Soto", "text": "yes, what happened with the buttons? :(", "likes": 1}]}, {"topLevelComment": {"author": "Damir Lumanovic", "text": "Great course, but you are not finished with portfolio section. ;)", "likes": 4}, "replies": [{"author": "Nattihi", "text": "​@Ayo Codes No one button is handled the same. Get in touch button is solved by wrapping the button i a tag like <a href=\"#dest\"><button>ect.....</>\r\nLearn more the same except link to another html page that describe the project. What I would do.", "likes": 0}, {"author": "Ayo Codes", "text": "the buttons don't work? Did you figure out how?", "likes": 0}]}, {"topLevelComment": {"author": "Smash The Squad", "text": "How can i get that html file", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "check the link on the description", "likes": 0}]}, {"topLevelComment": {"author": "Paul Walker", "text": "Fantastic project so far! I noticed in the portfolio section you never covered how to organize and show content via the buttons like in your small preview at the start of the section? I'd be really interested in knowing how to do this. Thanks.", "likes": 11}, "replies": [{"author": "Paul Walker", "text": "@Ayo Codes I'm afraid not. I went through the entire project and it's never covered sadly.", "likes": 3}, {"author": "Ayo Codes", "text": "the buttons don't work? Did you figure out how?", "likes": 2}]}, {"topLevelComment": {"author": "Tarik Najab", "text": "I get an npm warnthat I'm gonna share with you here: npm WARN bootstrap@5.0.1 requires a peer of @popperjs/core@^2.9.2 but none is installed. You must install peer dependencies yourself.\r\nnpm WARN postcss-cli@8.3.1 requires a peer of postcss@^8.0.0 but none is installed. You must install peer dependencies yourself.\r\nnpm WARN autoprefixer@10.2.6 requires a peer of postcss@^8.1.0 but none is installed. You must install peer dependencies yourself.\r\nnpm WARN postcss-reporter@7.0.2 requires a peer of postcss@^8.1.0 but none is installed. You must install peer dependencies yourself.\r\nnpm WARN bootstrap-v5@1.0.0 No repository field.\r\nnpm WARN optional SKIPPING OPTIONAL DEPENDENCY: fsevents@2.3.2 (node_modules\\fsevents):\r\nnpm WARN notsup SKIPPING OPTIONAL DEPENDENCY: Unsupported platform for fsevents@2.3.2: wanted {\"os\":\"darwin\",\"arch\":\"any\"} (current: {\"os\":\"win32\",\"arch\":\"x64\"})", "likes": 0}}, {"topLevelComment": {"author": "Simon Lawrence", "text": "My nav menu doesn't show when I click the toggler", "likes": 0}, "replies": [{"author": "Simon Lawrence", "text": "@Patrick Muriungi thanks, it was that.  I had the link \"<script src=\"/assets/vendors/js/glightbox.min.js\"></script>\", it didn't work but when I changed it to this <script src=\"assets/vendors/js/glightbox.min.js\"></script> with the \"/\" at the front it worked\n\nI'm wondering when the first linked path worked for the guy in the video but not for me.  We basic have the same directory structure.", "likes": 1}, {"author": "Patrick Muriungi", "text": "Double check whether you Have linked with the Bootstrap 5 JS?", "likes": 0}]}, {"topLevelComment": {"author": "watsap+±①④④③⑧⑨②③③④⑦", "text": "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.", "likes": 2}}, {"topLevelComment": {"author": "Jitx", "text": "Thank you ❤️", "likes": 1}}, {"topLevelComment": {"author": "Emijere Blessing", "text": "Where can I download the companies logo from?? Please", "likes": 0}}, {"topLevelComment": {"author": "Tahsin Al Mahi", "text": "which vscode theme is used in this video?", "likes": 0}, "replies": [{"author": "Tahsin Al Mahi", "text": "@Patrick Muriungi\nThanks a lot!", "likes": 0}]}, {"topLevelComment": {"author": "Lucas Tan Hong Dan", "text": "Hi Patrick, \n\nI encountered a problem. I followed your video closely and now my navbar isn't applying the linear gradient via the .menu class in _navbar.scss. I have checked the style.scss and applied @use '../custom' as *; but it still doesn't work", "likes": 0}, "replies": [{"author": "Karel Čančara", "text": "OK! Had the same problem and solved it! (but I don't 100% understand how :D)\r\n\r\nSo based on another video \"Stop using @import with Sass\" I:\r\n1) Created 2 extra files in Components and Sections called \"_index.scss\"\r\n\r\n2) In Components it contains:\r\n@forward \"animations\";\r\n@forward \"buttons\";\r\n@forward \"mixins\";\r\n@forward \"typography\";\r\nand in Sections:\r\n@forward \"navbar\";\r\n@forward \"intro-section\";\r\n@forward \"companies\";\r\n@forward \"services\";\r\n@forward \"testimonials\";\r\n@forward \"faq\";\r\n@forward \"portfolio\";\r\n@forward \"get-started\";\r\n@forward \"footer\";\r\n\r\n3) Then in style.scss I only have:\r\n@use \"custom\";\r\n\r\n@use \"Components\"; //importing components \r\n@use \"Sections\"; //import sections\r\n(instead of the things he adds in  (0:35:39) Part 3: File structure )\r\n\r\nThat's it! Now the gradient works for me :)", "likes": 0}, {"author": "Natalia Gonzalez", "text": "@Lucas Tan Hong Dan I have this issue, too and I think it's because I am using Visual Studio Code", "likes": 0}, {"author": "heartbeathero", "text": "I also ran into this problem. Running \"npm run compile:sass\" in the Git Bash let me see what needed to be debugged. I had restarted my pc an forgot to run the sass compliler again.", "likes": 0}, {"author": "Lucas Tan Hong Dan", "text": "@Patrick Muriungi I know, but i can't seem to find the issue why i was unable to use @use", "likes": 0}, {"author": "Lucas Tan Hong Dan", "text": "@Patrick Muriungi Based on your video, you did not do anything about the mixin yet at the time of the linear gradient", "likes": 0}]}, {"topLevelComment": {"author": "Rahul M", "text": "I can't find where to dowmload the theming kit any help?", "likes": 0}, "replies": [{"author": "Rahul M", "text": "@Patrick Muriungi thank you!", "likes": 1}, {"author": "Patrick Muriungi", "text": "Download it here on my GitHub Repo\nhttps://github.com/MuriungiPatrick/Bootstrap-5-Theming-Kit", "likes": 0}]}, {"topLevelComment": {"author": "Niladri Ash", "text": "can you please tell me how to add this type of comment shown in the project in vscode\nI normally add comments by ctrl+/", "likes": 0}}, {"topLevelComment": {"author": "Yogender Pal", "text": "Please, which port on localhost can we know the <theming-kit.html> is running?", "likes": 1}, "replies": [{"author": "Patrick Muriungi", "text": "@Yogender Pal actually the purpose is to see real time changes, as you do the changes instead of refreshing your page.  otherwise it can work even without a server.", "likes": 0}, {"author": "Yogender Pal", "text": "ok I need to manually 'go live' after right-clicking, while in  theming-kit.html file, didn't know HTML files don't actually use server files like in Django/Flask", "likes": 0}]}, {"topLevelComment": {"author": "Kent Hefley", "text": "How would a bundler like Parcel integrate into this? Could you just use Parcel instead of the compile sass script?", "likes": 0}}, {"topLevelComment": {"author": "Rodrigo Marsan", "text": "Well, I finally understood why my accordion didnt work, simply because I didnt have the JS folder and the files inside. Please EXPLAIN where that folder comes from and where to get those files from, thanks", "likes": 4}, "replies": [{"author": "Richard Krone", "text": "Yes, this is the one aspect of the video that I too felt a but confused on. The file prep-work was not as organized as I hoped but reviewing the video and comments eventually got me there. Still a wonderful video and I did manage to have a lot of takeaways from it.", "likes": 1}, {"author": "bharath kumar", "text": "hi, i to have the same doubt.. did u figure out..", "likes": 1}]}, {"topLevelComment": {"author": "Rodrigo Marsan", "text": "I dont know why my accordion doesnt work on the theming-kit file, it just doesnt open or close", "likes": 2}, "replies": [{"author": "Seeking Truth", "text": "Add the links for local source files to the theming kit html correctly and it will work.", "likes": 0}, {"author": "Elsa de Alfonso", "text": "@Rodrigo Marsan Yes, if I change the src to the one installed with bootstrap it doesn't work either !!", "likes": 0}, {"author": "Rodrigo Marsan", "text": "@David Rodríguez Hernández David, see my other comment below, I could fix it. It is just that you need to include the JS part of Bootstrap that in the repo is in the JS folder", "likes": 1}, {"author": "Patrick Muriungi", "text": "@David Rodríguez Hernández I have updated the repo on GitHub will work fine now", "likes": 0}, {"author": "David Rodríguez Hernández", "text": "I have the same problem", "likes": 0}]}, {"topLevelComment": {"author": "NoBody", "text": "why you have used tabulericon in the end(in footer : phone address and mail) instead of font awesome", "likes": 0}}, {"topLevelComment": {"author": "李晓明", "text": "HTML is a programming language.", "likes": 0}, "replies": [{"author": "Mista Winta", "text": "no, it's not; it's a markup language", "likes": 1}]}, {"topLevelComment": {"author": "Muhammad Imran", "text": "I face one problem when I applied the changes _navbar.scss there are no changes applied index.html and I have given reference style.css, how it would get from _navbar.scss", "likes": 0}, "replies": [{"author": "Asma", "text": "@Muhammad Imran thanks you free much pro 🤝 ,", "likes": 1}, {"author": "Muhammad Imran", "text": "@Asma you can run through the command line.", "likes": 0}, {"author": "Asma", "text": "@Muhammad Imran how run sass , i work on vsc ?", "likes": 0}, {"author": "Muhammad Imran", "text": "@Asma run the compiler of sass.", "likes": 0}, {"author": "Asma", "text": "@Muhammad Imran hi , i have seem problem  How solved ?", "likes": 1}]}, {"topLevelComment": {"author": "Ruchi Gupta", "text": "Please add a course on css animations  zero to hero and in that video please tell how to do very advanced css animations Please🥺🥺", "likes": 2}, "replies": [{"author": "James Fotografia", "text": "Better to follow dev ed", "likes": 0}, {"author": "Ruchi Gupta", "text": "By the way your courses are great.", "likes": 2}]}, {"topLevelComment": {"author": "Akshat Samdani", "text": "How to install theming kit?", "likes": 0}}, {"topLevelComment": {"author": "Ricardo Jorge Costa Loureiro", "text": "Why don't the accordion and the carousel don't work... neither of them, I've saw this twice and can't work it around.. Can anyone help... <b>BTH Great Video</b>", "likes": 1}, "replies": [{"author": "Mista Winta", "text": "@Ricardo Jorge Costa Loureiro did you download the JS script from bootstrap? and then add the script at the bottom of the index.html page?", "likes": 0}, {"author": "Ricardo Jorge Costa Loureiro", "text": "@Vaxa Code I did follow the example perfectly. I've runned it twice, only these two things are giving me troubles. What you mean with link the correct JS?", "likes": 0}, {"author": "Vaxa Code", "text": "Make sure you're linking with the correct JS for bootstrap 5\r\ndownload here manually on the link below or import from node modules folder\r\nhttps://getbootstrap.com/docs/5.0/getting-started/download/", "likes": 0}]}, {"topLevelComment": {"author": "bigcheese2001", "text": "In section 2 I'm a little confused by the theming kit and how to get the assets\\js\\bootstrap.min.js and popper.min.js files into the project, does anyone know how that should work, or do I just grab the files from somewhere manually?", "likes": 3}, "replies": [{"author": "bigcheese2001", "text": "@Vaxa Code cheers, I did try that but will give it another go.  The css and html is fine, just the js files.  I can get it running manually of course but didn’t know if npm etc would just do it automatically 👍", "likes": 2}, {"author": "Vaxa Code", "text": "download the theming-kit on my GitHub Repo. step by step instruction are there\nhttps://github.com/MuriungiPatrick/Bootstrap-5-Theming-Kit", "likes": 1}]}, {"topLevelComment": {"author": "Sayed Akhter", "text": "This video is the first in my life time of watching YouTube dev tutorial that I saw a instructor use Opera browser.", "likes": 2}, "replies": [{"author": "Richard Krone", "text": "Variety the spice of life. :)", "likes": 0}]}, {"topLevelComment": {"author": "RedVelocity", "text": "Why so laggy?", "likes": 0}}, {"topLevelComment": {"author": "শিখতে চাই", "text": "Sir will add your video subtitle. If you have subtitle option, it will be better to understand our video.  Please add subtitles", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "added", "likes": 1}]}, {"topLevelComment": {"author": "CodingWithSam", "text": "I think he was dead?", "likes": 0}}, {"topLevelComment": {"author": "GamingSquadRider", "text": "Why isn't the dropdown either the accordion working? Can anyone help?", "likes": 0}, "replies": [{"author": "Vaxa Code", "text": "Make sure you're linking with the correct JS for bootstrap 5\ndownload here manually on the link below or import from node modules folder\nhttps://getbootstrap.com/docs/5.0/getting-started/download/", "likes": 0}]}, {"topLevelComment": {"author": "Tarasele Gesiere", "text": "God I really needed this.", "likes": 2}}, {"topLevelComment": {"author": "mykalimba", "text": "Since version 5 (c. 2017), the \"npm install ...\" command has automatically added the \"--save\" option, so you do not need to add that on the command line.", "likes": 30}, "replies": [{"author": "Arun Kumar A.J", "text": "i didnt knew that.!!!! nicee", "likes": 3}]}, {"topLevelComment": {"author": "zzpaco", "text": "Amazing peace of work and even greater will to sharing knowledge!\nNow I have an honest question from a novice perspective : Why sould I pick Html/css/js vs WordPress which requires less training before you can produce something quite acceptable ?\nThanks for your feedback.", "likes": 1}, "replies": [{"author": "zzpaco", "text": "Thanks for quick reply! My boss wants to go WordPress because they already have an old site to be rebuilt (simple Portfolio Website).\nI'll follow your video when off work for my personal interest and skills improvement. Anyway CSS is almost mandatory for a fine tuning.\nThanks also for timings and shared resources ! Blue thumb up and Subscription", "likes": 1}, {"author": "Vaxa Code", "text": "Interesting!. WordPress themes are also created and integrated from html/CSS/JS.\nsuppose you need to create a custom WordPress theme? you need to create the html/css/js layout first.", "likes": 2}]}, {"topLevelComment": {"author": "Youtube BB", "text": "npm run compile:sass at 15:25 does nothing. Shows >projectName@version compile:sass /folder and > sass scss:assets/css but the folders and files don't get created.", "likes": 1}, "replies": [{"author": "Vaxa Code", "text": "check how you do your spacing on the script. and run the script again", "likes": 2}]}, {"topLevelComment": {"author": "KUMAR HARSH", "text": "Yo i think i will make this into my personal portfolio, it looks awesome", "likes": 2}}, {"topLevelComment": {"author": "Sandeep", "text": "I literally got a domain for my personal website and this pops on Quincy Larsson's email listing. Some sorta magic not even kidding lol", "likes": 10}, "replies": [{"author": "Hamza Danish", "text": "how to get a domain?", "likes": 0}]}, {"topLevelComment": {"author": "Sameer Adde ✪", "text": "Thank you so much,\nFrom Somalia.", "likes": 3}}, {"topLevelComment": {"author": "Vishnuvasan Srinivasan", "text": "What is the minimum system requirement to implement this project?", "likes": 0}, "replies": [{"author": "FKN XIV", "text": "This should work even on the Raspberry Pi 3", "likes": 0}]}, {"topLevelComment": {"author": "Edward Kushnir", "text": "Will there be subtitles?", "likes": 0}}, {"topLevelComment": {"author": "Time Stamp+er", "text": "The people who Dislike this video are not from web development, I guess.", "likes": 0}}, {"topLevelComment": {"author": "Dhananjoy Dey", "text": "17:35 showing this.... what can I do?\n\n bootstrap-v5@1.0.0 compile:sass C:\\Users\\Dhananjoy\\Desktop\\bootstrap-v5\r\n> sass --watch scss : assets/css\r\n\r\nPositional and \":\" arguments may not both be used.\r\n\r\nUsage: sass <input.scss> [output.css]\r\n       sass <input.scss>:<output.css> <input/>:<output/> <dir/>\r\n\r\n=== Input and Output ===================\r\n    --[no-]stdin               Read the stylesheet from stdin.\r\n    --[no-]indented            Use the indented syntax for input from stdin.\r\n-I, --load-path=<PATH>         A path to use when resolving imports.\r\n                               May be passed multiple times.\r\n-s, --style=<NAME>             Output style.\r\n                               [expanded (default), compressed]\r\n    --[no-]charset             Emit a @charset or BOM for CSS with non-ASCII characters.\r\n                               (defaults to on)\r\n    --[no-]error-css           When an error occurs, emit a stylesheet describing it.\r\n                               Defaults to true when compiling to a file.\r\n    --update                   Only compile out-of-date stylesheets.\r\n\r\n=== Source Maps ========================\r\n    --[no-]source-map          Whether to generate source maps.\r\n                               (defaults to on)\r\n    --source-map-urls          How to link from source maps to source files.\r\n                               [relative (default), absolute]\r\n    --[no-]embed-sources       Embed source file contents in source maps.\r\n    --[no-]embed-source-map    Embed source map contents in CSS.\r\n\r\n=== Other ==============================\r\n-w, --watch                    Watch stylesheets and recompile when they change.\r\n    --[no-]poll                Manually check for changes rather than using a native watcher.\r\n                               Only valid with --watch.\r\n    --[no-]stop-on-error       Don't compile more files once an error is encountered.\r\n-i, --interactive              Run an interactive SassScript shell.\r\n-c, --[no-]color               Whether to use terminal colors for messages.\r\n    --[no-]unicode             Whether to use Unicode characters for messages.\r\n-q, --[no-]quiet               Don't print warnings.\r\n    --[no-]quiet-deps          Don't print compiler warnings from dependencies.\r\n                               Stylesheets imported through load paths count as dependencies.\r\n    --[no-]verbose             Print all deprecation warnings even when they're repetitive.\r\n    --[no-]trace               Print full Dart stack traces for exceptions.\r\n-h, --help                     Print this usage information.\r\n    --version                  Print the version of Dart Sass.\r\nnpm ERR! code ELIFECYCLE\r\nnpm ERR! errno 64\r\nnpm ERR! bootstrap-v5@1.0.0 compile:sass: `sass --watch scss : assets/css`\r\nnpm ERR! Exit status 64\r\nnpm ERR!\r\nnpm ERR! Failed at the bootstrap-v5@1.0.0 compile:sass script.\r\nnpm ERR! This is probably not a problem with npm. There is likely additional logging output above.\r\n\r\nnpm ERR! A complete log of this run can be found in:\r\nnpm ERR!     C:\\Users\\Dhananjoy\\AppData\\Roaming\\npm-cache\\_logs\\2021-06-11T04_37_11_520Z-debug.log", "likes": 0}, "replies": [{"author": "Dhananjoy Dey", "text": "@Patrick Muriungi yes, It worked", "likes": 1}, {"author": "Patrick Muriungi", "text": "Going by what you have provided there is a space you have between input and output (> sass --watch scss : assets/css) no spaces between input and output it should be scss:assets/css\n\nhope this helps", "likes": 1}]}, {"topLevelComment": {"author": "Anh", "text": "You should use @use & map for custom bootstrap variables instead of @import\nThis is new concept of SASS and be recommend when use with UI library\n@import will be deleted from SASS soon", "likes": 5}, "replies": [{"author": "fname lname", "text": "@Advaiya Lad I did \n\n@use '../node_modules/bootstrap/scss/bootstrap' with (\n    $h1-font-size: 1.6rem,\n    $h2-font-size: 1.25rem\n);\n\nPut all your custom variables in the brackets", "likes": 0}, {"author": "Anh", "text": "​@Richard Krone \nhttps://sass-lang.com/documentation/at-rules/import\nin sass home page they say \n\"The Sass team discourages the continued use of the @import rule. Sass will gradually phase it out over the next few years, and eventually remove it from the language entirely\"", "likes": 2}, {"author": "Richard Krone", "text": "Thank you for this tidbit. I will do some research on it but do you have a prefered direct whitepaper link to this upcoming depreciated feature?", "likes": 1}, {"author": "mad mal", "text": "@Anh could you share more to look for this or a github project that you have done", "likes": 0}, {"author": "Anh", "text": "​@Advaiya Lad  \nFirst , create a file and import only things you need, not entire library \nLet's say vendor/bootstrap.scss\n```\n// Configuration\n@import \"boostrap/scss/functions\";\n@import \"boostrap/scss/variables\";\n@import \"boostrap/scss/mixins\";\n@import \"boostrap/scss/utilities\";\n\n// Layout & components\n@import \"boostrap/scss/navbar\";\n...\n```\n\nThen your main scss file should be something like this \n\n```\n@use \"vendor/bootstrap\" as bs5 with (\n   $grays: (...),\n   $grid-breakpoints: ( pc: ..., sp: ..., tablet: .. ),\n   $theme-colors: ( primary: ..., accept: ... , refuse: ...)\n);\n\n// When you want to use bs media-query\n@include bs5.media-breakpoint-up(pc) {\n   .navbar { ... }\n }\n```\nWith this you can custom not only value but even class name\nit will automatically create customized utilities class, mixin for you too, like col-pc, col-sp, or btn-accept ..\nAnd all other thing you don't need will be removed , like col-xs col-sm...\nI think this is the right way to use bootstrap or other library with customize", "likes": 1}]}, {"topLevelComment": {"author": "Apprendre Librement la Programmation", "text": "very interessant! thank so much", "likes": 0}}, {"topLevelComment": {"author": "ItsDerrick", "text": "Definately Kenyan.........More love from kenya", "likes": 3}}, {"topLevelComment": {"author": "Durell Mwakulo", "text": "Lot's of love from Kenya", "likes": 14}}, {"topLevelComment": {"author": "John James Burke", "text": "Is the theming Kit a seperate download or does auto create?", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "Yes it is a separate download. you can download it on my GitHub repo https://github.com/MuriungiPatrick/Bootstrap-5-Theming-Kit", "likes": 0}, {"author": "John James Burke", "text": "Nevermind. It's in the description.", "likes": 0}]}, {"topLevelComment": {"author": "praveen gopu", "text": "most awaited course", "likes": 0}}, {"topLevelComment": {"author": "shaun san miguel", "text": "This is what I'm talking about. There's not much any video there with sass and bootstrap 5 combine. Thanks for this", "likes": 14}}, {"topLevelComment": {"author": "Jeromy Classyca", "text": "Okay, now this is what i was searching for", "likes": 3}}, {"topLevelComment": {"author": "Aimal Sultani", "text": "what about Security Section.", "likes": 0}, "replies": [{"author": "Trey's Trades", "text": "THANKS FOR YOUR FEEDBACK \nT•E•X•T M•E\n>+]1=9=2=5=3=9=2=1=0=6=6", "likes": 0}]}, {"topLevelComment": {"author": "equat10n", "text": "The accordion collapses are not working, any help?", "likes": 0}, "replies": [{"author": "Patrick Muriungi", "text": "@bigcheese2001 the script should create the folder and put the compiled CSS in that folder, only if you create the script properly", "likes": 0}, {"author": "bigcheese2001", "text": "@Jeckson Alves I was kind of expecting the npm system to bring that file in, is that not right then but you have to do it manually??", "likes": 0}, {"author": "Jeckson Alves", "text": "@Patrick Muriungi I ran into the same problem and I was looking in the comments to see if I was the only with this problem.\r\nThe bootstrap.min.js was missing. Thanks!", "likes": 0}, {"author": "equat10n", "text": "@Patrick Muriungi Thank you it worked! seems silly mistake to me :')", "likes": 0}, {"author": "Patrick Muriungi", "text": "make sure you're using bootstrap 5 js", "likes": 0}]}, {"topLevelComment": {"author": "Aditya Ojha", "text": "Great channel!!", "likes": 2}}, {"topLevelComment": {"author": "Prasanth P", "text": "Not easy to follow at all", "likes": 1}}, {"topLevelComment": {"author": "Ian Rogers", "text": "Why don't you just use the sass plug-in available directly in VS Code? It's so much easier.", "likes": 2}, "replies": [{"author": "Vaxa Code", "text": "There is No VS Code Extension that supports Dart-sass by the time I was doing this course. plus I did this for others who don't use VS Code", "likes": 1}]}, {"topLevelComment": {"author": "The Wifi", "text": "He sounds like a Kenyan \nNice tutorial", "likes": 7}}, {"topLevelComment": {"author": "Pranay Singh Parihar", "text": "What if I want that \"Start your project\" form to work as well ?", "likes": 1}, "replies": [{"author": "Lachlan H", "text": "im not an expert but ive been tinkering around with sockets in python and that might be helpful? but java might integrate to a website better", "likes": 1}]}, {"topLevelComment": {"author": "Michel Ribbens", "text": "Very nice. And hope to see a similar video for Bootstrap 5 + Sass with React. Would be great to see how to create a boiler plate with this setup for React", "likes": 6}}, {"topLevelComment": {"author": "Wayne Kudoi", "text": "Bootstrap Day: Traversy Media and now FCC by my country mate 🇰🇪Patrick 👌👍🏽", "likes": 10}}, {"topLevelComment": {"author": "Jorge Garriga", "text": "I couldn't find the logo in the completed project Github repository. Where else can you find it at?", "likes": 2}, "replies": [{"author": "M Azhar A", "text": "@Craig Allan Nice.. I found it. Thanks bro", "likes": 0}, {"author": "Craig Allan", "text": "You can find it on Patrick's channel, Vaxa Code, in the comments. https://www.youtube.com/watch?v=NS_DvcSH954&t=0s", "likes": 0}, {"author": "M Azhar A", "text": "yeahh me too", "likes": 0}]}, {"topLevelComment": {"author": "Radu Cosmin Pugna", "text": "🤩 Awesome 🤩 Thank you for this 🙏", "likes": 4}}, {"topLevelComment": {"author": "gathara brian", "text": "🇰🇪🇰🇪🇰🇪 nashukuru", "likes": 2}}, {"topLevelComment": {"author": "WertiaAudit", "text": "😁👍", "likes": 0}}, {"topLevelComment": {"author": "Jwalant Bhatt", "text": "In part 2-2, where did the theming-kit.html file come from? It wasn't present in the chapter before that and suddenly appeared at the start of the next chapter.\n\nEdit: Got it. It's linked in the description. He also mentions it in the video after a while.", "likes": 11}, "replies": [{"author": "Geekyyouths", "text": "@Jwalant Bhatt have figured out the nav bar color and accordion mine are not working.thanks", "likes": 0}, {"author": "wizzacx", "text": "@bigcheese2001 Check This :\nPeople facing difficulties in loading the bootstrap javascript in theming-kit \n\n\r\n\r\nEDIT AS FOLLOWING : \n\n\r\n\r\nUnder the script tag in Theming-kit.html Replace : \n\n\r\n\r\n<script src=\"assets/js/bootstrap.bundle.min.js\"></script>\r\n <!-- <script src=\"assets/js/popper.min.js\"></script> -->\n\n\r\n\r\nwith ::\r\n\r\n<script src=\"./node_modules/bootstrap/dist/js/bootstrap.min.js\"></script>\n\r\n    <script src=\"./node_modules/@popperjs/core/dist/umd/popper.min.js\"></script>\n\n\r\n\r\nOR\n\n\n\r\n\r\n\r\nMake a Dir as \"js\" inside assets folder and paste the above js files from node modules.\r\n\r\nvoila. Clean Console Happy Developer.", "likes": 0}, {"author": "Patrick Muriungi", "text": "@bigcheese2001 download the theming-kit on my GitHub Repo. step by step instruction are there\r\nhttps://github.com/MuriungiPatrick/Bootstrap-5-Theming-Kit", "likes": 2}, {"author": "Jwalant Bhatt", "text": "@Ademola Kadiri Cheers mate", "likes": 0}, {"author": "Ademola Kadiri", "text": "@Jwalant Bhatt Thank you Jwalant. Figured it out eventually.", "likes": 1}]}, {"topLevelComment": {"author": "Balaji Ravi", "text": "Very nice I covered only header section but it's worth I learned lot of things 🙏🙏🙏🙏🙏🙏", "likes": 4}}, {"topLevelComment": {"author": "Elvis Warutumo", "text": "Appreciating content from my country people🇰🇪", "likes": 42}, "replies": [{"author": "Wafula Lukorito", "text": "Wakenya tumewakilisha kila place naona!", "likes": 0}, {"author": "Alex Ng'ang'a", "text": "Kenya. congrats to Patrick", "likes": 1}, {"author": "Alex Okeyo", "text": "@John Ochuro https://twitter.com/ItsMeAlekih", "likes": 0}, {"author": "John Ochuro", "text": "Hey majamaa , we should connect! 🇰🇪 my twitter is @itskrox", "likes": 2}, {"author": "Caleb Mbugua", "text": "Asante", "likes": 3}]}, {"topLevelComment": {"author": "Aviral", "text": "For those of you who are wondering that which font is he using in vscode, it is Poppins.", "likes": 19}, "replies": [{"author": "Kirti Rattan", "text": "@Geekyyouths just install the sass extension in vs code, from the extension tab.", "likes": 0}, {"author": "Geekyyouths", "text": "@Aviral both nav bar color and accordion changes are not being reflected in browser", "likes": 0}, {"author": "Geekyyouths", "text": "@Kirti Rattan how did you use the extension coz when I use it the style.css and source map go to scss folder not the assets/ CSS folder. can u help me pliz how to setup that using extension.thanks", "likes": 0}, {"author": "Aviral", "text": "@Kirti Rattan your welcome :))", "likes": 0}, {"author": "Kirti Rattan", "text": "@Aviral Hey I tried it with vs code extension, so I redid the whole project with vs code extension and it worked. Big thanks to you for helping me out. (✷‿✷)", "likes": 0}]}, {"topLevelComment": {"author": "Daniel Gohoho", "text": "FreecodeCamp, Brad Traversy and GeekProbin all released a bootstrap course at the same time. I guess today’s bootstrap day 😁", "likes": 1}}, {"topLevelComment": {"author": "Sharoz Ijaz", "text": "anyone else facing problem, with accordion, mine not showing??", "likes": 1}, "replies": [{"author": "Sharoz Ijaz", "text": "@Princy Lora Let me see", "likes": 1}, {"author": "Princy Lora", "text": "I just figured out...I had added accordion  after import Css. Now placed before import. Working now for me .", "likes": 1}, {"author": "Sharoz Ijaz", "text": "@Princy Lora Nope, i try changing the icon but didn't help either1", "likes": 0}, {"author": "Princy Lora", "text": "i'm facing same issue. Were you able to resolve?", "likes": 1}]}, {"topLevelComment": {"author": "walker ofn", "text": "now i will delete downloaded udemy courses from pyratepay", "likes": 1}}, {"topLevelComment": {"author": "walker ofn", "text": "i love you guys", "likes": 2}}, {"topLevelComment": {"author": "Nikusha", "text": "Hello guys , beginner here. I have a knowledge of HTML and also basic CSS and is these enough to watch this video and follow along? Thanks in advance !", "likes": 1}, "replies": [{"author": "Seeking Truth", "text": "Watch Dev Ed channel for SASS and then watch this video", "likes": 1}, {"author": "Patrick Muriungi", "text": "yes you can. I have started with sass setup", "likes": 1}, {"author": "Ahmad F. Iksan", "text": "I suggest you to get familiar with Sass syntax atleast, because its quite different from the standart css syntax, if you already cover that part then sure, you should be able to follow along with the tutorial.", "likes": 2}]}, {"topLevelComment": {"author": "Coding Khasan", "text": "I don't know Bootstrapt and SASS", "likes": 1}}, {"topLevelComment": {"author": "Islam Ibakaev", "text": "cmon dude, sass is dead...", "likes": 0}, "replies": [{"author": "Islam Ibakaev", "text": "@Juan Ricci No, you don't use them together. Bootstrap is a monolith. In a real project you find yourself using only bootstrap flexbox grid. Postcss is a relatively new tool, new approach, it's called utility first. One class is one responsibility, they are kind of Lego units.", "likes": 0}, {"author": "Juan Ricci", "text": "@Islam Ibakaev Is it easy to integrate postcss/tailwindcss with bootstrap 5? I think the tutor teaches sass because is the tool already included in bootstrap (but this is just my opinion, I am a newbie here)", "likes": 0}, {"author": "KakSource", "text": "@Islam Ibakaev i will take a look at that, seems pretty nice, thank you for sharing it", "likes": 1}, {"author": "Islam Ibakaev", "text": "@KakSource I used scss for years before I found postcss. Postcss fully covers scss functionality and offers much more. Btw, tailwindcss is a postcss plugin. So if you use tailwindcss you are actually working with postcss.", "likes": 0}, {"author": "KakSource", "text": "why do you say that", "likes": 0}]}, {"topLevelComment": {"author": "bibhav yadav", "text": "Dang, how do you guys know what we need most at the moment?❤️😂 Awesome!!", "likes": 38}, "replies": [{"author": "Gamers Destiny", "text": "😮 me too man. Just realised it was uploaded a day ago...", "likes": 1}, {"author": "Salom Dunyo", "text": "YouTube knows :)", "likes": 1}]}, {"topLevelComment": {"author": "Farhan Sadik Zisan", "text": "I waited for this course!\nMom: Last video before sleep\nME: OK", "likes": 16}, "replies": [{"author": "Flair", "text": "@MIXED GROUND Stop spamming. I am gonna report you for spam", "likes": 2}, {"author": "MIXED GROUND", "text": "https://www.youtube.com/channel/UCBo3aDK3m7-Q8ThYCJUiSDQ?sub_confirmation=1", "likes": 0}]}, {"topLevelComment": {"author": "Sarcastic DnA", "text": "Brad Traversy and FCC : Today is Bootstrap Day", "likes": 142}, "replies": [{"author": "Sara Ch", "text": "How to install it as a laravel project and make it happen??", "likes": 0}, {"author": "Mohamad Mohamad", "text": "also the net ninja", "likes": 1}, {"author": "MIXED GROUND", "text": "https://www.youtube.com/channel/UCBo3aDK3m7-Q8ThYCJUiSDQ?sub_confirmation=1", "likes": 1}, {"author": "Mounir El bertouli", "text": "Yeah ! I noticed that", "likes": 1}]}, {"topLevelComment": {"author": "Grace Abigail", "text": "Stock and forex investment is the key just as i started with .Mr George Oliver , my portfolio has grown so high", "likes": 1}, "replies": [{"author": "Gloria Snyder", "text": "I make huge profits on my investment since i started trading with Mr George Oliver , his trading startegies are top notch .", "likes": 0}]}, {"topLevelComment": {"author": "Richie Mugambi", "text": "He sounds kenyan", "likes": 3}, "replies": [{"author": "Richie Mugambi", "text": "He is kenyan for sure... Its so reassuring to see this tutorial though", "likes": 2}, {"author": "Marion fan", "text": "I thought the same, too. His name is Kenyan so he might be Kenyan.", "likes": 2}]}, {"topLevelComment": {"author": "Monali Gore", "text": "But, please can anyone tell me that, can we add these freecodecamp's projects in our resume by doing modifications in it. Or else interviewer knows these projects already ????", "likes": 12}, "replies": [{"author": "Remonetized。org", "text": "Use the Bootstrap snippets, you can put together a website very quickly, it's great. Then of course you can use his lessons here to customize it as you like.", "likes": 1}, {"author": "Roby Adi Putra", "text": "If you can make something like this you can use this for your resume", "likes": 2}, {"author": "Rahul Bhoir", "text": "i'll will say learn the project don't copy it, as we have done for an assignments in college ,  show your creativity in that ... make some changes. It will help you in longer run..", "likes": 7}, {"author": "Sarcastic DnA", "text": "@OP GAMER dude it's okay for fresher to add these. But when someone asks the person should be able to explain the code.", "likes": 4}, {"author": "OP GAMER", "text": "you should build your own projects and then add them to your resume!! Don't add these!!", "likes": 4}]}, {"topLevelComment": {"author": "Mushfik F. Rahman", "text": "Which theme you are using?", "likes": 0}}, {"topLevelComment": {"author": "Saurabh Sharma", "text": "Was looking for similar. THANK YOU❤️", "likes": 5}, "replies": [{"author": "MIXED GROUND", "text": "https://www.youtube.com/channel/UCBo3aDK3m7-Q8ThYCJUiSDQ?sub_confirmation=1", "likes": 0}]}, {"topLevelComment": {"author": "Rajath R Pai", "text": "There's already a mf who disliked the video.\nIt takes alot of time to create a course.\nRespect freeCodeCamp❤️", "likes": 70}, "replies": [{"author": "Daniel Medley", "text": "@Akshat Vats CCP has entered the chat.", "likes": 1}, {"author": "Akshay Joshi", "text": "@FriedmanProductions Good luck with your channel dude.", "likes": 0}, {"author": "FriedmanProductions", "text": "@Akshat Vats I love how someone with NO content comments on this. You have no idea the effort required to create a video and post it.", "likes": 0}, {"author": "MIXED GROUND", "text": "https://www.youtube.com/channel/UCBo3aDK3m7-Q8ThYCJUiSDQ?sub_confirmation=1", "likes": 0}, {"author": "Grih Oriko", "text": "@Akshat Vats well, comparing politics to programming is really dumb IMO, since politics are mostly about opinions rather than facts. \nBut anyway, if you dislike the video so much, where is your constructive criticism as well as your ideas about how to make it better? Mb if you're so experienced in making websites and shooting tutorials, you'll spend your own time making a video about the topic?", "likes": 4}]}, {"topLevelComment": {"author": "dry humor", "text": "This is so cool! Keep up the good work!", "likes": 2}}, {"topLevelComment": {"author": "Cryptechology", "text": "thank you, need to use this along with some javascript", "likes": 0}}, {"topLevelComment": {"author": "Cryptechology", "text": "perfect course, excxatly what i need right now!!", "likes": 3}, "replies": [{"author": "dry humor", "text": "same here. Apparently this video is so interesting.", "likes": 0}]}, {"topLevelComment": {"author": "Arnav Mehta", "text": "Thats What i wanted. And commented on last video 😭😍", "likes": 1}}, {"topLevelComment": {"author": "QQQ32", "text": "kinda sass", "likes": 0}}, {"topLevelComment": {"author": "Said Neder", "text": "Thank you for so much knowledge 🙌", "likes": 2}}, {"topLevelComment": {"author": "legend kartik", "text": "YOU JUST GAINED A NEW SUBSCRIBER!!❤️", "likes": 6}, "replies": [{"author": "Gaurav", "text": "Just yesterday i discovered this awesome channel and since yesterday  my new life has begun!", "likes": 3}]}, {"topLevelComment": {"author": "Mushfik F. Rahman", "text": "I want freecodecamp t-shirt ❤️", "likes": 0}}, {"topLevelComment": {"author": "Michael Soriano", "text": "Thanks for this contribution", "likes": 2}}, {"topLevelComment": {"author": "Aya Bc", "text": "Thank you so much 😊🙏", "likes": 1}}, {"topLevelComment": {"author": "J Prasanth", "text": "Hi Patrick sir .u re a such nice person", "likes": 1}, "replies": [{"author": "Patrick Muriungi", "text": "Thank you", "likes": 0}, {"author": "Vaxa Code", "text": "Thank You", "likes": 0}]}, {"topLevelComment": {"author": "Nikhil 17", "text": "!", "likes": 0}}, {"topLevelComment": {"author": "Anzar Alim", "text": "The start of the video was filmed on Hackentosh", "likes": 0}}, {"topLevelComment": {"author": "Katyayan Sharma", "text": "First comment", "likes": 0}}, {"topLevelComment": {"author": "sanjog belose", "text": "Amazing !!", "likes": 2}, "replies": [{"author": "MIXED GROUND", "text": "https://www.youtube.com/channel/UCBo3aDK3m7-Q8ThYCJUiSDQ?sub_confirmation=1", "likes": 0}]}, {"topLevelComment": {"author": "हिन्दू Speaks 🕉️", "text": "Thanks alot for this ❤️🔥 freeCodeCamp & Patrick sir ❤️", "likes": 3}, "replies": [{"author": "Vaxa Code", "text": "Thank You", "likes": 1}]}]}