{"video": {"id": "iUjWjt4E6rs", "title": "What is a Daily Standup? - Dev Life", "description": "The Daily Stand Up (aka DSU) is a part of the Agile Software development process (and SCRUM). These meetings are a short, helpful, and necessary part of the day for many developers.\n\nA lot of new devs wonder what web developers do on a day-to-day basis. In this video, you will learn all about the Daily Stand Up meeting, which is common in many development jobs. You will also learn tips to help you through your first DSU. \n\nVideo by Anissa Deanna.\n🎥Anissa's YouTube channel: https://www.youtube.com/channel/UCVOKt2XgozvMSnZDZGMdetg\n📷Anissa on Instagram: https://www.instagram.com/anissadeanna/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT3M59S", "likes": "546", "views": "15103"}, "comments": [{"topLevelComment": {"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg", "publishedAt": "2018-09-24T18:02:23Z", "author": "Black Clover", "text": "Doing the standup is the most ridiculous thing companies do! Why not have a regular meeting where everyone can do whatever they want sit or stand?! I absolutely hate it and avoid companies that do this.\n\nBtw, thanks for the explanation Anissa, for the rest of the people who didn't know what an abomination of a company practice this is.", "likes": 11}, "replies": [{"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg.8la4-DDttXc8mCg2IN-48w", "publishedAt": "2018-10-10T03:13:58Z", "author": "Anissa Deanna", "text": "Lol, I understand where you are coming from. For me it works. I'm on a team of 3-4 ppl including my ITPM and sometimes the 508 guy or someone from dev ops. It really just helps keep us on top of priority stuff. We don't talk to the business, so it allows us to hear if we are on the right track or get updates. Now a days, it usually last less than 10 minutes which is nice. With bigger groups it was a pain, at one point they combined a bunch of devs working on different apps into one DSU and it wasn't helpful and lasted closer 20minutes. I work from home, so a lot of the time I was working on my own stuff and just listening for keywords or my name in the DSU convo. I think its value depends on the situation and it's up to the ITPM to make sure it works for the team.", "likes": 0}, {"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg.8la4-DDttXc8ll1cjEDYr0", "publishedAt": "2018-09-29T00:13:21Z", "author": "Daniel Martz", "text": "Black Clover I’ve never stood while doing it, and yet we call it a stand up because that’s the common name for this sort of meeting. Wouldn’t mind standing though.", "likes": 0}, {"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg.8la4-DDttXc8liD3uRZVDA", "publishedAt": "2018-09-27T21:55:36Z", "author": "Black Clover", "text": "godsomex Powa thank you. Thats what im fighting for", "likes": 0}, {"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg.8la4-DDttXc8liAf7QhTmA", "publishedAt": "2018-09-27T21:34:36Z", "author": "G OC", "text": "Black Clover  of course it can be done sitting. i do mine sometimes from the comfort of my bed", "likes": 1}, {"id": "UgwP7DtN3KSCvlrl2IJ4AaABAg.8la4-DDttXc8lhEM1-UPnL", "publishedAt": "2018-09-27T12:47:34Z", "author": "Black Clover", "text": "Daniel Martz still, it can be done while sitting.", "likes": 0}]}, {"topLevelComment": {"id": "UgwHVg0JwOyn6PIxVCF4AaABAg", "publishedAt": "2022-04-05T14:05:18Z", "author": "Георги Ячев", "text": "thanks for the video. It was so short and helpful.", "likes": 0}}, {"topLevelComment": {"id": "UgxEMWrI_Fr5GHhGv8N4AaABAg", "publishedAt": "2021-02-09T22:40:41Z", "author": "Noel Slater", "text": "I appreciate your comments/input about Blockers. We do daily DSUs, but we don't really go over each team member's blockers. I think it would be beneficial (individually and collectively) if we did!", "likes": 0}}, {"topLevelComment": {"id": "UgzhcP_XikjVZHL3Mqp4AaABAg", "publishedAt": "2021-01-31T07:39:32Z", "author": "Rodolfo Vitangcol", "text": "Business Opportunity in Ruvol\r\n\r\nI have invented a Board Game [still unpublished and not yet out in the market] that I believe is guaranteed to be as challenging and exciting as CHESS.  I called it “RUVOL.”  \r\n\r\nIt is my hope that one day Ruvol may surpass chess as the “Number One Board Game in the World.” \r\n\r\nThe weakness of chess is it always starts in fixed positions that the opening moves become “memorizable.”  In fact, not a few have so mastered the moves that they can play against their opponents “blindfolded.”  It is for this very reason that the great Bobby Fischer introduced his so-called “Fischer Random Chess,” where the starting position of the pieces is “randomized” to make the memorization of openings impracticable.  Fortunately, it is also for this reason that I invented Ruvol where “every game” has been calculated to be a challenging one to play.\r\n\r\nHOW IS RUVOL PLAYED and HOW YOU CAN MONETIZE IT?\r\n\r\nI detailed everything in my YouTube video.  Here is the link:  https://www.youtube.com/watch?v=jcqth0m3-R0\r\n\r\nBIG MONEY POTENTIAL IN RUVOL!\r\n\r\nIt is worthwhile to note that the people who play chess will be the same people who will play Ruvol.  In my Google search, I learned there are around 800 million chess players in the world.  Even just a small percentage of these 800 million is good enough to earn big money from Ruvol either as an ONLINE GAME BUSINESS or as a PHYSICAL PRODUCT DISTRIBUTOR.\r\n\r\nYou may contact me at:  rodolfovitangcol@gmail.com.   \r\n\r\nThanks and God bless!\r\n \r\nRODOLFO MARTIN VITANGCOL\r\nThe Ruvol Inventor", "likes": 0}}, {"topLevelComment": {"id": "Ugz-gNXCmztq_v33K014AaABAg", "publishedAt": "2021-01-27T18:20:35Z", "author": "Bhushan Jungala", "text": "Never thought, I would ever find a video to explain this torture concept in almost every IT organization. 😬😬😬", "likes": 2}}, {"topLevelComment": {"id": "UgykUdyZ5PWEkj6vkIN4AaABAg", "publishedAt": "2020-08-11T22:22:08Z", "author": "tyler Knight", "text": "0:32", "likes": 0}}, {"topLevelComment": {"id": "UgzbsPg9NswzL8b4Cmh4AaABAg", "publishedAt": "2018-11-01T16:50:45Z", "author": "Rahul Maheta", "text": "How can i start dsu , i am project manager but I can't find out proper way to start dsu and takes it as regular practice. Help me", "likes": 0}}, {"topLevelComment": {"id": "Ugz093DtrC0dw4aoi9l4AaABAg", "publishedAt": "2018-10-10T03:06:39Z", "author": "Anissa Deanna", "text": "Thanks for posting my vid freeCodeCamp. If anyone has any questions for me, don't hesitate to ask and of course check out my other content. youtube.com/c/AnissaDeanna ❤", "likes": 0}}, {"topLevelComment": {"id": "Ugxu0JVGxB0cR1tCnBZ4AaABAg", "publishedAt": "2018-09-29T14:08:14Z", "author": "Hunter Lee", "text": "I appreciate being able to review my work every day. but I would be nervous about what part of of the job i wold be in the middle off. I tend to just go until the sun goes down, with intermittent breaks, so that i can get through as mch work in one day as possible, but at any specific time of day i could be at any point in my work. I would probably take notes of what i was doing as i was doing it, because what \"blocker\" i was having I then resolve. would that even be nessessary, or would it be approppriate to just say you have no blockers every day unless it's lasted, say, more than on day to resolve?", "likes": 0}, "replies": [{"id": "Ugxu0JVGxB0cR1tCnBZ4AaABAg.8lmXAaD-MtP8mChR43KTX_", "publishedAt": "2018-10-10T03:26:06Z", "author": "Anissa Deanna", "text": "I totally get where you are coming from. Most days, I usually don't have blockers. Today I said something like, \"Yesterday, I worked on the issue where there was a silent fail during deploy, today I plan to pair-program with my teammate to fix said problem quickly so that we can deploy to production asap, and other than that, no blockers.\" I also added in some other things I planned todo after I fixed the issue. If you have no blockers for several days, great. If you have a blocker currently, say what it is but that you are \"confident you will fix it in an hour or so\".  Otherwise, when I'm truly stumped, I might say \"I've been working on this task for a day or so and I'm a bit stumped, if someone wouldn't mind pairing up with me today or pointing to some resources, I would really appreciate it.\"", "likes": 3}]}, {"topLevelComment": {"id": "UgzF-EHb9BtBtlWzYhp4AaABAg", "publishedAt": "2018-09-27T19:08:18Z", "author": "Daniel Stoica", "text": "Probably the most useless part of Scrum.", "likes": 5}}, {"topLevelComment": {"id": "UgwIOfVb58FPYfjcgKF4AaABAg", "publishedAt": "2018-09-26T18:31:44Z", "author": "zrebrutibreniti", "text": "Thank you from Portugal ;)", "likes": 0}}, {"topLevelComment": {"id": "UgwDHloAwPUqRvcEAFZ4AaABAg", "publishedAt": "2018-09-25T01:48:24Z", "author": "josh", "text": "Stand ups are an enormous waste of time.", "likes": 4}, "replies": [{"id": "UgwDHloAwPUqRvcEAFZ4AaABAg.8lauKNOVRUt9DFSwsEE_UL", "publishedAt": "2020-09-06T03:47:31Z", "author": "josh", "text": "@tifking73 Yes, exactly!", "likes": 0}, {"id": "UgwDHloAwPUqRvcEAFZ4AaABAg.8lauKNOVRUt9DEaEKXmRV7", "publishedAt": "2020-09-05T19:40:42Z", "author": "tifking73", "text": "A task better done through Slack or some other type of IM.", "likes": 0}, {"id": "UgwDHloAwPUqRvcEAFZ4AaABAg.8lauKNOVRUt8lhDOMrV9Dc", "publishedAt": "2018-09-27T12:39:09Z", "author": "Daniel Martz", "text": "Why?", "likes": 0}, {"id": "UgwDHloAwPUqRvcEAFZ4AaABAg.8lauKNOVRUt8lcWUrcj7YM", "publishedAt": "2018-09-25T16:49:51Z", "author": "Влад Хименко", "text": "It's not if you know how to use it properly. I don't think there is too much value in you as a developer if you don't wanna spend 5-15 minutes to tell what you did yesterday, maybe that's because you did nothing and you just like to slack and just don't want anyone to know this?)", "likes": 2}]}, {"topLevelComment": {"id": "UgzrmtA5-7RtIyWnr_94AaABAg", "publishedAt": "2018-09-25T01:22:26Z", "author": "Muhaimin Zulkarnain", "text": "Ohh... my company does this, but I never knew there's a name for it.", "likes": 3}}, {"topLevelComment": {"id": "Ugz8RsLcTb-QimMWdB54AaABAg", "publishedAt": "2018-09-24T20:39:07Z", "author": "Olivier Roffini", "text": "Thanks for this video, continue ;-)", "likes": 1}}, {"topLevelComment": {"id": "UgyDjIHsDBLf4NLB8V14AaABAg", "publishedAt": "2018-09-24T19:03:19Z", "author": "SR", "text": "Congratulations for reaching 4k subscribers hope you guys will reach 1m subs before this year ends", "likes": 0}, "replies": [{"id": "UgyDjIHsDBLf4NLB8V14AaABAg.8laAyQxCZk48laeW6Qs9jM", "publishedAt": "2018-09-24T23:30:11Z", "author": "Ou8y2k2", "text": "400K. I was probably here at 4K. ;-)", "likes": 0}]}, {"topLevelComment": {"id": "UgwXRKCuUsm3TCjDj9t4AaABAg", "publishedAt": "2018-09-24T17:44:41Z", "author": "Abu Bakar Ali Ashraf", "text": "Thanks", "likes": 1}}, {"topLevelComment": {"id": "UgyoZnOUxU-tQAJAqb54AaABAg", "publishedAt": "2018-09-24T17:16:25Z", "author": "Matthew Leroe", "text": "Thanks for the heads up on dsu!", "likes": 1}}]}