{"video": {"id": "j-_s8f5K30I", "title": "Learn C Programming with Dr. Chuck (feat. classic book by Kernighan and Ritchie)", "description": "In this complete C programming course, Dr. Charles Severance (aka Dr. Chuck) will help you understand computer architecture and low-level programming through studying the \"classic\" version of the C Programming language from the 1978 book written by Brian Kernighan and Dennis Ritchie.\n\nIn this course we will be reflecting on how C provided an important foundation for the creation of modern programming languages. This is not a good place to start if you do not already have some programming experience. A suggested pre-requisite is Dr. Chuck's Python for Everybody course: https://youtu.be/8DvywoWv6fI\n\n📖 Online C Programming book by Brian Kernighan and Dennis Ritchie: https://www.cc4e.com/book/chap00.md\n🔗 Additional course resources: https://www.cc4e.com/\n(Unlock Code Hint: View the developer console on the website.)\n\n✏️ Dr. Charles Severance developed this course. He is a professor at the University of Michigan and one of the most popular software instructors in the world.\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Course Intro\n⌨️ (0:03:09) Chapter 0: Introduction\n⌨️ (0:20:44) Chapter 1: A Tutorial Introduction\n⌨️ (1:59:17) Chapter 2: Types, Operators, and Expressions\n⌨️ (3:02:09) Chapter 3: Control Flow\n⌨️ (3:49:31) Chapter 4: Functions and Program Structure\n⌨️ (5:20:32) Chapter 5: Pointers and Arrays\n⌨️ (6:50:30) Chapter 6: Structures\n⌨️ (8:16:33) Chapter 7: Input and Output\n⌨️ (9:02:02) Chapter 8: The UNIX System Interface", "duration": "PT9H38M35S", "likes": "8117", "views": "215678"}, "comments": [{"topLevelComment": {"author": "Hikaru Chen", "text": "Why use 1st edition instead of 2nd? Curious", "likes": 0}}, {"topLevelComment": {"author": "D3F3KT", "text": "This is a good video to sleep to. Quite hard to use it for actual learning, though.", "likes": 2}}, {"topLevelComment": {"author": "globulidoktor", "text": "glad dr. chuck did one on c too", "likes": 0}}, {"topLevelComment": {"author": "Ronald L. Johnson", "text": "i have the 1988 release of the Kernighan and Ritchie C programming language. at one point i owned the original 78 release but this second edition brings standards into the equation via ansi-c and i personally would recommend learning from this edition. it's the book i learned the basics of c in the mid to late 80's, with the very important nuances included by the creator/s of the language. it's an excellent book to learn the basics of c. this book prepares you to use c reference guides proficiently once you understand the syntax and control structures of the language. i can't stress how important it can be to learn c from this single book. it is a bit terse, assumes much however if you know the basics of the unix os, know how to us it's various editors (i still do all my c coding in vi) and the compiler subsystem, literally half the battle is won.", "likes": 0}}, {"topLevelComment": {"author": "Conteh Alimamy", "text": "I can not able to download the C programming can someone help me to download the pdf  here", "likes": 0}}, {"topLevelComment": {"author": "Dr. Mustafa Zaidi", "text": "Nice to see you. Who remember  ear;y times", "likes": 0}}, {"topLevelComment": {"author": "Erman Utku Avşar", "text": "The language of the creator of the creator...", "likes": 0}}, {"topLevelComment": {"author": "satoshinakamoto", "text": "Thankd", "likes": 0}}, {"topLevelComment": {"author": "RAJAT CHOPRA 🇮🇳", "text": "need more of such audio book format content, was such a great experience", "likes": 0}}, {"topLevelComment": {"author": "RAJAT CHOPRA 🇮🇳", "text": "'I see you're interested in learning PostGres, why not learn from me?'\n- Dr. Chuck", "likes": 0}}, {"topLevelComment": {"author": "Gu Steven", "text": "这个是机器人在读吗？", "likes": 0}}, {"topLevelComment": {"author": "V B", "text": "A lot of people have not yet found the video yet!", "likes": 0}}, {"topLevelComment": {"author": "V B", "text": "A lot of people talk about why C is not used much.\nSorry guys, as an embedded systems guy I only know C (also python).\nAnd it is most used in a lot of embedded systems.", "likes": 0}}, {"topLevelComment": {"author": "buti ", "text": "I'm so happy", "likes": 1}, "replies": [{"author": "Watynecc", "text": "yeay", "likes": 0}]}, {"topLevelComment": {"author": "Vivek Acharya", "text": "I bought the kindle version just yesterday. The book along with this lecture I am going to have an awesome time :D :D :D", "likes": 0}}, {"topLevelComment": {"author": "El_Coff <Foofoo>", "text": "It's a good book, I almost forgot about it along with my C memory.", "likes": 0}}, {"topLevelComment": {"author": "Capcom Turk", "text": "C is the Bitcoin of programming languages.  First and best lol", "likes": 0}}, {"topLevelComment": {"author": "biswajit rajaguru", "text": "he is just reading\n the book.", "likes": 0}}, {"topLevelComment": {"author": "JT", "text": "Blows my mind how lucky we are to have resources like this. What a time to be alive!", "likes": 2}}, {"topLevelComment": {"author": "NICOLE NEW", "text": "THANK YOU", "likes": 0}}, {"topLevelComment": {"author": "Isra", "text": "Dr. Chuck is great I love his content and his whole work ethic around sharing knwoledge. Awesome Dr, Chuck ❤", "likes": 0}}, {"topLevelComment": {"author": "YACOUBA SYLLA", "text": "Thanks", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Jason Pepas", "text": "Why is there a number guessing lock-out page?  I’m on my phone, I can’t access a developer console.  This is silly.", "likes": 1}, "replies": [{"author": "⁺①③①⑧③⓪③⑥⑦①⑧ whatsap", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "b888", "text": "C was the first language I learnt and fell in love with it. But I need a refresher no doubt.", "likes": 0}, "replies": [{"author": "⁺①③①⑧③⓪③⑥⑦①⑧ whatsap", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "Rojo Roj", "text": "What is he trying to do in this video. Actually reading the book line by line and making the video boring 😡😡😡😡😡", "likes": 0}, "replies": [{"author": "⁺①③①⑧③⓪③⑥⑦①⑧ whatsap", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️.", "likes": 0}]}, {"topLevelComment": {"author": "M H", "text": "He's reading everything he's saying. He can C.", "likes": 1}}, {"topLevelComment": {"author": "L P", "text": "Is learning C better than learning Java nowadays? 🙂", "likes": 1}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Hassan S.Konneh", "text": "Dr. Chuck taught me python...... his patience and teaching method am yet to see in other instructors..✌🏼❤", "likes": 0}}, {"topLevelComment": {"author": "Salaheddin AbuEin", "text": "Thank you so much.", "likes": 0}}, {"topLevelComment": {"author": "Avalanche Game Art", "text": "is no the past as it performs better than \"the future\"", "likes": 0}}, {"topLevelComment": {"author": "Chopa Games", "text": "It was almost 10 hours of video, but it took me almost a week of work to fully digest whole thing (I tried Hash map, linked list, etc by myself). Now it is time to update my knowledge gained from this 1978 by some new resources and I am ready to take university course about C. This book gave me a headstart. Thank you Dr. Chuck your were my guide to general programming (Python for everybody), now you were my guide to this important, but hard area of low-level languages. You are my n. 1!", "likes": 7}}, {"topLevelComment": {"author": "RomaineRC", "text": "Did DR Chuck just swat a fly? 🤔 59:59", "likes": 2}}, {"topLevelComment": {"author": "我爱大莱莱", "text": "who can tell me the unlock code for downloading this book, thanks a lot", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Werner Roets", "text": "It's just beautiful design isn't it. The prolog/C style syntax is still so dominant today. I've only really worked with high level languages and it seems a shame that we just push the cost onto the consumer. I think web browsers area a great example. Web applications are easy to build but incredibly inefficient. Very little consideration is given to the memory consumption.", "likes": 2}}, {"topLevelComment": {"author": "Waranzy Wise", "text": "No practical explanation", "likes": 0}}, {"topLevelComment": {"author": "Waranzy Wise", "text": "So what's the point here: He just read the whole book and nothing ehh?", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Maki Doko", "text": "Are you serious ? I guess, while it's not april's fool... 9h of book reading, really ?\nHave you ever try to follow a conf where the speaker just read his slideshow ? Then, you though \"let's try worst !\".", "likes": 0}}, {"topLevelComment": {"author": "Josue Ramirez", "text": "I am so glad videos like this exist. The tough part is actually getting through them and absorbing the material.", "likes": 7}, "replies": [{"author": "Ronald L. Johnson", "text": "and the best way to do that is copy all the code and run it as you go through the book. each chapter builds on the previous with TONS of repetition. the repetition drills the syntax and functions into you and by the end of the book you have it all memorized. you will not learn c by simply reading the book. you need to type in all that code, compile, run etc etc. this book will not make you a master c programmer, whatever that is, but it will make you a proficient c programmer. it readies you for the next book, intermediate c programming which i HIGHLY recommend as the natural progression in mastering c.", "likes": 2}]}, {"topLevelComment": {"author": "Skalex Stuch", "text": "Thanks so much for this guys! love all what you doing, I started with freecodecamp courses this year and almost finish the web development and wanted to know about C programming, but I also at the same time started the CS50X with the EDX and was so difficult for me \"as a newbie in programming\", after the second week with C i stopped and only continue with web development, but now I feel more ready hehe. And with this video I think can understand now C hopefully!  Cheers!", "likes": 1}}, {"topLevelComment": {"author": "Yto H", "text": "i am sorry, but reading out a C program is just torture to the listener.", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Ayman EL KARROUSSI", "text": "Mr.Severance i have been lost on learning C language and the fact that i just started your py4e when i gave then saw you made one about C language make you an angel in this industry", "likes": 0}}, {"topLevelComment": {"author": "David's Insider Club", "text": "If my life has any meaning then I'll watch this from start until finish.", "likes": 0}}, {"topLevelComment": {"author": "Tushar Singh", "text": "right on time when I finally understood I need to learn c.", "likes": 0}}, {"topLevelComment": {"author": "Maruf", "text": "*So he's the old Jaded guy*", "likes": 1}}, {"topLevelComment": {"author": "SNOW AND ⲂLⲞⲞⲆ", "text": "When you really know (C, C++) languages ​​like JavaScript and Python will be 1+2=3", "likes": 14}}, {"topLevelComment": {"author": "Guoliang Wang", "text": "For cc4e viewer, 42, i dont know why i input this number, but i just type it in, then ...", "likes": 0}}, {"topLevelComment": {"author": "Guillaume V.", "text": "Thanks for the reading! At point 1.5, for character/word/line counting, nothing outputs from the program, despite the `printf` at the end. It is supposed to read the input from the terminal right? Or am I missing something and the input should come from a file?", "likes": 0}}, {"topLevelComment": {"author": "Juan Dager", "text": "Learning C first will make you better understand modern languages. Similar to learning Latin roots helps understand European languages. But it is a detour. If you don't need to use C soon or you don't plan to work with C, then skip it and go directly to the language you will use like JavaScript, Python, Kotlin, etc.", "likes": 2}}, {"topLevelComment": {"author": "04ELY", "text": "Dr Chuck is really awesome!", "likes": 1}}, {"topLevelComment": {"author": "Praveen Dinelka", "text": "Elegant.", "likes": 0}}, {"topLevelComment": {"author": "318yang", "text": "This is the first time I hear a person READ the code out...", "likes": 2}}, {"topLevelComment": {"author": "Aryan Singh", "text": "Oh God ! I love it , can you do the same for C++ too please", "likes": 0}}, {"topLevelComment": {"author": "Aman Singh", "text": "Why learn this language today which makes it easy to create buggy software. We are fed up of hackers exploiting c memory faults. Please learn rust.", "likes": 1}}, {"topLevelComment": {"author": "Recon0x7F", "text": "Ty", "likes": 0}}, {"topLevelComment": {"author": "(defn life())", "text": "I learnt python first, but I fell in love with programming thanks to C.", "likes": 2}}, {"topLevelComment": {"author": "Cybad", "text": "Dr. Chuck is so awesome, I'm a huge fan of him and his work. Such a gifted and generous educator, and we're so lucky to have him! Looking forward to watching this course.", "likes": 3}}, {"topLevelComment": {"author": "Tasnuva Gisanra", "text": "in my experience, Any course had never been able to come closer compare to the deepness of a book. I Love The Way this this whole thing is presented cause I do listen to a lot of audio books. (I am kind of lazy when it comes to reading) on YouTube when it's comes to programming related audio books, there is no audio books available for free. Just thank you for this kind of depth course. I'm just grateful.", "likes": 0}}, {"topLevelComment": {"author": "this is really me", "text": "5:36:14 ... \"No!\" lol. In a post pandemic world, any misbehaving pet must be introduced to the audience.", "likes": 0}}, {"topLevelComment": {"author": "wil Montreal21", "text": "Is there not a licence problem (like music) reading and showing an entire book on youtube?", "likes": 0}, "replies": [{"author": "Dean G", "text": "There are certainly are copyright problems in some countries about Photocopying books. It's debatable whether there is a copy right issue here, but given the book is so old and hardly anyone buys a copy these days, I doubt it is worth the authors pursuing a copyright infringement.\n\nIn fact any decent C programmer owns a copy of this book as a reference book (I do) which is frequently used when writing a C program: it is indispensable. This video is more likely to generate sales of the book! So probably not in the interests of the authors to claim a copyright infringement.", "likes": 0}]}, {"topLevelComment": {"author": "Samsungsar Samsungsar", "text": "Thanks. there are many C tutorial but we need tutorial about C library, toolkit ... like Glib, Gtk 4 ...", "likes": 0}, "replies": [{"author": "Dean G", "text": "No you don't need a tutorial. You need to learn to read the documentation.\n\nFor every API there is documentation and there won't be tutorials for them all.", "likes": 0}]}, {"topLevelComment": {"author": "Ilerio Def", "text": "Well, after \"Python for everybody\" everything where Dr. Chuck is mentioned will have \"5 stars\" in my mind even before looking into it.\nThis man is a God-blessed educator from my view.", "likes": 3}}, {"topLevelComment": {"author": "nosffunS", "text": "Marcação de Estudo: 49:17", "likes": 0}}, {"topLevelComment": {"author": "chadjaa Sofiane", "text": "\"Do you wanna learn c. Why don't learn from me, Mr. chunk\".\nMr. chunk.", "likes": 0}}, {"topLevelComment": {"author": "Krzysiekoy", "text": "I mean... I like dr Chuck but what is the point of reading the whole book VERBATIM including the CODE SYNTAX...\n\nThis is like having to listen to a 9 hour lecture where the professor reads off of huge wall-of-text slides verbatim. You can parse the slide with our eyes / in your mind in about few seconds, but then have to wait for prof. to read the slide out loud for the next 3 minutes...\n\nWhen I saw this announcement from freecodecamp, I thought this is going to be more of a commentary - going over the book, giving insights, providing explanations, and NOT just reading the whole thing verbatim. This is honestly so bizzare...\n\nThis whole thing looks absolutely superfluous... Like if you see a snippet of code, then you can quickly parse it in your head. Having the code read out loud character-by-character is nothing but distracting. I would understand talking about the code and explaining what it does, but reading it verbatim?\n\n- pound define underscore n file\n- type def struct underscore iobuff\n- open square bracket...\n\n????\n\nWhat is the point of this whole thing? What am I missing?", "likes": 6}, "replies": [{"author": "D3F3KT", "text": "Yeah, very strange that the top comments are praising the instructor and the video. Once I saw what is was all about I stopped watching. Perhaps this only appeals to audio book listeners. I had to scroll down several lines in order to spot constructive criticism on this \"video\". Then I went on to watch an actual tutorial instead of this garbage.", "likes": 1}, {"author": "Yojan Shrestha", "text": "I genuinely thought this was an audio book based on the way this was presented. If this was supposed to be that then fair play but this is absolutely not the right format for video tutorial when it can be so much interactive than this verbatim reading. And no clue why others are praising for the content when it is abysmal for the YT format.", "likes": 0}, {"author": "phrk17", "text": "It just shows, that many people here on YouTube commented on this video without even watching for a few minutes. This is by no means a course and is hardly useful at all, unless your vision is impaired. I don't understand why this is here on fcc.", "likes": 1}]}, {"topLevelComment": {"author": "nosffunS", "text": "Thank you very much!", "likes": 0}}, {"topLevelComment": {"author": "Planet of the Idiots", "text": "Sh!t I will have the BOOK", "likes": 0}}, {"topLevelComment": {"author": "Planet of the Idiots", "text": "where can I get tutorial about HEADERS ?", "likes": 0}, "replies": [{"author": "⁺①⑤⓪①⑧①⑨③⑨②⑨ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "Privateer Investor", "text": "Thank you so so much for this and all your work to help us learn programing", "likes": 0}}, {"topLevelComment": {"author": "this is really me", "text": "THANK you! I’m leaning C now after using Python for years. We learn best in “immersion”. I’ll need to be at my computer for maximum benefit, but this kind of “reading” is letting me learn while busy with life chores. Thanks again.", "likes": 8}}, {"topLevelComment": {"author": "alex cai", "text": "it is surprising to me that reading the textbook could learn the programming!", "likes": 1}}, {"topLevelComment": {"author": "Efrain Mcshell", "text": "I have that book, I just started trying last night", "likes": 0}}, {"topLevelComment": {"author": "Akhil Vatsa", "text": "I wonder in tryst of knowledge, I just keep learning because it's interesting.. and soon I am not even using it and without an end goal.", "likes": 0}}, {"topLevelComment": {"author": "Glowie", "text": "where's dr. sneed?", "likes": 0}}, {"topLevelComment": {"author": "Keshab Thapa", "text": "Please do make video of UE5.", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Ismail", "text": "why is he just reading the book", "likes": 0}}, {"topLevelComment": {"author": "Jimver Dalupan", "text": "wow", "likes": 1}}, {"topLevelComment": {"author": "牛老牛在纽村 NZ Daily", "text": "I was a c player 14 years ago, then c++ running on suse, not the .net one. Now I am mainly js/ts plus java on sprintboot.", "likes": 0}}, {"topLevelComment": {"author": "Academic library", "text": "Course Contents ⭐️\n⌨️ (0:00:00) Course Intro\n⌨️ (0:03:09) Chapter 0: Introduction\n⌨️ (0:20:44) Chapter 1: A Tutorial Introduction\n⌨️ (1:59:17) Chapter 2: Types, Operators, and Expressions\n⌨️ (3:02:09) Chapter 3: Control Flow\n⌨️ (3:49:31) Chapter 4: Functions and Program Structure\n⌨️ (5:20:32) Chapter 5: Pointers and Arrays\n⌨️ (6:50:30) Chapter 6: Structures\n⌨️ (8:16:33) Chapter 7: Input and Output\n⌨️ (9:02:02) Chapter 8: The UNIX System Interface", "likes": 30}}, {"topLevelComment": {"author": "Ing Juan Pablo Franco Lozada", "text": "the result is 6 * 7 = 42 Finish", "likes": 0}, "replies": [{"author": "Ing Juan Pablo Franco Lozada", "text": "thanck you teacher best Channel.", "likes": 0}]}, {"topLevelComment": {"author": "Abc Def", "text": "One 10h video on C# please..", "likes": 0}}, {"topLevelComment": {"author": "JohnWick", "text": "Man, God bless these gentlemen", "likes": 0}}, {"topLevelComment": {"author": "Lars Thomas Denstad", "text": "Not sure what this is, seems like just some dude reading the original book. Seems like a joke. Just get the book.", "likes": 1}}, {"topLevelComment": {"author": "Zaky Vids", "text": "Can dr chuck make a JavaScript course as well this would be highly appreciated", "likes": 1}}, {"topLevelComment": {"author": "Anime-For-Life", "text": "I seriously needed this video cause I'm struggling with C for my projects", "likes": 0}}, {"topLevelComment": {"author": "shanmuga sundaram", "text": "Thank you, awaited for this video!", "likes": 0}}, {"topLevelComment": {"author": "James Evans", "text": "Why would you not use the second edition for this omg", "likes": 0}}, {"topLevelComment": {"author": "abi abi", "text": "learning c with reading the entire web?", "likes": 0}}, {"topLevelComment": {"author": "Shaikat Barua", "text": "Am I the one who see PYTHON 4 EVERYONE!", "likes": 0}}, {"topLevelComment": {"author": "KomalR Rathore", "text": "I'm from non it field, now  I've switched my sector to IT. \r\nSo sir Guide us, how to practice on HackerRank, HackerEarth and so on from Starting.", "likes": 0}}, {"topLevelComment": {"author": "Subhranshu Das", "text": "Feel like 16 again.", "likes": 0}}, {"topLevelComment": {"author": "Zyx Yuv", "text": "This sucks, we finished this book in 7th grade for AP Computer science when I was like age 12. How about going through The Rust Programming Language instead.", "likes": 1}, "replies": [{"author": "Dean G", "text": "Because C was a very important language for many years. Unix was written in it. And it is still used in embedded applications where  memory is tight.", "likes": 0}]}, {"topLevelComment": {"author": "J", "text": "Absolutely classic. Thanks for putting this out there. I started with C++ and Stroustrup, but it's easy to go back to C from there. Done plenty of work in both. And there are still copious jobs out there for both.", "likes": 6}}, {"topLevelComment": {"author": "Joe Yoest", "text": "Am I missing something here? I spot checked several points in this video and it seems like he’s literally just reading K&R C from cover to cover. Doesn’t look like he’s even writing, compiling, and running the code, let alone providing any instructional content. \n\nIt seems like this is a flat-out ripoff of K&R - just recording their book in audio form isn’t the same as creating a course featuring their book. \nI’ve watched some fcc Python courses and they were very well done; I’m wondering if this instructor has ever written a line of C code.", "likes": 8}}, {"topLevelComment": {"author": "T Glass", "text": "Note to self, resume at ch 1. 20:45\n1.2 program to try out: 30:00", "likes": 0}}, {"topLevelComment": {"author": "Jonathan Moore", "text": "I love you, you little bearded man. Thks", "likes": 0}}, {"topLevelComment": {"author": "caleb erioluwa", "text": "I learned C using this book in my second year .  It was not easy to understand it  but  I did get to love it later", "likes": 1}}, {"topLevelComment": {"author": "Shaik Shabana", "text": "How to unlock? Pls tell me lock", "likes": 1}}, {"topLevelComment": {"author": "Daniel", "text": "I came here because the thumbnail gave me an impression that a mafia boss was going to teach me programming", "likes": 2}}, {"topLevelComment": {"author": "INSANE GAMER", "text": "hello sir is it possible to learn  programming  in 2 weeks for placements", "likes": 0}}, {"topLevelComment": {"author": "thompson terna", "text": "Just when I needed it👍🏾", "likes": 0}}, {"topLevelComment": {"author": "Tonukari Tanure", "text": "Perfect timing for me. God bless you. Thank you guys.", "likes": 0}}, {"topLevelComment": {"author": "Zach Uram", "text": "Where do we get the book? is it free?", "likes": 0}}, {"topLevelComment": {"author": "chris plusplus", "text": "I just started learning c programming about 30hrs ago, and this video suddenly came, wow!", "likes": 2}, "replies": [{"author": "PROTAGONIST", "text": "THAT IS DARN SPECIFIC. A LITTLE OVER A DAY AGO.", "likes": 3}, {"author": "gloire Chabu", "text": "Same here", "likes": 1}]}, {"topLevelComment": {"author": "Artyom Mart", "text": "Is information in this course relevant?\nDoes it use the old version of C?", "likes": 2}, "replies": [{"author": "Dean G", "text": "It I recall correctly C++ compilers will still compile C code.", "likes": 0}, {"author": "echristopherson78", "text": "One nice thing is that it appears Dr. Chuck gives lots of notes on the text that at least touch on some of the differences between K&R C and ANSI C, in relevant places.", "likes": 0}, {"author": "echristopherson78", "text": "It uses the first edition (1978) of the book, which teaches what's known as K&R C (as opposed to ANSI C). Someone recently told me that he prefers the first edition because it teaches you more about being close to the machine and not using the \"training wheels\" that he perceived ANSI C to have. That said, within C coding, K&R C is extremely old and not often used anymore in its purest form.", "likes": 1}, {"author": "Anant", "text": "I want to know this too", "likes": 0}]}, {"topLevelComment": {"author": "Haveyouseenchefplis??", "text": "Finally!", "likes": 0}}, {"topLevelComment": {"author": "Royson Salis", "text": "Can u make one course for C++ too please 🤧🤧", "likes": 2}}, {"topLevelComment": {"author": "Ares Sun", "text": "The bible", "likes": 1}}, {"topLevelComment": {"author": "Value Pilgrim", "text": "Is there a course on Assembly language by Dr. Chuck yet?", "likes": 0}, "replies": [{"author": "Value Pilgrim", "text": "@Dean G Thanks for asking.\nI am a novice. I know a bit of C and some Unix Shell programming. I use a windows 11 laptop with AMD processor. What would you recommend?", "likes": 0}, {"author": "Dean G", "text": "Which assembly language are you interested in? There are many.", "likes": 1}]}, {"topLevelComment": {"author": "Maxfrischdev", "text": "Hah, crazy. I just recently watched the Interview with Dr. Chuck where he spoke about his plans to make more of the \"for everybody\" -courses, including that C one! 😃🤘🏻 Excited!", "likes": 4}}, {"topLevelComment": {"author": "Cristi P.", "text": "What a timing...EXACTLY what I was looking for. Thank you!!", "likes": 4}, "replies": [{"author": "INSANE GAMER", "text": "hello sir is it possible to learn  programming  in 2 weeks for placements", "likes": 2}]}, {"topLevelComment": {"author": "Taül Guedí", "text": "God bless the real teachers!", "likes": 0}}, {"topLevelComment": {"author": "roy Yung", "text": "He is literally READING from a book. What a snore fest", "likes": 6}}, {"topLevelComment": {"author": "Raj Mukherjee Codeing", "text": "You are amazing sir l learn lot's of things because of you.", "likes": 0}}, {"topLevelComment": {"author": "Rokas Karabevicius", "text": "Can't wait to watch this on some rainy autumn Saturday! K&R C is the Old Testament of programming books!", "likes": 0}}, {"topLevelComment": {"author": "Julius Rosco", "text": "Wow just, wow", "likes": 0}}, {"topLevelComment": {"author": "LUCKIΞ", "text": "You can learn C at any point of your life. You won't regret the decision. It'll be a worthy investment of your time and brain cells.", "likes": 8}}, {"topLevelComment": {"author": "Unknown Page", "text": "My eyes after 5h white screen", "likes": 0}}, {"topLevelComment": {"author": "Golden Maceteli", "text": "I just realized I had this book when I was in high school, this is a prompt to go read it", "likes": 1}}, {"topLevelComment": {"author": "Yilmaz", "text": "When I looked at C/C++ courses playlist, I was surprised there weren't many videos there. Well, I needed more tutorials and you guys uploaded this video at the exact time I was looking for more tutorials! Thank you for your awesome courses and thank you for making them free!", "likes": 1}}, {"topLevelComment": {"author": "Alexander Clavell", "text": "do you guys have a mic in my room? I was talking about watching a course like this in C \nthanks!", "likes": 1}}, {"topLevelComment": {"author": "坨主", "text": "这频道的内容真够🤩🤩🤩🤩👍👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "Ozzymand", "text": "Who needs audiobooks when you got the c programming audiobook", "likes": 1}, "replies": [{"author": "Chuck Severance", "text": "That is the point :)", "likes": 0}]}, {"topLevelComment": {"author": "forgottenvy", "text": "Elementary, dear Watson", "likes": 1}}, {"topLevelComment": {"author": "Mega Bolt", "text": "y-you passed the bar?", "likes": 0}}, {"topLevelComment": {"author": "Robin Kleven", "text": "I love C.", "likes": 0}}, {"topLevelComment": {"author": "Alexandros Taderera", "text": "Going through a book is a brilliant idea!", "likes": 3}}, {"topLevelComment": {"author": "Space Marine", "text": "Thank You 😀", "likes": 0}}, {"topLevelComment": {"author": "Ásio Conceição", "text": "Hello freecodecamop thanks for this wonderful job. Can you make a classe of Qt?", "likes": 0}}, {"topLevelComment": {"author": "himanshu bhat", "text": "Livin' Legend", "likes": 0}}, {"topLevelComment": {"author": "Olivier Lüthy", "text": "Ahhh man, I would have liked to have this course 3 years ago when I had to learn C. I was so damn bad😂", "likes": 1}}, {"topLevelComment": {"author": "Sajib Mandal", "text": "I found it.🤣", "likes": 0}}, {"topLevelComment": {"author": "Abdikhaliq Mohamoud", "text": "Tutor U know for his everyone courses.", "likes": 0}}, {"topLevelComment": {"author": "Reighmond Velasco", "text": "They got dr. Chuck from the peaky blinders series", "likes": 0}}, {"topLevelComment": {"author": "calkelpdiver", "text": "I learned C programming in 1986 in college.  I used this book, and still have my copy of it today (buried somewhere).  C is the foundation to a lot of modern languages like C++, C.Net, and Java.", "likes": 77}, "replies": [{"author": "Vit Levanskiy", "text": "@BoldAlphaz Even Go", "likes": 1}, {"author": "PROTAGONIST", "text": "@BoldAlphaz EVEN RUST", "likes": 3}, {"author": "BoldAlphaz", "text": "Even Python", "likes": 2}]}, {"topLevelComment": {"author": "Nahom Hailu", "text": "Just when I needed the most shout out to Dr Charles and FreeCodeCamp.  For this amazing course. Tank you.", "likes": 1}}, {"topLevelComment": {"author": "Jonathan Deats", "text": "I was just recently looking for a book on C. Wonderful timing!", "likes": 8}, "replies": [{"author": "lightspd714", "text": "@INSANE GAMER In all practicality no, it’s not.", "likes": 2}, {"author": "INSANE GAMER", "text": "hello sir is it possible to learn  programming  in 2 weeks for placements", "likes": 0}]}, {"topLevelComment": {"author": "Rayyan Amir", "text": "Hi, it would be great if you mention timestamp for \"For loop\"", "likes": 2}}, {"topLevelComment": {"author": "Husein Tinwala", "text": "Great 👍", "likes": 0}}, {"topLevelComment": {"author": "Feras Masoud", "text": "Dr. Chuck is one of the most important instructors from Michigan University!\nHis contributions to learning programming languages like Python and Javascript are noticeable.\nHe is the bridge between the very earlier stage of programming history and concurrent directions of programming.\nThis course is promising for great content and the outcome will be great.", "likes": 131}}, {"topLevelComment": {"author": "choco blan", "text": "last video for the day", "likes": 0}}, {"topLevelComment": {"author": "Bboy Rynan", "text": "Finally a C course 🤘🏽🤘🏽", "likes": 1}}, {"topLevelComment": {"author": "Geeky Programmer", "text": "Dr.Chuck is a legend!", "likes": 1}}, {"topLevelComment": {"author": "les palmiers", "text": "🌴 back in the future 🌴 with love and affection for kernighan and ritchie ❤️ let's do this course just for their memories", "likes": 2}}, {"topLevelComment": {"author": "Nate", "text": "I worked with Dr Chuck on Sakai and other higher education products. Brilliant man. Also used some of his grid computing work back when I was doing that in grad school. I am sure this course is fantastic.", "likes": 65}, "replies": [{"author": "Nate", "text": "@Chuck Severance things are great. Congrats on the new course.", "likes": 7}, {"author": "Chuck Severance", "text": "Nate - Great to hear from you again.  Hope all is well.", "likes": 8}]}, {"topLevelComment": {"author": "goowatch", "text": "The course is very good, but it is very theoretical, I think it lacks the practical component. Hopefully there will be a second part where it is addressed in a practical way.", "likes": 4}, "replies": [{"author": "Dean G", "text": "@silmar pinheiro C is not theoretical. It's simply a language and you use whatever elements of it you need.\n\nIt is fairly low level compared to other high level languages.", "likes": 0}, {"author": "Computer Science and Careers", "text": "You might wanna read Modern C programming after this", "likes": 0}, {"author": "silmar pinheiro", "text": "This book is theoretical. So this course is basically theoretical. No updates, this book is decades old.\nThat being said. C is very theoretical, it's close to the metal so you have to know what is a pointer and why strings are pointers, etc.", "likes": 4}]}, {"topLevelComment": {"author": "John Marshal", "text": "#coincidence \nToday I received the physical copy of this book (2nd edition)\n\nThanks ❤", "likes": 1}}, {"topLevelComment": {"author": "gammyhorse", "text": "Amazing. Thank you very much.", "likes": 1}}, {"topLevelComment": {"author": "UFO Grindizer", "text": "I just started the course. I already see the promise of a great content, thank you for this.", "likes": 6}}, {"topLevelComment": {"author": "Daniel", "text": "Useless", "likes": 2}, "replies": [{"author": "Pendulum theComplicatedOne", "text": "❤️ from Pakistan 🇵🇰", "likes": 0}, {"author": "Chuck Severance", "text": "This is intended as a read of the book with commentary.  There will also be a full course - that is coming.  The idea is that you can sit back, relax, and listen like an audio book.   The concepts in C are pretty dense and for some folks - the ability to listen to the book (and code) while on a bus or in a car - and listen over and over will allows complex concepts to sink in.  One of the problems I face as a professor is that students don't read the book - this is my attempt to solve that by reading it to them audio-book style.", "likes": 2}, {"author": "Habeeb Dindi", "text": "@Daniel Because he's kind of just reading the book right?", "likes": 0}, {"author": "Anant", "text": "Why", "likes": 0}]}, {"topLevelComment": {"author": "Jayalakshmi Kannan", "text": "Dr.chuck make a detail video on flutter plzz…", "likes": 1}}, {"topLevelComment": {"author": "Daniel Ise", "text": "Ufff 🔥🔥🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "Sukrit Ghorai", "text": "Eh not a good  tutorial, he is reading a website. not worth spending 10 hrs on it. :(", "likes": 4}}, {"topLevelComment": {"author": "a", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "Free Learning Code", "text": "Thanks for all🔥❤️", "likes": 1}}, {"topLevelComment": {"author": "Doofeinstein", "text": "You guys should live forever", "likes": 0}}, {"topLevelComment": {"author": "Maxi Luaces", "text": "😮", "likes": 0}}, {"topLevelComment": {"author": "Jose Ortiz", "text": "This is very nice. Can’t wait to watch the whole thing.", "likes": 2}, "replies": [{"author": "Alex", "text": "@INSANE GAMER Nop", "likes": 0}, {"author": "INSANE GAMER", "text": "hello sir is it possible to learn  programming  in 2 weeks for placements", "likes": 0}]}, {"topLevelComment": {"author": "faruk sahin", "text": "Is K&R suitable for modern C ?", "likes": 0}, "replies": [{"author": "Dean G", "text": "C is still used for embedded applications because it results in compact object code.", "likes": 0}, {"author": "this is really me", "text": "While the example code is outdated, and several functions are now considered unsafe for use, the actual text and insights are timeless. Read the book, skip the code.", "likes": 0}, {"author": "Chuck Severance", "text": "Not really.  This is about how the world changed in 1978 - and since most people won't really write in C - this book is focused at looking at how C changed the world and how C is the cause of our modern computing environment - both hardware and software.", "likes": 0}]}, {"topLevelComment": {"author": "siddharth ghosh", "text": "Was just watching this course a few days back. Dr Chuck is a legend.", "likes": 8}}, {"topLevelComment": {"author": "MySelf", "text": "This is full course ?", "likes": 2}}, {"topLevelComment": {"author": "Uncle Tango", "text": "Legendary book, incredible instructor", "likes": 58}, "replies": [{"author": "freeCodeCamp.org", "text": "42", "likes": 21}, {"author": "Pavan Pavan", "text": "Can you tell that unlock code ❓", "likes": 1}]}, {"topLevelComment": {"author": "3046_SAYANTAN GOSWAMI", "text": "the best", "likes": 0}}, {"topLevelComment": {"author": "Yakki_AddiTioN", "text": "Great content like always ❤️❤️", "likes": 4}}, {"topLevelComment": {"author": "Akanimoh Osutuk", "text": "Speechless", "likes": 0}}, {"topLevelComment": {"author": "Coupisgrub", "text": "I was re reading this book today only 😂😂 what a coincidence", "likes": 2}}, {"topLevelComment": {"author": "Jean Lopes", "text": "👏👏👏👏🎉🙏", "likes": 0}}, {"topLevelComment": {"author": "Jay Prakash", "text": "Thats some Noire styled thumbnail !!", "likes": 2}}, {"topLevelComment": {"author": "Азамат Керимов", "text": "Thanks a lot\n😉😉😉", "likes": 0}}, {"topLevelComment": {"author": "Aderogba Smith", "text": "Let's Go!!", "likes": 0}}, {"topLevelComment": {"author": "Saqib Ishaq", "text": "❤️", "likes": 0}}, {"topLevelComment": {"author": "Thilaka Athukorala", "text": "1st comment", "likes": 0}}, {"topLevelComment": {"author": "Nithish Ronaldo", "text": "It's my second view and thirdd like", "likes": 0}}, {"topLevelComment": {"author": "[18-552] Varma kanna", "text": "Hi first view", "likes": 0}}, {"topLevelComment": {"author": "TGRBA Tgrba", "text": "The best❤🔥", "likes": 2}}, {"topLevelComment": {"author": "Taimoor Abdullah", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Doggo670", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Adon Bush", "text": "First", "likes": 0}, "replies": [{"author": "Mark Walker", "text": "Too late", "likes": 0}]}, {"topLevelComment": {"author": "Mark Walker", "text": "First comment", "likes": 1}}]}