{"video": {"id": "J-cSy5MeMOA", "title": "Apache Cassandra Database – Full Course for Beginners", "description": "Apache Cassandra is an open source NoSQL distributed database. This beginner's Cassandra course has four modules. The first three modules will cover the basics Apache Cassandra data modeling. The final module covers practical applications of Cassandra. \n\nGet Started with Astra DB, built on Apache Cassandra: https://astra.datastax.com/register/ac250/vi-10\n\n⭐️ Course Contents ⭐️\n⌨️ (00:30) Module 1: Cassandra Intro and Background\n⌨️ (21:53) Module 2: Collections, User Defined Types, and Counters\n⌨️ (31:29) Module 3: Data Modeling\n⌨️ (1:04:22) Module 4: Practical Applications\n\n⭐️ Links ⭐️\n🔗 Build scalable API-based Microservices with Spring Boot and Cassandra\nhttps://astra.dev/3vIUwyx\n\n🔗 REST API in AstraDB - Introduction and curl: https://www.youtube.com/watch?v=oSVuPbH1S-c\n🔗  https://astra.dev/3rNnOL5\n\n🔗  Build a Reactive app in Apache Cassandra™ with Spring Framework: https://www.youtube.com/watch?v=1aRbndIcXV4\n🔗  https://astra.dev/3xSxaZW\n\n🔗  Advanced Data Modeling in Apache Cassandra™: https://astra.dev/3xX5QK7\n\n🔗 Introduction to #MachineLearning with Cassandra and Spark: https://astra.dev/39aPqU5\n\n🔗 NoSQL Course from Anna Kubow: https://www.youtube.com/watch?v=xh4gy1lbL2k\n\n🏗 DataStax provided a grant to make this course possible.", "duration": "PT1H8M40S", "likes": "1842", "views": "122810"}, "comments": [{"topLevelComment": {"id": "UgyWYTuL8sXPfXFIhi14AaABAg", "publishedAt": "2023-02-02T19:25:24Z", "author": "Sandy Hook 1", "text": ". leave me alone and I reject the interruptions and do not consent to the obstruction of my opportunities", "likes": 0}}, {"topLevelComment": {"id": "UgzmJjAtmUSrtUSbznJ4AaABAg", "publishedAt": "2022-12-24T14:41:06Z", "author": "Arulmozhi Karunanidhi", "text": "I want to update uuid in one table i want return that uuid as primary key for another table (return id ) is it possible in cassandra", "likes": 0}}, {"topLevelComment": {"id": "UgzgAGzgp2cwuBVhfNx4AaABAg", "publishedAt": "2022-11-25T22:14:16Z", "author": "Naseem Toumeh", "text": "definitely not for a beginner", "likes": 0}}, {"topLevelComment": {"id": "UgyP5eoSMPSpuCfTlrt4AaABAg", "publishedAt": "2022-11-11T21:56:43Z", "author": "quyen vo", "text": "I mostly learn my modules at school with help from online videos. And this video is one of the worst. Watching through the video like reading PowerPoint slides uploaded in school without any thorough explanation: what, why, how,..? Every points are presented very briefly and not explained well. Another point about this video which I find really tests my patient is: the monotone voice. I struggle a lot to keep me up during the video. Very sad but after 1 hour 8 mins I couldn’t learn anything. It might because I am too stupid and others, who compliment this video are very smart .. thanks anyway for uploading the video.", "likes": 2}}, {"topLevelComment": {"id": "UgznI7JUKJ49MtoNpNd4AaABAg", "publishedAt": "2022-10-25T17:13:21Z", "author": "Robert Butler", "text": "STOP SHOWING THIS AS AN AD. I'M NOT WATCHING AN HOUR LONG ADVERTISEMENT ON A 20 MINUTE LONG VIDEO. *wheeze.*  lol.", "likes": 0}}, {"topLevelComment": {"id": "UgzQftP3slfqnjTG0-d4AaABAg", "publishedAt": "2022-09-29T11:30:28Z", "author": "TheString Breaker", "text": "*Phenomenal Stuff!*", "likes": 1}}, {"topLevelComment": {"id": "UgyLkYQk056aMunPfkJ4AaABAg", "publishedAt": "2022-09-17T14:06:27Z", "author": "Akhil Sai", "text": "12:00 SQL fundamentals \n15:40 Partitions \n18:22 De-normalization", "likes": 4}}, {"topLevelComment": {"id": "UgzYHhT7-nqK6SP2BUd4AaABAg", "publishedAt": "2022-09-08T10:19:42Z", "author": "new view of things.", "text": "you did.", "likes": 0}}, {"topLevelComment": {"id": "UgzA3LCkdvfSGBu0hjl4AaABAg", "publishedAt": "2022-09-08T06:52:31Z", "author": "usirsorikmasmining", "text": "Thankyou for actually explaining tNice tutorialngs. Other videos that I watched started talking about how to make soft and didn't ntion anytNice tutorialng", "likes": 0}}, {"topLevelComment": {"id": "UgzO3IwJ7y1lMrQK2QV4AaABAg", "publishedAt": "2022-08-14T16:40:04Z", "author": "Gary Lau", "text": "In which case should I choose Cassandra over MongoDB as MongoDB also supports time series now?", "likes": 0}}, {"topLevelComment": {"id": "UgyYyyZlHF3eY3Tk3Nt4AaABAg", "publishedAt": "2022-08-05T16:35:56Z", "author": "qazaq empire 2", "text": "Kafka course please, with cool project", "likes": 0}}, {"topLevelComment": {"id": "UgzupMz557EgjA3aC4p4AaABAg", "publishedAt": "2022-08-04T23:58:20Z", "author": "Jasper V", "text": "𝐩𝓻Ỗ𝓂Ø𝓈Ｍ", "likes": 0}}, {"topLevelComment": {"id": "Ugz8RXdrJLeIphhEoj14AaABAg", "publishedAt": "2022-08-04T04:47:41Z", "author": "md hossen", "text": "Please make SQLite database crash course", "likes": 0}}, {"topLevelComment": {"id": "UgzKGCZDs7skl1AMTiF4AaABAg", "publishedAt": "2022-07-31T17:05:22Z", "author": "Sreenatha Reddy Chiyyeti", "text": "Excellent tutorial, covered what is necessary in 1 hour.  Thanks!", "likes": 2}}, {"topLevelComment": {"id": "UgzkHxqR_HEK8cRkMvF4AaABAg", "publishedAt": "2022-07-27T11:32:17Z", "author": "leandro abbas", "text": "Excelenteeee!!!", "likes": 0}}, {"topLevelComment": {"id": "UgyJmBRKJFXcbAiBvth4AaABAg", "publishedAt": "2022-07-25T10:28:31Z", "author": "Aliyu Abubakar", "text": "For the website u taught us I can't see visual studio code on my laptop", "likes": 0}}, {"topLevelComment": {"id": "UgxLx4XJSGlFzYkV3Mx4AaABAg", "publishedAt": "2022-07-24T20:55:36Z", "author": "Juan Mamani", "text": "Awesome! thanks x sharing!", "likes": 0}}, {"topLevelComment": {"id": "UgxOSaEmHET1j9V77bp4AaABAg", "publishedAt": "2022-07-24T16:37:33Z", "author": "SKEETER STUDIES", "text": "Please we need ussd application development tutorials", "likes": 1}, "replies": [{"id": "UgxOSaEmHET1j9V77bp4AaABAg.9dsENveug7I9dsEUrLx82K", "publishedAt": "2022-07-24T16:38:29Z", "author": "SKEETER STUDIES", "text": "Please we need ussd application development tutorials", "likes": 0}, {"id": "UgxOSaEmHET1j9V77bp4AaABAg.9dsENveug7I9dsESWYYzQN", "publishedAt": "2022-07-24T16:38:10Z", "author": "SKEETER STUDIES", "text": "Please we need ussd application development tutorials", "likes": 1}]}, {"topLevelComment": {"id": "UgxTRkR39NLUDJqR0i94AaABAg", "publishedAt": "2022-07-24T02:08:34Z", "author": "said raika", "text": "I want to hack for money", "likes": 1}, "replies": [{"id": "UgxTRkR39NLUDJqR0i94AaABAg.9dqfwI7KrZN9dsyLdd5ztI", "publishedAt": "2022-07-24T23:27:56Z", "author": "said raika", "text": "from hua max", "likes": 0}]}, {"topLevelComment": {"id": "UgzvNxJcZxbGaTcpJPx4AaABAg", "publishedAt": "2022-07-23T17:54:58Z", "author": "Taiyo Nakashima", "text": "fantastic video! if you could make some texts easier to see by avoidng black letters on dark background, it'd be even greater.", "likes": 1}, "replies": [{"id": "UgzvNxJcZxbGaTcpJPx4AaABAg.9dpnS6n-NDx9e4AsUNBXCI", "publishedAt": "2022-07-29T17:17:02Z", "author": "DataStax Developers", "text": "ty for the feedback, noted.", "likes": 0}]}, {"topLevelComment": {"id": "Ugy65fYD4YhGt88og3J4AaABAg", "publishedAt": "2022-07-23T12:42:03Z", "author": "VCN كوكايين", "text": "AlG🇩🇿🇩🇿", "likes": 1}}, {"topLevelComment": {"id": "Ugyq9m_xaTmlbKcld814AaABAg", "publishedAt": "2022-07-22T19:52:59Z", "author": "No Wiesz Co", "text": "14:27 Unexpected SQL Syntax error in line 5, near to ;", "likes": 0}}, {"topLevelComment": {"id": "UgxQPt2KgRUh4dKhUtF4AaABAg", "publishedAt": "2022-07-22T05:08:59Z", "author": "Fox.", "text": "Read my freakin mind man. Jesus it's creepy.", "likes": 0}}, {"topLevelComment": {"id": "UgwwWQJiwjClNLhy9o54AaABAg", "publishedAt": "2022-07-22T01:07:24Z", "author": "Jose Miralles", "text": "Yes! I've been wanting to learn Cassandra for a while.", "likes": 1}}, {"topLevelComment": {"id": "UgwYkXkwCQO22Wjoxw14AaABAg", "publishedAt": "2022-07-21T22:18:50Z", "author": "DB 421", "text": "Thanks!", "likes": 3}}, {"topLevelComment": {"id": "Ugx5bczod36SjCNtTf14AaABAg", "publishedAt": "2022-07-21T22:10:58Z", "author": "Carlos Saldaña Matar", "text": "Awesome content! 🤩", "likes": 0}}, {"topLevelComment": {"id": "Ugy3ytXG008oGFNpCjt4AaABAg", "publishedAt": "2022-07-21T21:27:05Z", "author": "Rishi Raj", "text": "🙏👍", "likes": 0}}, {"topLevelComment": {"id": "UgwnNZMJqnVvfCFFGu94AaABAg", "publishedAt": "2022-07-21T18:14:20Z", "author": "Pablo Martín Urrutia", "text": "Beautiful tutorial, very well explained and very well designed, thanks!", "likes": 2}}, {"topLevelComment": {"id": "UgwG_1mArKaYxMCBUo14AaABAg", "publishedAt": "2022-07-21T18:07:00Z", "author": "Saifullahi Khamisu", "text": "And I have One Big Issue, with my Project, in API integration Java (android studio), itz E-Wallet App that Users Gonna Add money and Buy Data with", "likes": 0}}, {"topLevelComment": {"id": "UgxBaqWoqk2ZJyIhFg54AaABAg", "publishedAt": "2022-07-21T15:31:40Z", "author": "Rx - Pert", "text": "Cool content, great subject.\nStill, FCC needs someone cooler to explain.\nNo one talks like this at the dinner table.\nGet some flavor.  Find a hip hop artist.\nYou're welcome, lol.", "likes": 0}}, {"topLevelComment": {"id": "UgznO4LdOnJyrx--8Dl4AaABAg", "publishedAt": "2022-07-21T15:28:39Z", "author": "Trevor Dennis", "text": "My opinion is that if you're not writing a web app that will have millions of users around the world, just stick with SQL.", "likes": 3}, "replies": [{"id": "UgznO4LdOnJyrx--8Dl4AaABAg.9dkO6k4Mrxh9e4Aot2o69V", "publishedAt": "2022-07-29T17:16:32Z", "author": "DataStax Developers", "text": "In fact, there is an upcoming tutorial on FreeCodeCamp that will speak in depth to the tradeoffs and balancing act of when to choose what.  Stay tuned, coming in next 2-3 weeks, would be grateful for your opinion on it when it arrives.", "likes": 0}, {"id": "UgznO4LdOnJyrx--8Dl4AaABAg.9dkO6k4Mrxh9e4AgLZ56ik", "publishedAt": "2022-07-29T17:15:22Z", "author": "DataStax Developers", "text": "SQL is often a great choice!  That said, Cloud makes it pretty easy to deploy globally, pretty soon that's going to be the norm for customer-facing apps or companies that have customers in multiple localities. You don't need to have an app with millions of users to want to deploy as multi-region DB (a single DB deployed across multiple regions).   That's definitely a strength Cassandra in particular vs. sharded DBs.    Food for thought!", "likes": 0}]}, {"topLevelComment": {"id": "Ugz12nyeNoeOcgGm9ft4AaABAg", "publishedAt": "2022-07-21T14:36:08Z", "author": "Royal Apples", "text": "This is great for anyone who wants to get into streaming or content delivery networks (CDN)  Or if you are dealing with large amounts of data, free code camp, always knows what we need! :)", "likes": 18}, "replies": [{"id": "Ugz12nyeNoeOcgGm9ft4AaABAg.9dkI6-obk1W9do0JszBQ5L", "publishedAt": "2022-07-23T01:17:42Z", "author": "Ronald Maffei de Lavor", "text": "“Oh, Sagrada Face de Jesus Compadecei-Vos de Nós!”\n\nConsagração à Sagrada Face de Jesus\n\nÓ boníssimo Jesus, que quereis salvar o mundo de hoje, com aquele infinito amor com que fora criado e redimido. Incluí-me também no número dos que realmente trabalham pelo triunfo do vosso Reino de Amor na terra. Recebei, para este fim, a total entrega de todo o meu ser, dispondo de mim. Quero difundir a Imagem de Vossa Divina Face e as misericórdias do Vosso Sacratíssimo Coração para que a Vossa Imagem ilumine e vivifique todas as almas. Jesus, operai milagres de conversão!\n\nChamais os apóstolos para esta nova época, que por sua vez se encarreguem dessa sublime missão. Que as ondas do Vosso misericordioso Amor se espalhem sobre o mundo inteiro, e afundando o maligno e destruindo os males, renovem a terra e façam os homens, ao sentirem os seus corações tomados de caridade, viverem o Novo Testamento à Luz desse Sol que é a Vossa Divina Face e as misericórdias do Vosso Sacratíssimo Coração. Amém.\n\nSenhor, fazei resplandecer Vossa Sagrada Face sobre nós.\n\nAo Cordeiro de Deus que Se assenta no trono e habita nos Sacrários, toda honra, louvor, poder e glória, agora e para sempre, por todos os séculos dos séculos. Amém.\n\n História da Sagrada Face de Jesus\n\nEsta santa devoção teve origem com a impressão milagrosa do Rosto de Cristo no lenço de Verônica, uma tradição muito respeitada na Igreja. O Papa Bento XVI fez questão de venerar o Véu de Verônica na cidade de Manoppello na Itália, em setembro de 2006. Durante sua visita ao santuário, Bento XVI foi o primeiro Papa a poder novamente venerar a relíquia, meio milênio após seu desaparecimento da Basílica de São Pedro.\n\nEsta devoção cresceu muito também por causa da importância que a Divina Face teve na vida de Santa Teresinha do Menino Jesus e da Sagrada Face. Outro fato que fortaleceu a devoção foram os surpreendentes estudos da figura de JESUS no santo Sudário de Turim; além das revelações à Irmã M. Pierina de Micheli (†1945), a mensageira da Sagrada Face dos últimos tempos.\n\nEm maio de 1938, a Virgem Santíssima mostrou (em visão mística) à Irmã Pierina, um escapulário formado de dois paninhos. Num ela viu a Face de JESUS com as palavras ao redor: “Ilumina, Domine, vultum tuum super nos” (“Senhor, fazei resplandecer a Vossa Face sobre nós”). No outro estavam escritas em volta de uma hóstia as palavras: “Mane nobiscum, domine” (Senhor ficai conosco). Lentamente Nossa Senhora se aproximou e disse:\n\n“Escuta bem e transmite ao teu confessor que este escapulário é uma arma de defesa, escudo de fortaleza e penhor de misericórdia que JESUS quer dar ao mundo nestes tempos de sensualidade e de ódio contra DEUS e a Igreja. São poucos os verdadeiros apóstolos. É necessário um remédio divino e este remédio é a FACE de meu Filho.\n\nTodos aqueles que usarem o escapulário, e sendo lhes possível, cada terça feira visitar o Santíssimo Sacramento fazendo “Uma Hora Santa”, para reparar os ultrajes que recebeu e continua recebendo meu Filho, cada dia, no Sacramento Eucarístico, serão fortificados na Fé, estarão prontos para defendê-la e hão de suportar todas as dificuldades internas e externas. Além disso morrerão serenamente sob o olhar de meu Filho”.\n\nSemanas mais tarde JESUS apareceu também e disse:\n\n“Quero que Minha FACE seja honrada com uma festa própria na Terça-feira da Quinquagésima (terça-feira de carnaval) e que esta festa seja preparada por uma novena durante a qual todos os fiéis façam Comigo reparação”.\n\nEm vez de fazer escapulários a Irmã Pierina mandou cunhar medalhas. Preocupada por isso recorreu à Nossa Senhora que novamente lhe apareceu dizendo:\n\n“Minha filha, não se preocupe, pois, o escapulário é substituído pela medalha com todas as promessas e favores. Só resta difundi-la mais ainda. Ora, interessa-me muito a festa da Sagrada FACE de meu Filho. Diga ao Papa que esta festa muito me interessa”.\n\nIrmã M. Pierina falou três vezes ao Papa e o Sumo Pontífice, ciente do pedido do Céu, não se fez esperar. No dia 15 de março de 1957, havendo já aprovado a propagação da medalha, facultou a celebração da festa, isto é, aos Beneditinos Silvestrinos de Roma. Em 10 de janeiro de 1959 o Papa João XXIII concedeu a mesma licença, a todos os Bispos do Brasil.\n\nPara merecer as graças prometidas é necessário:\n\nUsar a medalha, contemplar com amor, muitas vezes a Sagrada FACE, zelar pela devoção, fazendo a Hora Santa, nas Terças-feiras, promover anualmente a novena em preparação à festa na terça-feira de carnaval, e seguindo o exemplo dos grandes devotos da Sagrada FACE, ler e meditar diariamente o Novo Testamento. Todos os dias rezar:\n\n5 Pai Nossos; 5 Ave Marias; 5 Glórias; em honra das cinco chagas de Nosso Senhor JESUS CRISTO, rezando também a oração composta por Pio IX, e a aspiração que a segue:\n\n“Ó meu JESUS, lançai sobre nós um olhar de misericórdia! Volvei Vossa Face para cada um de nós, como fizestes à Verônica, não para que A vejamos com os olhos corporais, pois não o merecemos. Mas volvei-A para os nossos corações, a fim de que, amparados sempre em Vós, possamos haurir nesta fonte inesgotável, as forças necessárias para nos entregarmos ao combate que temos que sustentar. Amém.\n\nSenhor, mostrai-nos a Vossa Face e seremos salvos!”\n\nNota: No livro ORAÇÕES DE TODOS OS TEMPOS DA IGREJA (Ed. Cléofas) há outras orações desta devoção: A Ladainha da Sagrada Face; a Oração de Consagração à Sagrada Face; Novena à Sagrada Face; e outras orações.\n\nProf. Felipe Aquino\n\nOração à Sagrada Face\n\n(Composta por Santa Teresinha)\n\nÓ Jesus, que na Vossa crudelíssima Paixão Vos tornastes “o opróbio dos homens e o homem das dores”, eu adoro a Vossa Divina Face sobre a qual resplandecem a beleza e ternura da Divindade e que agora se tornou para mim como a face de um “leproso” (Is. 53,4).\n\nMas sob estes traços desfigurados reconheço o Vosso infinito amor e ardentemente desejo amar-Vos e fazer-Vos amar por todos os homens.\n\nAs lágrimas que com tanta abundância correram dos Vossos olhos, se me afiguram quais pérolas preciosas, que eu quisera recolher para, com seu valor infinito, resgatar as almas dos pobres pecadores.\n\nÓ Jesus, Vossa Face é a única beleza que encanta o meu coração, de boa mente quero renunciar na terra à doçura do Vosso olhar e ao inefável ósculo de Vossa boca divina, mas suplico-Vos, imprimi em meu coração Vossa Divina Imagem, e inflamai-me com Vosso amor, a fim de que possa um dia contemplar a Vossa Face gloriosa no Céu. Amém.\n\nFonte:\n\nhttps://blog.cancaonova.com/felipeaquino/2015/03/04/devocao-a-sagrada-face-de-cristo/\n\nTerço da Sagrada Face\n\nIniciar fazendo cinco vezes o sinal da Santa Cruz, em honra as Cinco Santas Chagas de nosso Senhor Jesus Cristo. Após rezar o Creio, o Pai-Nosso a Ave-Maria e o Glória.\nNas contas do Pai-Nosso: Pai Eterno, ofereço-Vos a Face adorável de Vosso Divino Filho para abrandar a cólera de Vossa Justiça, obter a santificação do clero, o perdão dos pecadores e o alívio das almas do purgatório.\nNas contas da Ave-Maria: Oh! Sagrada Face de Jesus, compadecei-vos de nós e do mundo inteiro.\n\nNo final, rezar três Ave-Marias em louvor das dores que Nossa Senhora sofreu ao ver Jesus carregar a Cruz, ser pregado, vê-lo morrer e recebê-lo morto em seus amorosos e ternos e santos braços. No fim de cada Ave-Maria acrescentar a jaculatória: Nossa Senhora das Dores, rogai por nós!\n\nNo encerramento, rezar: Face adorável de meu Jesus, meu único amor, minha luz e minha vida, fazei que veja somente a Vós, nada conheça fora de Vós, ame-Vos unicamente, e que, enfim, não viva a não ser convosco, de Vós, por Vós e para Vós. Assim seja. Amém.\n\nRezar 1 Glória.\n\nQuem reza se salva\n\n                               \n\nLeigos em oração pela Santa Igreja Católica Apostólica Romana.\n\n© 2021 – Todos os direitos reservados – Política de Privacidade\n\nFeito com ❤ no Wordpress\n\nConteúdo acessível em libras usando o VLibras Widget com opções dos Avatares Ícaro ou Hozana.Conteúdo acessível em libras usando o VLibras Widget com opções dos Avatares Ícaro ou Hozana.", "likes": 0}]}, {"topLevelComment": {"id": "Ugx65pEONKZFjtaIvoJ4AaABAg", "publishedAt": "2022-07-21T13:35:42Z", "author": "54M1WUL", "text": "we need a python devops automation course", "likes": 13}, "replies": [{"id": "Ugx65pEONKZFjtaIvoJ4AaABAg.9dkBBMPV0gD9l8mlKMHBNO", "publishedAt": "2023-01-21T11:53:34Z", "author": "Carlos Aceves", "text": "Ok ok y ok", "likes": 0}]}, {"topLevelComment": {"id": "UgwXYrEvWwHWVT-_pS14AaABAg", "publishedAt": "2022-07-21T13:33:15Z", "author": "Mohammad Samiur", "text": "Mern stack complex project wanted. Love you from Bangladesh", "likes": 0}}, {"topLevelComment": {"id": "UgzjAtkh9Hb5D4ETFsl4AaABAg", "publishedAt": "2022-07-21T13:31:47Z", "author": "ArrayIndexOutOfBoundsException", "text": "This guy does nothing except for telling the topic of the videos he steals.... Inside his playroom. \nTop kek", "likes": 0}, "replies": [{"id": "UgzjAtkh9Hb5D4ETFsl4AaABAg.9dkAjfRf5f19dkE-uP5J_d", "publishedAt": "2022-07-21T14:00:20Z", "author": "freeCodeCamp.org", "text": "We get permission to post all videos from the creator. And for this one, freeCodeCamp was given a grant to make it possible for us to post it. The person who does the intros also creates courses on the channel, including one posted last week. But you did get the playroom part right. 😉", "likes": 4}]}, {"topLevelComment": {"id": "UgwHwihWqPalfY8_yi94AaABAg", "publishedAt": "2022-07-21T13:27:55Z", "author": "Kelvin Rimba", "text": "As always freecodecamp never disappoints 👏", "likes": 5}}, {"topLevelComment": {"id": "Ugx_F2ybRJZywHDxIh14AaABAg", "publishedAt": "2022-07-21T13:17:40Z", "author": "Sneh Patel", "text": "Freecodecamp always knows what we need... 😀", "likes": 4}}, {"topLevelComment": {"id": "Ugyrgl9njhlYLqs7Lsx4AaABAg", "publishedAt": "2022-07-21T13:16:44Z", "author": "Saifullahi Khamisu", "text": "very good sir", "likes": 0}}, {"topLevelComment": {"id": "UgxoWhQtGtdIdBjnmkR4AaABAg", "publishedAt": "2022-07-21T13:12:47Z", "author": "IT Expert", "text": "thank u", "likes": 0}}, {"topLevelComment": {"id": "UgzQNtH6Y8rqzWHp9th4AaABAg", "publishedAt": "2022-07-21T13:07:50Z", "author": "Shushant Dubey", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"id": "Ugxjm8rGkDw8vOUsa8t4AaABAg", "publishedAt": "2022-07-21T13:07:17Z", "author": "Ak0ag1ki", "text": "Thank you for another fantastic video!", "likes": 1}}, {"topLevelComment": {"id": "UgxnBNgxPB3RoCosqr94AaABAg", "publishedAt": "2022-07-21T13:07:12Z", "author": "Geeky Programmer", "text": "First", "likes": 0}}, {"topLevelComment": {"id": "Ugw2Z_DafiLr44hA8Gt4AaABAg", "publishedAt": "2022-07-21T13:07:03Z", "author": "Ryan", "text": "Boom!", "likes": 1}}, {"topLevelComment": {"id": "Ugwlcfh__zhsEd_kah54AaABAg", "publishedAt": "2022-07-21T13:07:02Z", "author": "Lightning Dice", "text": "Hi", "likes": 0}, "replies": [{"id": "Ugwlcfh__zhsEd_kah54AaABAg.9dk7uPXs8NM9dkG-fAt0Je", "publishedAt": "2022-07-21T14:17:47Z", "author": "Tonie", "text": "Hi", "likes": 0}, {"id": "Ugwlcfh__zhsEd_kah54AaABAg.9dk7uPXs8NM9dk7xRUvrhB", "publishedAt": "2022-07-21T13:07:26Z", "author": "rudiansyahirun", "text": "Hi", "likes": 0}]}]}