{"video": {"id": "j3XufmvEMiM", "title": "What are Microservices?", "description": "An introduction to microservices from Software Engineering Daily. Find out about microservices and microservice architecture in this quick animation. Music by The Prion. \n\nhttp://softwareengineeringdaily.com\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT3M48S", "likes": "6445", "views": "256101"}, "comments": [{"topLevelComment": {"author": "Shawn", "text": "Also, I came here to learn how a microservice is made on a more technical level. Everyone does the \"why does it exist\" but not \"how does it exist\". Off to the next video to hopefully find out, but I'm sure it will have 3-4 minutes of why microservices exist", "likes": 0}}, {"topLevelComment": {"author": "Shawn", "text": "Most companies used Unix and didn't switch to Linux until around the early 2010s. Just wanted to point that out; I saw the Linux logos at the beginning.", "likes": 0}}, {"topLevelComment": {"author": "Priyanka Choudhary", "text": "this was so loaded with information. until now both these words were mystery for me, but now I feel like my understanding of them is crystal clear. ...Hats off to you folks at freecodecamp, you make my life easy every day!!", "likes": 0}}, {"topLevelComment": {"author": "saeed17", "text": "@2:51 \"which sits in a rack\" - the first time I watched this video I thought he said \"Iraq\", was well confused 🤦‍♂", "likes": 0}}, {"topLevelComment": {"author": "Miguel", "text": "Finally a no-nonsense, clear explanation.", "likes": 0}}, {"topLevelComment": {"author": "Sagar Pandya", "text": "super simple short and easily understandable. thanks", "likes": 0}}, {"topLevelComment": {"author": "CodeWithRay", "text": "Excellent video. Absolutely loved every second 🤩 Very well explained!! 💯👏", "likes": 0}}, {"topLevelComment": {"author": "kanhaglobal", "text": "Excellent way to Give Intro to Micro Services Concept.  Thanks a lot !", "likes": 0}}, {"topLevelComment": {"author": "Sunrise Sunset", "text": "Great video, but I'm still a bit confused as to what constitutes a microservice. Is the entire frontend (Vue.js. user-facing side, for example) a microservice sitting in one container and a MySQL database be a second microservice? Would some backend framework API built in Laravel, for example,  that connects the frontend to the database be a third microservice? I'm having trouble conceptualizing the dividing lines.", "likes": 0}, "replies": [{"author": "Srinjoy Ghosh", "text": "different organizations have different 'dividing lines'", "likes": 0}]}, {"topLevelComment": {"author": "no one", "text": "can anyone mention the minute he answers the question \"What are Microservices?\"", "likes": 0}, "replies": [{"author": "一本のうんち", "text": "he doesn't. at one point he says they're decoupled code in another he says docker containers are microservices...", "likes": 0}]}, {"topLevelComment": {"author": "Megatton 720", "text": "Thanks so much. You've been a wonderful help!", "likes": 0}}, {"topLevelComment": {"author": "Jakob Berg", "text": "this beat goes so hard what the fuuuuuu", "likes": 0}}, {"topLevelComment": {"author": "Akshat Ramanathan", "text": "Best video ever. Love this explanation", "likes": 0}}, {"topLevelComment": {"author": "CODING PANDA", "text": "they dont even told about azure😂", "likes": 0}}, {"topLevelComment": {"author": "Salaheddin AbuEin", "text": "Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Augustine Enodiana", "text": "Really engaging video", "likes": 0}}, {"topLevelComment": {"author": "Tom de Visser", "text": "Amazing explanation", "likes": 0}}, {"topLevelComment": {"author": "Ashu Singh", "text": "Does anyone know how to perform a load testing on microservice via Jmeter ??", "likes": 0}}, {"topLevelComment": {"author": "Gal Nadjar", "text": "Insanely good explanation thank you so much!!", "likes": 0}}, {"topLevelComment": {"author": "Nicetomeetu Gaming", "text": "Thanks for this amazing video sir!", "likes": 0}}, {"topLevelComment": {"author": "Vikas Panwar", "text": "here's my perspective on why micro services may not be the right choice for you - https://www.youtube.com/watch?v=LZPsyX0J9DM&t=58s", "likes": 0}}, {"topLevelComment": {"author": "Pia Wendrich", "text": "u forgot to show the space and galaxy", "likes": 0}}, {"topLevelComment": {"author": "Shawn Veillon", "text": "Ah, 2018, OK.  But still... \"the two cloud providers\"... um, actually, I think at the time of publishing this video GCP was at best #4, now #3.  Azure is #2, and they do have Azure Service Fabric to manage micoservice based apps/systems.  Don't get me wrong, I prefer GCP over everything and believe/hope they will one day be #1.  But especially given freecodecamp is focused mostly on beginners, it's important to keep information accurate and relevant.", "likes": 1}}, {"topLevelComment": {"author": "L.J.", "text": "Microservices have no technical advantages over monoliths", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Kalifa", "text": "Best Explanation we could ever find wonderful approach Thanks team", "likes": 1}}, {"topLevelComment": {"author": "mishmohd", "text": "how do I learn how to make a microcloudservice", "likes": 0}}, {"topLevelComment": {"author": "Negus222", "text": "2:50 \"...which sits in Iraq...\"\nThat was unexpected. I didn't know all servers sat in Iraq.", "likes": 3}}, {"topLevelComment": {"author": "Kudoshi", "text": "I read and watched Microsoft's video on explaining all these. It took me like 12 min to watch them and still have no idea.\nBut this video took 4 min to explain everything clearly", "likes": 0}, "replies": [{"author": "TheUltimateNewPlayer", "text": "That usually happens when they go into and unnecessarily detailed technical explanations using a lot of jargon. And if you don't understand the jargon you get lost quick. Whereas this video walked you through everything step by step without any fluff.", "likes": 1}]}, {"topLevelComment": {"author": "Alejandro Torres Hernandez", "text": "Inception.", "likes": 0}}, {"topLevelComment": {"author": "Gary Chan", "text": "I like how a cloud is a network of data centres. Explanation on point", "likes": 2}}, {"topLevelComment": {"author": "wano vlogs", "text": "Video is good though. But I have question sir? Why you are using docker to run multiple services on ec2 we can also run multiple services without using docker as well.\n\nKindly reply anyone who knows about this really appreciated.\nThanks", "likes": 0}}, {"topLevelComment": {"author": "J C", "text": "Google is third in the cloud... today. In 2018, I'm pretty sure IBM was third behind Azure and AWS.... GCP is peanuts.", "likes": 0}}, {"topLevelComment": {"author": "Yashodhara Hettiarachchi", "text": "This video is awesome.", "likes": 0}}, {"topLevelComment": {"author": "Supernova12034", "text": "oh god, I learned what containers are!", "likes": 0}}, {"topLevelComment": {"author": "Mohit Ashliya", "text": "My whole doubt of cloud is solved now Thanks for the wonderful explanation", "likes": 0}}, {"topLevelComment": {"author": "Seeker44", "text": "3 years later.... Rarely people use GCP and its AWS vs Azure now.", "likes": 0}}, {"topLevelComment": {"author": "Hamza Mushtaq", "text": "Great visual explanation. You showed an excellent grasp of the topic. Loved the visuals.", "likes": 0}}, {"topLevelComment": {"author": "legendofJupp", "text": "i didn't get the part \"which sits in iraq, which sits in a data center\". sorry for my bad english, for me it sounds like iraq is part of a data center. can someone explain it to me?", "likes": 0}, "replies": [{"author": "WaveHello", "text": "It should say \"sits in A RACK\". The subtitles are wrong, your English is fine.", "likes": 0}]}, {"topLevelComment": {"author": "Nigel Higgs", "text": "“Software development has never been easier” I’m just a cs student so I don’t work directly with this but this sounds more complicated then ever before lol the layers on layers of abstraction are ridiculous. This video is great btw.", "likes": 77}, "replies": [{"author": "arch1e", "text": "Yeah the video was very good but \"Software development has never been easier\" is nonsense. I started programming in 1982 and I can tell you it's way more complex now.... and actually made more complex by all the stuff that is suppossed to make it easier.", "likes": 3}, {"author": "Xavier Velez", "text": "@The Man In Black Right? Imagine having to actually learn algorithms from an old man in a lecture hall rather than having the multitudes of resources the internet gave us?", "likes": 0}, {"author": "The Man In Black", "text": "@Xavier Velez  lol engineers in the 70's before www and stack overflow be like: 👁👄👁", "likes": 8}, {"author": "Xavier Velez", "text": "@Supernova12034 Oh you sincerely have no idea what you’re saying. Software development has been made FAR easier. The issue that is confusing you is that things being made are far more complex now. But go back 10 years and try to build a SPA without today’s tools, you’ll be lost AF I promise you.", "likes": 7}, {"author": "Supernova12034", "text": "the bar rises every year.  in 1999 a dev had to know a fraction of what he had to know in 2013.   in 2013 a dev had to know a fraction of what he has to know in 2021. \n\nso that quote \"software development has never been easier \" is incorrect.", "likes": 47}]}, {"topLevelComment": {"author": "Renars Kukuks", "text": "Very well explained. Structured, direct, clear, and within the context of practicality. Thank you", "likes": 0}}, {"topLevelComment": {"author": "cazterk", "text": "smash the like if you listen to the se-daily podcast", "likes": 0}}, {"topLevelComment": {"author": "Pasan Jayaweera", "text": "I'm here straight from the KRAZAM microservices video lol", "likes": 0}}, {"topLevelComment": {"author": "Pratik Pawar", "text": "thanks for this video I understand what I was confused for lonng time", "likes": 0}}, {"topLevelComment": {"author": "Zekrell", "text": "awesome video but my head is exploding", "likes": 0}}, {"topLevelComment": {"author": "Janath Herath", "text": "good job", "likes": 0}}, {"topLevelComment": {"author": "NullPointer", "text": "I'm not sure I agree with the thing about \"software development has never been easier\" :D It rather has never been so accessible I think...", "likes": 2}}, {"topLevelComment": {"author": "Jensen Raylight", "text": "so? Microservice = Docker ??", "likes": 1}, "replies": [{"author": "CodeWithRay", "text": "Yeah", "likes": 0}]}, {"topLevelComment": {"author": "The Business Analyst Pandit", "text": "Excellent piece of Information (Y)", "likes": 0}}, {"topLevelComment": {"author": "Kowshik Moyya", "text": "Very well explained! Thanks for the video", "likes": 0}}, {"topLevelComment": {"author": "Ravikumar", "text": "Great 👍 make more videos please", "likes": 0}}, {"topLevelComment": {"author": "My music", "text": "Software used to be fun 20 years ago - Now its just hard work.", "likes": 9}, "replies": [{"author": "一本のうんち", "text": "@Ivan Kurnia all these large google level scale paradigms are applied to really basic stuff nowadays like even brochure websites. development is impenetrable for newbies nowadays as they are met with a wall of jargon technologies services that are not even needed but that are endorsed by gatekeeping guardians.", "likes": 2}, {"author": "Gabriel Medeiros", "text": "you must be outta your mind.", "likes": 0}, {"author": "Antio", "text": "Actually the opposite man!\nProgramming without stack overflow, youtube and millions solutions available for you is HARD WORK!\nRespect to veterans programmers", "likes": 3}, {"author": "Ivan Kurnia", "text": "everything large scale needs hard work duh", "likes": 0}, {"author": "El Chingon", "text": "What? Its still fun today. Sounds like you just can't get with the times imo.", "likes": 0}]}, {"topLevelComment": {"author": "justin ching", "text": "the fact that you used visuals here was a game changer. this is such an efficient way of explaining things", "likes": 172}, "replies": [{"author": "mmahal", "text": "man I second this, this video singlehandedly consolidated everything. Game changer.", "likes": 2}]}, {"topLevelComment": {"author": "Lightwatch", "text": "That big picture explanation at the end was amazing, thank you so much!!!", "likes": 0}}, {"topLevelComment": {"author": "Adem Tepe", "text": "Cool!", "likes": 0}}, {"topLevelComment": {"author": "Ravi Srinivasan", "text": "Very nicely done", "likes": 0}}, {"topLevelComment": {"author": "Siddhant Roy", "text": "really good phew but quite a mouthful...I have just heard about microservices and this 3:47 minute video came in my recommendations so thought to check it out didnot thought it would be this informative", "likes": 0}}, {"topLevelComment": {"author": "ayoola fakoya", "text": "That ahaaa! moment , and why ❔", "likes": 0}}, {"topLevelComment": {"author": "Rodolfo Vitangcol", "text": "Business Opportunity in Ruvol\r\n\r\nI have invented a Board Game [still unpublished and not yet out in the market] that I believe is guaranteed to be as challenging and exciting as CHESS.  I called it “RUVOL.”  \r\n\r\nIt is my hope that one day Ruvol may surpass chess as the “Number One Board Game in the World.” \r\n\r\nThe weakness of chess is it always starts in fixed positions that the opening moves become “memorizable.”  In fact, not a few have so mastered the moves that they can play against their opponents “blindfolded.”  It is for this very reason that the great Bobby Fischer introduced his so-called “Fischer Random Chess,” where the starting position of the pieces is “randomized” to make the memorization of openings impracticable.  Fortunately, it is also for this reason that I invented Ruvol where “every game” has been calculated to be a challenging one to play.\r\n\r\nHOW IS RUVOL PLAYED and HOW YOU CAN MONETIZE IT?\r\n\r\nI detailed everything in my YouTube video.  Here is the link:  https://www.youtube.com/watch?v=jcqth0m3-R0\r\n\r\nBIG MONEY POTENTIAL IN RUVOL!\r\n\r\nIt is worthwhile to note that the people who play chess will be the same people who will play Ruvol.  In my Google search, I learned there are around 800 million chess players in the world.  Even just a small percentage of these 800 million is good enough to earn big money from Ruvol either as an ONLINE GAME BUSINESS or as a PHYSICAL PRODUCT DISTRIBUTOR.\r\n\r\nYou may contact me at:  rodolfovitangcol@gmail.com.   \r\n\r\nThanks and God bless!\r\n \r\nRODOLFO MARTIN VITANGCOL\r\nThe Ruvol Inventor", "likes": 0}}, {"topLevelComment": {"author": "Coding Boot", "text": "Which software used to create this video?", "likes": 0}}, {"topLevelComment": {"author": "BackOffer", "text": "Ah yes, sits in Iraq", "likes": 1}}, {"topLevelComment": {"author": "Sahil", "text": "Bruh This solved all of my Doubts\nyou saved me a lot of hassle", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Lemine Ahmed Yacine", "text": "I had been struggling for a long time to understand what's microservices mean. thank you, keep it up", "likes": 4}}, {"topLevelComment": {"author": "Gerry Wowiling", "text": "the subtitle tho..which sits in Iraq, i almost laugh  \"a rack\" become Iraq", "likes": 3}}, {"topLevelComment": {"author": "n k", "text": "\"which runs on server.. which sits on IRAQ' this is what the subtitle says.. I got confused for a while then I realised he meant - 'sits on a rack' hahahahhahahhaha", "likes": 55}, "replies": [{"author": "Bernie Midgard", "text": "I explicitly turned on subtitkes to evaluate that - now this fact explains a lot for me  ;-)", "likes": 1}, {"author": "Suheyl A.", "text": "Lol, that's why it's on fire!", "likes": 3}, {"author": "Gerry Wowiling", "text": "exactly", "likes": 0}]}, {"topLevelComment": {"author": "Kevin Mukam", "text": "Very well explained, thank you for this", "likes": 0}}, {"topLevelComment": {"author": "vinny142", "text": "1:05 \"tigh couplings that are hard to break up\"\nA) no it doesn't and B) they don't have to be broken up.\n\n1:10 \"If a progam is too  big it is impossible to run on a typical machine\"\nJust how big do you think a website gets?\n\n2:12 \"with amazon taking care of the hardware and hypervisor level\"\nwhich is *EXACTLY* what *ANY* hosting company does for you. Stop pretending that it's either AWS or self-hosting, that is a very dishonst presentation. A big fat LIE.\n\n\nThis is an Amazon commercial, that shamelessly lies about how bad a monolith is, it LIES IN YOUR FACE to promote Amazon. It's pathetic.", "likes": 7}, "replies": [{"author": "v i r a l  - posts", "text": "underrated comment", "likes": 0}]}, {"topLevelComment": {"author": "Василь Кобрій", "text": "Great video, thanks!", "likes": 1}}, {"topLevelComment": {"author": "José Costa", "text": "Microsoft Azure isn't competing with Amazon and Google?", "likes": 6}, "replies": [{"author": "Zernab Gohar", "text": "I think the whole point of bringing up Google competing with AWS is because the video brings up kubernetes, a product by Google", "likes": 2}, {"author": "Alex Vasiluță", "text": "Yes, it is", "likes": 1}]}, {"topLevelComment": {"author": "Robert Burnett", "text": "That sowed a few things together for me!  So clear.", "likes": 2}}, {"topLevelComment": {"author": "Akshaya Kumar", "text": "Absolutely loved this video! What a clear visualized way to explain the micro-service concept and the relevant present day software that accommodate this!", "likes": 27}}, {"topLevelComment": {"author": "Deepak Shinde", "text": "Excellent video helpful", "likes": 0}}, {"topLevelComment": {"author": "Endoscopisis", "text": "Finally, a clean fucking explanation.", "likes": 6}}, {"topLevelComment": {"author": "Tucker Troyer", "text": "Great video!", "likes": 1}}, {"topLevelComment": {"author": "Muhammad Ahmed Javed", "text": "This is beyond my understanding", "likes": 31}, "replies": [{"author": "c_a", "text": "It was beyond my understanding too months ago, now its not after getting some hands on experience with Google qwiklabs", "likes": 0}, {"author": "Salduwadae Estiyana", "text": "Lol don't feel bad, I'm trying to wrap my mind around this as well. Looks like it's time to hit some books hard!", "likes": 2}]}, {"topLevelComment": {"author": "Mate Ajduković", "text": "Great video but background music is so annoying.", "likes": 3}}, {"topLevelComment": {"author": "Rahul Pahuja", "text": "Superb", "likes": 0}}, {"topLevelComment": {"author": "Joe Wong", "text": "That was a great intro thank you and please continue", "likes": 8}}, {"topLevelComment": {"author": "Sa Noticias", "text": "If you could provide the text of this presentation that would help, too many new words to look up the definitions for each term.", "likes": 11}, "replies": [{"author": "Tulsi Khatri", "text": "Someone commented whole text in comment section.", "likes": 0}, {"author": "Zes", "text": "wrr", "likes": 0}]}, {"topLevelComment": {"author": "Daniel N", "text": "Cool.", "likes": 0}}, {"topLevelComment": {"author": "Tech n Dev", "text": "Thanks", "likes": 1}}]}