{"video": {"id": "jh86NGG9jdE", "title": "Answering tricky JavaScript interview questions", "description": "We all work in our respective silos when writing JavaScript, be it a framework or library. After a few years working as a Front-end dev, I looked at a list of \"JS interview\" questions and realized that I couldn't answer many of them (at least not well). So I set out on a long, somewhat lonesome journey of JS discovery, and am pleased to share my findings with you, in the form of a talk.\n\nRegardless of how you feel about getting asked random questions meant to trick you up in an interview (you should be appalled), my talk will cover some basic JS subtleties, and hopefully fill in some knowledge gaps w/r/t:\n- Hoisting and variable scope\n- Expressions v. statements\n- Undeclared v. undefined v. null\n- Equality comparisons\n- How to properly walk out if an interviewer asks you to do fizz buzz\n\nThis talk was given at Nodevember 2016 by Russell Anderson.\n\nCheckout the Nodevember channel for more great talks: https://www.youtube.com/channel/UC7z0nOE8ITfrGnXJgNzYaEQ\n\nThis talk is under the creative commons license. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT35M16S", "likes": "1671", "views": "59882"}, "comments": [{"topLevelComment": {"author": "Guru", "text": "He's a Christian. He mentions this to his bio. I'm speechless. Proud Christian. 🤮🤢", "likes": 0}}, {"topLevelComment": {"author": "Beauté", "text": "Don't use double equals! Thank me later", "likes": 1}}, {"topLevelComment": {"author": "Wintur윈터", "text": "him saying \"um\" is really distracting. I have adhd. 😭", "likes": 0}}, {"topLevelComment": {"author": "Jibin Babu", "text": "Let and const are also hoisted. But they are in temporal dead zone", "likes": 2}}, {"topLevelComment": {"author": "Muhammad Yousuf", "text": "23:16  what?? 0 is what??", "likes": 0}}, {"topLevelComment": {"author": "IsayanBros", "text": "The title is deceptive. Turns out the most basic javascript questions are considered “tricky” by this guy. I started watching this video with completely different expectations as of what “tricky” constitutes.", "likes": 0}, "replies": [{"author": "Guru", "text": "He mentions he's a Christian in the beginning. What else did you expect?", "likes": 0}]}, {"topLevelComment": {"author": "David Turner", "text": "He has a developer job and can't do a simple fizzbuzz? What am I doing with my life?!", "likes": 0}}, {"topLevelComment": {"author": "Nitesh Tak", "text": "You question for hoisting your answer is incorrect , kindly check it again , it will not throw any error", "likes": 0}}, {"topLevelComment": {"author": "my name", "text": "\"so you wanna be a chef here ? tell me how to write a cookbook then ...\"\n\"im a chef not a writer i can cook if you want\" \n\"ok i dont think youre right for us \" \nthats how dumb coding interviews are", "likes": 6}}, {"topLevelComment": {"author": "joey alfaro", "text": "The way it was explained to me no one wants to train the code monkeys. Start up just wants to exploit you. Stepp leaning curve to figure out computer is stupid just freezes because it doesn't understand. Their is guy that figured it out Fredrik Christenson hed on here he will help you understand whole picture.", "likes": 0}}, {"topLevelComment": {"author": "web boss", "text": "00:00 Introduction\n00:19 About Russell Anderson\n01:57 Inspiration for the talk\n02:22 Brad Frost's responses to HTML5 Boilerplate frontend developer interview questions\n03:54 Are interview questions a good idea?\n04:48 Explain event delegation\n05:59 Describe event bubbling\n06:30 How event bubbling and delegation works in practice\n08:05 What's the difference between \"target\" and \"currentTarget\"\n08:35 Explain why function foo(){}() doesn't works as an IIFE\n09:16 Explain the difference between writing a function as a statement and an expression\n12:14 Why in general is a good idea to leave the global scope of a website as-is and never touch it?\n13:17 Explain \"hoisting\"\n18:13 What do we do with the knowledge of hoisting?\n19:22 What is the difference between a variable that is null, undefined or undeclared?\n26:36 What is the difference between == and === ?\n28:25 You are hired!\n28:52 Closing remarks\n30:32 Questions and Answers", "likes": 9}}, {"topLevelComment": {"author": "Frank Johnson", "text": "I'm sure this is a cool video, but can the thumbnail be updated to match the person speaking?", "likes": 13}, "replies": [{"author": "Frank Johnson", "text": "@TokyoXtreme yeah agreed, that's why I felt let down by the actual video not matching the thumbnail.", "likes": 1}, {"author": "TokyoXtreme", "text": "Gotta amplify diversity and inclusivity and marginalized conquered peoples.", "likes": 3}]}, {"topLevelComment": {"author": "someone", "text": "correction:\nlet foo=null\ntypeof foo // return \"object\" as string 😀", "likes": 0}}, {"topLevelComment": {"author": "Hasan Said", "text": "These interview questions are only going to get worst and harder because of the amount of devs available now a days smfh.", "likes": 2}, "replies": [{"author": "csuszka", "text": "The reality is that if you don't know these things, you won't be able to debug your code efficiently, because you won't know why your code behaves in a specific way.", "likes": 2}]}, {"topLevelComment": {"author": "Pawan Deore", "text": "I know 80% answers does that mean I am 7/10 in JavaScript.🤔", "likes": 3}}, {"topLevelComment": {"author": "DarrewIP", "text": "5:00 start from here to save you some time ;)", "likes": 15}}, {"topLevelComment": {"author": "Craig", "text": "It was helpful! Thanks!", "likes": 2}}, {"topLevelComment": {"author": "Breade The van", "text": "He lost me when he said christian", "likes": 8}, "replies": [{"author": "TokyoXtreme", "text": "You triggered bro?", "likes": 0}]}, {"topLevelComment": {"author": "Just Mea YT ", "text": "thanks!", "likes": 0}}, {"topLevelComment": {"author": "Keith D Commiskey", "text": "In lieu of random technical questions, I would love the opportunity to go into detail in any one of my projects---some of which are open source. While discussing the code, you'll get technical know-how right alongside how I came up with solutions to situations. Let's not interview; let's code!", "likes": 1}}, {"topLevelComment": {"author": "utubewatcher806", "text": "32:21 nailed it!  if you're getting an interview that is completely based on knowing terms and techniques of the tools, run to the nearest exit.  Usually a sign that the interview panel doesn't have a grasp on delivery and is focused on tools.", "likes": 12}, "replies": [{"author": "GG SAY", "text": "Actully it's kinda basic.", "likes": 0}]}, {"topLevelComment": {"author": "Marc Droz", "text": "why people here are so triggered about this individual literary taking 3 seconds out of a 35 minute interesting talk to share his world-view. ...3 seconds! ...didn't even made it a big deal! lul", "likes": 5}, "replies": [{"author": "Frank Vee", "text": "Just curious to know... would you feel the same if he had taken the time to mention he is atheist?", "likes": 1}]}, {"topLevelComment": {"author": "Yorumcu Turk", "text": "I'm Muslim. I been developing software and web application since 15 years..............................................", "likes": 5}}, {"topLevelComment": {"author": "Yorumcu Turk", "text": "No need to know who exactly you are, whats your religion, your parents...etc.  \nWhen I start reading books about programming languages, the authors wrote about their life, what they drinking when they writing the book, about wheather...etc. First 100 pages of the book are empty talk.  Just teach! Stop wasting the our time. We boring!  We are stop watching or reading and can't learn anything.", "likes": 4}, "replies": [{"author": "Rayaqin", "text": "\"we boring\" means that you are boring, \"we are bored\" means that you feel bored, and whatever activity you are engaged in is boring\n\nmight wanna learn that\n\nalso you can skip ahead easily, if you don't care", "likes": 2}]}, {"topLevelComment": {"author": "Vikas KM", "text": "Nice talk.. 👍👍 learning JavaScript and loving it", "likes": 6}}, {"topLevelComment": {"author": "sudhansu choudhary", "text": "8:10 complete bullshit! please research even.target and event.currentTarget, 13:40, not the definition of hoisting,. please research on what you are going to talk about! freeCodeCamp.org, expect better from you!", "likes": 0}, "replies": [{"author": "Abhay Agarwal", "text": "You are a dumbass if you think what he said was wrong . Lol go educate yourself first.", "likes": 0}]}, {"topLevelComment": {"author": "Hassan Ben haj bouih", "text": "this was very informative thank you, i learned a lot.", "likes": 3}}, {"topLevelComment": {"author": "Krisztián Kugler", "text": "The definition of hoisting is completely inaccurate here. Nothing is \"declared / moved to the top\" as many sources claim.", "likes": 5}, "replies": [{"author": "hay ben", "text": "Yes, I agree with you guys.\nLet, and const are \"hoisted\" but don't get initialized, and they are not accessible until the JS Engine hits the line that they are declared on.", "likes": 0}, {"author": "Chris Elwell", "text": "Also, let and const are indeed hoisted, but they are just not ‘initialized’", "likes": 3}, {"author": "Ayaz Hussain", "text": "You are right, nothing goes up physically but all the definations of variables and functions got there memory allocations in the stack at compile time,  It is Hoisting.", "likes": 3}]}, {"topLevelComment": {"author": "Gabe Zoidberg", "text": "You lost me at \"I'm a christian\"", "likes": 5}, "replies": [{"author": "Jordan Sinclair", "text": "You sound like a very open-minded person.", "likes": 9}, {"author": "Gabe Zoidberg", "text": "Religious people are weird, that just HAVE to talk about something that doesn't exist. He also likes golf. meh.", "likes": 2}, {"author": "Language Learning Experiences", "text": "louis jeddou je suis d'accord avec vous...", "likes": 0}, {"author": "Loudkill_", "text": "c'est pas un drame en soi", "likes": 0}]}, {"topLevelComment": {"author": "D", "text": "Why do really religious people always bring up that they are religious whenever they give a talk on a completely unrelated topic?", "likes": 30}, "replies": [{"author": "Leonardo Martins", "text": "He just said he is a Christian, it took literally less than 3 seconds, why are people making such a big deal out of it? It wasn't like he started to preach or anything. I see people complaining how Christians are intolerant, but they can't stand someone just mentioning his faith.", "likes": 1}, {"author": "José Tandavala", "text": "It is my impression or in this world, it can no longer be said that I am a Christian. \nlet the man introduce himself before doing his job just that. Don't buy what he sold that's okay, you don't need to storm the water glass", "likes": 0}, {"author": "D", "text": "@Wheat and Tares If you're going to answer your own question, why bother asking it? But in fact, if you find me a video of a muslim or a hindu bringing up their religion in a JavaScript video, I will post the same comment there. Not sure what point, if any, you're trying to make.", "likes": 0}, {"author": "Wheat and Tares", "text": "I wonder if you wouldve asked the questions if a muslim or a hindu briefly mentioned that in his short introduction. I'd guess no.", "likes": 0}, {"author": "Dal Dalron", "text": "@David Fernandez Good ol' Christian lies.", "likes": 0}]}, {"topLevelComment": {"author": "Simone Icardi", "text": "Nice to know that I'm not the only one to find this kind of questions often, not so relevant to spot a good dev.", "likes": 15}, "replies": [{"author": "my name", "text": "coding interviews are so badly done . ive never had a single question that is actully relevant to my job . thats like asking a chef how to write good recipe books instead of getting them to cook", "likes": 1}]}, {"topLevelComment": {"author": "Rafał Foltyński", "text": "Very good presentation, I learn a lot. Maybe sameone have a link for this list of questions which was on the 28:46?", "likes": 7}, "replies": [{"author": "Red Death", "text": "Rafał Foltyński\n2:10", "likes": 3}]}, {"topLevelComment": {"author": "State Of The Art", "text": "First", "likes": 2}, "replies": [{"author": "Gonzalo Espeche", "text": "your life goals are interesting.", "likes": 6}]}]}