{"video": {"id": "jhEfT9YjLcU", "title": "Easily code a virtual reality web experience with A-Frame (WebVR)", "description": "With Mozilla's free framework A-Frame, anyone who can write HTML can create a virtual reality app, and anyone who knows JavaScript can animate the scene. In this video, Benji walks through an example, starting from scratch.\n\nA-Frame:\nhttps://aframe.io/\n\nCode:\nhttps://github.com/okaybenji/a-frame-demo\n\nDemo:\nhttps://okaybenji.github.io/a-frame-demo/\n\nThanks to Goldfire Studios for setting aside time for employees to work on their own projects.\nhttp://goldfirestudios.com\n\nYou can follow Benji on Twitter @okaybenji\nhttps://twitter.com/okaybenji\n\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT10M58S", "likes": "1053", "views": "47904"}, "comments": [{"topLevelComment": {"author": "吕明慧", "text": "how to put this vr scene into google cardboard?", "likes": 0}}, {"topLevelComment": {"author": "FastLane FILMS", "text": "Great video, got a project im working on and i was wondering if its possible to upload a 3d picture the same way instead of the sphere and such? thanks", "likes": 0}}, {"topLevelComment": {"author": "geelemo", "text": "Is there any full course that goes in-depth into 3d animation with or without VR", "likes": 0}}, {"topLevelComment": {"author": "Antonio Fuller", "text": "Three.js is already easy enough, A-frane just makes autopilot LMAO", "likes": 0}}, {"topLevelComment": {"author": "Khalid Benjelloun", "text": "Cool and Interesting, Glad to meet ya Benji! Khalid from Fes, Morocco.", "likes": 1}}, {"topLevelComment": {"author": "Nathan Helm-Burger", "text": "Thanks!", "likes": 1}, "replies": [{"author": "Nathan Helm-Burger", "text": "I love doing little programmatic art projects in javascript with simple animated geometric figures, and I thought: \"how awesome would it be if I could make a VR version of this? I wonder if that's easy to adapt from the regular javascript? I wonder if there's someone who made a tutorial video to show this?\"\nBam. Exactly what I was hoping for. Time to make some simple animated art, and risk making myself seasick with too many twirling spheres and cubes...", "likes": 2}]}, {"topLevelComment": {"author": "gamer", "text": "Thanks a lot", "likes": 1}}, {"topLevelComment": {"author": "Adrish & Anish", "text": "I am facing problem in playing it in mobile chrome browser, it says unable requests to browser to enjoy immersive mode", "likes": 0}}, {"topLevelComment": {"author": "Studylicious", "text": "Sir, I have made a VR headset and it's hand controller. But I am so so so much confused that how can I make a game for it. \nSir, can you please make a video over it? \nWhatever your answer may be, but please do reply sir", "likes": 0}}, {"topLevelComment": {"author": "Galih Ridho Utomo", "text": "Sir, not work", "likes": 0}}, {"topLevelComment": {"author": "Jacob Anderson", "text": "Thanks for the clear video", "likes": 2}}, {"topLevelComment": {"author": "Brandon W.", "text": "Just started looking into VR using js and this video is amazing.", "likes": 4}}, {"topLevelComment": {"author": "Christopher Warrior", "text": "I have an idea for a new VR project. Can I email you the idea? I need help building it and was hoping you could point me in the right direction.", "likes": 0}}, {"topLevelComment": {"author": "Tyler Warcup", "text": "How can you move on the z plane? For instance walk forward and backward.", "likes": 0}, "replies": [{"author": "BenjiJS", "text": "You should be able to move around just by pressing the arrow or WASD keys.", "likes": 0}]}, {"topLevelComment": {"author": "Fahad Ali", "text": "Sir awasome project thanks for shareing", "likes": 2}}, {"topLevelComment": {"author": "댕청", "text": "thank you teacher", "likes": 2}}, {"topLevelComment": {"author": "chad palmer", "text": "Im a beginner, that texture did broaded horizons.", "likes": 2}}, {"topLevelComment": {"author": "Jeffrey McFarland", "text": "Great videos both in terms of content and presenter presentation!. I'll be sharing with the group WebXR at: https://webxr.groups.io/g/main", "likes": 1}}, {"topLevelComment": {"author": "Null Void", "text": "Thanks!", "likes": 2}}, {"topLevelComment": {"author": "Ankit Tiwari", "text": "Hey,buddy thanks for the tutorial but the ball and plane is not appearing on my computer screen.", "likes": 0}}, {"topLevelComment": {"author": "inpace1", "text": "Thanks a lot ! :)", "likes": 2}}, {"topLevelComment": {"author": "Dóndevivir Tecnologías para el Negocio Inmobiliario", "text": "Great work. Do you know how to use a IP camera (wifi camera)  with webVR javascript and HTML5 (A-Frame, Three.js) .?. I'm looking for code examples to use  an external camera for smartphone.", "likes": 0}}, {"topLevelComment": {"author": "Hussain Salih", "text": "Good", "likes": 2}}, {"topLevelComment": {"author": "Nipho Twala", "text": "Ok, This was awesome!", "likes": 5}}, {"topLevelComment": {"author": "Malorie C", "text": "This is so cool! Thanks for sharing!", "likes": 1}}, {"topLevelComment": {"author": "arber.studio", "text": "Can you import WebVR projects to be viewed in a native VR app? I can't find any info on this", "likes": 0}}, {"topLevelComment": {"author": "Caleb Prenger", "text": "What does math.sin do?", "likes": 0}, "replies": [{"author": "BenjiJS", "text": "It's a sine wave function. It's commonly used as an easing function in coded animations. Can be used for instance to make things bob up and down.\nhttps://en.wikipedia.org/wiki/Sine_wave\nhttps://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Math/sin", "likes": 0}]}, {"topLevelComment": {"author": "Elly Potamianos Illustrations", "text": "I'm literate with computers, but I have not studied HTML.  As an artist, I find this spectacular to animate designs on your own.   Bringing a Surrealistic composition to life would be a dream of mine.  I will look into your A-Frame when I have some time.  My search that brings me to your video at this time is to find a way to post an HTML virtual exhibit to an HTML widget.  It begins with \"object\" but requires \"iframe.\"  Without changing the HTML code, I know that there is an HTML code sentence that one can implement prior to such an \"object\" HTML code, but I don't know it.  It seems not too many people in IT at the website I'm trying to post know either.  It would help tremendously if you knew.", "likes": 0}}, {"topLevelComment": {"author": "Rico Robinson", "text": "This is awesome, I was waiting for an easy, intuïtive way to add VR to the web.\nKnow any way to make it interactive? With gaze or something?", "likes": 4}, "replies": [{"author": "Rico Robinson", "text": "Benji Kay Perfect. Thanks!", "likes": 2}]}, {"topLevelComment": {"author": "Hassan Abudu", "text": "Killer video! I learned an incredible amount. I have one question for you - is there any particular reason you're using arrow notation to define functions like \"shiftHue\"? Is this now a JavaScript \"design pattern\"?", "likes": 2}, "replies": [{"author": "Ariel Blasi", "text": "Nowadays we use those fat arrows for functions, it's part of the new Javascript spec", "likes": 0}, {"author": "Benji Kay", "text": "I don't think it's a design pattern, just personal preference. To me, it's cleaner and easier to read and results in fewer lines of code. But you do you!", "likes": 0}]}, {"topLevelComment": {"author": "Mohamed Fizerali", "text": "i using Windows, i used notepad for html, when i run in mozilla or chrome it shows nothing. in address tab it shiw the directory name,filename.html. it shows only blank, pls help fixing this issues", "likes": 0}, "replies": [{"author": "Benji Kay", "text": "I don't want to hate on Notepad! I wrote my first websites in Notepad and it's dear to my heart for its simplicity. But Khanh is right -- you should upgrade. I use Brackets and I love it. It's also free and open source. http://brackets.io The other editors suggested are also great options.", "likes": 1}, {"author": "Trần Khanh Huỳnh", "text": "Can you give us your code?", "likes": 1}, {"author": "Trần Khanh Huỳnh", "text": "I'd like to interject for a moment. Notepad is terrible. Use VS Code/Atom/Vim/Sublime Text instead, it is similar to Notepad but better. _I am using Atom_.", "likes": 0}, {"author": "BenjiJS", "text": "¯\\_(ツ)_/¯ I'd have to see the code! You could also try copying the code from the Github repo in the description and see if it works for you.", "likes": 0}, {"author": "Mohamed Fizerali", "text": "i just coded script and a-scene.  it is enough for single sphere view haa . am i right mate.", "likes": 0}]}, {"topLevelComment": {"author": "Хангелді Iлебаев", "text": "Cool thing !", "likes": 2}}, {"topLevelComment": {"author": "Aqib Shah", "text": "Big props for using native JS instead of including the jQuery library! Lol.", "likes": 19}, "replies": [{"author": "Antonio Fuller", "text": "LMAO", "likes": 0}, {"author": "BenjiJS", "text": "Haha XD thanks", "likes": 1}]}, {"topLevelComment": {"author": "fredy mendez", "text": "a-frame link is wrong.", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Fixed.", "likes": 0}]}, {"topLevelComment": {"author": "Emmanuel Ogba", "text": "Familiar with Aframe but didn't know you could make a sphere change color automatically, pretty cool.", "likes": 4}, "replies": [{"author": "Emmanuel Ogba", "text": "BenjiJS I will, it's been a while since I visited their site", "likes": 1}, {"author": "BenjiJS", "text": "Yeah, there are all sorts of things you can do, you're really just limited by your imagination. Animating by adjusting prop values is just one approach. You could also, for instance, change positions based on user input to create interaction. I'd recommend checking out the other examples on A-Frame's site if you're interested!", "likes": 1}]}, {"topLevelComment": {"author": "Srujan Mhase", "text": "This is gold👌👍", "likes": 20}, "replies": [{"author": "Shan Ruan", "text": "Pure gold", "likes": 0}, {"author": "BenjiJS", "text": "Thanks, super glad you enjoyed it!!", "likes": 3}]}, {"topLevelComment": {"author": "Luke S.", "text": "Second Comment", "likes": 0}}, {"topLevelComment": {"author": "Sarang S", "text": "First Comment", "likes": 0}, "replies": [{"author": "Benji Kay", "text": "Sarang S y tho", "likes": 0}]}]}