{"video": {"id": "JQ_BCly-heU", "publishedAt": "2015-07-17T08:31:55Z", "title": "Computer Basics 20: What Do Programmers Do?", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n  Programmers (a.k.a. coders, developers, or software engineers) solve problems by turning big ideas into tiny steps that a computer can understand.\n  In this video, we'll discuss what programmers do.\n  Programmers can also be called coders, developers, or software engineers, and what all of these peple do is take ideas and turn them into functional code.\n  It's not just creating that code, but also maintaining it.\n  Let's look at how the computer looks at code, specifically javascript.\n  The computer looks at code one line at a time, and as you're writing code, you will notice numbers on the left hand side.\n  The computer literally goes down line by line, making sense of what each line has to say.\n  Everything is done sequentially, just straight down, so refrencing something that is below and hasn't happened yet will lead to a problem.\n  Computers just read straight down like you would read a book.\n  Programmers are the ones responsible for breaking their ideas down into the little tiny steps and writing them in a way that computers can understand them.", "duration": "PT1M32S", "likes": 0, "views": "21083"}, "comments": [{"topLevelComment": {"id": "UggufbAmdR4weXgCoAEC", "publishedAt": "2016-10-30T18:18:37Z", "author": "Enside Tux", "text": "well it was concise", "likes": 0}}, {"topLevelComment": {"id": "UgjJYyz2UV3MAXgCoAEC", "publishedAt": "2016-10-20T19:00:17Z", "author": "Thawing Zone", "text": "I feel like the sequential point in JS isn't entirely accurate... for example hoisted functions", "likes": 3}}, {"topLevelComment": {"id": "UggrOiV-oRg_NXgCoAEC", "publishedAt": "2016-09-22T20:08:07Z", "author": "kristofkallo", "text": "More like Biana.isHungry().", "likes": 2}}, {"topLevelComment": {"id": "UghBVveNMc_EM3gCoAEC", "publishedAt": "2015-08-02T04:10:17Z", "author": "sajid ali mudassar", "text": "What is the difference between a Coder, Developer and Software Engineer?", "likes": 5}, "replies": [{"id": "UghBVveNMc_EM3gCoAEC.82L-PIece608LTx-Stwfhl", "publishedAt": "2016-11-19T21:30:12Z", "author": "Dihydrogen Monoxide", "text": "They are all different names for the same job.", "likes": 6}]}]}