{"video": {"id": "KFmn8sWSYuU", "publishedAt": "2018-06-25T14:25:46Z", "title": "How to achieve reusability with React components", "description": "React's component model makes it easy to reuse UI code, but reusing components across projects, applications, and teams is only possible if developers can find, install, and rely on each other's code. @walmartlabs, we have hundreds of developers working across dozens of teams, and one of the biggest obstacles to their productivity is duplication of work that's already been completed elsewhere in the organization. In this talk, you'll learn about the technical means we used to achieve this goal, and the processes and policies that facilitate and encourage code reuse throughout @walmartlabs.\n\nTalk given by Alex Grigoryan at Node Summit 2017.\n\nThanks to Node Summit for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT22M31S", "likes": "244", "views": "17907"}, "comments": [{"topLevelComment": {"id": "UgwqYW5ke3Rf-n888mN4AaABAg", "publishedAt": "2021-04-04T15:39:49Z", "author": "Divine Zeal", "text": "For people who say working at Walmart isn’t a good job", "likes": 0}}, {"topLevelComment": {"id": "UgxBYiHXIf4LHHIrI6h4AaABAg", "publishedAt": "2020-12-15T12:24:39Z", "author": "Avi Mehenwal", "text": "very nice, we are transiting from monolithic to component driven development for existing products. Got a question, are you using managed CI/CD tools/pipelines? or self-hosted? Would also like to know rational on your decision. Super thanks and stay awesome", "likes": 0}}, {"topLevelComment": {"id": "UgwGkqRslgiYlqqRlPt4AaABAg", "publishedAt": "2020-01-26T21:10:44Z", "author": "Kevin Muldoon", "text": "Brilliant! Business wants reusability/efficiency across the organization. This is a great goal, but I think you hit the nail on the head. It's not just a technical challenge but a philosophical change which requires organizational commitment. Not only is this change philosophical in nature, it's a fundamental cultural shift. Very difficult to change/align different cultures across different departments/silos, in effort to create efficiencies. It seems you've done an excellent job and I'm glad I ran across this video you've put together. Much thanks!", "likes": 1}}, {"topLevelComment": {"id": "UgzdMq-AnzlZbEx_YDR4AaABAg", "publishedAt": "2018-06-28T02:10:42Z", "author": "Arvil Meña", "text": "glad to hear insight from this philosophy. But I want to hear the statistics on how much time are these \"Meta meetings\" are consuming in the dev workflow. I want to know the insight of how cost-effective this philosophy is compared on just letting each organization use the framework they decided, avoiding these seemingly unnecessary workflow. Letting each organization just use and code on however and whichever they want breeds innovation.\n\nIf the concept they want is \"to make everyone stay on the same platform,\" then I think that they should had built a first class API or an SDK, instead of a reusable components. This still keeps all the organization on the same page, and let each organization choose which JS library or frontend tools they should use. That challenge he discussed at the end about innovation is not actually a \"challenge\" but the main limitation of this philosophy. This philosophy will just be breeding legacy software nobody wants to use. I also want to hear the insight of the developers working on this workflow, are they feeling innovative? or they think they are stuck on a system they can't use in the future.", "likes": 1}}, {"topLevelComment": {"id": "UgzKW9sikElRPrfSX0Z4AaABAg", "publishedAt": "2018-06-26T17:11:12Z", "author": "Simone Icardi", "text": "Nice speech", "likes": 0}}]}