{"video": {"id": "kGYGEcdPE2U", "title": "How to Speak the Language of Application Architecture", "description": "How do you begin to engineer the world's best software application? As you live in an Agile world today, how do you use architecture disciplines like Kruchten 4+1, UML, TOGAF, and Zachman? What do they mean? Where do you start?\n\nIn this talk, Brad Beiermann will take you on a journey through the past, present and future disciplines of being a software architect. This talk will equip you with the concepts of continuous design, and what it means to be design driven in today's fast paced development environment. \n\n🔗Slides: https://www.slideshare.net/BradBeiermann/the-language-of-application-architecture\n\nTalk by Brad Beiermann at the July, 17, 2018 meeting of Software Craftsmanship McHenry County. Their YouTube channel: https://www.youtube.com/channel/UCgQevmRtF0f_7d3vOVAUomw\n\nThis talk is under the creative commons license. freeCodeCamp is not associated with this talk but we are excited to share it with a wider audience.\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT1H52M34S", "likes": "336", "views": "17939"}, "comments": [{"topLevelComment": {"id": "UgxxAaJlrKFTkccMB5h4AaABAg", "publishedAt": "2022-09-27T12:32:21Z", "author": "TECH LEARN", "text": "Nice video but the sound wasn't very good", "likes": 1}}, {"topLevelComment": {"id": "UgzL7Pq1UPCnDydACut4AaABAg", "publishedAt": "2022-03-07T16:13:41Z", "author": "Pradnya J", "text": "Thank you for sharing this @freecodecamp. I like how the speaker provided a logical flow of how to work through the architecture through a real example. Such a simple explanation! The uml diagrams he walked through make so much more sense now!", "likes": 0}}, {"topLevelComment": {"id": "UgxAPVltQAk4p0XI4xB4AaABAg", "publishedAt": "2020-09-11T15:38:28Z", "author": "garry sohi", "text": "I know html, css, js, reactjs for frontend, python for backend, and mysql. Now I want to understand how to glue these together, build an application and deploy on server.\nWhat do I need to learn next?\nIs this the right video?", "likes": 1}}, {"topLevelComment": {"id": "UgxvUtWS85LItDeX1314AaABAg", "publishedAt": "2020-08-16T19:42:26Z", "author": "John MacIntyre", "text": "1:00:05 \"How do you know this?  Well it's on a ???? list.\"   \nWhat did he say?  A what list?", "likes": 0}, "replies": [{"id": "UgxvUtWS85LItDeX1314AaABAg.9CR5XSAFlrA9ZHGrRI8r7o", "publishedAt": "2022-03-07T16:11:04Z", "author": "Pradnya J", "text": "I think he said, \"it's on the kruchtens (model). \"", "likes": 0}]}, {"topLevelComment": {"id": "Ugw87uIKxVcgmdgScld4AaABAg", "publishedAt": "2018-12-09T03:42:06Z", "author": "Guillermo Arellano", "text": "This was incredibly eye opening. Who would’ve thought that design and planning would still be a vital part of Agile? I have been in many organizations lately where no design or architecture was modeled and all of a sudden new developers need to be onboarded and the original consultant is no longer with the team! Talk about expensive ramp up.", "likes": 5}}]}