{"video": {"id": "KibbYf9avko", "title": "How to Make a Custom Website from Scratch using WordPress (Theme Development) - 2019 Tutorial", "description": "Learn to create a completely responsive website from scratch using WordPress, HTML, CSS, JavaScpript, and PHP. Also, learn to create a custom WordPress theme.\n\nAfter watching this course you will have a solid understanding of how WordPress works and how to create your own custom theme in WordPress. \n\n🔗 Design Source Code: https://github.com/Godsont/Responsive-Website-Design\n\n🔗 Theme Source Code: https://gtcoding.net/product/gtcoding-wp-custom-theme/\n\n⭐️ Contents ⭐️\n⌨️ (0:00:00) Intro and Demo\n⌨️ (0:00:55) Research & Planning\n⌨️ (0:10:52) UI Design - The Front Page\n⌨️ (0:27:47) UI Design - CSS\n⌨️ (0:59:07) UI Design - JavaScript\n⌨️ (1:05:11) UI Design - More Pages\n⌨️ (1:20:43) PHP Basics\n⌨️ (1:58:31) Installing WordPress locally\n⌨️ (2:03:05) WordPress - style.css file\n⌨️ (2:11:47) WordPress - linking CSS and JS\n⌨️ (2:23:17) WordPress - Custom Post Type\n⌨️ (2:33:31) WordPress - Template Hierarchy\n⌨️ (2:43:29) WordPress - while loop\n⌨️ (2:54:52) WordPress - the Front Page\n⌨️ (3:11:44) WordPress - Blogs Index Page\n⌨️ (3:26:42) WordPress - Single Post Page & Comments\n⌨️ (3:52:59) WordPress - Sidebar & Search\n⌨️ (4:14:35) WordPress - Contact Form\n⌨️ (4:20:17) WordPress - Custom 404 Page\n⌨️ (4:24:19) Finishing Up\n\nOther Links:\n🔗 Template Hierarchy: https://developer.wordpress.org/files/2014/10/wp-hierarchy.png\n🔗 Link for the time formats in the_time() function: https://codex.wordpress.org/Function_Reference/the_time\n🔗 Comment Form: https://codex.wordpress.org/Function_Reference/comment_form\n\nCourse from GTCoding. Check out their YouTube channel: https://www.youtube.com/gtcoding\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org\n\nAnd subscribe for new videos on technology: https://youtube.com/subscription_center?add_user=freecodecamp", "duration": "PT4H27M14S", "likes": "8828", "views": "453936"}, "comments": [{"topLevelComment": {"author": "GTCoding", "text": "Hi guys, I hope you liked the tutorial. Timestamps for the different sections are given in the description. \rYou can subscribe to my channel for more web development tutorials. Here is the link:  https://www.youtube.com/gtcoding?sub_confirmation=1\r\r\n\n\nThanks to freeCodeCamp for sharing my course. Happy Coding! 👍👍", "likes": 159}, "replies": [{"author": "🔕 Hajji {    }", "text": "Helpful thanks 😊", "likes": 0}, {"author": "anoop garg", "text": "You need to improve your teaching style", "likes": 0}, {"author": "Chohee Jung", "text": "@GTCoding, Hi! :) thanks for the awesome video. I have a question, is it possible to add some plugin into custom theme such as woo commerce or membership plug in?", "likes": 0}, {"author": "ASHOK", "text": "Subscribed😗", "likes": 0}, {"author": "Sabih", "text": "@A. N. Install teamviewer or anydesk", "likes": 0}]}, {"topLevelComment": {"author": "Jamar Martin", "text": "so excited to see youre using local", "likes": 0}}, {"topLevelComment": {"author": "IAMZenju", "text": "what web server do you use?", "likes": 1}, "replies": [{"author": "IAMZenju", "text": "@Jo JoLaragon", "likes": 0}]}, {"topLevelComment": {"author": "Nolan Perrini", "text": "Great video!!!! i really like your \"doosions\"  ;P", "likes": 0}}, {"topLevelComment": {"author": "MaryKate Giarrocco", "text": "This tutorial is great!!\nI am having some trouble with finding the HTML for google fonts.  Can you provide any links?", "likes": 0}}, {"topLevelComment": {"author": "carter paul", "text": "You from India brother?", "likes": 0}}, {"topLevelComment": {"author": "Ankeet Singh 01", "text": "Hi everybody, just wanted to tell that this tutorial needs some modifications as of 2021 and I've commented some below that could help you along.  Sorry I could not post them in one comment because YT was not letting me to do that.", "likes": 0}}, {"topLevelComment": {"author": "GeorgesNgandeu", "text": "Bro, you are a wordpress god!!!!!!!!!! Too good!", "likes": 0}}, {"topLevelComment": {"author": "Gabriel Austin", "text": "Excellent, in-depth tutorial!!", "likes": 0}}, {"topLevelComment": {"author": "Ahmad Setiadi", "text": "Please give the english or bahasa translation in every post(video)", "likes": 0}}, {"topLevelComment": {"author": "Patrick Danoninho", "text": "Hello, great video and amazing work. If you dont mind, im having trouble making my navbar (i made my site differently from you) linking to other pages. When i press the about, instead of going to about.php, it goes to index.php. All links in my navbar do this. Please help, i would very much apreciate it. Thank you", "likes": 0}}, {"topLevelComment": {"author": "Philip Rahman", "text": "One of the best WordPress tutorials, you explained well and know how to teach steps by steps. I will be visiting your tutorials many more times. A big thanks from me for putting a nice course.", "likes": 0}}, {"topLevelComment": {"author": "Afzal Mahmud Hridoy", "text": "Thank you sir.", "likes": 0}}, {"topLevelComment": {"author": "Md Aval Aval", "text": "Thanks a lot and a lot.you really want people to learn something. This is really helpful for beggainers.", "likes": 0}}, {"topLevelComment": {"author": "Abbas Boxwala", "text": "Hello i m totally noob and new in coding and a friend of my recommended me to watch ur videos... But i m a bit confused as to where should i start from? Which course should I pick first and start... I just watched 10 mins of the WordPress video but could not really understand much... So do i need to watch any other course first? Please reply. \nThankyou", "likes": 0}, "replies": [{"author": "Harika", "text": "Hi, if you're totally new to web development, you might want to start by learning basic HTML, CSS and some Javascript. You can find beginner tutorials here on Youtube. Hope that helps.", "likes": 0}]}, {"topLevelComment": {"author": "Lau Kia Li", "text": "Thanks for you kind sharing! After watching your video, I understand more about how the theme works. I am at beginner stage and spent about 17 working hours to complete this.", "likes": 0}}, {"topLevelComment": {"author": "Ankita kolte", "text": "Can you please tell me what should be the size of the card image...", "likes": 0}}, {"topLevelComment": {"author": "Kevyyar", "text": "Why is every Wordpress site tutorial a blog? Can’t there be a regular marketing/informational site?", "likes": 0}}, {"topLevelComment": {"author": "Vjekoslav Ranogajec", "text": "1:10:00 If you look above the navbar, there is unnecessary empty space, like a top-margin for a navbar. However, after editing .page-heading, it disappeared. But not on my computer, I still have a big chunk of empty space above the navbar. It doesn't appear in my index.html, just in bloglist. It's super frustrating", "likes": 0}}, {"topLevelComment": {"author": "Vangelis Efthimiatos", "text": "@4:05:04", "likes": 0}}, {"topLevelComment": {"author": "Hemant Sankhla", "text": "BESTEST BEST BEST ULTIMATE BEST tutorial on wordpress development", "likes": 1}, "replies": [{"author": "Elon Musk", "text": "Bro, you have so many grammatical errors.", "likes": 0}]}, {"topLevelComment": {"author": "Mohammad Jabed Hosen", "text": "Sir , my archive page is not showing 3:19:45", "likes": 0}}, {"topLevelComment": {"author": "Maxim K", "text": "1 question: the function you've called \"gt_setup()\" on 2:17:38 is it custom name or it has to be this way?", "likes": 0}, "replies": [{"author": "Maxim K", "text": "@arash afshar thanks", "likes": 0}]}, {"topLevelComment": {"author": "منوعات monoaat", "text": "I don't have any experience in html and css is this video help me learn all things", "likes": 0}}, {"topLevelComment": {"author": "Israel Diniz", "text": "How can I open this tab that simulates the website on a mobile phone?", "likes": 0}}, {"topLevelComment": {"author": "Mixed", "text": "thanks teacher. :)", "likes": 0}}, {"topLevelComment": {"author": "Nuwan Thushara", "text": "Does anyone know where I can find a full tutorial on craftis wordpress theme? how to build a website using craftis theme or any similar one to craftis?", "likes": 0}}, {"topLevelComment": {"author": "Denis Ulita", "text": "hello sir I'm trying to create what you are sharing but my archive.php is not working for the Projects still showing index.php and when I created page.php for about the Projects also change to page.php.", "likes": 0}, "replies": [{"author": "Michał B", "text": "did you create page called projects?nvm just noticed, he didn't create this page too, but it worked for me.", "likes": 0}]}, {"topLevelComment": {"author": "Tee O", "text": "I'm considering starting a career in WordPress development, but I'm a little worried about the job outlook.  Do WordPress developers even code anymore or can the entire website be easily built using page builders?  Will there be a need for WordPress developers in ten years?  Twenty years?  Lastly, do WordPress developers often have to customize themes and plugins?  Any advice would be appreciated.", "likes": 0}}, {"topLevelComment": {"author": "monika singh", "text": "Sir please woocommerce custom  website video using proper code", "likes": 0}}, {"topLevelComment": {"author": "Adu Gyamfi", "text": "I was finding very difficult on where to start to become wordpress developer till i just watch this video. ❤❤ thank you for this video.", "likes": 0}}, {"topLevelComment": {"author": "Ankita Naik", "text": "Is it any harm if i download the vs in Window 7", "likes": 0}}, {"topLevelComment": {"author": "RM13", "text": "Please dont get anymore Indian guys for tutorials, their accents are super off putting and annoying.", "likes": 1}}, {"topLevelComment": {"author": "cherry", "text": "Freecode camp .. my real home <3 <3", "likes": 0}}, {"topLevelComment": {"author": "Nitin Suryawanshi", "text": "I have seen your video n it is nice 😊👍\nHow can I Improve Performance of Website with hosting like Godaady, bluehosht, hoshtgator & magicworkshost", "likes": 0}}, {"topLevelComment": {"author": "Satya Raj", "text": "Not visible in Mobile", "likes": 0}}, {"topLevelComment": {"author": "Dimitrios Pavlis", "text": "I found a misleading part of the video. While creating the Custom Comment Form, he did not try to post a new comment. He just displays the exisitng comments. The functionality that user applies does not work. I will post the the code for the comment form. I have checked it several times and the code just does not work while posting a new comment.", "likes": 0}}, {"topLevelComment": {"author": "Andrew Fleming", "text": "I like that styling background music by the way.", "likes": 1}}, {"topLevelComment": {"author": "Press Tech ➊", "text": "if anyone want to learn to make a wordpress theme from scratch this is the perfect solution \"ignore all other videos\" this is the right on \nis it worth  4 hours and is worth to watch several times when you glitch somewhere or get stucked.\nwell done and thanks.", "likes": 3}}, {"topLevelComment": {"author": "Andrew Fleming", "text": "This is a really good tut. I think it's getting a bit old at this point but it doesn't appear to be dated yet. The OP codes things slightly differently than what I've seen from the other tutorials I've followed so I highly recommend following through to the end with this video but also try out other teachers to get a well rounded skill-set. \n\nThanks so much for putting this together.", "likes": 3}}, {"topLevelComment": {"author": "abhishek singhal", "text": "also check staqlab-tunnel. This tool can host wordpress site on local pc and gives a public url. i share public url to give demo to client and boss", "likes": 0}}, {"topLevelComment": {"author": "Emir Hadzimehmedovic", "text": "I have a problem to connect the CSS file with the theme. I follow the tutorial and recheck everything but CSS simply doesn't work. Also, font awesome, and js doesn't work either.", "likes": 0}, "replies": [{"author": "Freelance Pixie", "text": "I had the same problem with font awesome. :(", "likes": 0}]}, {"topLevelComment": {"author": "MOULA Raoul", "text": "Thank you so much!!", "likes": 0}}, {"topLevelComment": {"author": "Static Shockaa", "text": "the functions get_header and get_footer have the red wavy line under them but they do work. What extension do i put on VScodes to get it to Stop showing ?", "likes": 0}}, {"topLevelComment": {"author": "Daylightkiller", "text": "Good", "likes": 0}}, {"topLevelComment": {"author": "Clary Valentine Morgenstern", "text": "I stucked right at 3:14:39. After I deleted some code as he said and remained this:\r\n\r\n<?php\r\n\t\twhile (have_posts()) {\r\n\t\t\t\tthe_post();\t\r\n\t\t?>\r\n\r\nNo posts are shown in my blog, do you know what's wrong with it?", "likes": 0}}, {"topLevelComment": {"author": "Matins Veismans", "text": "You didn't show how to create a new project in visual code", "likes": 0}}, {"topLevelComment": {"author": "Fadey", "text": "31:11 search box\n32:55 input, textarea (se aplica la toate search boxurile)\n33:31 fara lineuri cat apesi\n33:40 search-box input + design search-box\n29:11 casuta colorata\n30:35 background sliding", "likes": 1}}, {"topLevelComment": {"author": "Pablo Fonseca", "text": "It was difficult to adapt to BEM and SASS", "likes": 0}}, {"topLevelComment": {"author": "S.M.Mahmudur Rahman", "text": "Thanks a lot for making such a wonderful video tutorial.", "likes": 0}}, {"topLevelComment": {"author": "alejo", "text": "add subtitles please", "likes": 1}}, {"topLevelComment": {"author": "hymn 13", "text": "This tutorial is fantastic. Thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Charanpal singh", "text": "this is really confusing , while people say that when you know wordpress it is simple, you dont need to know coding??\nbut here you are using html with wordpress!!!", "likes": 0}, "replies": [{"author": "king akgbl", "text": "bro if you design a ready-made theme then you don't need to coding.thats what we call it WordPress customization. Now this ready-made theme that you used was built by a coder same way the instructor shown in this video. so think what you want to be a customizer or a theme creator. To be a creator you need to learn HTML,CSS, js,PHP ,bootstrap,jquery. this is just beginning to be a good WordPress developer you ave to learn more and more.\n thanks and sorry for my bad English.", "likes": 1}]}, {"topLevelComment": {"author": "Karen Joy Kendall", "text": "Please, please add captioning!!", "likes": 0}}, {"topLevelComment": {"author": "DigiExploration", "text": "Hi, can anyone give my any links from GTcoding or elsewhere on how to publish the custom theme on PW on the hosting?", "likes": 0}}, {"topLevelComment": {"author": "Seif Eddine Slimene", "text": "in 03:18:51 when i click on projects in header links it doesn't show the projects in browser console it shows 404 error even when i created archive.php it still request the same resource which is projects/ with 404 error i read the comments here and try the permalink thing in settings and save but not working!\nIs need help on this please!", "likes": 1}, "replies": [{"author": "z b", "text": "did you manage to solve that issue?", "likes": 0}]}, {"topLevelComment": {"author": "abdur abdur", "text": "very nice tutorials", "likes": 0}}, {"topLevelComment": {"author": "Subramanyam .D 24M", "text": "For some devices Local Wordpress wont work fine....for them better to use Bitnami or Squarespace Local hosting.", "likes": 0}}, {"topLevelComment": {"author": "Faisal Hawlader", "text": "Nice tutorial, but at the start you typed all html and css code in the way that seems you have memorized all things!\nIt would be better if you do all things parts by parts.\nFor example, rather than typing whole html, type html for nav first and write css for that navbar \nthis will be a lot of helpful to the viewers.", "likes": 0}}, {"topLevelComment": {"author": "K. Elshahawy", "text": "thanks for the valuable information !", "likes": 1}}, {"topLevelComment": {"author": "Bogi Boglarovics", "text": "i guess Linux is no longer a development platform", "likes": 0}}, {"topLevelComment": {"author": "Bini H Alex", "text": "great tutorial buddy. But i lost track around 3:20:30 how did the projects page get powered by archive.php? was it done authomatically by WP engine? I created that but it didn't work. was there a parameter you assigned before that?", "likes": 1}}, {"topLevelComment": {"author": "intelectus", "text": "Hi, and thanks for the video.\nI have a question:\nIf I use (<i class=\"fas fa-search\"></i>) I get a small square on the firefox browser that says F0C9. But if I change it to (<i class=\"fa fa-search\"></i>) I can see the icons (I don't know which way is right).\nAlso, I copied and pasted the index.html page from your source and I get two sets of \"Home Blog Projects About\" plus two search and search boxes. Ok I guess I delete one code?\nThanks", "likes": 0}, "replies": [{"author": "siddharth mourya", "text": "1. class should be 'fa' not 'fas' so 'fa fa-search'. It stands for font-awesome.\n2. when you copied index.html you are getting two sets of \"Home Blog Projects About\" because in actual there are two sets we have made . One is for media breakpoint max-719(i guess) and other for media breakpoint min-720\n\nhope you get that, if not revert back. I'll try to explain more.", "likes": 0}]}, {"topLevelComment": {"author": "HiiamArshadImran", "text": "Sir please make complete wordpress e store development with php and mysql", "likes": 0}}, {"topLevelComment": {"author": "Tom", "text": "thank you for this amazing video", "likes": 0}}, {"topLevelComment": {"author": "Madeline", "text": "Wondering if anyone can help with an issue I've run into. Instead of including a blog and projects page in my theme, I've only kept projects as a custom post type with categories. Everything functions the same as the blog page does from this tutorial - I've looped through and displayed all projects with hyperlinked category names under my \"Archives: Projects\" page using \"get_the_category_list\". However, when I click on one of these categories links, it redirects me to the \"Category: Name\" page with only the blog post types that share this category name. Why aren't my projects being displayed when I can see the categories just fine on the Projects page and why is it only categorizing Blog posts here?", "likes": 0}}, {"topLevelComment": {"author": "ait hasan", "text": "THANK you buddy that was really helpful but it can't implemented from where I am at, Because we don't use credit card in our location (Syria) and that is sucks.", "likes": 0}, "replies": [{"author": "unknown man", "text": "what cant be implemented bro? Why do you need a credit card for this tutorial? Its free", "likes": 1}]}, {"topLevelComment": {"author": "Sangareddy Info", "text": "Thanks Like who is learning during lockdown 🙂🙂🙏", "likes": 40}}, {"topLevelComment": {"author": "unknown man", "text": "can we use elementor and other plugins in our theme?", "likes": 1}, "replies": [{"author": "Manolis Zaimakis", "text": "Yes you can. But i recommend you to avoid page builders. They load much unecessary bloatware in your website. It is easy to just design your html css and convert it to a theme. This way you will have a rapid small size theme with good scores in Pagespeed and GTMetrix. Moreover page builders, mostly Elementor add lots of div tags that you dont need.", "likes": 1}]}, {"topLevelComment": {"author": "Lifemond International", "text": "Play it at 1.25 speed. You’re welcome.", "likes": 0}}, {"topLevelComment": {"author": "johan barrios", "text": "Thank you so much for your tutorial! I'm working through it but I'm facing a problem with the projects section on the Blog index page section 3:11:44 section,  the design gets applied to the blog option but when I click on projects it says \"page not found\", even after I created the archive.php file to see if it would pull from that, it doesn't show anything from it, it only says on the nav bar \"page not found\" could you help me with this? thank you so much!", "likes": 0}, "replies": [{"author": "Seif Eddine Slimene", "text": "@johan barrios I did everything you said but still doesn't work, i don't know why?!", "likes": 0}, {"author": "johan barrios", "text": "@Seif Eddine Slimene Hey, yes! I got helped from a great developer from this thread, so check this solution:\nGo to Setting > Permalinks. check if it is set \"Post name\" from the very beginning,. If it is, do not change anything there. Just clicked Save Changes. And then everything should start working as it should.\nIf not, please re check your code for your custom post type!", "likes": 0}, {"author": "Seif Eddine Slimene", "text": "You found any solution?", "likes": 0}]}, {"topLevelComment": {"author": "Yasir YT", "text": "freeCodeCamp is my career ,,, it helped me lot!", "likes": 0}}, {"topLevelComment": {"author": "Rashmi Poudel", "text": "How can we get GTCodIng in left side of the explorer?", "likes": 0}}, {"topLevelComment": {"author": "Kevin Connaughton", "text": "why is about page wrong? <h2 class=\"page-heading\"><?php the_title(); ?></h2>\r\n    <div id=\"post-container\">\r\n      <section id=\"blogpost\">\r\n        <div class=\"card\">\r\n          <?php if(has_post_thumbnail()) { ?>\r\n          <div class=\"card-image\">\r\n            <img src=\"<?php echo get_the_post_thumbnail_url('get_the_ID'(),'full'); ?>\" alt=\"Card Image\">\r\n           </div>\r\n            <?php } ?>\r\n          <div class=\"card-description\">\r\n            <?php the_content(); ?>\r\n          </div>\r\n        </div>\r\n\r\n      </section>\r\n         <?php } ?> \r\n      </div>     \r\n      <aside id=\"sidebar\">\r\n        <h3>Sidebar Heading</h3>\r\n        <p>Sidebar 1</p>\r\n      </aside>\r\n    </div>\r\n  <?php get_footer(); ?>", "likes": 0}}, {"topLevelComment": {"author": "johan barrios", "text": "Hey, thank you so much for the tutorial, I've been following this one to get a hold on to get into Wordpress development, and it has been of great help. I wanted to know if I could get some help, how come on the minute: 2:22:02 you can use the word:  all on the wp_enqueue_style without the 'all', when it's supposed to be a string for media? I've tried to do it without it and it throws a huge warning saying  \"Warning: Use of undefined constant all - assumed ‘all’ (this will throw an Error in a future version of PHP) \" \n\nIs there something that I'm missing or this is giving that it's an older version of PHP? Wordpress? \n\nThank you in advance for your help.", "likes": 1}, "replies": [{"author": "Elena Novinskiy", "text": "@johan barrios You are welcome :) I also do not entirely understand every part of the code :) I learn by doing. I am sure having done this several time I will eventually get it.", "likes": 0}, {"author": "johan barrios", "text": "@Elena Novinskiy THANK YOU SO MUCH!  created and recreated the code watching the video but nothing worked but following yours did the trick! you're a SAVIOR! I need to learn how to create custom blog types like this but step by step! again I'm completely grateful for your help!", "likes": 1}, {"author": "Elena Novinskiy", "text": "​@johan barrios ok, I was just curious and decided to start over with creating a custom post type. As a matter of fact I created 2, book and product, cause I wanted to try creating multiple custom post types. Here is my functions code.\n\n\nfunction book_post_type(){\n  $labels = array (\n    'name'                => _x( 'Books', 'Post Type General Name', 'text_domain' ),\n    'singular_name'       => _x( 'Book', 'Post Type Singular Name', 'text_domain' ),\n    'menu_name'           => __( 'Books', 'text_domain' ),\n    'parent_item_colon'   => __( 'Parent Item:', 'text_domain' ),\n    'all_items'           => __( 'All Books', 'text_domain' ),\n    'view_item'           => __( 'View Book', 'text_domain' ),\n    'add_new_item'        => __( 'Add New Book', 'text_domain' ),\n    'add_new'             => __( 'Add New', 'text_domain' ),\n    'edit_item'           => __( 'Edit Book', 'text_domain' ),\n    'update_item'         => __( 'Update Book', 'text_domain' ),\n    'search_items'        => __( 'Search Book', 'text_domain' ),\n    'not_found'           => __( 'Not found', 'text_domain' ),\n    'not_found_in_trash'  => __( 'Not found in Trash', 'text_domain' ),\n  );\n  $args = array(\n    'label'               => __( 'book', 'text_domain' ),\n    'description'         => __( 'Post Type Description', 'text_domain' ),\n    'labels'              => $labels,\n    'show_in_rest'        => true,//add Gutenberg Editor Support\n    'supports'            => array('title', 'thumbnail', 'editor', 'excerpt', 'comments'),\n    'taxonomies'          => array( 'category', 'post_tag' ),\n    'hierarchical'        => false,\n    'public'              => true,\n    'show_ui'             => true,\n    'show_in_menu'        => true,\n    'show_in_nav_menus'   => true,\n    'show_in_admin_bar'   => true,\n    'menu_position'       => 5,\n    'menu_icon'           => 'dashicons-clipboard',\n    'can_export'          => true,\n    'has_archive'         => true,\n    'exclude_from_search' => false,\n    'publicly_queryable'  => true,\n  );\n  register_post_type( 'book', $args );\n}\n// Hook into the 'init' action\nadd_action( 'init', 'book_post_type' );\n\n\nfunction product_post_type(){\n  $labels = array (\n    'name'                => _x( 'Products', 'Post Type General Name', 'text_domain' ),\n    'singular_name'       => _x( 'Product', 'Post Type Singular Name', 'text_domain' ),\n    'menu_name'           => __( 'Products', 'text_domain' ),\n    'parent_item_colon'   => __( 'Parent Item:', 'text_domain' ),\n    'all_items'           => __( 'All Products', 'text_domain' ),\n    'view_item'           => __( 'View Products', 'text_domain' ),\n    'add_new_item'        => __( 'Add New Product', 'text_domain' ),\n    'add_new'             => __( 'Add New', 'text_domain' ),\n    'edit_item'           => __( 'Edit Product', 'text_domain' ),\n    'update_item'         => __( 'Update Product', 'text_domain' ),\n    'search_items'        => __( 'Search Product', 'text_domain' ),\n    'not_found'           => __( 'Not found', 'text_domain' ),\n    'not_found_in_trash'  => __( 'Not found in Trash', 'text_domain' ),\n  );\n  $args = array(\n    'label'               => __( 'product', 'text_domain' ),\n    'description'         => __( 'Post Type Description', 'text_domain' ),\n    'labels'              => $labels,\n    'show_in_rest'        => true,//add Gutenberg Editor Support\n    'supports'            => array('title', 'thumbnail', 'editor', 'excerpt', 'comments'),\n    'taxonomies'          => array( 'category', 'post_tag' ),\n    'hierarchical'        => false,\n    'public'              => true,\n    'show_ui'             => true,\n    'show_in_menu'        => true,\n    'show_in_nav_menus'   => true,\n    'show_in_admin_bar'   => true,\n    'menu_position'       => 9,\n    'menu_icon'           => 'dashicons-clipboard',\n    'can_export'          => true,\n    'has_archive'         => true,\n    'exclude_from_search' => false,\n    'publicly_queryable'  => true,\n  );\n  register_post_type( 'product', $args );\n}\n// Hook into the 'init' action\nadd_action( 'init', 'product_post_type' );\n\n\nAfter this I went ahead and created several book posts and several product posts. When I went to check is I get respective post pages and post feeds I also got Page Not Found. So I went to Setting > Permalinks. I had it set to \"Post name\" from the very beginning. So I did not change anything there. I just clicked Save Changes. And then everything started working as it should.\n\n\nYou are welcome to use this code. I just find this way it is a bit more structured and there is less arrays within arrays. Also keep in mind that the function name cannot exceed 20 characters including underscores. So your function ep_custom_post_type() is 19 characters. I would name it simply ep_post_type() or something to make it shorter.", "likes": 1}, {"author": "johan barrios", "text": "I've cleared the cache on my browser but sadly no change, I've tried the settings - permalink - save step but still nothing happens, when I click project it doesn't show the posts that I've created and on the browser nav tab still says \"Page not found\"  :/.  Is there any specific setting that the permalink should have?\n\nBtw here I add the while loop that I have for the index.php:\n<?php \n  while (have_posts(  )){\n    the_post(  );\n  ?>\n\nAnd the function for the custom blog  type:\nfunction ep_custom_post_type(){\n  register_post_type( 'project', \n  array(\n    'rewrite' => array('slug' => 'projects'),\n    'labels' => array(\n      'name' => 'Projects',\n      'singular_name' => 'Project',\n      'add_new_item' => 'Add New Project',\n      'edit_item' => 'Edit Project',\n    ),\n    'menu_icon' => 'dashicons-clipboard',\n    'public' => true,\n    'has_archve' => true,\n    'supports' => array(\n      'title','thumbnail','editor','excerpt', 'comments'\n    ) \n  )\n    );  \n} \n\nadd_action( 'init','ep_custom_post_type');\n\n\nI really can't seem to find the error :/, thank you so much for your support.", "likes": 0}, {"author": "johan barrios", "text": "@Elena Novinskiy Thank you so much! I'll be checking that but I think it's working fine as the custom post type (project) it's showing on the admin, and I can create post on projects without any problem. \n\nThe issue might with the while loop because it does work for the blog but not for the project, so it's quite strange! I'll be clearing the cache to see how it goes!", "likes": 0}]}, {"topLevelComment": {"author": "Francis Chin", "text": "wow ! I don't believed I spend 2 days to complete the 4 hours video tutorial ! But I did it ! And I have a working theme. Great job. But this is just the begining of WP Theme development journey for me ! Thank you for your video", "likes": 2}, "replies": [{"author": "unknown man", "text": "can we use woocomerce and other plugins in this theme?", "likes": 0}]}, {"topLevelComment": {"author": "Nil Miquel Martínez", "text": "Thank you for the tutorial! It helps me a lot", "likes": 0}}, {"topLevelComment": {"author": "Amirul Clasher", "text": "eeeo", "likes": 0}}, {"topLevelComment": {"author": "Nil Miquel Martínez", "text": "This was a trouble for me, i put it here for if someone need it -> wp_enqueue_style('style', get_stylesheet_uri(), NULL, microtime(), $media = 'all');", "likes": 11}, "replies": [{"author": "Hussain Mubarak", "text": "Thanks Nil you saved my time, wish you a good day :)", "likes": 1}]}, {"topLevelComment": {"author": "B. Mikel", "text": "Once my theme is uploaded on live website, how do I update it in case I edit files on local server?", "likes": 0}, "replies": [{"author": "Muhammad Hashim", "text": "@B. Mikel Appreciated. Thank you <3", "likes": 0}, {"author": "B. Mikel", "text": "@Muhammad Hashim Sorry, I just said I modify theme files via FTP. It's not the best practice. It's much better to use gulp + rsync web development. In this case, one should start from scratch with dev environment (install NODE.JS, modules, packages, gulp etc). With just one command, it automaticallly updates the files on live website.", "likes": 1}, {"author": "DigiExploration", "text": "@B. Mikel круто, напиши мне в телеге - @asummers. Я сейчас студию по WP делаю", "likes": 0}, {"author": "Muhammad Hashim", "text": "@DigiExploration English Pls :)", "likes": 0}, {"author": "B. Mikel", "text": "@DigiExploration привет, я просто через FTP клиент Filezilla правлю файлы, потом обновляю.", "likes": 1}]}, {"topLevelComment": {"author": "Isalm Mazidul", "text": "i hate indian accent!", "likes": 1}}, {"topLevelComment": {"author": "JOBAYER AHMED", "text": "Awesome tutorial. Keep it up. Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Jared Aitken", "text": "OK I finished this tutorial but one thing that is bugging me. My paragraphs on the blogs are on one line. I have to scroll horizontally to read them. How do I fix this?", "likes": 0}, "replies": [{"author": "unknown man", "text": "@Jared Aitken hi, can we use woocomerce and other plugins in this theme?", "likes": 0}, {"author": "Jared Aitken", "text": "@Nicholas Flint Thanks I'll try it out", "likes": 0}, {"author": "Nicholas Flint", "text": "I know it's been a month but I just found the fix (or a fix). Find \".card .card-description {}\" in the .css file and add \"word-break: break-all;\"", "likes": 1}]}, {"topLevelComment": {"author": "Brian Hardaway", "text": "Do you provide the images?", "likes": 0}}, {"topLevelComment": {"author": "talia ledoux", "text": "Thanks for this amazing tutorial, it help me a lot. I used Wordpress to design my website. Without this video I could not have done it.", "likes": 0}}, {"topLevelComment": {"author": "Sam B.", "text": "An amazing in-depth tutorial, really good- covers a lot! This gave me two things: 1. A very good understanding of how to develop wordpress themes from scratch and an intro in to PHP. 2. An understanding that I do NOT want to do wordpress theme development (it is so tedious)  and PHP is annoying.", "likes": 4}, "replies": [{"author": "Alex Gordon", "text": "@B. Mikel build from scratch", "likes": 1}, {"author": "Salviano Silva", "text": "you don't need to use php", "likes": 2}, {"author": "B. Mikel", "text": "if not WP then WHAT?", "likes": 1}]}, {"topLevelComment": {"author": "Nahid", "text": "excellent tutorial ..thank you so much", "likes": 0}}, {"topLevelComment": {"author": "Chohee Jung", "text": "Hi! :) thanks for the awesome video. I have a question, is it possible to add some plugin into custom theme such as woo commerce or membership plug in?", "likes": 1}, "replies": [{"author": "unknown man", "text": "same question", "likes": 0}]}, {"topLevelComment": {"author": "Chohee Jung", "text": "Thank you sooooooo much! I've been looking for this kind of video 💛", "likes": 2}}, {"topLevelComment": {"author": "Yash Gaikwad", "text": "*how to add multiple image uploader in one section?*", "likes": 1}}, {"topLevelComment": {"author": "Silvio Pontes", "text": "HI, Do you make theme for Wordpress?\r\nHow much and what is the delivery time?\r\nIt will be for an AIRBNB type gym search engine!", "likes": 0}}, {"topLevelComment": {"author": "Dipenparmar12", "text": "Great.", "likes": 0}}, {"topLevelComment": {"author": "Anirudha Chakrabarty", "text": "Good tutorial to make a custom wordpress website..", "likes": 0}}, {"topLevelComment": {"author": "SmartWolf", "text": "Thanks you so mutch...couldn't be more clear. EXACTLY what I was looking for", "likes": 1}}, {"topLevelComment": {"author": "KaterKarloMawMaw", "text": "Very good video on this topic. Exactly what I need! Thank you so much!", "likes": 1}}, {"topLevelComment": {"author": "krystyna93418", "text": "great tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Houstradamus", "text": "I only needed the integration part, but you caught me on the PHP part which is important. Great tutorial even for experts like me, It refresh my knowledge.", "likes": 1}}, {"topLevelComment": {"author": "nabil libre", "text": "I love the background with the noise of cars :).", "likes": 1}}, {"topLevelComment": {"author": "Pallavi Priyadarshini", "text": "Its always exhausting to see Indian tutorials. I feel like you ve things and just jotting it down.. you don't show how things change after styling .", "likes": 0}}, {"topLevelComment": {"author": "Walking Dead", "text": "Thank you for all this free content", "likes": 2}}, {"topLevelComment": {"author": "Juan M. Vázquez", "text": "on minute 2:18:15 , the word \"all\" must be a string just like: \"all\", otherwise it is going to throw an error", "likes": 3}}, {"topLevelComment": {"author": "Beto Zurita", "text": "All I can say is thank you very much!   Great tutorial :)", "likes": 1}}, {"topLevelComment": {"author": "Alex Butler", "text": "I had real trouble with getting the site loading from Local by Flywheel - instead an XAMPP admin dashboard showed up.  After trying to learn about Apache hosting and being sent in various directions from different people, I found that changing the .local url to .test fixed the issue for me", "likes": 1}, "replies": [{"author": "Dimitrios Pavlis", "text": "If you are on Windows try Bitnami for Wordpress. It is way better.", "likes": 0}]}, {"topLevelComment": {"author": "Kerim Tim.", "text": "When uploading a document (word) file into WordPress and linking it to a website the links don't work and the name of the file in /upload/ file shows crazy symbols. How to solve this problem?", "likes": 0}}, {"topLevelComment": {"author": "James Kiarie", "text": "This is a great job indeed", "likes": 1}}, {"topLevelComment": {"author": "Md Shihhab Hossain Antu", "text": "could you plz upload the font awesome link and google font link in the description.", "likes": 0}}, {"topLevelComment": {"author": "dylbraddb", "text": "As a beginner to wordpress, this is by far the best video containing all the most important aspects of developing a theme that I have found. Helped me solve many problems in my theme. Many thanks", "likes": 0}}, {"topLevelComment": {"author": "Gursimran Singh", "text": "I am getting this warning but it disappears immediately after page is loaded \n: Use of undefined constant all - assumed 'all' (this will throw an Error in a future version of PHP)", "likes": 0}, "replies": [{"author": "KRN", "text": "Use 'all' instead of all in  wp_enqueue_style().", "likes": 0}]}, {"topLevelComment": {"author": "Kevin Wagner", "text": "Your so amazing and I love that you explained everything", "likes": 0}}, {"topLevelComment": {"author": "abdo qund", "text": "how I'm supposed to start and I'm not even know-how to work with html", "likes": 2}}, {"topLevelComment": {"author": "smile", "text": "31:03", "likes": 0}}, {"topLevelComment": {"author": "Jamal Waring", "text": "Perfect, added this to my skillset", "likes": 4}}, {"topLevelComment": {"author": "tanvir mahmud", "text": "3:40 Comments", "likes": 0}}, {"topLevelComment": {"author": "Gokul", "text": "I can't able to find \"open with live server option in vs code\" even though I searched it in command palette. What should I do?", "likes": 0}, "replies": [{"author": "Kamlesh Pandey", "text": "@Gokul go at the left bottom bro you will see a square blocks click there ....OR press  ctrl+shift+X and type (live server) in the search box it is provided by Ritwick Dey , click on it and install it", "likes": 0}, {"author": "Gokul", "text": "How to get that extension?", "likes": 0}, {"author": "Bekto Dedic", "text": "You need extension called Live Server on VSCode", "likes": 0}]}, {"topLevelComment": {"author": "Colin L", "text": "Thank you great tutorial", "likes": 0}}, {"topLevelComment": {"author": "Jasper ", "text": "Can you also use the woocommerce plugin with this?", "likes": 1}}, {"topLevelComment": {"author": "Qureshi Qureshi", "text": "Need guidance ..\nI want to make E-commerce website in which registered buyers get the products in whole sale price and unregistered buyers get same products in retail price and admin panel wo manages clients and products updation , deletion and addition etc...how it will make with free theme and plugins?", "likes": 0}}, {"topLevelComment": {"author": "J g", "text": "Why it says NOT SECURE in the url?", "likes": 0}}, {"topLevelComment": {"author": "Michał Rogoziński", "text": "Just finished watching whole video. I want to code WordPress themes in the future and just wanted to see how the whole process looks like. I'm really impressed and it was really educating. Thank you for sharing it with us. From editing aspect, sometimes it was hard to understand what's you're saying Sir because of microphone sound level was different with each section. Additionaly noises from outside of you window were a bit distracting sometimes :D", "likes": 0}}, {"topLevelComment": {"author": "Marek Eisenman", "text": "4 hrs to create wp theme?", "likes": 0}}, {"topLevelComment": {"author": "shiniemi", "text": "Thank you! This is an awesome tutorial! Really helped me to get started with PHP coding :)", "likes": 7}}, {"topLevelComment": {"author": "Shivam Meena", "text": "Thank you so much! this was everything i needed! :-)", "likes": 1}}, {"topLevelComment": {"author": "Othneil Drew", "text": "Very well structured tutorial. Thank you very much! :D", "likes": 0}}, {"topLevelComment": {"author": "Tech Soul", "text": "How a student can know how and when to use all those elements, classes, Ids and styles being used in this detailed work. Its a copy of some work that's already generated. Time should have been spent to teach a student for rules of producing a basic layout of WordPress Theme. Good work for advanced learners.", "likes": 3}, "replies": [{"author": "Shreyash Chavan", "text": "Use wordpress docs for that", "likes": 0}]}, {"topLevelComment": {"author": "samir samir", "text": "sorry but you are just turning around some points you know and avoiding important ones ..", "likes": 1}}, {"topLevelComment": {"author": "ITdots", "text": "2:42:43", "likes": 0}}, {"topLevelComment": {"author": "Chess Geeks", "text": "Which code editor are you using?", "likes": 0}}, {"topLevelComment": {"author": "Hung Nguyen", "text": "I don’t know if I miss anything, but why did he use archive.php for the /project slug? Does it require any setup previously in Wordpress admin page?", "likes": 2}}, {"topLevelComment": {"author": "Serhat Demirkan", "text": "icant add image to projects help me pls", "likes": 1}}, {"topLevelComment": {"author": "Serhat Demirkan", "text": "<img src=\"<?php echo get_the_post_thumbnail_url('get_the_ID'); ?>\" alt=\"Card Image\">  Photos didnt come", "likes": 0}, "replies": [{"author": "Serhat Demirkan", "text": "Solved > echo get_the_post_thumbnail_url('get_the_ID'(),'full');", "likes": 1}]}, {"topLevelComment": {"author": "Juan Andrade", "text": "I noticed an error in the minute 2:31:30 should be \"menu_icon\" instead of \"menu-icon\".", "likes": 5}, "replies": [{"author": "Vangelis Efthimiatos", "text": "Thanks!!! That's why the dashicon of \"Projects\" was not changed to 'dashicons-clipboard'.", "likes": 0}, {"author": "KrimO", "text": "That's one good student over here XD", "likes": 0}]}, {"topLevelComment": {"author": "crazy1985", "text": "I have learned more than I ever expected! You are officially on of my heros!", "likes": 7}}, {"topLevelComment": {"author": "Николай", "text": "sorry, dislike, that is dull", "likes": 0}}, {"topLevelComment": {"author": "najam uddin", "text": "Hello sir it is a great tutorial . I loved it a lot but there is a problem my archive.php is not showing instead it is going to index.php according to wordpress template hierarchy. Can anybody help me ?", "likes": 1}, "replies": [{"author": "Sahan Jayasinghe", "text": "Hi, I have the same issue did you find a solution?", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Adnan", "text": "Idiot waisted too much time for Css html. ..Lol  u should start from starting point only WordPress coding not the html css", "likes": 0}}, {"topLevelComment": {"author": "Andrew Solovey", "text": "Thanks for the tutorial! Though this trick with Projects page showing all the projects automatically based on URL slug doesn`t work for me. The Projects page is showing nothing except the title of the page. I tried changing the permalinks structure as was suggested in one of the comments but it didn`t help. Can anyone help? I`m using XAMPP as localhost.", "likes": 0}, "replies": [{"author": "Andrew Solovey", "text": "@ZumbaBen Thanks a lot! Your solution works pretty well for me too.", "likes": 0}, {"author": "ZumbaBen", "text": "create a new page Project in ur wordpress dashboard, also create a new file page-project in your editor, copy past the code but this time with the $args and wp_query code same as in the tutorial. (i was stuck too there, thats all i could find.)", "likes": 3}]}, {"topLevelComment": {"author": "Gavin Chan", "text": "all about basics, not what i want :(", "likes": 0}}, {"topLevelComment": {"author": "Kevin Connaughton", "text": "I do appreciate the amount of work that you put into this course, but am I the only one that having such frustrating time codes that were getting, I've spent so much time trying to work out why the code is not working in the WordPress theme, I do like the design of your website's and all the CSS used. That was very successful,, but when I come to coding the WordPress files I've had such a frustrating time, this one example is so exhausting,\nParse error: syntax error, unexpected ')' in C:\\xampp1\\htdocs\\wk\\wp-content\\themes\\GTCoding\\header.php on line 78,\nit just does not accept wrapping the PHP around the } sign, I've checked and checked my code, there is something seriously wrong, I see you get no replies here, but to the people who is doing this course are you experiencing the same problems as I have", "likes": 1}}, {"topLevelComment": {"author": "Prince Of The Pharaohs", "text": "just to be clear in this video we are using wordpress as a framework to build our website?", "likes": 0}}, {"topLevelComment": {"author": "A H", "text": "very very thank u much much...👌👌👌👌", "likes": 0}}, {"topLevelComment": {"author": "Jon Elkin", "text": "This helped with some questions for me.", "likes": 0}}, {"topLevelComment": {"author": "SeungJoon Hyun", "text": "Thank you so much. it took days to finish this but it actually helped me a lot :P", "likes": 13}, "replies": [{"author": "Oscar Martinez", "text": "How many days it took ? \nI'm asking because I just started this tutorial.", "likes": 0}]}, {"topLevelComment": {"author": "Meeky James", "text": "Amazing tutorial, thank you", "likes": 0}}, {"topLevelComment": {"author": "Sahil khan Khalilx", "text": "make video how to add custom php css login page to wordpress site", "likes": 0}}, {"topLevelComment": {"author": "Knowledge World", "text": "Good Job Brother", "likes": 0}}, {"topLevelComment": {"author": "Abdul Rauf", "text": "awesome video", "likes": 0}}, {"topLevelComment": {"author": "shaiD", "text": "thank you so much , from scratch! , this is what i'm looking for , thanks!.\n if u create also  plugins it be the best to understand wordpress and php.", "likes": 1}, "replies": [{"author": "Shiva Concept Solution", "text": "video available on our channel please visit", "likes": 0}]}, {"topLevelComment": {"author": "Robroy 404", "text": "Is wordpress can create tournament bracket?", "likes": 0}}, {"topLevelComment": {"author": "tarek", "text": "Please possible do Arabic language translation", "likes": 0}}, {"topLevelComment": {"author": "Rafael Lima", "text": "the template code is offline...", "likes": 0}}, {"topLevelComment": {"author": "krystyna93418", "text": "Great tutorial. \n\nA question: If I want to work on two wordpress themes at one time with \ndifferent posts and pages between the two themes, activating one or the \nother in the themes page doesn't update/change the posts and page \ninformation relative to each theme. Does that mean I need to install a \nfresh version of wordpress for each theme?? \nI am confused on how to work on two at one time. \nThanks :)", "likes": 1}}, {"topLevelComment": {"author": "krystyna93418", "text": "Great tutorial. \n\nA question: If I want to work on two wordpress themes at one time with \ndifferent posts and pages between the two themes, activating one or the \nother in the themes page doesn't update/change the posts and page \ninformation relative to each theme. Does that mean I need to install a \nfresh version of wordpress for each theme?? \nI am confused on how to work on two at one time. \nThanks :)", "likes": 0}}, {"topLevelComment": {"author": "Sumeet Sharma", "text": "I am not getting the output of the posts under projects when I click on 'Projects'. It does not show any output. Please help", "likes": 1}, "replies": [{"author": "Seif Eddine Slimene", "text": "@johan barrios Same problem here!", "likes": 0}, {"author": "johan barrios", "text": "@Angel Martinez Hey, I've been facing the same issue,  it actually says \"page not found\" and I've tried this, but sadly doesn't do any difference, the index.php settings worked for blogs but not for projects, and I tried to create the archive.php to see if project would pull from that, but nothing, is there any way that I can sort this?", "likes": 0}, {"author": "Angel Martinez", "text": "It happened to me too. Go into the wordpress dashboard -> settings->permalinks, then click save changes\nThis fixed the problem for me.", "likes": 2}]}, {"topLevelComment": {"author": "Sandro TV", "text": "Could you make a video about Modx? It would be marvelous!", "likes": 1}}, {"topLevelComment": {"author": "blackdajack12", "text": "local by flywheel is not a very good option compared to others like DesktopServer, since the installation and configuration is so more susceptible to errors and failed instalations", "likes": 0}}, {"topLevelComment": {"author": "Maysum Raza", "text": "local by flywheel stuck on starting local machine :( and showing error message   \"This Computer does not have VT-X/AMD-v enabled\" for Enables it  go into bios setting..", "likes": 0}, "replies": [{"author": "crazy1985", "text": "use bitnami", "likes": 0}, {"author": "Saksham Kapoor", "text": "copy and paste error message on google. I had the same error. Works fine now.", "likes": 1}]}, {"topLevelComment": {"author": "CHANGE AGENTS", "text": "i think freecodecamp is the coolest, thanx ma frriends", "likes": 0}}, {"topLevelComment": {"author": "Dimitrije Jovanovic", "text": "When i go to Theme Source Code it says: Website under construction. Please check back later.", "likes": 0}}, {"topLevelComment": {"author": "Hemendra Sahu", "text": "at 3:19:25 I have a problem.  gtcoding.local/projects/  does not index any project posts, although it's using template of index.php. can anyone please help?", "likes": 2}, "replies": [{"author": "Seif Eddine Slimene", "text": "@Hemendra Sahu I do the same still not work with me!", "likes": 0}, {"author": "Hemendra Sahu", "text": "@Ehab Ezzat Thank you. I changed the permalink to \"custom structure: /%postname%/\" and it worked fine.", "likes": 0}, {"author": "Ehab Ezzat", "text": "Go to your site settings -> permalinks and click on \"save button\".", "likes": 1}]}, {"topLevelComment": {"author": "Nicolò Ciaccia", "text": "Can someone please tell me what's going on with all this honking?", "likes": 2}}, {"topLevelComment": {"author": "Raphael Miranda", "text": "left at 18:35,", "likes": 0}, "replies": [{"author": "unknown man", "text": "you completed the video now>? xD", "likes": 0}]}, {"topLevelComment": {"author": "Pepe Márquez", "text": "Fantastic Tutorial, congratulations for your great work!!", "likes": 0}}, {"topLevelComment": {"author": "helmi fadlilah", "text": "Please show subtitle options", "likes": 1}}, {"topLevelComment": {"author": "Mir Mumtaz", "text": "Nice refreshing tutorial", "likes": 1}}, {"topLevelComment": {"author": "Emdirty Yo", "text": "Nice dude, but there are some minuses: You didn't tell about Menus (registering navbars) and etc stuff. But good job", "likes": 2}}, {"topLevelComment": {"author": "Charlie Shain", "text": "wow..amazing tutorial for me...thank's a lot GTCoding for this tutorial..... :)", "likes": 2}}, {"topLevelComment": {"author": "yuksel bey", "text": "Hi thank you for lessons to help us. Couple of time I started like your lesson video somewhere something happened I couldn't fix it or never get answers. For example, when I looked at the comments I saw your links is not running. I know you spend a lot of time to make this lesson video. Thanks for sharing your experience.  But when we started the lessons if it's not running something or we made mistakes we will need your help.", "likes": 2}}, {"topLevelComment": {"author": "DeathToCockroaches", "text": "2:18:54 instead of all set it to $media = 'all'", "likes": 4}, "replies": [{"author": "DeathToCockroaches", "text": "@Tom No problem", "likes": 0}, {"author": "Tom", "text": "thx man  i had an error there what is $media = 'all' doing anyways?", "likes": 0}, {"author": "Megan Rodriguez", "text": "Thank you!!!", "likes": 0}, {"author": "DeathToCockroaches", "text": "Also at 3:45:25 just insert  _<p>_ before _<input_ if you are having name appear differently, although apparently he corrects it by deleting the pargraph tags if i just remove it, it just gets even more terrible", "likes": 0}]}, {"topLevelComment": {"author": "Mohammed Khan", "text": "please activate english subtitles", "likes": 1}}, {"topLevelComment": {"author": "bali pro", "text": "Learn wordpress \n\nhttps://youtu.be/nlkIUflcAOU", "likes": 0}}, {"topLevelComment": {"author": "Kyoui Aishita", "text": "how do I open the localhost?", "likes": 1}}, {"topLevelComment": {"author": "Vanchhai", "text": "thank guy, it is really hopeful for me.", "likes": 0}}, {"topLevelComment": {"author": "ZumbaBen", "text": "Omg thank you so much :) thank u for helping me connecting the dots. Now just need more practice. and build more similar projects.😉", "likes": 8}}, {"topLevelComment": {"author": "Richard Denell", "text": "It would be really nice if you would tell me... how do I get word press , what am I supposed to watch you on if I'm online watching you.  Also you need to quit thinking every one is at your skill level,  slow down and break it down.  as far as I'm concerned your wideo sucks.  I think ya'all are crazy   from  the       \" United States of America\"", "likes": 0}}, {"topLevelComment": {"author": "Mustafa Mahmud", "text": "done", "likes": 0}}, {"topLevelComment": {"author": "limyohwan", "text": "in  a long string such as footer #social-media-footer ul li:hover a .fa-youtube what are the rules on where you put :hover", "likes": 0}, "replies": [{"author": "Christopher Roelle", "text": "On any element that you want to access the hover pseudo code. On li:hover, if the user hovers over an li tag, that list item contained within the tag will take on the css of the hover code. \n\nSo with a a{ color: white; } a:hover{ color: blue; }, any links on the page that the user hovers over will turn blue, and when they stop hovering over the link it will return to white", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Ahmed", "text": "make complete course on wordpress 5.2", "likes": 0}}, {"topLevelComment": {"author": "LaTanya Powers", "text": "Is there a way to add Closed Caption for deaf and hard of hearing individuals?  If the person is talking throughout the video, closed caption will help.", "likes": 0}}, {"topLevelComment": {"author": "Sahil Mehta", "text": "Man U deserves more subscribers than PewDiePie...Hats of to u bro...love from india...", "likes": 0}}, {"topLevelComment": {"author": "abid mahmud", "text": "10:40", "likes": 0}}, {"topLevelComment": {"author": "Andrey Grushevskiy", "text": "Are all custom post types such as 'projects' archives by default?", "likes": 0}}, {"topLevelComment": {"author": "Gabriela Soares", "text": "Hi guys! I am loving this video. It is amazing. But, I can not make the \"search\" button appear when I click on the magnifying glass. Help me please!!!", "likes": 1}, "replies": [{"author": "congwei bai", "text": "It may because there is wordpress nav bar on the top as search place is fixed. Try change height in js file?", "likes": 0}]}, {"topLevelComment": {"author": "Sofia S.", "text": "Exactly what I needed! Thanks!", "likes": 1}}, {"topLevelComment": {"author": "Shahzaib Mughal", "text": "Very Useful toturial", "likes": 0}}, {"topLevelComment": {"author": "Visualmodo", "text": "IT WordPress theme https://visualmodo.com/theme/it-wordpress-theme/ for modern technology, startups, and innovative companies. The theme is just as innovative itself to let you build a website with powerful functionality, yet not requiring much time or effort for you. All the features and functionality that any startup needs letting you create a website for your company or innovation industry 📱🖥🔌🛰👨‍💻", "likes": 1}}, {"topLevelComment": {"author": "Samuel Arcos", "text": "its not a 2019 tutorial, its from after August 2018, because of the wordpress version.", "likes": 2}}, {"topLevelComment": {"author": "all inone", "text": "*FCC*", "likes": 0}}, {"topLevelComment": {"author": "shashgo", "text": "You the man.  Please can you also show howto create a wordpress theme for ecommerce with the shopping basket, and the credit card taking feature.", "likes": 1}, "replies": [{"author": "shashgo", "text": "So does adding an ecommerce plugin cause a shopping cart icon to appear and become functional along with a merchant gateway.", "likes": 0}, {"author": "Versatile", "text": "Just install plugins for shopping  cart.", "likes": 0}]}, {"topLevelComment": {"author": "Daniel Okiror", "text": "This video is a very precious gift and this is what I have been looking for. Thank you Freecodecamp.", "likes": 3}}, {"topLevelComment": {"author": "Zyberdata v. Randi Mortensen", "text": "Hi,  why can't I see the sidebar     \n\n<aside id=\"sidebar\">\n        <?php dynamic_sidebar('main_sidebar'); ?>\n\n      </aside>\n\n    </div>\n\n    <?php get_footer();?>\n\n\nit's only show a black place", "likes": 1}, "replies": [{"author": "Angel Martinez", "text": "in functions.php look for the function where you register the sidebar, see if the 'id' field is exactly 'main_sidebar' or there is some typo there", "likes": 0}]}, {"topLevelComment": {"author": "Musah Abukari", "text": "You're great my dear friend", "likes": 0}}, {"topLevelComment": {"author": "Zohaib Tariq", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "PROGRAMMER SOHAN", "text": "Thank you from Bangladesh.", "likes": 3}}, {"topLevelComment": {"author": "Tolulope Ojediran", "text": "I have not watched but I've liked your video already merely going through viewers comments. My question is this: is this video only for people with coding experience or absolute beginner?", "likes": 2}, "replies": [{"author": "Hemendra Sahu", "text": "basic knowledge of HTML CSS and javascript will work", "likes": 0}]}, {"topLevelComment": {"author": "Francis Infante", "text": "anyone have the full css file? my design unusually got broken", "likes": 1}}, {"topLevelComment": {"author": "24 Entertainment", "text": "Keep it up bro ❤️❤️❤️from Bangladesh...", "likes": 1}}, {"topLevelComment": {"author": "Beto", "text": "https://youtu.be/KibbYf9avko?list=PL7QWzq3NVCR5tLyFejy_7-nnT20QsTIQR", "likes": 0}}, {"topLevelComment": {"author": "silvio pontes", "text": "Hi, I really enjoyed this class.\r\nI'm watching with a lot of dedication.\r\nI have a question; How to make a menu that on your smartphone is only on the side half of the screen? Thank you teacher.", "likes": 1}}, {"topLevelComment": {"author": "Thomas Lion", "text": "Music WordPress Theme - Powering your new music, band, artist, music industry, fan club website to new heights. Responsive, fast, interesting interaction feature packed & supported by top authors https://visualmodo.com/theme/music-wordpress-theme/\r\n🎵🎶🔈🎤📢🎧", "likes": 1}}, {"topLevelComment": {"author": "DigitalCity7", "text": "Hello! If you are looking to create a\nwebsite, I invite you to enter my channel where you will see in the\ndescription, an excellent software, to create incredible pages of the internet,\nin an unlimited way.", "likes": 0}}, {"topLevelComment": {"author": "Shabir Bhat", "text": "I will create one page wordpress website on affordable price.\r\nFor more details please visit below link.\r\nhttps://lnkd.in/fvgkVET", "likes": 0}}, {"topLevelComment": {"author": "Phyo Maung Maung", "text": "Thank you very much for the video. Can I get the source code of the themes.", "likes": 1}}, {"topLevelComment": {"author": "taariqq", "text": "What an incredible tutorial. I had heard a lot about WordPress but never found a course that explained how all the pieces fit together. I know a bit of CSS and PHP. This tutorial clarified so many things to me. Helped me decide to pursue a career in wp development. \nThere is a lot of bad-mouthing out there about PHP and wp. But learning how customizable it is, it is definitely worth investing ones time learning at, even as a starting point in web-dev.\nThank you Godson! Appreciate it much.", "likes": 4}, "replies": [{"author": "GTCoding", "text": "Wow! Thanks. Glad to hear that it was helpful. :)", "likes": 2}]}, {"topLevelComment": {"author": "Бейбарыс Сейткалиев", "text": "Hi! i have a question: i want to add VR Image (360 photo) to my wordpress, i'm the begginer in workflow with wordpress, so i need some help with coding", "likes": 0}}, {"topLevelComment": {"author": "kenyasman86", "text": "Ive finally had to break down and learn WordPress. Im not far enough along to get a job with a company, but im good enough to build nice sites, but all the freelamce work is in WordPress. And i have to start making some money from this somehow", "likes": 2}}, {"topLevelComment": {"author": "Yashwith Poojary", "text": "add plugin development too", "likes": 1}}, {"topLevelComment": {"author": "Maurice Webb", "text": "THANK YOU FOR THIS 🙏🏾!!", "likes": 2}}, {"topLevelComment": {"author": "W3 Lab Digital Agency", "text": "Very nice video, helpful for beginners :) Keep it up! We will support you!", "likes": 8}}, {"topLevelComment": {"author": "Rizki Aprita", "text": "HAMMER THAT LIKE BUTTON", "likes": 1}}, {"topLevelComment": {"author": "medoune cisse", "text": "how can we build a website for news using wordpress such as Le Monde....\nThank you", "likes": 3}}, {"topLevelComment": {"author": "Hendra Prasetya", "text": "Thanks for the tutorial. I have followed up to 3:15:00 mark, can't wait to finish it ✌️", "likes": 6}, "replies": [{"author": "Clary Valentine Morgenstern", "text": "@hendra prasetya I stucked right there. After I deleted some code as he said and remained this:\n\n<?php\n\n\t\twhile (have_posts()) {\r\n\t\t\t\tthe_post();\t\n\n\t\t?>\n\n\nNo posts are shown in my blog, do you know what's wrong with it?", "likes": 0}, {"author": "taariqq", "text": "up to 3:24:00 ... just came across a bit of a glitch. In header.php I somehow ended up removing the top portion upto the logo area. Perhaps that is why my 'class=\"active\" ' is not working.\nwill fix it, but WHAT an incredible tutorial! Gotta love it.", "likes": 0}]}, {"topLevelComment": {"author": "Hullio GQ", "text": "Thank you for this tut. The one thing I wish I could see is a complete theme with \"Service, Portfolio, Gallery, About us\" pages included. All the WordPress tuts I have watched do a Front, Blog, and Single post page but not the usual pages on a regular website I would be designing for clients.", "likes": 1}, "replies": [{"author": "Hullio GQ", "text": "@Djony almeida Can you also show how to create a Services and About page?", "likes": 0}, {"author": "Djony almeida", "text": "what are you saing i'm confuse man \"i would be designing for clients\"", "likes": 0}]}, {"topLevelComment": {"author": "Niraj Narkhede", "text": "Awesome video....", "likes": 0}}, {"topLevelComment": {"author": "Kalpesh Bhula", "text": "How come you did not use Gutenburg?", "likes": 0}}, {"topLevelComment": {"author": "usbgus", "text": "First class tutorial. Excellent work!", "likes": 1}}, {"topLevelComment": {"author": "sas10x", "text": "woocommerce or opencart please..", "likes": 0}}, {"topLevelComment": {"author": "Joey Kelly", "text": "Thanks for the helpful video!", "likes": 2}}, {"topLevelComment": {"author": "Zeeshan Hashmi", "text": "Thanks for Great Information.", "likes": 0}}, {"topLevelComment": {"author": "AJM Web Services", "text": "Hey there, what is your  favorite page builder ? I utilize several though my favourite is undoubtedly Oxygen.\nThanks for your hard work with this video recording - great stuff!!  \n🙂", "likes": 0}}, {"topLevelComment": {"author": "BuzzBuster Video", "text": "Great tutorial but next time can you not do it in the middle of rush hour traffic? ;)", "likes": 0}}, {"topLevelComment": {"author": "עמנואל Matthew 1:23אלוהים איתנו", "text": "Nice video thanks a lot.", "likes": 1}}, {"topLevelComment": {"author": "Yeapes", "text": "thanks sir", "likes": 0}}, {"topLevelComment": {"author": "Ten Minute Tokyo 2", "text": "Learned it 20 years ago.", "likes": 0}, "replies": [{"author": "TOMinPDX", "text": "Wasted your time coming to this video then.", "likes": 0}]}, {"topLevelComment": {"author": "ELK", "text": "thank you man!", "likes": 1}}, {"topLevelComment": {"author": "Alia Bharadwaj I. E", "text": "Thanx a lot , I am 12 and I am learning HTML and CSS , I thank you from my heart for that ❤️❤️", "likes": 86}, "replies": [{"author": "Olgay Celik", "text": "I am 36 my first code is hello world very difficult to learn in my age.  the earlier you start the more you learn👌", "likes": 0}, {"author": "madness", "text": "Your welcomed in kids web world .i am 13 and i am an normal web developer", "likes": 2}, {"author": "Wane Kaxa", "text": "@Dimitrije Jovanovic  Dude! I'm 28 I'm learning Angular! You're young, there's nothing wrong with your brain.", "likes": 0}, {"author": "Mohamed Khalif", "text": "Wow, you are amazing", "likes": 0}, {"author": "Dimitrije Jovanovic", "text": "Nice, I'm 24. ^-^ \nI wish I have fresh and young brain like Yours for this.\nMine is little buggy. \nGood luck!", "likes": 3}]}, {"topLevelComment": {"author": "Abraham Dieudonne", "text": "Can you do a custom shoplift theme next?", "likes": 1}, "replies": [{"author": "crazy1985", "text": "That's my next tutorial.", "likes": 0}]}, {"topLevelComment": {"author": "Umar Nasir", "text": "An amazing lesson on utilizing CSS effectively w/ HTML to create a snappy looking template.", "likes": 10}, "replies": [{"author": "Khelifa Toufik", "text": "i've never seen a poor way to code like he did", "likes": 0}]}, {"topLevelComment": {"author": "varun anand", "text": "pls add pulgin development", "likes": 1}}, {"topLevelComment": {"author": "James M. Browne", "text": "Many thanks for this!!!", "likes": 3}}, {"topLevelComment": {"author": "សុង ចាន់ថន", "text": "Thanklaxon you for share", "likes": 1}}, {"topLevelComment": {"author": "Charlene", "text": "What kind of person gives this a thumbs down. This is rhetorical question. I know the type FFS", "likes": 2}}, {"topLevelComment": {"author": "Mudasar Ali", "text": "Love you", "likes": 1}}, {"topLevelComment": {"author": "MoreCodes", "text": "Definitely what I was looking for. Thank you so much!", "likes": 5}}, {"topLevelComment": {"author": "Muhammad Ahmed", "text": "please make complete course on laravel 5.8", "likes": 1}}, {"topLevelComment": {"author": "Mitch G", "text": "This doesn't seem very codey considering WordPress pretty much does it all for ya..", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "You have to use code to create a custom WordPress theme.", "likes": 1}]}, {"topLevelComment": {"author": "Jewko Swektenko", "text": "Хельо гайс тудей ай виль тич  ю хау ту криейт...", "likes": 1}}, {"topLevelComment": {"author": "saurabh", "text": "Also thank you very much for all these resources....god bless you..", "likes": 2}}, {"topLevelComment": {"author": "The8beat War", "text": "U r the best youtuber", "likes": 2}}, {"topLevelComment": {"author": "saurabh", "text": "You deserve 10 million subscribers...\nThank-you very much from India....\n🙏🙏🙏", "likes": 27}}, {"topLevelComment": {"author": "snono", "text": "Think you", "likes": 1}}, {"topLevelComment": {"author": "Anjolaoluwa Awe", "text": "Thanks for giving us all resources 😁", "likes": 15}, "replies": [{"author": "taariqq", "text": "Were you able to complete w/o downloading his theme code?", "likes": 1}]}]}