{"video": {"id": "kj8HU-_P2NU", "title": "Template Literals (ES6) - Beau teaches JavaScript", "description": "How to use template literals in JavaScript ES6. These are surrounded by backticks ``.\n\nMore info:\n🔗 https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals\n\nBeau Carnes on Twitter: https://twitter.com/carnesbeau\n\n⭐JavaScript Playlists⭐\n▶ES6: https://www.youtube.com/playlist?list=PLWKjhJtqVAbljtmmeS0c-CEl2LdE-eR_F\n▶JavaScript Basics: https://www.youtube.com/playlist?list=PLWKjhJtqVAbk2qRZtWSzCIN38JC_NdhW5\n▶Design Patterns: https://www.youtube.com/playlist?list=PLWKjhJtqVAbnZtkAI3BqcYxKnfWn_C704\n▶Data Structures and Algorithms: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkso-IbgiiP48n-O-JQA9PJ\n▶Clean Code: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkK24EaPurzMq0-kw5U9pJh\n\n-\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nFollow us on twitter: https://twitter.com/freecodecamp\nLike us on Facebook: https://www.facebook.com/freecodecamp\nFollow Quincy on Quora: https://www.quora.com/Quincy-Larson", "duration": "PT9M43S", "likes": "345", "views": "19751"}, "comments": [{"topLevelComment": {"author": "Weird stuff", "text": "3:49 my brain can't process that . I got frustrated after seen that . I need more tanning :(", "likes": 0}}, {"topLevelComment": {"author": "Parnpraya Junhaman", "text": "How are you typing so fast??", "likes": 0}}, {"topLevelComment": {"author": "amitava mozumder", "text": "wow! it got really complicated really fast, took me a while to digest the last function, but why would we ever use that in daily life coding? the code will be obfuscated AF! LOL", "likes": 3}}, {"topLevelComment": {"author": "WESTWOOD267", "text": "I had to check to make sure I was watching this at normal speed, man you type fast", "likes": 0}}, {"topLevelComment": {"author": "Colin Dante", "text": "Code structured using template literals strips the outline algorithm thereby negating the affect semantic markup would have on web crawlers in search engines.  It could be said that hybrid search engines using directories could fill the gap but structured code is the way to go. That being said, there is a lot to take into consideration before avoiding it all together.", "likes": 0}}, {"topLevelComment": {"author": "Kenbomp", "text": "Powerful but ugly to read js syntax. But useful video. Reminds of small talk blocks", "likes": 0}}, {"topLevelComment": {"author": "Sofiane bm", "text": "gg", "likes": 0}}, {"topLevelComment": {"author": "Maria Chaudhry", "text": "which editor it is ?", "likes": 0}}, {"topLevelComment": {"author": "Sherry Song", "text": "I still don't quite understand the empty string at 2:54. If there is nothing, should it just return nothing instead of creating an empty string. Could someone explain? Thank you!", "likes": 1}}, {"topLevelComment": {"author": "SY Z", "text": "this was super helpful thank you, but iduno the last example seems so convoluted...(sorry beginner js coder)", "likes": 2}}, {"topLevelComment": {"author": "Jessen's Channel", "text": "crazy typing speed!", "likes": 1}}, {"topLevelComment": {"author": "Creative Texan", "text": "How the tag function recognized the difference between the strings and values and which to store in the first array and which to store in the second array is not clear. I understand how the ...rest operator works where it places the remaining unknown number of parameters into to an array but how this particular function differentiates between the values and strings is not explained, also why does the tag function place the strings in an array as well?", "likes": 4}, "replies": [{"author": "k n", "text": "this Template Literals (ES6) is  coded in such a way that  first parameter of a function in which it is applied is assumed to be string array and another parameter to be number array (irrespective of ur personal names given).\nand why not ...string??\nmaybe they used [string = ...string] concept...", "likes": 0}]}, {"topLevelComment": {"author": "Deepak Surya", "text": "can anyone explain why he's put three dots in front of the values parameter in the tag function?", "likes": 0}, "replies": [{"author": "khaled S", "text": "@Eliseo Rodriguez Thanks a lot man that was helful", "likes": 0}, {"author": "Eliseo Rodriguez", "text": "Its called the spread operator, what it does is copy everything in the object its put into. For example. \nlet dontMutateThisArray = [a,b,c,d,e,f,g];\n  lets say we wanna make a copy and mutate it. \nlet shouldIMutateThis = dontMutateThisArray;\nI want to change a copy of this array but it is a refrence type meaning if we did  change this array it will change the original array anyway because the copied variable is just pointing still to the original variable. Thus changing what you might have thought was a different object. \nshouldIMutateThis.slice(0, 1);\nwill change dontMutateThisArray \nSo to make a true copy that has nothing to do with the original use ...objectToBeCopied\nFor this example we are using an array so\n let iCanMutateThisSafely = [...dontMutateThisArray];\nNow you can do whatever you want and maintain the original, this is the way all functional programming should be done, preserve the original and mutate the copy. \nHope this helps, this is what I know if I got anything wrong feel free to correct me.\n\n\nThat only answers what it does, what he is doing here is something more advanced on top of this spread operator, which Im still learning obviously since Im here. And Im still trying to understand it.", "likes": 2}, {"author": "Deepak Surya", "text": "freeCodeCamp I actually googled it and now I kinda have an idea about it, but I don't understand the code copied from MDN, I guess I have to try again.", "likes": 0}, {"author": "freeCodeCamp.org", "text": "Check out this video for an explanation of those dots: https://youtu.be/iLx4ma8ZqvQ", "likes": 2}]}, {"topLevelComment": {"author": "Emilio Soto", "text": "This was very helpful. Thanks very much!", "likes": 0}}, {"topLevelComment": {"author": "Faisal Naseer", "text": "which IDE are you using?", "likes": 0}}, {"topLevelComment": {"author": "Leyla Ziba", "text": "great explanation of this topic. you made it easy to understand.", "likes": 0}}, {"topLevelComment": {"author": "Dimarzio", "text": "Wow.. Nice explanation of the last MDN example. Bravo.", "likes": 0}}, {"topLevelComment": {"author": "Good Wish", "text": "Good last example. It took me 10 minutes to understand it.  :)", "likes": 7}}, {"topLevelComment": {"author": "Sithiss", "text": "What is this lighting fast typing speed Oo", "likes": 4}, "replies": [{"author": "Иван Јакимовски", "text": "More like video speed 2x.", "likes": 5}, {"author": "Anton Kot", "text": "8+ years of practise, I suppose", "likes": 1}]}]}