{"video": {"id": "KUmi_KBLMQY", "title": "Computer Basics 9: More on the Motherboard", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n   A little more detail on what constitutes a motherboard and what functionalities are standard in PCs.\n  Today we're going to be talking more about the motherboard.\n  We mentioned it briefly in previous videos, but we'll give some more detail today.\n  What makes a motherboard is the connection between the CPU and the memory - if it doesn't do that, it's not a motherboard.\n  But, most motherboards do a lot more than that.\n  Primarily, they have expansion slots and ports.\n  Expansion slots are where you put anything that can increase the performance of a computer without putting more load on the CPU.\n  For example, a graphics or a sound card would up the user experience by giving better sound or video quality, but it wouldn't slow down the computer.\n  A Network Interface Card could also go in an expansion slot.\n  This would help your computer conncet with the networks around it, something we'll talk about more in upcoming videos.\n  PC and Express cards are primarily found in laptops, and Express cards are taking over due to their smaller size.\n  In addition to expansion slots, motherboards have ports.\n  On your computer, you probably know there's a place to connect USB, firewire, SD card, ethernet, even an audio plug-in to listen through headphones.\n  These are all considered ports, a place on the motherboard where you can connect the CPU to some outside source to either get or give information.", "duration": "PT1M51S", "likes": 0, "views": "26440"}, "comments": [{"topLevelComment": {"author": "Trader Babg", "text": "Thanks", "likes": 1}}, {"topLevelComment": {"author": "E Eddenson", "text": "Thanks my Xbox is broken", "likes": 0}}, {"topLevelComment": {"author": "Ho Ho Chi", "text": "How about a RAM ? Cos it can be inserted in a slot or port either ?", "likes": 0}}, {"topLevelComment": {"author": "Martin Mickels", "text": "Very helpful vids, thanks!", "likes": 2}}, {"topLevelComment": {"author": "pablo sanch", "text": "You have done a great job with all your vids!!\n-P", "likes": 2}}, {"topLevelComment": {"author": "Techadon", "text": "very good teacher.. doesn't waste time... i love all your tuts", "likes": 16}}]}