{"video": {"id": "lcYUjR8jCEQ", "title": "Sliding Panels: CSS Tutorial (Day 25 of CSS3 in 30 Days)", "description": "Create sliding content panels with CSS3!\n\n⭐️Files you need ⭐️\n💻Sliding Panels Code: https://www.dropbox.com/sh/wbw2ldo2caaal7c/AABWT7lqrlDF_hqCbtbxFo4Ca?dl=0\n💻All tutorials in this series need this \"_theme-styles\" directory (only download once): https://www.dropbox.com/sh/890hx6ke34oovaz/AAByJ-jb-H5pWuIUx7t_GvQqa?dl=0\n\nThis video works as a stand-alone tutorial but is also day 25 of CSS3 in 30 Days. For the rest of the series, check out this playlist: https://www.youtube.com/playlist?list=PLWKjhJtqVAbl1AfjiGyYxwpdAPi5v-1OU\n\nCSS3 in 30 Days is developed by Brad Hussey. Check out his website for more great tutorials: https://codecollege.ca/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT13M9S", "likes": "417", "views": "23456"}, "comments": [{"topLevelComment": {"author": "Noga Fouz", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "MICKEYmouseYT", "text": "looking on another screen and trying to be pro?", "likes": 0}}, {"topLevelComment": {"author": "Elderny", "text": "hello sir i want to learn c++", "likes": 0}}, {"topLevelComment": {"author": "Max Boog", "text": "When you click on the box on a mobile device there is no way to slide it back. Do you know a way to fix this?", "likes": 1}}, {"topLevelComment": {"author": "Dennis Wenger", "text": "Wouldn't actually the frames be even worse using \"top\" if the screen was not at a very high resolution? I'm thinking the pixels would actually larger in that case.", "likes": 0}}, {"topLevelComment": {"author": "Saurabh Shukla", "text": "Thank you Brad for all this videos, very helpful!!!\nI have just visited your website codecollege  and I want to know how you have created a sliding testimonial section!! \nCan u please make a video on that \nIt will be very helpful for me and  for others!!!!!", "likes": 0}}, {"topLevelComment": {"author": "KNO3", "text": "Sliding From the bottom now we here", "likes": 6}}, {"topLevelComment": {"author": "Top Secret", "text": "There is the best web-instructor and the best way to explanation ever what I saw and heard 😊👍My regards, man! Great job! Your CSS course is awesome! I hope to see in future your masterclass or workshop about how to create real life websites  (web-pages) from psd mockup to html,css,js using most popular and modern technology like gulp, sass, pug and other from zero to final result. \np.s. Sorry for my bad english, I'm not a native speaker, I'am only studing english and web-development.", "likes": 2}}, {"topLevelComment": {"author": "Lucas Silva", "text": "Great! I'll modify this to activate when the user clicks, as I'm making a web app for myself and \"hover\" is not useful.", "likes": 0}}, {"topLevelComment": {"author": "yutao Wang", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "yassine KACM", "text": "Thank you bro,good job.", "likes": 0}}, {"topLevelComment": {"author": "ah bu", "text": "Thanks a lot! I'm following your CSS3 in 30Days with great interest! Even from Germany. Hope you doing CSS3 in 30Days someday again.", "likes": 0}}, {"topLevelComment": {"author": "Bhavika Kapadia", "text": "Thank you\nI will definitely use it in my project:)", "likes": 0}}]}