{"video": {"id": "lKKsjpH09dU", "title": "Micro-Frontends Course - Beginner to Expert", "description": "Don't know what a Micro-Frontend, but you've heard the buzz and you want to learn it. Let me take you from just starting out, to understanding asynchronous loading, error handling, shared state, cross platform micro-frontends, how to route multiple applications together, and even how to test Micro-Frontend code.\n\n✏️ Jack's channel: https://www.youtube.com/c/JackHerrington\n\n💻 Code: https://github.com/jherr/micro-fes-beginner-to-expert\n\n⌨️ (0:00:00) Introduction\n⌨️ (0:01:06) Micro-Frontend demo\n⌨️ (0:08:13) Why Micro-Frontends?\n⌨️ (0:11:50) Why Module Federation?\n⌨️ (0:20:16) Asynchronous Loading\n⌨️ (0:24:56) Error Handling\n⌨️ (0:31:42) Server Setup\n⌨️ (0:38:36) Sharing Functions\n⌨️ (0:50:15) Nomenclature\n⌨️ (0:51:35) Sever Cart Setup\n⌨️ (0:59:28) Sharing State\n⌨️ (1:02:42) Sharing the JWT\n⌨️ (1:13:53) Sharing the Cart\n⌨️ (1:26:48) State Sharing Alternatives\n⌨️ (1:27:21) Finishing the Cart\n⌨️ (1:29:36) Cross-Platform Micro-Frontends\n⌨️ (1:39:02) Micro-Frontend Routing\n⌨️ (1:48:24) Unit Testing\n⌨️ (1:51:53) End-To-End Testing\n⌨️ (1:54:55) What's Next?\n\n#microFrontends #moduleFederation #react #solidjs\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Wong Voon jinq\n👾 hexploitation\n👾 Katia Moran\n👾 BlckPhantom\n👾 Nick Raker\n👾 Otis Morgan\n👾 DeezMaster\n👾 AppWrite\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H56M44S", "likes": "7008", "views": "259900"}, "comments": [{"topLevelComment": {"author": "Claudio Seccia", "text": "This tutorial is A W E S O M E!!! Thanks Jack!!!", "likes": 0}}, {"topLevelComment": {"author": "Emily LeBlanc", "text": "What is the video Jack mentions in the error handling section?  I'd like to check out how to have my application fallback to older version of the components.", "likes": 0}}, {"topLevelComment": {"author": "Tim Ehrhardt", "text": "In the READ ME for “create-mf-app” it says “These projects are not production complete”. So if it is not production complete is there a way use Module Federation with CRA or do we have to just wait until CRA releases a version that will support MF? Would like to use create-my-app but it seems like it is not an option with it being not production ready.", "likes": 0}}, {"topLevelComment": {"author": "Aishwarya Kotla", "text": "Facing - npm ERR! Invalid package name \"@\" of package \"@@nestjs/passport\": name can only contain URL-friendly characters. Tried to remove \"@\": \"nestjs/passport\", it raises a new error  cannot find index.html in server. Any suggestion on how to fix this issue", "likes": 0}}, {"topLevelComment": {"author": "hussein hasan", "text": "I definitely going to send you a special fidget spinner gift in the near future for this AMAZING tutorial!!! \nLOTS OF THANKS.", "likes": 0}}, {"topLevelComment": {"author": "faren rai", "text": "only react apps what about angular and vuejs other native webpack apps  for microfornted  and example", "likes": 0}}, {"topLevelComment": {"author": "Diomar Felipe Villarroel", "text": "tengo una pregunta, que otras herramientas diferentes a webpack puedes utilizar para organizar el flujo de trabajo en los microfrontends?", "likes": 1}}, {"topLevelComment": {"author": "Frederico Luis Figueira", "text": "Really good video thanks Jack Herrington, there was a little cut on the video at 18:00 min, you're explaining about module federation", "likes": 0}}, {"topLevelComment": {"author": "Jonathan Rees", "text": "Correct me if I'm wrong, but returning the Subscription in the useEffect hook won't unsubscribe from the Observable. I'm sure you have to inside the useEffect hook return a () => subscription.unsubscribe(). Genuinely curious about this one :)", "likes": 0}}, {"topLevelComment": {"author": "SystKoRn", "text": "for me this idea about \"micro-frontend\" is really bad is like are motivated them to make projects with any frameworks in the same project and is not a good idea and is unsustainable, I was thinking what the best scenario will be and maybe is for old old projects without a path of development when these was started even in this scenario is like \"well we can continue with bad practices and we have react angular vuejs, tomorrow I want svelte or X framework\"", "likes": 0}}, {"topLevelComment": {"author": "marcello42", "text": "Hey freecodecamp, I see you are not on odysee so I an wondering how your content is licensed? I hope it is CC (as educational content should)? So we could mirror your content from YouTube to odysee.", "likes": 0}}, {"topLevelComment": {"author": "Abhi", "text": "Good tutorial but your on-screen movements are way too fast.", "likes": 0}}, {"topLevelComment": {"author": "Ronal Burgos", "text": "Great ...master ..!", "likes": 0}}, {"topLevelComment": {"author": "Ronal Burgos", "text": "¡Gracias!", "likes": 0}}, {"topLevelComment": {"author": "HARIHARAN A", "text": "Hi Sir, please tell any another resources to learn MicroFrontEnd with react", "likes": 0}}, {"topLevelComment": {"author": "Teerasak Vichadee", "text": "Note on react-router-dom. In this tutorial, Jack uses react-router-dom v5\n\nIf your app crash after implementing the router, you might use a different version of react-router-dom.\n\nIf you want to use the latest version of react-router-dom. Just change from Switch to Routes and change Route prop from component to element.", "likes": 5}}, {"topLevelComment": {"author": "Bob Francis", "text": "Joined but still not playing", "likes": 0}}, {"topLevelComment": {"author": "Mikhail", "text": "thanks for mentioning dio vs code extension ❤❤❤running to 👀it asap )", "likes": 0}}, {"topLevelComment": {"author": "Ramkumar Subramanian", "text": "Suggested this in 2015 but was dismissed as too advanced.", "likes": 0}}, {"topLevelComment": {"author": "Ramkumar Subramanian", "text": "This Microservices and Microfrontends removed the Schizophrenia. We can see it and do it as it exists. Having only a single UX team is problematic. Now each team controls its own frontend.  Love. Trinity and Neo.", "likes": 0}}, {"topLevelComment": {"author": "Vasil O'Connell", "text": "Отличный материал. Спасибо!", "likes": 0}}, {"topLevelComment": {"author": "Hugo Deiró", "text": "Extremely good! Really enjoyed that!", "likes": 0}}, {"topLevelComment": {"author": "Rajath Venkatesh", "text": "I am looking to share services and make them as singletons to be used between my shell and micro front ends in angular.\nI use angular architects module federation!\nI have multi repo MFEs so NX share libraries would not be a good option. \nAny advise?", "likes": 0}}, {"topLevelComment": {"author": "RaysPlay", "text": "Very interesting", "likes": 0}}, {"topLevelComment": {"author": "shashank kulkarni", "text": "thank you nice information", "likes": 0}}, {"topLevelComment": {"author": "Alexsandro Souza", "text": "How can I publish my course in the channel?", "likes": 0}}, {"topLevelComment": {"author": "Eric Andresen", "text": "But you could just expose the pdp page as a micro frontend and let the home page team place it where they want, so toy dont have to import and fiddle with the header and footer on all pages?", "likes": 0}}, {"topLevelComment": {"author": "SilverLion30", "text": "Bro, can you have a microfe in React and another in Angular? That would be awesome! Really good content.Thank you so much", "likes": 1}, "replies": [{"author": "Francis", "text": "Yes this is possible. Micro FE are tech agnostic", "likes": 1}]}, {"topLevelComment": {"author": "Paula Victoria Suárez Blanco", "text": "Thank you so much! I love it the course", "likes": 0}}, {"topLevelComment": {"author": "Aniket Kariya", "text": "This seems like overkill. Like, is this even needed when we have components? Microservices were invented because monoliths were becoming a mess and hard to scale and SOA had a short life. Microservices bought their own set of problems but they solved the problem and it was a right tradeoff to make. Backend has to handle spikes, security, latency, data access, monitoring, and what not, and frontend developers somehow can't handle a couple of pages seriously !!??  \n\nwhoever invented this, at least to me, is definitely overkill. not sure if fortune 500s are having trouble maintaining frontends as well. just an opinion, no hate.", "likes": 1}}, {"topLevelComment": {"author": "Dmitry G. Anderson", "text": "@Jack Thanks for the course =)\nshare your vs code settings please like plugins theme font =)", "likes": 0}}, {"topLevelComment": {"author": "Marc One N.", "text": "Thanks Jack for this awesome content! Just quick question: I am getting CORS issue with my application. I cannot get product to home or everywhere it is supposed to be displayed due to CORS which blocks the request. Any idea? Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Ghazanfar Khan", "text": "Create mf app not updated to latest versions.", "likes": 0}}, {"topLevelComment": {"author": "Yuval", "text": "Hi thanks for the greate video\nPnpx isnt just a windows thing. Its great for all platforms because it uses caching and symbolic links to resuse dependecies on your machine. So you wont need to use 30% of your hard drive just for node_module folders.\nThere are more nice features but the caching and linking one is the think that makes pnpm stands out of all the others", "likes": 0}}, {"topLevelComment": {"author": "Viraj Jayasinghe", "text": "Hi thank you for your video. is there a video that describes the MFE configuration with react. I means from scratch. without using create-mf-app?", "likes": 0}}, {"topLevelComment": {"author": "Death Disco", "text": "This kind of thing is why people are finally starting to hate react.", "likes": 0}}, {"topLevelComment": {"author": "Nima Eslamloo", "text": "Is this about server-side rendered micro front ends or only the client side?", "likes": 0}}, {"topLevelComment": {"author": "Amir Shakeri", "text": "how build production?", "likes": 0}}, {"topLevelComment": {"author": "Douglas Barraza", "text": "Thanks for all materials about micro-frontends", "likes": 0}}, {"topLevelComment": {"author": "Michael Morris", "text": "Tailwind sucks.  CSS was invented to get style information out of the DOM. Tailwind shoves it right back in using classes.  Anyone who thinks Tailwind is all neato hasn't had the joy of working with a massive HTML 3 site or has forgotten what a pain in the ass all those <center> tags and align attributes where.  Good video overall, but tailwind is useless beyond quick demoing.", "likes": 0}, "replies": [{"author": "Daniel Sousa", "text": "TailwindCSS has more than one approach. You can use it in your .css with @apply which is a good way to keep html clean, but I rather use classes anyway.", "likes": 0}]}, {"topLevelComment": {"author": "The Sovereign of Solitude", "text": "I'm new to this, do anyone know about how to optimize seo and deploy for microfrontend?", "likes": 0}}, {"topLevelComment": {"author": "smith dragon", "text": "I think we can use a gateway to put all the service together .so in this way we don't need to integrate other service to the home  router service", "likes": 0}}, {"topLevelComment": {"author": "Nathan Hedglin", "text": "If you share the Organisms then the molecules and atoms will get loaded anyways as they're dependencies. Would they be exposed and useable though?\n\nIf every micro-frontend defines their own organisms, then how are teams supposed to find those shareable components? \n\nYou have to explicitly share and import them. Wouldn't having a central location be better?", "likes": 0}}, {"topLevelComment": {"author": "redda2", "text": "Any tutorial for Angular?", "likes": 0}}, {"topLevelComment": {"author": "Zaarc Baan", "text": "how the hell is JWT called a \"Jot\" ? just call it a token or jwt or a web token....", "likes": 0}}, {"topLevelComment": {"author": "Nivi", "text": "Saw a video that started with \"Micro-Frontends\" and got an I.T. video instead....Giving this 0/10 as it's not what I expected.", "likes": 0}}, {"topLevelComment": {"author": "Kirill Pavlovskii", "text": "So great course", "likes": 0}}, {"topLevelComment": {"author": "omar akki", "text": "Big thanks for you", "likes": 0}}, {"topLevelComment": {"author": "Philip Roberts", "text": "Way above me thanks anyway I think 😅", "likes": 0}}, {"topLevelComment": {"author": "philip_jc", "text": "Great video, very well explained concepts and implementations. I am currently gearing up to implement microfrontends in my projects at work, but as with other videos in the scene currently yu have not dug into how they are hosted and shared via real environments once deployed. I have hazarded some guesses. In the Webpack configs we point to where the remote projects are hosted (locally (localhost) on in your tutorial) is it safe to safe we just need to point at where we store them once deployed, for me this would be in the nginx folder, nginx/build/project files (index.js).\n\nCheers", "likes": 0}}, {"topLevelComment": {"author": "HaoLux", "text": "Can you give me theme vscode", "likes": 1}}, {"topLevelComment": {"author": "HaoLux", "text": "Can you give me vscode", "likes": 0}}, {"topLevelComment": {"author": "Sebastian Paniagua Isaza", "text": "Just for anyone who's dealing with an error when adding reac-router-dom, I've just find out that Switch is no longer Supported. Use Routes instead. React and it's changes are really annoying.", "likes": 3}, "replies": [{"author": "David Lim", "text": "Could you reply with the snippet of code that you used to fix the issue please?", "likes": 0}]}, {"topLevelComment": {"author": "Anurag Singh", "text": "26:24", "likes": 0}}, {"topLevelComment": {"author": "Ehab Okal", "text": "Thank you very much for this video , I'll be looking forward to learn more from you ❤", "likes": 0}}, {"topLevelComment": {"author": "Rocketman001", "text": "Hi Jack, Pls is it possible to use Module Federation on an existing project?", "likes": 0}}, {"topLevelComment": {"author": "chetan kumar", "text": "Awesome Content Jack. Wondering how you would go about doing this in an app that is created with CRA?", "likes": 1}, "replies": [{"author": "Travis Gillitzer", "text": "CRA doesn't have support for Module Federation yet I don't think..   I'm not sure if they even have a version that supports Webpack 5 yet.", "likes": 1}]}, {"topLevelComment": {"author": "ا لـ ـجـ ـز ا ئـ ـر ي", "text": "I Can build it all and deploy this app with builded  HTML/CSS/JS files to my host?", "likes": 0}}, {"topLevelComment": {"author": "Maxim Zaytsev", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Kayote", "text": "Apologies for the poor choice of words but I want people to strongly consider alternatives to this approach before deciding upon this. At my last place, the CTO, even though he didnt understand what micro-frontends are, was still insistent that this is the way to go for their startup (they were working on the MVP!). Unnecessary complexity just for the sake a few very specific case benefits makes no sense to me.", "likes": 0}, "replies": [{"author": "DrGabbo", "text": "Crazy CTO, probably he wanted to make a cool PPT to present to the other executives so he`d look like a rain main", "likes": 0}]}, {"topLevelComment": {"author": "Vinícius Rodrigues Marcili", "text": "Its possible use Angular with this method?", "likes": 0}}, {"topLevelComment": {"author": "Harsh Vora", "text": "PNPX commend not found", "likes": 0}, "replies": [{"author": "Paolo Cavone", "text": "Windows installation of the pnpx CLI, from poweshell as administrator run the command: Invoke-WebRequest 'https://get.pnpm.io/v6.16.js' -UseBasicParsing -o pnpm.js; node pnpm.js add --global pnpm; Remove-Item pnpm.js", "likes": 0}]}, {"topLevelComment": {"author": "TranscendentPhoenix", "text": "We're just making buzzwords up now.", "likes": 0}}, {"topLevelComment": {"author": "Secret EyeSpot", "text": "Npx works just fine with windows 10", "likes": 0}}, {"topLevelComment": {"author": "Cole Drain", "text": "Never knew I would have the opportunity to be taught by Kevin De Bruyne.", "likes": 0}}, {"topLevelComment": {"author": "Matias Sosa", "text": "Can this solution be used with Ionic React?", "likes": 0}}, {"topLevelComment": {"author": "sam k", "text": "I Didnt understand how login is retained from homepage to cart page.Can any body help me what  I am missing .Is this is becoz of rxjs or he stored the jwt in some local storage to be extracted when cart page is loaded?", "likes": 0}, "replies": [{"author": "Bilal Bhojani", "text": "Hi, it is bcoz of rxjs.", "likes": 0}]}, {"topLevelComment": {"author": "ab def", "text": "Which react auto complete extension are you using?", "likes": 0}, "replies": [{"author": "Ruben Verster", "text": "Github Copilot babyyyyy :D <3", "likes": 0}]}, {"topLevelComment": {"author": "Anyz Zas", "text": "Does anyone know the name of the theme he's using? Looks really good", "likes": 1}}, {"topLevelComment": {"author": "Luciano Zangeronimo", "text": "amazing, really super cool, tks Jack", "likes": 0}}, {"topLevelComment": {"author": "Esther Ejidike", "text": "Hello @Jack Herrington  and everyone else. I am having trouble installing npm and starting the server on the server app. I keep getting this error \" Invalid package name \"@\": name can only contain URL-friendly characters\". I believe this error is being caused by this dependency \"@\": \"nestjs/passport\", how do i get around this.", "likes": 3}, "replies": [{"author": "Dmitry G. Anderson", "text": "use yarn instead npm", "likes": 0}, {"author": "Akansha S", "text": "@Calvin Thanks! that worked for now... Couldn't find a genuine workaround though", "likes": 0}, {"author": "Calvin", "text": "Hi @Esther, were you able to resolve it ?\nIn case you weren't,  just delete the \"@\": \"nestjs/passport\" line\nI did it and so far everything seems to be fine - not sure if it's the best way to go, but at least gets you unblocked", "likes": 1}, {"author": "Arabog Arabog", "text": "@Jack I am getting the same error. Any idea on how to go about this?", "likes": 1}]}, {"topLevelComment": {"author": "Two Left Shoes", "text": "Like a boss", "likes": 0}}, {"topLevelComment": {"author": "seena haqverdy", "text": "Amazing 👌", "likes": 0}}, {"topLevelComment": {"author": "Admir Alicic", "text": "If I could, I'd hit 'Like' for this 10 times, awesome content, thank you :)", "likes": 0}}, {"topLevelComment": {"author": "Coordinates", "text": "vs code is powerful AF  13:05", "likes": 0}}, {"topLevelComment": {"author": "Kamerton Audiophile player", "text": "I started to use Micro-Frontends back in 2000. I am glad that the approach got popularity now, so you can learn it over youtube now. Thanks for getting people familiar with the architecture.", "likes": 2}}, {"topLevelComment": {"author": "Teon Prudent", "text": "What autocomplete plugin are you using?", "likes": 0}, "replies": [{"author": "Ruben Verster", "text": "github copilot babyyyy :D <3", "likes": 0}]}, {"topLevelComment": {"author": "BungyLaces70.3", "text": "Micro fr'ends", "likes": 0}}, {"topLevelComment": {"author": "ErlWable", "text": "This is gold", "likes": 0}}, {"topLevelComment": {"author": "CHITUS💙⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻", "text": "You’ve highlighted a major problem with micro frontends in this video in that you need to have versioning. Wrapping components in an error boundary is not a solution, nor is having a fallback to a library. You may as well just have the library in the first place.", "likes": 15}}, {"topLevelComment": {"author": "Abhi M", "text": "Will the plug in be available for other build tools like vite", "likes": 1}}, {"topLevelComment": {"author": "mrmiyagi5", "text": "web has become so bloated that this is what we get ha", "likes": 1}}, {"topLevelComment": {"author": "Tejas Ahluwalia", "text": "I love how the auto subtitles makes \"micro-frontends\" into \"my girlfriends's\" xD", "likes": 1}}, {"topLevelComment": {"author": "Suresh Veeramalla", "text": "Will it work for angular also??", "likes": 0}}, {"topLevelComment": {"author": "Shashikant", "text": "Thank you so much, it's very informative and make it easy to understandable. thanks  😊 👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "Bryan Lumbantobing", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "jongood01", "text": "You’ve highlighted a major problem with micro frontends in this video in that you need to have versioning. Wrapping components in an error boundary is not a solution, nor is having a fallback to a library. You may as well just have the library in the first place.", "likes": 2}, "replies": [{"author": "jongood01", "text": "@Jahz Yeah that’s my point. Team A can’t deploy an api change to a component because it will break everyone who consumes it. I can’t see a way you could coordinate breaking changes without versioning so then you end up either needing to have a rule like “components must never have props” or you have versioning which defeats the whole purpose of module federation.", "likes": 0}, {"author": "Jahz", "text": "Having only the npm library robs you of the whole point of module federation which is having your micro front-ends update by just refreshing the page rather that communicating about a library update and redeploying. I agree with you though in a sense that depending on how much you’re dependent on those live updates, module federation might just be a complication you don’t need to add", "likes": 0}]}, {"topLevelComment": {"author": "Leo Desiatnykov", "text": "Top-noch skills. Many thanks", "likes": 0}}, {"topLevelComment": {"author": "Cnsnmms", "text": "Thank you for wasting my 2 hours.", "likes": 0}}, {"topLevelComment": {"author": "Research and Build", "text": "Why do they come up with a fancy name \"micro frontend\" when really its just a library...i mean sure its handed to us by the server but its not much different than acting just like  library, its a UI library...just in the client instead of the server. I swear to God programmers these days just like to sit around and come up with words", "likes": 2}, "replies": [{"author": "pakito de rivera", "text": "it has to sound fancy, for. kiddos to try it out and think they are great programmers", "likes": 0}]}, {"topLevelComment": {"author": "zengin07", "text": "After watching demo part at the beginning here is my opinion:\nThis may be very beneficial for large projects that are developed by multiple teams but I think nx workspaces provides similar benefits more conveniently for projects that are developed by single team. \n\nThanks for the high quality free content.", "likes": 10}, "replies": [{"author": "uziboozy", "text": "The point of micro frontends is that each microfrontend can be developed independently.\nNx workspaces doesn't solve that issue.", "likes": 3}]}, {"topLevelComment": {"author": "Олег Олейник", "text": "Exсellent work! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Balaji Kesavan", "text": "Great going , I always like your videos ,  Thanks  😊", "likes": 0}}, {"topLevelComment": {"author": "Tim Myers", "text": "Mind blown.... thanks alot Jack.", "likes": 1}}, {"topLevelComment": {"author": "afj9966", "text": "Single web dev works on the whole project in startups while dev in big corps form teams working on pages with better pay\n\nWhat a world", "likes": 15}, "replies": [{"author": "Jack Williams", "text": "Pro's and Con's to either.", "likes": 1}, {"author": "Bryan Liu", "text": "U learn more in a startup tho", "likes": 2}]}, {"topLevelComment": {"author": "Anthony P", "text": "Awesome !!! Thanks for the video.", "likes": 0}}, {"topLevelComment": {"author": "androidgeeking", "text": "What happens with redux and localstorage? How do you eliminate conflicts?", "likes": 0}, "replies": [{"author": "Ruben Verster", "text": "rather just use redux-persist. then it saves your store in localStorage\n\nyou can also have an algortihm run that pulls from redux and localStorage and then just get the unique ones by id :P\nYou gotta think man", "likes": 0}]}, {"topLevelComment": {"author": "szeredai akos", "text": "Why do you use the word share? In architecture that is called coupling.\nSo, in your header app.name is a little bit weird. You are essentially creating a layer of error handling across your project which deals with errors within the same project. That has a maintainability issue. Lets say, there is a 180 screen project with 10 different applications which makes use of the header. Ideally developed and maintained by 10 different teams.\n\nAnd the contract changes.\n\nLets say 2 of the teams implemented proper error handling on remote components (I am exaggerating, there is less than 1 in 20 FE teams which have that amount of discipline). That leaves you with 8 teams which need to be coordinated to handle the contract change. Technical coordination of 8 teams ... do you have any idea how expensive that is?\n\nSo in essence, shared components in your context is NOT a positive feature.\nObviously, it can be rooted out with the O from SOLID. So, the proper way for doing it is {!!app && app.name}\nJus sayin :D", "likes": 0}, "replies": [{"author": "szeredai akos", "text": "@Pradana GDE NPM just complicates things needlessly. The mechanism he described is solid but he uses it erroneously. You do need shared code, there is no doubt about that, but he has a shared component which is afferent to his application and efferent to contract which is digested on the application. That is essentially cross coupling. Pathological. You don't do that between apps, you don't do that between dev teams. Not even between 2 classes of the same app. Ever!\n\nSetting up an error boundary, or the condition I mentioned ensures some degree of discreteness. If you have way too much of those conditions then you remove that component from the shared bucket and have it reimplemented on all applications. Parallel systems are way worse than duplicate code.", "likes": 1}, {"author": "Pradana GDE", "text": "Thats what i wanna comment also, after watching 25% of this video, im getting a context of \"Shared Component\" rather than \"Microfrontend\" instead.\n\nMicrofrontend should be independent, where 1 MF error, the other MF should be fine, as same as how Microservice are not depend to each other as well.\n\nTalking about this shared component, why not just use npm library as component where the changes based on version, so we can control based on deployment documentation, rather than this realtime shared component changes but boom everything.", "likes": 1}]}, {"topLevelComment": {"author": "flozero", "text": "The only things missing I would say is how to deploy it properly in like saying bucket s3 or google or whatever.", "likes": 0}}, {"topLevelComment": {"author": "Rajesh Vishwakarma", "text": "Thanks a ton for such course on FE.", "likes": 0}}, {"topLevelComment": {"author": "yatheesh", "text": "i see the co pilot in action", "likes": 0}}, {"topLevelComment": {"author": "Nuwan Thuduwage", "text": "Jack this is a very good explanation and thank you for sharing knowledge, can you put the video link of the Error Handling scenario of loading the older version with the help of NPM and error boundaries. I couldn't find it. Appreciate it if you can mention the video link with us.", "likes": 2}}, {"topLevelComment": {"author": "dhanu bhardwaj", "text": "Interesting topic and Best part about is patterns of sharing the components . 👍", "likes": 0}}, {"topLevelComment": {"author": "Andrew Morgan", "text": "In case anyone gets blocked when trying to add React Router: If you just install router as shown in the video (with npm/yarn) without specifying a version, you'll get React Router v6. This version has replaced the Switch component with a Routes (not Route) component but it behaves the same and also changed the \"component\" prop on Route to be \"element\". Route's \"element\" prop requires the component to be passed in as \"<PDPContent />\" not just PDPContent like in the video.", "likes": 85}, "replies": [{"author": "novalentino94", "text": "gosh thanks! been hours stuck in this part, lol", "likes": 0}, {"author": "David Lim", "text": "Could you reply with the snippet of code that you used to fix the issue please?", "likes": 0}, {"author": "Akansha S", "text": "Oh you life saver.. ❤️", "likes": 1}, {"author": "Jonathan Keen", "text": "Thank you for this. I spend a good couple of hours on this.", "likes": 2}, {"author": "Ayimkan Rayapova", "text": "omg, i was struggling with the element={<.../>} a lot, thanks for this comment! you accidentally fixed my code which is not even related to this video", "likes": 2}]}, {"topLevelComment": {"author": "Maulik Sheth", "text": "Thanks Jack for the quick working implementation of micro front end in the first 8mins of this video! awesome. will follow the whole  vid.", "likes": 5}}, {"topLevelComment": {"author": "Ming Ching Chen", "text": "23:59  configs about module federation shared", "likes": 0}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Cláudio Medina", "text": "Man, you've just killed a few cats with that <span/> pretending to be a button at 1:56:43 .\nStill, great course that hits most of the topics in such an easy way to follow. 💪", "likes": 0}, "replies": [{"author": "Alex Alexx", "text": "@MRLIBERALES this bots got even into programming lol", "likes": 1}, {"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Mohammad Hussain", "text": "Maklemore changed his profession bruh no more hiphop", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Yokub ibn Safar", "text": "Why you never say hello in your videos", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "CodeDreamer_Ben", "text": "Wow, thanks so much especially for the JS to make the cart. Online cart, probably  can make this cart to their webpage on  shirt merge or others!", "likes": 2}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Yusoff Jamaluddin", "text": "He did not even mention to do 'yarn && yarn start' for the home part, as a beginner this is not good and gave a downvote immediately.\n\nHe is a good educator for beginners who have known about nodejs and npm, does they mention about it? NO.", "likes": 0}, "replies": [{"author": "Rumble", "text": "This isn't beginner content really", "likes": 3}, {"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Mardi Vester Tamma", "text": "Thank you for the nice explanation and great content sir 👍👍👍", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Zor", "text": "Thank you sir🙏🤍", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️", "likes": 0}]}, {"topLevelComment": {"author": "Magvin", "text": "How to deploy them in AWS this is the question", "likes": 0}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 1}]}, {"topLevelComment": {"author": "Nikhilesh Katakam", "text": "Thanks for doing this comprehensive tutorial Jack.", "likes": 3}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 1}]}, {"topLevelComment": {"author": "husler", "text": "Is Micro-frontend and Micro-services same? 🙄 If you can explain in just simple term.", "likes": 2}, "replies": [{"author": "husler", "text": "@Jack Herrington ok got it", "likes": 1}, {"author": "Meleeman", "text": "Lol let's divy up a front end project so it's easier for multiple people to work on it without messing it up as bad, it's an unnecessary process complicating the project and making it more difficult to deploy, and having an app break because of something someone else did more likely, wow this was a problem frameworks we're supposed to solve", "likes": 1}, {"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}, {"author": "Jack Herrington", "text": "Micro-frontends are the UI version of Micro-services. So you are breaking up the UI of an application into smaller shareable pieces.", "likes": 4}]}, {"topLevelComment": {"author": "Alexandro Campos", "text": "Thank you very much!", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Meleeman", "text": "Man I love working with node but I don't want to work for a nodejs company", "likes": 2}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Meleeman", "text": "This sounds like a terrible idea, and more excuses for me to not do anything because the other team didn't get x feature done", "likes": 2}}, {"topLevelComment": {"author": "Mahendra Nath", "text": "Thank you so so much 👍🏼🎉🙏⭐❤️", "likes": 1}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Al", "text": "This is what im learning about bigger companies. You're very much a small cog in a BIG machine. Which is nice because you can apply for jobs and not worry thinking you need to be some full stack wizzard", "likes": 10}, "replies": [{"author": "MRLIBERALES", "text": "@Meleeman for more info dm ☝️", "likes": 0}, {"author": "Meleeman", "text": "Yeah I'd rather be cool lol, you're more easily passed around as a full stack dev, always a new job, always something new to do, new to learn and you can really be powerful in an organization, as you can literally engineer systems at a higher level", "likes": 1}, {"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Alkhemist", "text": "Wow", "likes": 2}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Zaky Vids", "text": "Please also make a crash course on Figma and no code applications", "likes": 0}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Sedislam Ng", "text": "Don't know where you watching this from but I wished you all the best in life ❤️❤️", "likes": 9}, "replies": [{"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Sourav _-_", "text": "this is an exotic topic. thanks for the videos.", "likes": 2}, "replies": [{"author": "MRLIBERALES", "text": "@Meleeman for more info dm ☝️", "likes": 0}, {"author": "Meleeman", "text": "Exotic is a good word for it, god help any startup or small organization doing this", "likes": 2}, {"author": "MRLIBERALES", "text": "for more info dm ☝️☝️", "likes": 0}]}, {"topLevelComment": {"author": "Milicev", "text": "Whats the extension name that suggest you what to type next? \nThanks in advance!", "likes": 2}, "replies": [{"author": "K Taymour", "text": "I  was about to ask the same question.\nIf anyone knows we would be grateful, thanks", "likes": 0}]}, {"topLevelComment": {"author": "Hydra", "text": "I clicked the video because i liked your smile", "likes": 1}}, {"topLevelComment": {"author": "Ikromov.T", "text": "Hi thanks for free lessons \nPlease post lessons about Front End dev more", "likes": 3}}, {"topLevelComment": {"author": "Mohinder Singh", "text": "Wow dream come true", "likes": 2}}, {"topLevelComment": {"author": "daddymilos", "text": "wow now I can use microservices with micro-frontends\nintresting", "likes": 3}}, {"topLevelComment": {"author": "Syllight", "text": "I will remember to donate to fCC when I'm old enough to get a job!", "likes": 80}, "replies": [{"author": "Ruben Verster", "text": "I've been programming for.... 2 years... I still haven't donated... This made me feel so bad. I started on FCC. So I know where I'm blessing a part of my salary end of the month ^_^", "likes": 0}, {"author": "Strict on budget", "text": "I already earned my first salary\ngoing to donate to FCC!", "likes": 1}, {"author": "Azhaguraja AllinAll", "text": "We will bro,we will..\nNovember 17 2021 9:17 pm", "likes": 3}]}, {"topLevelComment": {"author": "Shiv", "text": "Can you use the Most Ancient Sacred Language \"SANSKRIT\" for Computer Code? 🙏please Do one Session on Sanskrit in computer world", "likes": 1}, "replies": [{"author": "Dany Tops", "text": "*Only one problem Sanskrit have sanskrit more latter English 26 later easy to type but Sanskrit have difficult to type and harder to make adaptable keyboard*", "likes": 1}]}, {"topLevelComment": {"author": "Narcissistic Narcissus", "text": "People, remember to subscribe to his channel. \nHe is a great educator!", "likes": 18}, "replies": [{"author": "CodeDreamer_Ben", "text": "Also always a great educator, do join their channel, become a patron of their patreon acc and support their non-profit webpage!", "likes": 2}]}, {"topLevelComment": {"author": "j r", "text": "That awesome Jack ...❤️❤️", "likes": 1}}, {"topLevelComment": {"author": "Eduardo Brito", "text": "Nothing on the description related to what technologies will show up in the video?", "likes": 3}, "replies": [{"author": "Eduardo Brito", "text": "@Shrumpf as with everything. Still, it's good to know what's the tech stack. Sometimes tech limits things, despite an approach being generic.", "likes": 0}, {"author": "Shrumpf", "text": "You could use whatever you want, its not bound to a specific technology.", "likes": 0}, {"author": "Jack Herrington", "text": "Module Federation, React, Solid-JS, Tailwind, etc.", "likes": 1}]}, {"topLevelComment": {"author": "Abhilash Sharma", "text": "🤘", "likes": 1}}, {"topLevelComment": {"author": "mfresh2o", "text": "Hello…. Excited to learn micro frontend and add the experience as a frontend developer… thank you for this 😊", "likes": 4}}, {"topLevelComment": {"author": "Sujahath Siddeek", "text": "excited to learn this", "likes": 1}}, {"topLevelComment": {"author": "Joey Callas", "text": "Second", "likes": 0}}, {"topLevelComment": {"author": "Mayank Bajpai", "text": "I am present ✌🏻 thanks for this one", "likes": 1}}, {"topLevelComment": {"author": "Menard Maranan", "text": "FIRST!!!", "likes": 2}}, {"topLevelComment": {"author": "Saneen Mohammed", "text": "Yaay", "likes": 0}}, {"topLevelComment": {"author": "Owais Farooq", "text": "hi", "likes": 0}}]}