{"video": {"id": "LSBC3n9x52Q", "title": "Maths for Programmers: Introduction (Tips For Learning)", "description": "Transcript:\n\nHello World, Shawn Grooms here with Free Code Camp. And in this video I will be giving you three tips on how to learn Discrete Mathematics. The first tip is to stay calm. People often hear the word Mathematics and panic. When you panic, you stop listening. If you stop listening, you can't learn the material. If you simply stay calm, then you'll be able to learn the material better. You aren't being graded on the subject so there's no need to panic. The second is to rewind. You can rewind the videos at any time. When I learned Discrete Mathematics I didn't have this opportunity. In theory you should be able to learn the material much faster than I was ever able to. I strongly encourage rewinding the video. Finally, explain. Once you think you understand the material of the videos you can try to explain the material out loud either to yourself or to a friend. If no one is around, or you feel weird talking to yourself then you can try and explain it to a rubber ducky. There's a concept in Programming called Rubber Ducky debugging, which is where programmers go through their code, line by line, trying to identify bugs in their code by explaining it to a rubber ducky. So similarly, if you go through the material of the videos, subject by subject, you will soon be able to identify any gaps in your understanding of the material.\n\n\n\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nFollow us on twitter: https://twitter.com/freecodecamp\nLike us on Facebook: https://www.facebook.com/freecodecamp\nFollow Quincy on Quora: https://www.quora.com/Quincy-Larson", "duration": "PT1M28S", "likes": "857", "views": "67530"}, "comments": [{"topLevelComment": {"author": "Abid Ali", "text": "Excellent video.", "likes": 0}}, {"topLevelComment": {"author": "Carl Akafia", "text": "l need the link to your other video on discrete maths, mathematical induction and the rest.", "likes": 1}}, {"topLevelComment": {"author": "Matt", "text": "First he says stay calm, no marks, no pressure. Then he spikes our anxiety by saying we should theoretically learn faster than him. My fuckin emotions.", "likes": 2}}, {"topLevelComment": {"author": "Aleksandar X M", "text": "Good point ®️", "likes": 1}}, {"topLevelComment": {"author": "Harjit Singh", "text": "Hey, can you recommend a book (preferably free or cheap because im a student on a tight budget) that goes through what you say in these videos but in a bit more detail so that i can get further knowledge?", "likes": 2}, "replies": [{"author": "Nallius Sairus", "text": "If you're still interested in it after 8 months, look up \"Discrete Mathematics: An Open Introduction\". It's free and open source.", "likes": 2}]}, {"topLevelComment": {"author": "Raul Aguilera", "text": "Is there any book about discrete math that you'd recommend?", "likes": 2}, "replies": [{"author": "Salman Siddiqui", "text": "Concrete Mathematics, A Foundation to Computer Science by Donald Knuth", "likes": 0}]}, {"topLevelComment": {"author": "udendran mudaliyar", "text": "Superb", "likes": 1}}, {"topLevelComment": {"author": "Shilpa Kannan", "text": "Thank you so much for the efforts. Much appreciated :)", "likes": 1}}, {"topLevelComment": {"author": "Cram Quila", "text": "I keep coming back to this video when I get all confused in the later videos.... It's a great reminder to stay calm and keep my sh/t together.", "likes": 1}}, {"topLevelComment": {"author": "Erick Lee", "text": "so clear and simple thanks.", "likes": 1}}, {"topLevelComment": {"author": "an12", "text": "I'm FUCKING PANICKING WHAT DID YOU SAY?!", "likes": 5}, "replies": [{"author": "Kickboxing Monkey", "text": "me tooooo", "likes": 1}]}, {"topLevelComment": {"author": "Mono Me", "text": "\"when you panic, you stop listening\" \n\ni need a rubber Ducky\nLooking forward to finish the playlist :D thank you !", "likes": 8}}, {"topLevelComment": {"author": "Tsukiyomi ikuto", "text": "really grateful thanks.", "likes": 1}}, {"topLevelComment": {"author": "Pro Lookout", "text": "this is an awesome idea... great job guys👍👍👍👍", "likes": 1}}, {"topLevelComment": {"author": "TJ", "text": "Hi, is this maths for people that already know maths and have masters degrees in maths, that might also want to work at Google doing maths? That's what it looks like to a dumbo like me. I'm sure there's a link to programming somewhere, but I don't see it. I've skim-watched the vids, you're a clever guy.", "likes": 1}}, {"topLevelComment": {"author": "The Master of None", "text": "Can we get the Math Vids in a Playlist with an order? Thanks", "likes": 6}, "replies": [{"author": "freeCodeCamp.org", "text": "+manwithgills https://www.youtube.com/playlist?list=PLWKjhJtqVAbndUuYBE5sVViMIvyzp_dB1. Bare in mind the playlist is a work in progress and Is incomplete 😀", "likes": 4}]}, {"topLevelComment": {"author": "Regular", "text": "Thank you, love these vids.", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "We'll have another one out at a similar time tomorrow!", "likes": 1}]}, {"topLevelComment": {"author": "Devarsh Bhatt", "text": "1st", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": ":)", "likes": 0}]}]}