{"video": {"id": "lX9hsdsAeTk", "title": "How to Undo Mistakes With Git Using the Command Line", "description": "Git offers lots of different ways to undo, revert, recover and fix your mistakes. In this course, we'll look at the bad things that can happen to you - and how Git can save your neck.\n\n✏️ This course was created by Tobias Günther from Tower. Tower creates a powerful Git desktop GUI for Mac and Windows. You can download it here: https://www.git-tower.com\n\nNote: This course focuses on using Git with the command line. You do not need Tower or any other GUI software to follow along.\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Introduction\n⌨️ (00:54) Hosted by Tower\n⌨️ (01:29) Git as your safety net\n⌨️ (02:50) Discard all local changes in a file\n⌨️ (04:28) Please be careful: discarding local changes cannot be undone!\n⌨️ (05:03) Restoring deleted files\n⌨️ (06:10) Discard chunks / lines in a file\n⌨️ (10:22) Discarding all local changes\n⌨️ (11:42) Fixing the last commit\n⌨️ (14:53) What \"rewriting history\" means\n⌨️ (15:54) Reverting a commit in the middle\n⌨️ (18:48) Resetting to an old revision\n⌨️ (21:48) Resetting a file to an old revision\n⌨️ (23:59) The Reflog\n⌨️ (24:38) Recovering deleted commits\n⌨️ (27:46) Recovering deleted branches\n⌨️ (31:22) Moving a commit to a new branch\n⌨️ (33:55) Moving a commit to a different branch\n⌨️ (35:57) Interactive Rebase: an overview of what you can do\n⌨️ (37:54) Interactive Rebase: how it works in general\n⌨️ (38:36) Editing old commit messages with Interactive Rebase\n⌨️ (41:29) Deleting commits with Interactive Rebase\n⌨️ (43:20) Squashing multiple commits into one with Interactive Rebase\n⌨️ (46:00) Adding changes to an old commit with Interactive Rebase\n⌨️ (51:54) Splitting/editing an old commit with Interactive Rebase\n⌨️ (54:01) Reminder: don't rewrite commits that you have already shared!\n⌨️ (54:38) First Aid Kit for Git: a set of short videos and a cheat sheet, free to download (www.bit.ly/git-first-aid-kit)\n\n⭐️ Special thanks to our Champion supporters! ⭐️ \n🏆 Loc Do\n🏆 Joseph C\n🏆 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT55M21S", "likes": "2037", "views": "58067"}, "comments": [{"topLevelComment": {"author": "Private Name", "text": "Fantastic video. And very comprehensive.  Only thing is that you never gave the CLI commands for the last exercise, \"Splitting / Editing and Old Commit.\"  I took good notes on everything else. Thanks for this post.", "likes": 0}}, {"topLevelComment": {"author": "Cesar Espitia", "text": "Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Harshad Pandit", "text": "Probably the most important topic on GIT explained in the most simplest way. Awesome.", "likes": 0}}, {"topLevelComment": {"author": "Mo Ali", "text": "Not exaggerating, you are a gift from heaven, currently having problems with bad merges with master branch. This is helping me alot", "likes": 0}}, {"topLevelComment": {"author": "Batuhan Budak", "text": "Wow, amazing tutorial. After reading the git documentation I was really confused about some topics but this lesson made it clear to me. I really appreciate it thx for the great content.", "likes": 3}}, {"topLevelComment": {"author": "Charanjeet Kaur", "text": "You are awesome indeed. thanks alot!😍🙏 Thanks for providing such a crucial knowledge for free.", "likes": 0}}, {"topLevelComment": {"author": "Nomaan Butt", "text": "great video", "likes": 0}}, {"topLevelComment": {"author": "ZAIN WEB DEV", "text": "Nobody covered these git commands before. Thanks a lot!\n\nCan someone please tell me what are the commands for case # 17 at 54:01", "likes": 0}}, {"topLevelComment": {"author": "Ashirwad Sharma", "text": "git restore is not finding as a command. What would be problem??", "likes": 0}}, {"topLevelComment": {"author": "이건개발", "text": "$ git restore .", "likes": 0}}, {"topLevelComment": {"author": "Sanskaar Patni", "text": "This video is so goood! Important stuff af:\nI had seen the video when it came out.. \nBut yesterday when I ran into a problem I realized I should see this video again properly", "likes": 0}}, {"topLevelComment": {"author": "Amit Kumar Jena", "text": "Voila!", "likes": 0}}, {"topLevelComment": {"author": "Humayun Akhtar", "text": "Oh Man I'm so happy to learn multiple things in this video", "likes": 0}}, {"topLevelComment": {"author": "Zoltán Guba", "text": "Immediately added this video to my favourites. Thanks for the clear explanation!", "likes": 0}}, {"topLevelComment": {"author": "Angela J. Holden", "text": "This video saved me! About 2 weeks ago I deleted a commit and tried everything to could think to get it back. Discovering git reflog, then resetting or creating a new branch from that commit is exactly what I needed. And voilà, all work restored after many sleepless nights. THANK YOU SO MUCH!", "likes": 2}}, {"topLevelComment": {"author": "Jason Huebel", "text": "11:30 That's my biggest concern, git restore doesn't ask for confirmation. While I'm OK with that in other cases, when you are discarding changes, I feel like git should err on the side of caution.", "likes": 1}}, {"topLevelComment": {"author": "Jason Huebel", "text": "Great information. Thanks for sharing.", "likes": 0}}, {"topLevelComment": {"author": "RTX3050_valorant", "text": "hi freecodecamp is it possible can we get ppt?", "likes": 0}}, {"topLevelComment": {"author": "Bishnu Kumar Bhakat", "text": "Thank you for this drive, really it was an awesome tour to stack up the real base of \"git\".", "likes": 0}}, {"topLevelComment": {"author": "David Tang", "text": "This was awesome. Thank you! Definitely will be checking out Tower now lol.", "likes": 0}}, {"topLevelComment": {"author": "StarGazing", "text": "How many 'CTRL Z' is allowed in Tower?", "likes": 0}}, {"topLevelComment": {"author": "Michael Tarassov", "text": "Thanks a lot, it was great!", "likes": 0}}, {"topLevelComment": {"author": "Juan Camilo Vélez", "text": "Genial. Muchas gracias.", "likes": 0}}, {"topLevelComment": {"author": "Daniel López", "text": "thanks for the course and for making it freely available.", "likes": 0}}, {"topLevelComment": {"author": "Dgiulian", "text": "Another good tip is when we have worked on a file but want to commit only parts of it, we can use the -p option to decide which lines should and shouldn't be staged.", "likes": 3}}, {"topLevelComment": {"author": "Bruno Ribarić", "text": "\"Using the command line\" is an unnecessary addition to the title, given that a quite relevant portion of the video shows off his GUI tool.", "likes": 1}, "replies": [{"author": "sujith kumar", "text": "This is why I hate people, the entire video is free, it shows everything how to do as it claims using CLI, but you still had to comment to spread negativity somehow and pointed him showing his GUI tool to make the unrelated parts faster.", "likes": 2}]}, {"topLevelComment": {"author": "Sai Shashank", "text": "I wished I could undo mistakes that I made in my life by using git :’)", "likes": 54}, "replies": [{"author": "Arun", "text": "do it better next time, do not \"commit\" more mistakes :-)", "likes": 0}, {"author": "ms711", "text": "You can but you need admin privileges.", "likes": 1}, {"author": "Bishnu Kumar Bhakat", "text": "Yes! you can, by following up DRY principle.", "likes": 0}, {"author": "Thenga Kola", "text": "F", "likes": 0}]}, {"topLevelComment": {"author": "asha alex", "text": "Very well explained.. Thank you very much", "likes": 1}}, {"topLevelComment": {"author": "Dipen Parmar", "text": "Excellent job,  Great for experts as well beginners....", "likes": 1}}, {"topLevelComment": {"author": "Ozzy", "text": "Git is such an amazing tool!", "likes": 3}}, {"topLevelComment": {"author": "Mustafa Aljanabi", "text": "please I want a full course talks about HTML, CSS, and JS all of them are standard version like not html5 or css3 or something. Thanks!", "likes": 3}}, {"topLevelComment": {"author": "Jay Silverman", "text": "Really good video. On git restore -p enter \"?\" and git will show you the following:\n\ny - discard this hunk from worktree\nn - do not discard this hunk from worktree\nq - quit; do not discard this hunk or any of the remaining ones\na - discard this hunk and all later hunks in the file\nd - do not discard this hunk or any of the later hunks in the file\ns - split the current hunk into smaller hunks\ne - manually edit the current hunk\n? - print help", "likes": 2}}, {"topLevelComment": {"author": "Oceane", "text": "Question: \n1)when you squash two commit into one is it ok to delete the parents of that new commit", "likes": 0}, "replies": [{"author": "Arvind Parthasarathy", "text": "It is hard to understand exactly what is meant by this question and the answer is going to spell out the guesses and talk about what you might do in those situations. The answer to it assuming I've understood what you are asking is NO. The \"parent\" is likely another change made to the codebase prior to the 2 commits that were squashed together - NO only because you might want to keep that change. \n\nIf you were squashing to 2 commits into the \"parent\" in which case, you are really squashing 3 commits together, and you did not really want any of the 3 commits in your code base, you can technically do it. But the better thing to do in that situation is to just delete all 3 commits. You don't need to squash them before you delete them.\n\nIt is quite possible that I've not understood the question because quite frankly the question is a bit short of details. But you can always try things out yourself without messing up your current git branch and that is the wonderful thing about git. Steps:\n/home/<user>/<directory>> git checkout -b temporary-branch\n/home/<user>/<directory>> git rebase -i HEAD~15     // I've chosen 15 arbitrarily. You need to decide how far back the commits should go to get to the commits you need\nPerform the squashes and deletions that you think you need in the file that opens. Save the file and exit.\n/home/<user>/<directory>> git log --pretty-print\nCheck to see if the commit history looks correct to you, and build you code and run it to make sure you haven't deleted some commits that you did not intend to.\n\nGood luck !", "likes": 1}]}, {"topLevelComment": {"author": "blasttrash", "text": "awesome tutorial", "likes": 1}}, {"topLevelComment": {"author": "The CS Content", "text": "I also do videos about programming!😁", "likes": 0}}, {"topLevelComment": {"author": "Jean Carlos", "text": "Great explanation!\nBoom! Not panic anymore!", "likes": 1}}, {"topLevelComment": {"author": "Hideto S", "text": "Thank you for giving me a very detailed and very easy-to-understand explanation!!! RESPECT!!! 🙏", "likes": 3}}, {"topLevelComment": {"author": "Mohit Joshi", "text": "Make advance  full course on c++ with project", "likes": 0}}, {"topLevelComment": {"author": "Konstantin Rebrov", "text": "A like for a comprehensive overview of all the different possible things one can do in git to fix your mistakes.\nBut a dislike for using a GUI tool almost half of the time. You should have used git status and git log to find information about the commit history. And you also used the GUI tool to checkout different branches, and even do cherry-pick! I'm not necessarily against using GUI tools, but the title of your video is \"How to Undo Mistakes With Git Using the Command Line\r\". It implies that you will not use any GUI tools, only Using the Command Line! If instead you would have used Command Line ONLY and not used the GUI tool, it would have made explaining the actual git commands better. I think that using the GUI tool is less clear about what is actually going on. It is better to use the actual Command Line to explain how git works, especially since that's the title of your video!", "likes": 2}}, {"topLevelComment": {"author": "Njul", "text": "Git Tower looks nice, but it's not available for GNU/Linux, so I'll stick with command line.", "likes": 7}, "replies": [{"author": "ILIYA LESANI", "text": "Use GitKraken", "likes": 0}, {"author": "A. Hutsona", "text": "IMO all these types of things are nice but the CLI is really the best tool to use. It will be universal across all environments.", "likes": 4}]}, {"topLevelComment": {"author": "Arun J", "text": "❤️", "likes": 0}}, {"topLevelComment": {"author": "Cyril", "text": "The most usefull lesson, big thx!", "likes": 0}}, {"topLevelComment": {"author": "Ankur Gupta", "text": "This is a missing guide of my git journey.", "likes": 0}}, {"topLevelComment": {"author": "Jose Arevalo", "text": "The video is in my the top 10! Thanks! 👍🏼", "likes": 0}}, {"topLevelComment": {"author": "Gambit", "text": "delete folder then clone again", "likes": 0}, "replies": [{"author": "eniluck", "text": "Use RAR instead....", "likes": 0}]}, {"topLevelComment": {"author": "Richard Bajužík", "text": "Just use SmartGIT :D", "likes": 1}}, {"topLevelComment": {"author": "Mei", "text": "Exactly what I need!TY", "likes": 0}}, {"topLevelComment": {"author": "Hajar El majid", "text": "I've read it as how to do mistakes with Git and even with that I clicked never have blindly trust a channel like that!", "likes": 6}}, {"topLevelComment": {"author": "Chika Onyema", "text": "Wow", "likes": 0}}, {"topLevelComment": {"author": "Bouamar Elouahhabi", "text": "I remember your voice from gitower tutorials :), thanks for the good job!", "likes": 2}}, {"topLevelComment": {"author": "afrobear2310", "text": "never been so late !!!!", "likes": 0}}, {"topLevelComment": {"author": "K I R 4 N", "text": "Im bsc cs student and its project time...could you please mention some projects with tutorials bcs many project centers approach me with expensive fees...i can't afford it...help me guys", "likes": 0}}, {"topLevelComment": {"author": "VietnamNeko", "text": "my parents:", "likes": 12}}, {"topLevelComment": {"author": "Shubham Dandekar", "text": "Useful one.", "likes": 2}, "replies": [{"author": "freeCodeCamp.org", "text": "If you are brand new to git, start with this video: https://www.youtube.com/watch?v=RGOj5yH7evk", "likes": 0}]}, {"topLevelComment": {"author": "Megaheropap", "text": "Yes", "likes": 1}}, {"topLevelComment": {"author": "Anubhav Mukherjee", "text": "Second", "likes": 1}}, {"topLevelComment": {"author": "Abdulqudduus Babalola", "text": "Nice. Been looking for this forever", "likes": 0}}, {"topLevelComment": {"author": "Saksham Kshatri", "text": "Never been sooooo early!!", "likes": 4}}]}