{"video": {"id": "m7ZYJkvWwlE", "title": "Google Interview Question: How to Code a Queue Using a Stack. Whiteboard Wednesday by Irfan Baqui", "description": "Irfan Baqui shows you how to approach whiteboard coding interviews in this weekly series of Whiteboard Wednesday!\n\nCheck out more Whiteboard Wednesday videos here: https://www.youtube.com/watch?v=71kEvXsEKYQ&list=PLs2vRLhtciEt46Fg-uz1LQxb4xSW-KMGa\n\nToday's question is from Google: \"How to implement a queue using stacks?\"\n\nAbout Irfan: Irfan Baqui is a software engineer based in San Francisco. He loves to help other engineers grow and writes about how you can get your dream job: irfanbaqui.com/blog\nYou can learn more about Irfan here: http://irfanbaqui.com/about\n\nIrfan publishes weekly tech and non-tech videos on his youtube channel, including Whiteboard Wednesdays. Check it out and subscribe! https://youtube.com/c/irfanbaqui\n\nAsk Irfan a question or just say Hi: https://twitter.com/irfanbaqui\n\n-\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT16M30S", "likes": "202", "views": "6987"}, "comments": [{"topLevelComment": {"author": "Cheney Shreve", "text": "Great video, thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Dev P", "text": "Hello Irfan,\nSo we are using recursive approach here, and under the hood recursion uses Stack. If we go through iteratively, then we have to have an array.\nSo ultimately I'm using one another data structure here.\nSo can I ask it to interviewer like what is the point to do this whole stuff when I can easily do it??", "likes": 0}}, {"topLevelComment": {"author": "Rahul Gupta", "text": "wonderful video.. would love to watch more like these.", "likes": 0}, "replies": [{"author": "Irfan Baqui", "text": "Rahul Gupta There are more on my channel: https://www.youtube.com/c/irfanbaqui \nI'll be posting new ones every week, so make sure to subscribe :)", "likes": 2}]}, {"topLevelComment": {"author": "Alex Friedberg", "text": "The nervous acting is funny 😂", "likes": 6}}, {"topLevelComment": {"author": "David Castelblanco Benavides", "text": "I really like the recursion that Irfan used while implementing the solution, I'd come up with a cycle that pops and pushes the elements until it reaches the first element.", "likes": 1}}, {"topLevelComment": {"author": "Radio Heaven Tamil", "text": "Letters in the board are too small.. Pls improve it in next video..", "likes": 0}, "replies": [{"author": "Gaurav Chauhan", "text": "thats right", "likes": 0}]}, {"topLevelComment": {"author": "Dimko Zhluktenko", "text": "I haven't ever thought about implementing queue with stack, but it's possible however. Thanks", "likes": 3}, "replies": [{"author": "Irfan Baqui", "text": "You'd almost never do this in real life.. but a good one to solve.", "likes": 1}]}, {"topLevelComment": {"author": "Irfan Baqui", "text": "What kind of problems should I solve next? Also, there are more on my YouTube channel: https://www.youtube.com/c/irfanbaqui\nNew ones every week, so make sure to subscribe :)", "likes": 9}, "replies": [{"author": "Manoj", "text": "Irfan Baqui Please could you make a video based on data file handling. A problem that is to  create a program for storing and searching data's of school children's according to their roll number. This video was really awesome. Thank you . Hope to see more.", "likes": 0}, {"author": "Sahil Mangotra", "text": "Can you please implement top view of a tree without hash map  in java or c++ (Implementing in c)?", "likes": 0}]}, {"topLevelComment": {"author": "Interview_DS_Algo", "text": "Thanks a lot . It was really helpful", "likes": 2}, "replies": [{"author": "Irfan Baqui", "text": "Glad you liked it!", "likes": 0}]}]}