{"video": {"id": "MHtqcL-3_fM", "title": "From Self-Taught Programmer to Job", "description": "A talk on how you can start your programming career from nothing. Topics covered:  strategies on how to learn to program, tips on how to get a job, tricks for staying motivated along the way.\n\nLearn how to get a programming job with no experience.\n\nTalk by Daniel Deutsch (@DDCreationStudi) and Robert Axelsen (@robaxelsen). \n\nRecorded by Pusher.com. Check them out if you want awesome real-time tools, and subscribe to the their YouTube channel for more talks!\n\nPusher's channel: https://www.youtube.com/channel/UCoyqucxoFXDFnh3khD0rjUg\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT34M29S", "likes": "5805", "views": "169184"}, "comments": [{"topLevelComment": {"author": "Koulmen Ilyas", "text": "Motivation is a trap don't fall for it,  don't wait to be motivated to do programming > building a habit is the real key here > I recommend two books which help me with that ( the motivation myth by Jeff Haden && Atomic Habits by James Clear)", "likes": 4}}, {"topLevelComment": {"author": "traveler. through. life", "text": "I'm another imposter... Hi to all impostors!", "likes": 1}}, {"topLevelComment": {"author": "Salaheddin AbuEin", "text": "Thank you very much guys, very helpful. I wish you all the best.", "likes": 0}}, {"topLevelComment": {"author": "Young-Sossa14", "text": "when you look at the job description and the stack is not the same with the one i have learned do i still apply anyway?\nmaybe they can change something or", "likes": 0}}, {"topLevelComment": {"author": "Frost", "text": "\"I don't know why... time for cheesecake and coffee.\" Well, that was unexpectedly accurate. I also came from outside of programming. My major started out about Earth science but it turned into learning Python for various geospatial software.", "likes": 7}}, {"topLevelComment": {"author": "DarkTealGlasses", "text": "Motivation is the hard part for me.", "likes": 1}}, {"topLevelComment": {"author": "G Man", "text": "I worked on the dock doing back breaking labor in the heat and in the cold.  I taught myself to program and now I am a full stack web developer at the same company.  I have seen people come in with degrees in CS with a background knowledge of programming that couldn't develop.  Development is demanding and requires constant learning to stay relevant.  You have to be able to go into work and be willing to use your brain to work.  This sounds glamorous, but it means you're going to have a lot of days going home with your brain feeling burned out.  You have to understand that you are going to encounter problems that you can't solve, but somehow figure out a way to solve it anyway and with time constraints.", "likes": 18}}, {"topLevelComment": {"author": "Giordano Bruno", "text": "FREE Python tutorials on Youtube (Playlist): https://www.youtube.com/watch?v=6omQ-t9L9Ak&list=PLb1Ovsa8zsbVedMy8HfEVwKepZ2qWRV9J", "likes": 0}}, {"topLevelComment": {"author": "Xandar", "text": "Man, you stall my story, same here !", "likes": 0}}, {"topLevelComment": {"author": "Tytus Gierycz", "text": "Being a math genius isn't necessary but being a genius helps a lot;)", "likes": 2}}, {"topLevelComment": {"author": "Trebelo Jaques", "text": "The thumbnai made me think this was a video by c++ weekly by jason turner", "likes": 1}}, {"topLevelComment": {"author": "Roni", "text": "Hi, everyone. Just wanted to share my story. I’m currently almost 13 years old. It all started about a year ago, when I was getting bored of quarantine and looking to learn something new. It was then I found out about programming. I did a little research and decided to start learning HTML. I learned from a tutorial on a website, but barely practiced and had a hard time. I decided to quit. When I started 7th grade, I got offered by my school to learn to code at a boot camp. At first, I hesitated. I wasn’t sure if coding was for me. I decided to give it another try and to go to the boot camp. At the boot camp, we started learning the basics of C and I started to enjoy programming. I would make all sorts of projects and show them to my family. After learning C for several months, the boot camp moved on to Python, which I’m currently still learning. I enjoy coding in Python even more than coding in C because I can make cooler projects in Python more easily than in C. It is currently summer vacation, so I have time to watch tutorials, learn from websites and read books about programming. I forgot to mention that most of what I know wasn’t taught by the boot camp. I learned it by myself by watching tutorials on YouTube and searching on Google. My advice for any self taught developer is to practice a lot", "likes": 72}}, {"topLevelComment": {"author": "daniela guzman", "text": "I'm learning to code with freecodecamp. it's one of the most useful website I've ever found to learn to code. i totally recommend it", "likes": 0}}, {"topLevelComment": {"author": "KakSource", "text": "I will come back with feedback when i get a job as software developer", "likes": 2}, "replies": [{"author": "Seagull", "text": "@KakSource Did you ever get a job?", "likes": 0}, {"author": "KakSource", "text": "@Talson Hacks Haha! thank you!!, good luck to you, too!", "likes": 1}, {"author": "Talson Hacks", "text": "@KakSource lol, it is an idiom which means \"Good luck!\"", "likes": 1}, {"author": "KakSource", "text": "@Talson Hacks Lol, why!?", "likes": 0}, {"author": "Talson Hacks", "text": "Break a leg!", "likes": 0}]}, {"topLevelComment": {"author": "Alex Platt", "text": "3 weeks learning...", "likes": 0}}, {"topLevelComment": {"author": "stevebob240", "text": "This is inspiring, I'm learning through freeCodeCamp and other resources. Thank you so much!", "likes": 1}}, {"topLevelComment": {"author": "Drew Loeffler", "text": "Hey, this was terrific, thanks guys.", "likes": 0}}, {"topLevelComment": {"author": "Ralph L", "text": "Thank you.. All the information was very helpful", "likes": 0}}, {"topLevelComment": {"author": "Stephan Cote", "text": "I can relate 😅", "likes": 0}}, {"topLevelComment": {"author": "Alcides Gomez", "text": "Im a self taught programmer since 2019 from FreeCodeCamp and im still learning", "likes": 1}}, {"topLevelComment": {"author": "Saeed M. Adam", "text": "I’ll comeback to this comment once I get a job as a software developer. (Tue December 29, 2020)", "likes": 51}, "replies": [{"author": "Jarixa Martinez", "text": "December 28, 2021.. \nDid you get a job for programming?", "likes": 0}, {"author": "Om Prakash Yadav", "text": "so sad ,,,,u didn't got any job till now", "likes": 0}, {"author": "Origin", "text": "Any update?", "likes": 2}, {"author": "Angelo Reyes", "text": "Same here. (Fri July 2, 2021)", "likes": 2}, {"author": "Cristian Quesada Cossio", "text": "Good luck!! My best wishes", "likes": 1}]}, {"topLevelComment": {"author": "MaxSmile", "text": "8:08 what is the name of the tool?", "likes": 3}, "replies": [{"author": "steven musembi", "text": "wakatime", "likes": 0}]}, {"topLevelComment": {"author": "Shaz Noon", "text": "Aoa\nI'm 15 and learning from freecodecamp.\nTo all genius self taughts do u think that i can work as a freelancer or get a job in the next 1.5 years\nIf i study and code for 60-90 minutes a day", "likes": 2}, "replies": [{"author": "Jordan Partridge", "text": "Yes, but actually no, I would say start learning and as soon as you start asking yourself if you're ready start applying.\n\nDon't get discouraged if you don't have any luck, you'll only be 16/17 and that alone could make it difficult for employers to hire you due to certain labour laws (don't know what country you live in but it may apply anyway). And similar for freelancing especially if through toptal or similar as I believe they have age restrictions but don't quote me on that one.\n\nIf you have built up a solid portfolio of work by the time you're 18/19 I can definitely imagine you having work by then.\n\np.s. definitely not a genius", "likes": 0}]}, {"topLevelComment": {"author": "AMIT +", "text": "I will be back on day here \n15 nov 2020", "likes": 0}}, {"topLevelComment": {"author": "Desk Solutions", "text": "I have read that book too, \"sams java in 21 days\"", "likes": 1}}, {"topLevelComment": {"author": "CoderDmitri", "text": "FreeCodeCamp is my Jesus!", "likes": 0}}, {"topLevelComment": {"author": "Sounak Bhowmik", "text": "I'm 21, and am learning many new things every day related to programming and computers. I think I've started a little early😉", "likes": 2}}, {"topLevelComment": {"author": "Übermensch Fallschirmjäger", "text": "My main problem as a developer is where I live. I absolutely despise work culture and generally speaking the country that I live in. I hope someday I can go abroad.", "likes": 2}, "replies": [{"author": "Insane Guy", "text": "@Don’t Know Im self taught Web Developer, and im aiming to land remote position to some USA company, i would be more than satisfied to get paid 2000 dollars per month", "likes": 0}, {"author": "Don’t Know", "text": "@Insane Guy yes. I’m from the US and work for the big banks in business analysis and we have teams comprised of people in UK, India and Canada.", "likes": 0}, {"author": "Insane Guy", "text": "@G. Barrios can i work from europe to usa conpany remotly from my home?", "likes": 0}, {"author": "G. Barrios", "text": "But if you are really good, you can find jobs in Germany for example! I know some South Americans who did it!", "likes": 0}]}, {"topLevelComment": {"author": "Jack", "text": "Next video - How to navigate all the annoying wokeness  in tech.", "likes": 0}}, {"topLevelComment": {"author": "SamiXPunch", "text": "I have already started to learn Html and CSS and in 3 weeks I have been able to build my first website with also little bit of Javascript  by just watching FreeCodeCamp tutorials but still I am far from getting the experience to get a job I will come back after 6 months and hopefully I get a job wish me luck guys 24th September 2020", "likes": 4}, "replies": [{"author": "S7v7n", "text": "How is it going right now?", "likes": 1}, {"author": "Alok Singh", "text": "Any update", "likes": 2}]}, {"topLevelComment": {"author": "ouma ouma", "text": "i just start learning coding from freecodecamp and i found it kinda hard but im still trying i wont give up easily i want to ask you guys a question does freecodecamp ofer you jobs or after you finish your learning you take your certificate from ffc and post it to copanies or how does it work can y all tell me because im new at this", "likes": 1}}, {"topLevelComment": {"author": "iVuDang", "text": "Thank you for sharing your stories and tips!", "likes": 0}}, {"topLevelComment": {"author": "Kahan Bhalani", "text": "This video may become my biggest motivation as a self-taught programmer. 👏", "likes": 10}, "replies": [{"author": "Robert Axelsen", "text": "How awesome! Happy we could provide you with some motivation :D", "likes": 0}]}, {"topLevelComment": {"author": "IronLady89", "text": "I had the same concept on programming that you have to be a MATH GENIUS and went into teaching after high school whilst being hopeless that I'd never learn to code. I faced my fear last year and attended coding bootcamp just so I could learn and yup, my view on coding has changed. It's about being able to understand problem and how you would go about solving it.", "likes": 24}, "replies": [{"author": "Angel Torres", "text": "What’s the latest @ironlady89?", "likes": 0}, {"author": "Vijay's Business Academy", "text": "Yes maths is not a necessary but knowing maths will help us be a better coder. But no one needs to be a math wiz to be a programmer", "likes": 1}, {"author": "Robert Axelsen", "text": "Amazing! Nice to not be alone about having that experience, hehe.", "likes": 1}]}, {"topLevelComment": {"author": "Nivedha Duraikannu", "text": "college dropout , finally jumping into my first love(IT).Hoping to learn more  and find a job soon,.. cheers to all ,trying to be +ve", "likes": 5}, "replies": [{"author": "1999", "text": "how did it go bro", "likes": 0}, {"author": "Talson Hacks", "text": "Best of luck, Nivedha!", "likes": 0}, {"author": "Adam TSchmidt", "text": "cheers mate", "likes": 0}]}, {"topLevelComment": {"author": "Chase Koobi", "text": "ill Come back to this comment once i have a Job!!!!!!(as software developer) Wed July 29, 2020", "likes": 21}, "replies": [{"author": "Brick Martin", "text": "He died.", "likes": 0}, {"author": "Seyide Hundeyin", "text": "goodluck ma", "likes": 0}, {"author": "UnforsakenAssassin", "text": "You got this!", "likes": 0}, {"author": "Adam TSchmidt", "text": "cheers mate", "likes": 0}]}, {"topLevelComment": {"author": "June Hanabi", "text": "Before programming I was in 3rd grade. I didn't start programming until I was 10 in 4th grade and that just came from an obsession of wanting to know more about how my moms desktop pc worked, learning you could create these things that would run on it, then taking a life-long obsession to want to know more so that I could do that myself. It's really weird for me to see others already older and established doing other things before switching over to programming but I think that's amazing and I wish everyone wonderful luck on their new endeavor. Being older and established means it's a higher risk to switch jobs like that, it takes a lot of confidence and risk. But I hope everyone gets to be in life where it makes them happy.", "likes": 6}}, {"topLevelComment": {"author": "suman modak", "text": "Freecodecamp is great .. But you need to get a graduate degree first  on how to use this website...And get ready to start putting all your 24 hours for 5 years to get a junior developer job. And no one will tell you this truth until you ralize it yourself. All you are watching here and there on why you should become a programmer are actually  landing pages... They want you to just get into this nothing else. it doesnt matter to them whether it is worth it or not..", "likes": 0}, "replies": [{"author": "C.D O.", "text": "Oh that's loser mind talking", "likes": 2}]}, {"topLevelComment": {"author": "Turco949", "text": "Really good video but it does require 34 minutes and 7 cups of coffee to complete it.", "likes": 8}}, {"topLevelComment": {"author": "bigp x", "text": "Look. We are ALL self taught.\nIf you go to school the teacher and the litterature is your source butYOU still have to make sure YOU understand it. \n\nNow the difference is that the teacher is in \"online-format\" and you will have to learn it on different hours. \n\nOFC it can be done.", "likes": 3}}, {"topLevelComment": {"author": "Amirul Clasher", "text": "nice video", "likes": 0}}, {"topLevelComment": {"author": "Nic Lorenzo", "text": "Thanks freeCodeCamp.", "likes": 0}}, {"topLevelComment": {"author": "Liang Qiao", "text": "Motivation is key! This stuff is like driving. Not rocket science. Just takes a bit of time!", "likes": 5}}, {"topLevelComment": {"author": "Ultraposting", "text": "Wow, this guy is literally me", "likes": 2}, "replies": [{"author": "Talson Hacks", "text": "So you’re a monster!", "likes": 0}]}, {"topLevelComment": {"author": "Star Child", "text": "HOT TIP : Before attempting code or programming language - TRY MASTERING THE BASICS OF VERBAL COMMUNICATION.   When you are NOT  speaking your native language - it helps communication if you don't speed through your spiel...it all sounds like fkn gibberish; even the captioning has effed off.", "likes": 2}}, {"topLevelComment": {"author": "Thomas K", "text": "nice thanks", "likes": 0}}, {"topLevelComment": {"author": "Lambo Holygrail", "text": "The guy talking first sounded like Martin Sellner. Maybe not so strange as he is from Vienna.\n\nDid not expect to see a guy from Bergen, my home town, in this video. Does not matter much though. Learning to code and earn a living from it is what matters.", "likes": 0}}, {"topLevelComment": {"author": "Iamkakarot Saiyan", "text": "dont eat cheesecake before working out.. hehehe", "likes": 2}}, {"topLevelComment": {"author": "drop_messages", "text": "I feel like becoming a self taught programmer is a great \"2nd career\". It does not matter if you are a high school drop out, or you have an MBA and you want to start your own business. If you have a computer, an internet connection, you can start coding. And if you cannot find a company to hire you , make apps on your own.", "likes": 164}, "replies": [{"author": "Horacio", "text": "@Awesome Bear Audiobooks yeah nah", "likes": 0}, {"author": "Awesome Bear Audiobooks", "text": "I am an MBA student and I am not very eager to start the business. By learning to code and working internationally I will be able to make more money than from any traditional business I could ever attempt to do... without a huge chance of going bankrupt! lol", "likes": 2}, {"author": "swallowedinthesea11", "text": "That's easier said than done regarding the selling apps part. I used to believe that too when I was first learning, but it wasn't until I saw some videos of people who were great at programming but did poorly in selling their apps did I realize it's more difficult.", "likes": 2}, {"author": "Horacio", "text": "I personally don't think it is something that you could do as a '2nd career', it is something that takes time and a lot of effort. I don't believe it is impossible but I would say it would be extremely difficult to achieve!", "likes": 17}, {"author": "M R P", "text": "That's what I've been thinking about.. If no one's going to hire me, I might as well just create my own mobile/web apps and sell/monetize the apps to people who need it.", "likes": 9}]}, {"topLevelComment": {"author": "Al. vr.", "text": "Thank's Guys", "likes": 1}}, {"topLevelComment": {"author": "Sophia Dominguez", "text": "CS drop out \nKeep learning and keep fighting \nyou can't lose if you don't quit!!!!!!!!!", "likes": 7}}, {"topLevelComment": {"author": "hmm", "text": "I'm suggesting to create a group on telegram where we can share our successful stories and learn from each others mine is : Larbi H", "likes": 14}}, {"topLevelComment": {"author": "shivang chheda", "text": "Hi i just completed reading c programming language k&r to know how the basic computer system works on lower level kind of now what should i learn to get programming job in industry python or c++ don’t say java and how should i learn that language ( a path )", "likes": 3}, "replies": [{"author": "Fuck You", "text": "Programming job isn't language related but tech one. If you want to work in C++/C# go for Game development(Unity, Unreal Engine) and financial algo (Expert Advisor , Trading bot....) , For AI go with Python/C++ , web JS and mobile dev Java/Kotlin/Swift\nThere's more but what you should learn will depend of what you want to do so be more specific and I hope you have already find your path now.", "likes": 0}, {"author": "Robert Axelsen", "text": "Depends on what field you would like to work in. Python is a good choice for machine learning, science, backend web dev and dev-ops, for example.", "likes": 0}]}, {"topLevelComment": {"author": "IOSoraOI", "text": "Beautiful. Thanks guys <3", "likes": 1}}, {"topLevelComment": {"author": "Logix Indie", "text": "22:28", "likes": 2}}, {"topLevelComment": {"author": "Yezus 323", "text": "Who is in la ca that can show me some stuff on programmkng ?", "likes": 0}}, {"topLevelComment": {"author": "Nelson Jimenez", "text": "I hate resumes", "likes": 0}}, {"topLevelComment": {"author": "Gros Lait", "text": "I'm learning to become a self-taught programmer.", "likes": 123}, "replies": [{"author": "Aidan Cardazzone", "text": "Good luck 👍", "likes": 0}, {"author": "Z13 Dev", "text": "@Yoqub Xakimov I came.", "likes": 0}, {"author": "DarkTealGlasses", "text": "Same", "likes": 0}, {"author": "DOPHIE", "text": "I'm going to learn! I have no IT experience apart from building my gaming PC. I have no qualifications, didn't even pass my final year of high school, have been working labouring jobs for the last 5 years. But I've now got a kid on the way so it's time to knuckle down! Will be studying every day, applying for jobs, and taking every interview I can. I'll give an update once I make some progress!", "likes": 2}, {"author": "D M", "text": "Still learning?", "likes": 2}]}, {"topLevelComment": {"author": "Limitless 1", "text": "Great video :)", "likes": 1}}, {"topLevelComment": {"author": "Daniels Tekno Kanal", "text": "I am selfthought and am learnig a lot right now. I want a job in some time...", "likes": 1}, "replies": [{"author": "iTech", "text": "Daniel Høifødt gl", "likes": 1}]}, {"topLevelComment": {"author": "HunterJustGaming", "text": "I. Am. Job.", "likes": 3}}, {"topLevelComment": {"author": "Patrick S.", "text": "thank you for this video! inspirational to say the least", "likes": 2}}, {"topLevelComment": {"author": "Oscar Mejia", "text": "Peek my portfolio https://odm275.github.io/portfolio/ and let me get some feedbacks. Maybe even an offer ;). I'm in Houston, TX and willing to relocate.", "likes": 0}}, {"topLevelComment": {"author": "Wunderharry", "text": "I just started out learning (already done with HTML and CSS on fCC) but I think I will get some great motivation out of the \"sad panda\" metaphor because it kind of resonates with me.\n\nThanks for the video!", "likes": 14}, "replies": [{"author": "Allison Marie", "text": "@Wunderharry thanks so much!!! ❤️", "likes": 0}, {"author": "Wunderharry", "text": "@Allison Marie If there is one tip I can give you it's this: start your own project ASAP! It's the fastest way of learning BY FAR. And you'll pick up Nodejs in no time, I'm still wondering to this day why theres even a differentiation - it's basically JS with a different purpose xD\nThanks 🙂 You'll get there too, just keep on working and, more importantly, building your own stuff. Cheers!", "likes": 1}, {"author": "Allison Marie", "text": "@Wunderharry but full stack is so intimidating 😩 I’m 50% done with my JS course right now and I still feel like I know nothing. Thank you for updating again! And congrats on all your hard work to get where you are now!", "likes": 0}, {"author": "Wunderharry", "text": "@Allison Marie You're very welcome! Well I think it's time for another update: still work at the same company, still super happy. Also, got the second (this time very significant) raise so far.\n\nFrom what I can tell, purely Frontend Development seems (more?) saturated now, Full Stack is still in high demand.\n\nIt was, and I can say this whole-heartedly, the best decision I've ever made. Wish you the best of luck! Work hard and you'll get there!", "likes": 0}, {"author": "Allison Marie", "text": "@Wunderharry thank u for ur updates omg. so motivating.", "likes": 0}]}, {"topLevelComment": {"author": "Mariano Queirel", "text": "Thank You Free Code Camp!", "likes": 1}}, {"topLevelComment": {"author": "Mariano Queirel", "text": "Thanks!!!", "likes": 3}}, {"topLevelComment": {"author": "Ernest Chan", "text": "any suggestion what kinds of projects we should build in our developer portfolio? thx", "likes": 5}, "replies": [{"author": "Rob Axelsen", "text": "The first half of the projects in that list you can do with only HTML/CSS/JS. For the later ones it might require at least a front end framework (React/Vue.js/Angular, etc) and later also backend knowledge (Node.js, MongoDB, etc). The new curriculum has you covered though, and you can learn as you go through it :)", "likes": 1}, {"author": "Ernest Chan", "text": "Thanks. They are really helpful! I just wonder what kind of skillset do we need to complete those projects? HTML, CSS and JS is the only thing I know in this point and I have not much experience in backend except some basic PHP. can I handle those projects too?", "likes": 2}, {"author": "freeCodeCamp.org", "text": "The freeCodeCamp curriculum has projects that would look good on a portfolio. Try this list: https://learn.freecodecamp.org/coding-interview-prep/take-home-projects", "likes": 7}]}, {"topLevelComment": {"author": "Marco Chrappan", "text": "don't call it programming if it just web development", "likes": 5}, "replies": [{"author": "C.D O.", "text": "Omg it is programming. Html probably is not, but JS is definitely yes", "likes": 0}, {"author": "Ali", "text": "Try to learn \"just web development\" and you will know that it is programming.", "likes": 1}, {"author": "Ashish Kumar", "text": "It is not just  HTML or CSS. Various new backend and frontend frameworks requires your brain to solve the problems. Dont  post random thoughts without knowing about it", "likes": 1}, {"author": "iTech", "text": "Marco C. S. Who cares its coding", "likes": 0}, {"author": "iTech", "text": "freeCodeCamp I'm offended he said I'm not smart enough for anything else but honestly I've done some c# at school and I wanna do unity after web dev and web dev is way harder.", "likes": 0}]}, {"topLevelComment": {"author": "Tiger Secc", "text": "What was the book called he said?", "likes": 1}, "replies": [{"author": "axMf3qTI", "text": "Just do a search for Eloquent Javascript, there is a free version online.", "likes": 2}, {"author": "Robert Axelsen", "text": "Garrett Blackard Eloquent JavaScript", "likes": 2}]}, {"topLevelComment": {"author": "Sol R", "text": "Very helpfull. Thanks you very much guys.", "likes": 2}}, {"topLevelComment": {"author": "Ankit Arya", "text": "a sniff a video from fbe\ni sniff a video from fbe*", "likes": 0}}, {"topLevelComment": {"author": "Falconx Falconz", "text": "Two dislikers are loosers! :)", "likes": 5}, "replies": [{"author": "Sushant Chaudhary", "text": "salty because of $50K in college debt. (:", "likes": 1}]}, {"topLevelComment": {"author": "Mza", "text": "Vunene carape 😍", "likes": 2}}, {"topLevelComment": {"author": "Nabil BOUDLAL", "text": "i really like this video, it treat a lot of important points that every programmer should know about", "likes": 15}}, {"topLevelComment": {"author": "Not sure how to call it yet", "text": "The bold guy remind me of myself , being the smartest kid in school for computers I hated math so I havebt had the chance to learn it properly, in my line of job I far accseed every one so now I am learning to code and hopefully do something more important with my life :)", "likes": 42}, "replies": [{"author": "Eren", "text": "Same thing happened in my life either, when i was in prime school im the hacker guy in my class but after then i started to high school and my lessons are gone bad and i thought all the programming and engineering stuff is only for math genius then after the high school i started to business school and i am studying my last year on that but i learnt programming by my self effort so i want to be a programmer when i graduate. As a intp personal type person, i guess we are may have a common personal type guys :)", "likes": 0}, {"author": "Kiwicami", "text": "I'm kinda like that too, but i hated math because the teachers i had weren't good teachers so i didn't understand a thing which made me hate it. But the few good math teachers i had was where i actually enjoyed it. I was always big into computers like games and what not, i always wanted to create my own games. I think the first thought i had about \"being\" a game dev was after i played GTA: Vice City a couple of year after it released, i was maybe 11yo, on pc and playing it with a friend and just talking about how cool a gta game would be in a game world the size of the entire earth, LOOOL, thinking back, what a silly idea that was at the time in 2004 with the hardware limitations. but like that guy i thought it was for geniuses only. Now i'm learning to code HTML CSS and Javascript, i wish i learned sooner because i really enjoy it...", "likes": 2}, {"author": "Safa Ashan", "text": "Same here i m weak in math so i didnt got the chance to learn it properly however i took medical science rn i m not much interested in it.", "likes": 4}]}, {"topLevelComment": {"author": "Pavan Kalyan", "text": "I don't like his word,  programming is only for maths genius. Lol... 😒😒😒😏", "likes": 4}, "replies": [{"author": "andreiafouto", "text": "wow talking about having an opinion without knowing the subject. lol it's like politicians all over the world. lol", "likes": 0}, {"author": "Вдохновенный Христианские песни", "text": "zseven Essentially libraries, and with modern day computing power you don't need to optimize your web application, unless it's some huge application, and then yes.", "likes": 0}, {"author": "Zola", "text": "thats what he thought when he was a child.", "likes": 7}]}, {"topLevelComment": {"author": "ZSTOLEN", "text": "I'm a Self-Taught Programmer", "likes": 36}, "replies": [{"author": "Sunny mufc", "text": "@ZSTOLEN thats a great comment.thats why i am doinh this", "likes": 1}, {"author": "Y yaba", "text": "@Crypto Ochoi need someone to study with like to ask questions 😭😭", "likes": 0}, {"author": "Crypto Ocho", "text": "@ZSTOLEN  thats great to hear friend, many blessing to you on your endeavors. i am currently embarking on my journey to be a self-taught dev.", "likes": 1}, {"author": "ZSTOLEN", "text": "@Crypto Ocho  I'm making 2800$ per month with 2 years work experience. I also do some freelance side works to make my monthly income extra more.\nbeing work as a programmer is not a job, It is a\n art of creating beautiful ideas", "likes": 2}, {"author": "Crypto Ocho", "text": "have you found a job?", "likes": 0}]}]}