{"video": {"id": "MmtfrjLLjJ0", "title": "jQuery: CSS and classes", "description": "Learn how to use jQuery to modify CSS and classes with the css, addClass, removeClass, and toggleClass methods.\n\n💻 Code: https://codepen.io/beaucarnes/pen/pryoXJ\n\n🐦 Beau Carnes on Twitter: https://twitter.com/carnesbeau\n\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on technology: https://medium.freecodecamp.com\n\nAnd subscribe for new programming videos every day: https://youtube.com/subscription_center?add_user=freecodecamp", "duration": "PT5M32S", "likes": "126", "views": "8703"}, "comments": [{"topLevelComment": {"id": "Ugwt5cQGHtGY0IYoIkl4AaABAg", "publishedAt": "2022-08-19T15:06:06Z", "author": "Muswamba Madoucha", "text": "I really Enjoyed this course", "likes": 0}}, {"topLevelComment": {"id": "UgjHX8PP7Kx_UXgCoAEC", "publishedAt": "2017-08-01T06:37:25Z", "author": "Elregar71", "text": "Also, can you use toggle and set it to make a sound instead of visual changes? I'd like to start a project for next football season that's a weekly pick em site. I have a buddy who's a huge cowboys fan and I'd like to put some code in there that emits a loud buzz when he clicks on them to win, just to mess with his head haha.  I'd have to tie it to his login name somehow. Is that achievable with JS/jQuery?", "likes": 0}}, {"topLevelComment": {"id": "UggLCxRr3CJecXgCoAEC", "publishedAt": "2017-08-01T06:28:48Z", "author": "Elregar71", "text": "I really enjoy your teaching style Beau, is there an order to watching your JavaScript vids? I'd like to start on JS and was wondering about that.", "likes": 0}}, {"topLevelComment": {"id": "UghfRUUjN-WUJHgCoAEC", "publishedAt": "2017-08-01T03:29:28Z", "author": "RR", "text": "This is good! So we can create classes / id's in CSS, for example .red{color: red;} and then use it to jQuery addClass, $(\"p\").addClass(red); without \"\". I had the same question while doing fcc-weather challenge. Suggestion, when you mentioned to use addClass, beginner won't understand what do you mean by CSS class as the class name is .red and the color is red and it is in CSS block which is hidden. Thanks and its a great help", "likes": 0}}, {"topLevelComment": {"id": "UggL0qnfswpEZngCoAEC", "publishedAt": "2017-07-31T18:48:33Z", "author": "MsLadyL", "text": "This was good! Question if we are not supposed to put production ready code in JS where do we put it and will it over ride the CSS code or is there a possibility that one will override the other?", "likes": 0}}]}