{"video": {"id": "mtDJfSHQfAM", "title": "Build an IoT application with Node.js and Docker", "description": "Learn how to build and scale an IoT application with microservices using Node.js and Docker. This project will give you a working IoT dashboard connected to a SmartThings IoT hub and devices. You can use the application you will build to monitor IoT devices, but it’s really designed as an example of how to build an IoT application in the cloud that leverages microservices, Node.js and Docker.\n\nTalk given by Shubhra Kar and Wyatt Preul at Node Summit 2017.\n\nThanks to Node Summit for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT1H3M2S", "likes": "410", "views": "31092"}, "comments": [{"topLevelComment": {"author": "Bijen Adhikari", "text": "Me too didnt understand😑😑😑😐", "likes": 0}}, {"topLevelComment": {"author": "Cesar gomide", "text": "A billion of indians will eat all software industry scary future", "likes": 1}, "replies": [{"author": "Venkat", "text": "Lol !", "likes": 1}, {"author": "Cesar gomide", "text": "Yes! Let's Learn Software Engineering that small percentage is the all us population think kid", "likes": 1}, {"author": "Roy Honders", "text": "Cesar gomide what the hell? It's probably only a small percentage of Indians that actually work in the software industry. Not a billion. And they certainly won't be the only people in the industry.", "likes": 1}]}, {"topLevelComment": {"author": "Run", "text": "what is all these about? i am a node js developer and i didn't understand a thing here.", "likes": 15}, "replies": [{"author": "Riki Pebrianto", "text": "@Emmanuel Scott lol", "likes": 0}]}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "Thank u for this awesome video", "likes": 1}}]}