{"video": {"id": "mu3epeXRIt0", "title": "A day at Pennybox with Co-Founder Reji Eapen", "description": "A day at Pennybox with Co-Founder Reji Eapen.\n\nwww.pennybox.com\n\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT12M16S", "likes": "79", "views": "5151"}, "comments": [{"topLevelComment": {"author": "Wilbs", "text": "Jocelyn cute do", "likes": 0}}, {"topLevelComment": {"author": "Bogdan Nedelcu", "text": "You look similar to Dinesh in Silicon Valley show. :) Keep up de good work.", "likes": 2}}, {"topLevelComment": {"author": "zeroxcub", "text": "At last, I don't mind the shaking a least this guy is actualy showing what he use and explain his workflow, not just wandering and saying what he does like other video.", "likes": 0}}, {"topLevelComment": {"author": "akinhwan. com", "text": "may need a stabilizer", "likes": 0}}, {"topLevelComment": {"author": "George Motuliki", "text": "the guy in the background must be a FOODIE cause he turned when he heard the key word \"YUM\"!", "likes": 5}}, {"topLevelComment": {"author": "Samantha Burress", "text": "Wish there were more videos/content like this.  Thanks for the look into what you're doing!", "likes": 0}}, {"topLevelComment": {"author": "Mrinmay", "text": "@freeCodeCamp absolutely digging this series. Do keep em coming. <3", "likes": 0}}, {"topLevelComment": {"author": "/", "text": "the most important thing is coffee. i second that.", "likes": 0}}, {"topLevelComment": {"author": "Barki skipper Mustapha", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "Marlon", "text": "Loving the new videos. Your 'Day at' and 'Ask Preethi' videos are great.", "likes": 5}}, {"topLevelComment": {"author": "JOOLEAN", "text": "Amazing video and walk-through, love the transparency and how the founder explains the creation-process and his \"day-in-the-life\"-tasks. 👏 🚀  Interesting concept and proposed parent-child interaction. The only thing that could be improved is the splash screen and it's logo (should be more centered, closer to title and smaller imo), the visually dominant background-gradient with its vibrant orange - and code-documentation. ✌️", "likes": 1}}, {"topLevelComment": {"author": "Adam Naor", "text": "Its a pleasure getting to work with Reji to build Pennybox.com. This video shows his tenacity, grit, and organization - all things that make him a thoughtful entrepreneur!", "likes": 0}, "replies": [{"author": "Vicki Kirk", "text": "Adam Naor  Then tell him Pennybox stopped working with no notice. My down and I relied on that app to manage all his allowances and chores in and out. Now we’re sol!", "likes": 0}]}]}