{"video": {"id": "mxsZlsG8tKA", "title": "Chrome Dev Tools: Timeline Tab", "description": "Info and mini-lesson on the 'Timeline' tab of Chrome Dev Tools. Check out more in-depth documentation here: https://developers.google.com/web/tools/profile-performance/evaluate-performance/timeline-tool\n\nThe Timeline panel lets you record and analyze all the activity in your application as it runs. It's the best place to start investigating perceived performance issues in your application.\n\nJust like you use network to find out how long things take to communicate with the internet and you use sources to find out where something's broken, you can use timeline to figure out what's going on and how long it takes in even more detail.\n\nWith the timeline you record events using the small circle button. You can record (or capture) stacks, profile js, memory, and paint (css). \n\nWhen you record (capture) these, it sets them up in small, detailed logs that you can organize many ways to fit you. \n\nAll of this will help you to better understand what's happening in the browser, particularly which events require more browser memory than others.\n\nWhen you're using timeline, remember to use this 'clear' button and to start recording before you load the page, depending on what you want to capture.\n\nYou'll notice that when you record JS events, clicking on the title or \"function call\" on the left will take you to the document and line of that function using the resource panel.", "duration": "PT2M56S", "likes": "92", "views": "12903"}, "comments": [{"topLevelComment": {"id": "Ugzz8oj-pcPvA8mOF_94AaABAg", "publishedAt": "2017-10-27T03:22:31Z", "author": "Sarveshwar Singh", "text": "https://developers.google.com/web/tools/chrome-devtools/evaluate-performance/timeline-tool\nWarning: This page is deprecated. See Performance Analysis Reference for up-to-date information.\n\n↓ Updated One ↓\nhttps://developers.google.com/web/tools/chrome-devtools/evaluate-performance/reference", "likes": 0}}, {"topLevelComment": {"id": "Ugw8xw82PJSH3QkNcSV4AaABAg", "publishedAt": "2017-08-31T10:05:02Z", "author": "Balance.", "text": "There is no \"Timeline\" tab. It's probably renamed to \"Performance\" and it has changed so much. Can you make this video again with the updates? Thanks.", "likes": 4}}, {"topLevelComment": {"id": "UggiOd1X9_0yzngCoAEC", "publishedAt": "2017-03-13T14:08:03Z", "author": "UndreamtMayhem", "text": "Enjoying the videos!!  This will be a good resource to eventually build upon this explains the colours  in the timeline. Do not worry if it seems overwhelming at first everyone the more you build the easier it gets :)", "likes": 0}}]}