{"video": {"id": "mZdznKc5ZaM", "title": "One weird trick to becoming a better software developer 😉", "description": "Those of us who have worked in software development for longer than a few years probably feel we have an intuitive sense of what a great developer is. Some traits come more easily to mind than others when it comes to identifying a great developer. In this talk we will take a slightly different approach to evaluating software development best practices, and identify one underrated skill common to great software developers: empathy. I hope to demonstrate that cognitive and emotional empathy skills are critical to good software development. We will explore ways to cultivate this trait in order to become better developers, both for our own sakes and for the sake of the teams in which we work.\n\nTalk given at PyCon 2018 by Esther Nam.\n\nThanks to PyCon for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT28M22S", "likes": "428", "views": "16744"}, "comments": [{"topLevelComment": {"author": "Hi", "text": "great content! but same voice tong make me feel sleepy.", "likes": 0}}, {"topLevelComment": {"author": "iVuDang", "text": "25:40 I really like the point about gathering more information and conveying that you are on the same team/same objective, rather than opposed to each other.", "likes": 0}}, {"topLevelComment": {"author": "Matthew Rister", "text": "Really, really glad I found this video", "likes": 0}}, {"topLevelComment": {"author": "Stef Joseph-Kruyswijk", "text": "My future me appreciates this talk", "likes": 1}}, {"topLevelComment": {"author": "Zâmbetul Soarelui", "text": "Thank You! Great and important ideas.", "likes": 0}}, {"topLevelComment": {"author": "Abhishek Jain", "text": "Her voice cured my anxiety.", "likes": 16}, "replies": [{"author": "Creepinson Productions", "text": "lol", "likes": 0}]}, {"topLevelComment": {"author": "David S", "text": "Good talk!", "likes": 0}}, {"topLevelComment": {"author": "Alexandre Belloni", "text": "Esther, great talk. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "v k", "text": "Firstly, thanks for this video and to the speaker for sharing her experiences. I am looking forward to implement it in my upcoming project. But this seems really promising to me!", "likes": 1}}, {"topLevelComment": {"author": "Merser", "text": "Amazing talk", "likes": 0}}, {"topLevelComment": {"author": "GDI Bass", "text": "I love the Future You / Past You distinction and I use it all the time.", "likes": 0}}, {"topLevelComment": {"author": "Jeff Nyak", "text": "Exactly what i needed.", "likes": 1}}, {"topLevelComment": {"author": "teriyakov", "text": "I didn't really have any expectations but this turned out to be a really good talk. Thanks and well done!", "likes": 2}}]}