{"video": {"id": "NIG4BZ8VpF4", "title": "Using Python to build an AI to play and win SNES StreetFighter II with machine learning", "description": "Hear the story of how we used Python and machine learning to build an artificial intelligence that plays Super StreetFighter II on the Super NES. We'll cover how Python provided the key glue between the SNES emulator and AI, and how the AI was built with gym, keras-rl and tensorflow. We'll show examples of game play and training, and talk about which bot beat which bot in the bot-v-bot tournament we ran.\n\nTalk given by Adam Fletcher and Jonathan Mortensen at PyCon 2018.\n\nThanks to PyCon for giving us permission to post this talk. freeCodeCamp is not associated with this talk. We're just excited to bring more exposure to to it!\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT30M38S", "likes": "884", "views": "66342"}, "comments": [{"topLevelComment": {"author": "Howard Lam", "text": "The one thing missing with these rewards training system is that the system can't generate good intermediate rewards to target. When humans train, we identify the intermediate steps needed to get good results like we practice a certain combo and then optimize for the opportunity to connect them in the main game. We get rewards just for timing those things right. But AIs don't specifically target for them. That makes it so it wanders around all the time. So even with a lot of training power, a lot of training power is wasted training for useless things. It's true that it helps finding out of the box solutions but most of the time you get unoptimized solution. You can see that with just that running 100m (forgot the game name) video. He used input from a master as a priori for the engine to optimize. This way the AI doesn't have to wander around and settle for a local minimum that's very far from the globally optimized solution.", "likes": 0}}, {"topLevelComment": {"author": "Moto Aventura", "text": "I'm trying to build an AI to play SF2CE arcade version and I'm wondering why you don't show any results on video...", "likes": 1}}, {"topLevelComment": {"author": "Aupheromones", "text": "Show me an algorithm that can win with Balrog, and I'll be impressed.", "likes": 1}, "replies": [{"author": "Mr. Hippopotamus", "text": "Wall up > grab > 1+ input per frame > gg", "likes": 1}]}, {"topLevelComment": {"author": "nesterzhzhot", "text": "where can I take a full code o this?", "likes": 0}}, {"topLevelComment": {"author": "nesterzhzhot", "text": "If this is for beginners, than I don t like it, because there are a lot of info, that I needed to know, but they didn t tell.\nIf not, than why they gave so many facts, that pro python programmers already know?\nAnyways, I liked this video, good job!", "likes": 0}}, {"topLevelComment": {"author": "MavVRX", "text": "What does the agent do when the player swaps sides? Was it trained on both sides or was the input and controls flipped to handle that?", "likes": 2}}, {"topLevelComment": {"author": "Neux", "text": "gottem", "likes": 2}}, {"topLevelComment": {"author": "Daniel Dilly", "text": "12:49", "likes": 2}}, {"topLevelComment": {"author": "Steven Barnes", "text": "A 30-minute presentation without actually seeing the results of their efforts. I wish Google's AI was clever enough to not show me these videos.", "likes": 70}, "replies": [{"author": "Moto Aventura", "text": "Indeed.", "likes": 0}, {"author": "RP", "text": "\"This works, trust us, we're programming gurus\"", "likes": 0}, {"author": "Ruevers", "text": "I think the same...", "likes": 2}, {"author": "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMW", "text": "\"I wish Google's AI was clever enough to not show me these videos.\"\nLMAAAAAAOOOO", "likes": 5}]}, {"topLevelComment": {"author": "TCG Investments", "text": "If you came here to see this actually work..... turn back.", "likes": 7}, "replies": [{"author": "alvin phantomhive", "text": "thanks for saving my time :)", "likes": 1}]}, {"topLevelComment": {"author": "Blah Bleh", "text": "Please cc I wanna do this !! llearn soething !!..?\nYYYAAAYY IM GON222 TRIII IDSSS\nTHIS ***  THANK YOU !!!", "likes": 1}}, {"topLevelComment": {"author": "Blah Bleh", "text": "i SOOOO wanna do this man !! :) thanks !!!", "likes": 1}}, {"topLevelComment": {"author": "ZHICHENG LIU", "text": "I can take off my eyebrow\n( ・ิω・)ノิิ\n( ・ิω・ิ)put on\n( ・ิω・)ノิิtake off\n( ・ิω・ิ)put on\n╰ิิ( ・ω・)ノิิtake off both sides\n( ・ิω・ิ)put on \n╰ิิ( ・ω・)ノิิtake off again\n(・ω・) No! I lost them!", "likes": 1}}, {"topLevelComment": {"author": "Cat M", "text": "Ultimate Machine Learning Super Street Fighter II Turbo HD Director's Cut Game of the Year Edition", "likes": 8}}, {"topLevelComment": {"author": "Everlost", "text": "[spoiler] you won't see a fight...", "likes": 43}, "replies": [{"author": "Liam Anjewierden", "text": "you get to see one, it's only 16 seconds though", "likes": 2}, {"author": "Un Named Channel", "text": "Thanks I came for a fight. SeeeYA!", "likes": 2}]}, {"topLevelComment": {"author": "crc_error", "text": "Fascinating.  Fighting games and artificial intelligence are both interests of mine and I'd love to see more development of AI in these games.", "likes": 3}}, {"topLevelComment": {"author": "Zes", "text": "no such thing as borx or nerdx or not, use ai as tool is ok, not nerx, cepux, any be any interesx, no nerx", "likes": 1}}, {"topLevelComment": {"author": "70ME3E", "text": "whoa what, the presentation just ended when I thought it was just getting warmed up..\nwhere was the main model's architecture shown? you talked about some boring infrastructure setup stuff and about your cute on site display but not the main part??", "likes": 12}, "replies": [{"author": "Ruevers", "text": "yes, very poor presentation.", "likes": 1}]}, {"topLevelComment": {"author": "Jimmy Joe", "text": "Do it for fortnite", "likes": 2}, "replies": [{"author": "Ruevers", "text": "I think they can´t because they not proove achive this in street figther....total loos of time this video,", "likes": 0}, {"author": "Naza", "text": "Michael Allen Yes, a computer doesnt have to be intelligent to beat a human in a FPS, thats why is not interesting to make FPS-oriented IA", "likes": 0}, {"author": "Michael Allen", "text": "FPS are a joke for computers to play. They can have perfect instant accuracy.", "likes": 0}, {"author": "fangiscool1", "text": "@Dr. Drakon If Starcraft II can be done, then Fortnite can certainly be done", "likes": 0}, {"author": "Dr. Drakon", "text": "Its not possible yet imo", "likes": 0}]}, {"topLevelComment": {"author": "Matheus Prandini", "text": "Would it be possible to do the same approach to other snes games?", "likes": 1}, "replies": [{"author": "spaceman00", "text": "Yes, they did one that works with any game, by trying to maximize the amount of unique situations the ai have been at.", "likes": 0}, {"author": "Robko против войны в Украине", "text": "yes. You can do ANY game", "likes": 1}]}, {"topLevelComment": {"author": "nakobots", "text": "Would have liked to hear more about the observation space. From the talk we heard x position and health bars are observed. I wonder what else about the opponent's action is known to the agent.", "likes": 7}, "replies": [{"author": "Derp777", "text": "doesn't it show everything at 4:01?", "likes": 0}]}, {"topLevelComment": {"author": "#Яков", "text": "wow! so +++++ interesting \n great questions from audiences", "likes": 1}}, {"topLevelComment": {"author": "Luke Wells", "text": "Came here to see a match. :(", "likes": 92}, "replies": [{"author": "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMW", "text": "Me too", "likes": 1}, {"author": "dllemm", "text": "18:00 there aren't many videos of this I can find online.  It looks like they AI mostly spams the same move at different frequencies & distances.\nIt would be cool to see a super tuned version.", "likes": 6}]}, {"topLevelComment": {"author": "Daporan", "text": "Awesome use of machine learning! If you like AI applied to games you might want to give my channel a check. Cheers!", "likes": 1}}, {"topLevelComment": {"author": "Shadow Gallery", "text": "A revolution without dancing is a revolution not worth having.", "likes": 1}}]}