{"video": {"id": "NWG8vO02oj4", "title": "Unity GameDev Tutorial for Beginners: Brick Breaker Game", "description": "This beginner's Unity tutorial shows how to build a Brick Breaker Game similar to the original ones from the 80's.  We will be covering topics such as:  2D games, sprites, keyboard input, input manager, Rigidbody2D, colliders, User Interface (UI), trigger colliders, OnTriggerEnter2D, OnCollisionEnter2D, loading scenes, C# and others.\n\n🔗Download Unity here: https://store.unity.com/\n\n⭐️Contents ⭐️\n⌨️ (0:00) Part 1 - The Paddle\n⌨️ (18:21) Part 2 - The Ball\n⌨️ (49:31) Part 3 - The Bricks\n⌨️ (1:16:11) Part 4 - The Score and Lives\n⌨️ (1:44:50) Part 5 - Ending the Level and Game\n⌨️ (2:16:30) Part 6 - Making a Powerup\n⌨️ (2:39:21) Part 7 - Making Special Bricks\n⌨️ (2:50:39) Part 8 - Loading Levels\n⌨️ (3:23:52) Part 9 - Music and Sounds\n⌨️ (3:40:30) Part 10 - High Score\n⌨️ (4:06:28) Part 11 - Start Menu\n\nThis tutorial was created by Mike Page of ScriptingIsFun.com. \n🔗Check out their YouTube channel for more Unity tutorials: https://www.youtube.com/user/PageTechnology\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT4H36M54S", "likes": "1574", "views": "101227"}, "comments": [{"topLevelComment": {"author": "Mehtab Singh Gill", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "Teggie Foxtrott", "text": "omg i love the sound your mouse makes when you click XD", "likes": 0}}, {"topLevelComment": {"author": "Justin Anderson", "text": "2:11:55\nJust spent about an hour trying to figure out why numberOfBricks = GameObject.FindGameObjectsWithTag(\"brick\").length;\nWouldn't work.\n\n...\n\nI didn't capitalize .Length\nThrew off the whole code xD", "likes": 0}, "replies": [{"author": "Justin Anderson", "text": "I even tried a couple of work around where I stored numberOfBricks.length as numBricks and tried to print that out.  Which ALSO would have worked, had I capitalized .Length", "likes": 0}]}, {"topLevelComment": {"author": "Justin Anderson", "text": "Unity interface has changed a bit since this tutorial has been made.  So if you're having problems getting the scoreText and livesText connected to the game manager, you have probably accidentally chosen Text - Text Mesh Pro.  These are graphics, not strings or integers.\n\nYou will want to delete those\n\nRight click canvas > UI > Legacy > Text\n\nUse that text object instead, and you will be able to drag it to the Game Manager.  Though, the text won't look as fancy.", "likes": 0}}, {"topLevelComment": {"author": "Justin Anderson", "text": "Great video.  Helped me loads!", "likes": 0}}, {"topLevelComment": {"author": "Siddharth Shah", "text": "where can i download the sprites for the bricks?", "likes": 0}}, {"topLevelComment": {"author": "Michael Blosenhauer", "text": "I can't get my levels to load properly centered every time. Sometimes to the right and sometimes to the left. Not sure if I'm messing up saving the prefabs or what.", "likes": 0}}, {"topLevelComment": {"author": "Ed Issa", "text": "How do I control the game on my Android device", "likes": 0}}, {"topLevelComment": {"author": "Trick 9000", "text": "2:02:53 \nSo I just renamed my Scene from SampleScene to Main and that deleted a whole bunch of stuff and made the controls for left and right not work. Anyone know why ? Cant reset it either so I might aswell restart. Still curious why this happend...", "likes": 0}}, {"topLevelComment": {"author": "Donovan Franchini", "text": "when i load the next level, just the ball don't stop... why?", "likes": 0}}, {"topLevelComment": {"author": "Hiếu Vu Minh", "text": "key \"HIGHSCORE\"  where why can't i see", "likes": 0}}, {"topLevelComment": {"author": "Thiago Neres", "text": "Great tutorial! I started building my own brick breaker game before watching your tutorial.\n\nThe thing that I got stuck with is the bounciness behavior. My ball has a circle collider and bricks naturally have a box collider.\n\nThe behavior that I want for collisions with bricks is to add speed but don't change the angle, simply invert velocity X or Y depending on where the ball hit (sides or top/bottom).\n\nAnd PhysicsMaterial2D kind of does that,  except that it changes the direction if the ball hits the edge of a brick or if it hits two bricks at once (between them).\n\nDo you have any suggestions to fix that?", "likes": 0}}, {"topLevelComment": {"author": "Satyam Sagar", "text": "A lots of heart 💜💜💜", "likes": 0}}, {"topLevelComment": {"author": "jesus the whore", "text": "some important time stamps:\n\n*movement script for the paddle*\n4:20 - 9:32\n\n*script for setting the left and right screen edges*\n11:19 - 14:14\n\n*setting the paddle collider*\n15:44 - 18:05\n\n*adding rigid body and collider to ball*\n19:40 - 21:11\n\n*force script for ball*\n21:39 - 23:31", "likes": 3}}, {"topLevelComment": {"author": "Gary Gluckman", "text": "if someone replys to this i will comment on this video 8000 times", "likes": 0}, "replies": [{"author": "Daniel Jones Ortega", "text": "hey", "likes": 0}]}, {"topLevelComment": {"author": "a-can-o-beans", "text": "Really appreicate a nice, long form video where you explain the logic in everything you are doing. Im 45 minutes in and i feel more comfortable with code and unity than i ever have with any other videos ive watched. thank you so much for taking the time to make a video such as this :)", "likes": 5}}, {"topLevelComment": {"author": "slahser dota", "text": "I just finished my first commercial game that I am releasing on steam in 2 weeks, and every time people ask me about programming I always recommend this tutorial. First I completed and it is just amazing. Thank you so much!", "likes": 7}, "replies": [{"author": "tehtonym", "text": "Got a store page so we can wishlist?", "likes": 0}, {"author": "Mathgasm", "text": "I am looking into making some games for the steam deck.", "likes": 0}]}, {"topLevelComment": {"author": "Mitchi Bell (mitchib1440)", "text": "this needs WAAAAY more views dude. Absolutely amazing. Nice and steady for us noobs!", "likes": 2}}, {"topLevelComment": {"author": "RIMSHA ASHFAQ", "text": "kindly share the source code", "likes": 0}}, {"topLevelComment": {"author": "WeCan WinThis", "text": "Thank you so much for this tutorial, it helped alot :)", "likes": 0}}, {"topLevelComment": {"author": "Jatish Kathard", "text": "Hi\nDo u know how to make the levels not spawn low. Like for example level 1 works fine and as soon as I go to level 2 the brick come low to the paddle plss help", "likes": 0}}, {"topLevelComment": {"author": "Lupiyo BR", "text": "Nice tutorial!!! One of the best of youtube! \nI have a question, my ball keeps going horizontal all the time, and then i have to wait like 10 minutes, or more, to the ball change direction. Someone knows a fix to it? Thanks!", "likes": 0}, "replies": [{"author": "Hichame Zitouni", "text": "check collider2D and make them incline as he did when he make colleder aroud the paddle", "likes": 4}]}, {"topLevelComment": {"author": "AlphaaaTV", "text": "destroy script is not working for me//", "likes": 0}}, {"topLevelComment": {"author": "capybara", "text": "Isn't there a better way for placing each brick as a seperate object? I tried tilemaps but I can't figure it out how to add destroy effects (I want fade out in my case)", "likes": 0}, "replies": [{"author": "capybara", "text": "@Justin Anderson yeah I figured it out since, thanks haha", "likes": 0}, {"author": "Justin Anderson", "text": "You can duplicate multiple instances of the bricks.\n\nPlace first brick.  CtrlD, Ctrl drag.  Then hold Ctrl and click each brick so both are highlighted.  Two become four.  Four become 8.  16 should be big enough for a row.  Maybe too big.  Duplicate the row and Ctrl drag it up.\n\nThen I copied the double brick row, moved it up, and changed the color.  Did that 3 times.\n\nIf you're having trouble finding the snap tool, it was moved by the time I did this tutorial.  Right below the game and scene tabs.", "likes": 0}]}, {"topLevelComment": {"author": "Michael Servedio", "text": "2:16:30 Just making down where I am!", "likes": 0}, "replies": [{"author": "Vikram Reddy", "text": "Hi could you please let me know how you added/imported brick. Thanks", "likes": 0}]}, {"topLevelComment": {"author": "Serghi", "text": "Great tutorial, i learned a lot with this, thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Elisey Pasiechnikov", "text": "When i first press space my ball flies up extremely fast, can someone help", "likes": 0}, "replies": [{"author": "Tetrakatsuki", "text": "use speed 1, there must be some change in unit but 500 is far too much", "likes": 0}]}, {"topLevelComment": {"author": "AliciaHammond", "text": "that tutorial was AMAZING! the best i've seen so far. everything so clean, calming voice, in great pace, loved it! it really helped me with my uni project, thank you very much, i've learned so much!", "likes": 3}, "replies": [{"author": "AliciaHammond", "text": "@Daniel Jones Ortega yeah i think there will be no problems. i did mine in 2019 version and everything works fine", "likes": 0}, {"author": "Daniel Jones Ortega", "text": "Do you know if this will work in the current 2020 versions of unity?", "likes": 0}]}, {"topLevelComment": {"author": "Ria Cayde", "text": "Longshot because I know the video is a few years old, but whenever my ball crosses the bottom collider it takes away ALL lives even if I change my total from 3 to 5. Ive doubled checked that UpdateLives is set to -1 and my GM script says lives += changeInLives so that its adding the -1 to that like you said.", "likes": 0}, "replies": [{"author": "Ria Cayde", "text": "Wow nevermind I'm so sorry. I had the lose condition set to greater than or equal instead of less than or equal, which zeroed out the lives because we were setting it to zero in the statement.", "likes": 0}]}, {"topLevelComment": {"author": "Rishabh Sharda", "text": "For some Reason ball and box do not collide and the ball goes right through the box, I have added colliders to both", "likes": 0}}, {"topLevelComment": {"author": "Shadow Caster", "text": "when making the empty game object i cant scale it or move it without it disappearing every time i click on it 25:00", "likes": 0}}, {"topLevelComment": {"author": "Lifebynumbers", "text": "Unity required Coding its not game develop without coding?", "likes": 0}}, {"topLevelComment": {"author": "kai koda", "text": "29:22 bkmrk", "likes": 0}}, {"topLevelComment": {"author": "Ila Fed", "text": "https://www.udemy.com/course/turn-based-strategy-game-development/?couponCode=ILIKEHEROES\nTurn based game dev tutorial. Discount coupon on udemy. 13$", "likes": 0}}, {"topLevelComment": {"author": "Неопознанный Треугольник", "text": "I have a problem. When I play the game the ball is awfully slowing down. How can I fix it?", "likes": 0}}, {"topLevelComment": {"author": "OZ", "text": "for me when i add the power up it says:  UnassignedReferenceException: The variable has not been assigned\neven tho i assigned it", "likes": 1}, "replies": [{"author": "Justin Anderson", "text": "Check for a missing \")\"\nI had the same thing happen\nVoid function(something(something * else)); I was missing one of those last paranthesis.  They're easy to miss.", "likes": 0}]}, {"topLevelComment": {"author": "Go After", "text": "I wish I could give you 1 billion likes.", "likes": 1}}, {"topLevelComment": {"author": "Wrozen", "text": "How do you add a yellow explosion to the yellow bricks instead of all bricks exploding into the same color?", "likes": 0}}, {"topLevelComment": {"author": "James Joseph Sewell", "text": "having a glitch where the ball will randomly start moving very slowly after hitting bricks, what could be causing this?", "likes": 1}}, {"topLevelComment": {"author": "Anooj Shete", "text": "mi shi karat hoto chhoti chhoti si chhoti chhoti chhoti  chhoti si", "likes": 0}}, {"topLevelComment": {"author": "The Chiseled Movement", "text": "47:00 getting rid of endless horizontal bounce", "likes": 8}}, {"topLevelComment": {"author": "saimahesh thota", "text": "Bro I am getting cs0103 error vector2 is not available", "likes": 0}}, {"topLevelComment": {"author": "Caty Gau", "text": "I love it !!!! thank you", "likes": 0}}, {"topLevelComment": {"author": "Sam A", "text": "Would be helpful we could get the sourcecode", "likes": 0}}, {"topLevelComment": {"author": "Cyber", "text": "How can i stop the ball when a level ends? the paddle stops moving but when a level is completed the ball will just continue to move. One scenario I had happen to me is that I had 1 life left and completed the level, and while in the level complete screen the ball hit the collision trigger in the bottom of the game, giving me a game over screen.", "likes": 1}, "replies": [{"author": "Zient Deveero", "text": "2 years late but I think why it happens is that us calling return only makes it so that the ball won't respond to anything else around it but it keeps the vector momentum that it initially had, so we need to set the velocity to zero before we return", "likes": 0}, {"author": "James Joseph Sewell", "text": "yeah same thing with me, im just going to make the ball stop moving when the game is over", "likes": 0}]}, {"topLevelComment": {"author": "OXMOND Tutorials", "text": "Cool! Great Breakout tutorial! Well done 👍🤓", "likes": 1}}, {"topLevelComment": {"author": "Ugur Kavakli", "text": "How can I implement a speed up power up to this script?", "likes": 2}}, {"topLevelComment": {"author": "colo bAggins", "text": "Thank you very much for this very well explained tutorial!!", "likes": 0}}, {"topLevelComment": {"author": "G.F.P", "text": "Can someone help me because my ball passes the edges and goes away . I created the edges and added a collider.", "likes": 1}, "replies": [{"author": "G.F.P", "text": "Ok I don't know why but I removed the Circle collider and added a new one and it worked. Thanks for the help", "likes": 0}, {"author": "colo bAggins", "text": "Hi GFP, it's your Ball a RigidBody2D, has a CircleCollider2D? Also, are your edges have a BoxCollider2d? (Check this on inspector) Hope this help you", "likes": 0}]}, {"topLevelComment": {"author": "wajih mneimne", "text": "hey just want to say im stuck at the beginning with the paddel... im geting 19 lines when i click on c# but in your video its only 17 lines i tried to rewrite the code to the same as you.. but it dident work any solutions ? but i still love how you explain things :D", "likes": 2}, "replies": [{"author": "Dave Kassirer", "text": "This is a year later, but for what it's worth is it because you are using Visual Studio on Windows possibly and not MonoDevelop on Mac?\nMine also was 19 lines, but it's just the formatting that is different. The curly braces are in different spots, that should be all :)", "likes": 0}]}, {"topLevelComment": {"author": "Bagzhan Sadvakassov", "text": "Damn, I wish someone would make same tut for Java.", "likes": 1}, "replies": [{"author": "Heinrich Kreuser", "text": "In Unity, using Java or just using Java to make the same type of block breaker game?", "likes": 0}]}, {"topLevelComment": {"author": "Soufiane Benamer", "text": "Awsome\nThank you a lot", "likes": 0}}, {"topLevelComment": {"author": "uCrossTV", "text": "poopy stinky poo poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky poopy stinky", "likes": 0}, "replies": [{"author": "Tixx", "text": "I agree", "likes": 0}]}, {"topLevelComment": {"author": "James Scott", "text": "I've tried 3 times to pick up and use unity and each time it was hella confusing. I'm not sure what was different about your tutorial, but it all clicked for me. Thanks.", "likes": 0}, "replies": [{"author": "Justin Anderson", "text": "A few things.  This guy actually knows how to code.  He is good at explaining it.  And he doesn't try to cram a bunch of unnecessary bullshit at you.", "likes": 0}]}, {"topLevelComment": {"author": "Rs winds", "text": "is unity required online all time?Can I use unity in offline?", "likes": 1}, "replies": [{"author": "شروحات للهواتف الذكية", "text": "Rs winds yes u can", "likes": 0}]}, {"topLevelComment": {"author": "Famine", "text": "1:03:04\n\n\njust marking the particles for me", "likes": 0}}, {"topLevelComment": {"author": "RGB Crafts", "text": "My ball won't bounce back after colliding with the brick. It just ram them down in one swap.\nPS.: Nevermind. I just put this on the OnCollisionEnter2D and it worked pretty fine:\n\nvoid OnCollisionEnter2D(Collision2D other)\r\n {\r\n  if (other.transform.CompareTag(\"Brick\"))\r\n  {\r\n   Debug.Log (\"Colliding with a brick\");\r\n   rb.velocity = new Vector2 (rb.velocity.x, -rb.velocity.y);\r\n   Destroy(other.gameObject);\r\n  }\r\n }", "likes": 0}, "replies": [{"author": "Vikram Reddy", "text": "Hi\nHow you added brick in the game please explain", "likes": 0}]}, {"topLevelComment": {"author": "Phoenix Diamond", "text": "Legit!", "likes": 0}}, {"topLevelComment": {"author": "Maciek Rapacz", "text": "2,27,45 Is saying that OnTriggerEnter2D isn't use.", "likes": 1}}, {"topLevelComment": {"author": "Robko против войны в Украине", "text": "5 hours? There is a video of making the same game in 10 mins. I wonder which one I should watch :D Jokes aside, thanks for the in-depth video.", "likes": 0}}, {"topLevelComment": {"author": "diana odintsov", "text": "Where can i download unity for free ?", "likes": 0}, "replies": [{"author": "Number1One", "text": "https://store.unity.com/products/unity-personal", "likes": 0}]}, {"topLevelComment": {"author": "Techno Riyaz", "text": "Can anyone suggest good left and right screen edge so that ball moves fine and nothing like bug??", "likes": 0}}, {"topLevelComment": {"author": "Kobalt Steel", "text": "I need some help; when I complete a level, the previous level will \"still be there\" even though all of the bricks were destroyed and the next level loaded. I don't want this, as I want to include permanent objects and I don't want these objects being carried over to the next level. What can I do to fix this issue?", "likes": 0}}, {"topLevelComment": {"author": "Dario Corno", "text": "For anyone following this tutorial, the BoxCollider2D has sems not to trigger the OnTriggerEnter2D event. Use an EdgeCollider for the bottom edge and check the Is Trigger box.", "likes": 4}, "replies": [{"author": "Justin Anderson", "text": "My problem was a forgotten \")\"\nHaha", "likes": 0}, {"author": "andreeasrh", "text": "thanks bro!", "likes": 0}]}, {"topLevelComment": {"author": "WhiteFoxGames", "text": "hello i try too add the effect to bricks but when i start the game the paddle is disapper. what to do?\nhttps://youtu.be/NWG8vO02oj4?t=4160", "likes": 0}}, {"topLevelComment": {"author": "Gamekeeper ", "text": "am making a brick breaker game and it requires two balls.   how do i switch of collision between the balls. and how do i make the balls maintain the same speed after collision", "likes": 0}}, {"topLevelComment": {"author": "Máté Kovács", "text": "Addendum:\n\nIf you want to stop the ball from muving during level transition (which you should, as players can lose lives if the ball hits the bottom during that time, since you can't move the paddle), then just add this line to the void Update function in the BallScript:\n  if(GM.gameOver){\n   transform.position = paddle.position;\n  }\n\nThis is the same line used with the if (!inplay), and will put the ball on top of the paddle, however, it will launch automatically when the next level starts.\nEnjoy!", "likes": 6}}, {"topLevelComment": {"author": "Máté Kovács", "text": "How can you add sound effects to the powerups through collision?\nI tried to make a function in the powerupscript, and then access it via making a reference for it in paddlescript, then getting it in the collision function that destroys it, but it doesn't work.\n\nI don't want the powerup to make sound when it's made because it will be at the same time with the collision and break sounds, nor want to just add sound to the paddle, because I want to use multiple powerups with different sound effects.\n\nCan somebody help?", "likes": 0}, "replies": [{"author": "Riyujin", "text": "It's a bit late, just in case you never found it, I'd do it like this :  just add an AudioSource to your prefab (powerups), untick \"play on awake\" and set them to isTrigger on the collider. Now in a script, do a OnTriggerEnter with Destroy function (add the 2nd parameter which is a delay so that it can play the sound) right after Destroy, deactivate the meshRenderer so it seems to disapear directly but it does not destroy the powerup, do a PlayOneShot of your sound. This should work pretty well. However I hope you already found a way :)", "likes": 0}]}, {"topLevelComment": {"author": "Máté Kovács", "text": "1:25:35 Can't add script to the game object.\nMessage: https://imgur.com/a/wLzak2m\n\nEDIT: Seems like it doesn't like the differentation of the unique Game Manager name. It allows scripts with other names to be designated.", "likes": 0}, "replies": [{"author": "Justin Anderson", "text": "This is right around the scoreText and livesText.  I've noticed people are using TEXT - TMPro instead of regular text object.\n\nRight click Canvas > UI > Legacy > Text.\n\nTry that", "likes": 0}, {"author": "Vikram Reddy", "text": "Hi could you please let me know how you imported or added brick. Thanks", "likes": 0}]}, {"topLevelComment": {"author": "Máté Kovács", "text": "Oh, yay. So you need an additional program as well that you didn't specify and gave acces to.\n\nJust what I needed from these lousy YT tutorials.. -,-\"", "likes": 0}, "replies": [{"author": "Justin Anderson", "text": "If you're looking for something light, try notepad++", "likes": 0}, {"author": "Máté Kovács", "text": "@Ricky Nijland Bullshit reaction for a bullshit comment.", "likes": 0}, {"author": "Máté Kovács", "text": "@Ricky Nijland Just as hard as writing properly...", "likes": 0}, {"author": "Máté Kovács", "text": "@Hotel Plantage Well, it's less space than VS, which though can be downloaded with the recent updates, is still can be missed... like how I did.", "likes": 0}, {"author": "Hotel Plantage", "text": "@Máté Kovács You don't have to use MonoDevelop, it's just an IDE. Visual Studio or Eclipse will do just fine, and are better in terms of functionality", "likes": 1}]}, {"topLevelComment": {"author": "Pro Turguénev", "text": "2:40:38", "likes": 0}}, {"topLevelComment": {"author": "Pro Turguénev", "text": "1:33:00", "likes": 0}}, {"topLevelComment": {"author": "gamer 6805", "text": "what language is this?", "likes": 1}, "replies": [{"author": "Nicholas J", "text": "C#", "likes": 0}]}, {"topLevelComment": {"author": "Pro Turguénev", "text": "24:45", "likes": 1}}, {"topLevelComment": {"author": "nut squirrel", "text": "may i ask can we use matf.clamp for restricting the play area for paddle.", "likes": 1}, "replies": [{"author": "Ben Lloyd", "text": "*i know this is a year old but,* yes you could,  his method is an alternative", "likes": 0}]}, {"topLevelComment": {"author": "Mab Ped", "text": "Hey!can you sent me a link  pictures of brick? please.", "likes": 0}, "replies": [{"author": "Vikram Reddy", "text": "@Mab Ped Hi could you please let me know how to add brick", "likes": 0}, {"author": "Vikram Reddy", "text": "Hi could you please let me know how to add brick. Thanks", "likes": 0}, {"author": "Mab Ped", "text": "This is my email.MrMabPed@gmail.com", "likes": 0}]}, {"topLevelComment": {"author": "Bernadus kriswanto adi priater", "text": "how want i need a leveling in this game?", "likes": 0}, "replies": [{"author": "Gowtham Selvam", "text": "@Nate Gaudreault common sense: 0", "likes": 0}, {"author": "Nate Gaudreault", "text": "english: 0", "likes": 0}]}, {"topLevelComment": {"author": "Syntax Logic", "text": "I wish I could use JavaScript with Unity.", "likes": 2}, "replies": [{"author": "Syntax Logic", "text": "But I heard it wasn't \"real JavaScript\". Also, the community prefers C#.", "likes": 0}, {"author": "Gorgest Boi", "text": "Syntax Logic u can", "likes": 0}]}, {"topLevelComment": {"author": "Leitoz", "text": "i have a question...how can i stop the ball or reset position in the moment of loading level panel pop ups?", "likes": 1}, "replies": [{"author": "Gamtos Vaikas", "text": "Hello, I have just finished this game and the tutorial was awesome.\nYou can fix this problem by using same method when the ball touches the ground.\nInsert these lines into gameManager.cs function UpdateNumberOfBricks() else branch.\nThis is the place where we invoke the loading level.\n\njust at the beginning of the existing else, insert:\n\nballScript ball = FindObjectOfType<ballScript>();  // to be able to acess ballScript.cs functions from gameManager.cs                                                              \n                ball.rb.velocity = Vector2.zero;\n                ball.inPlay = false;\n\nthis sets ball to paddle position after each level. hope instructions are clear, and happy coding!", "likes": 3}]}, {"topLevelComment": {"author": "Dante Uribe", "text": "Hi! :) Right at the beginning, when trying to apply the script to the paddle, I get \"The script class cannot be found\". Do you know of a way to fix this? Thanks!", "likes": 1}, "replies": [{"author": "Silent Ryu", "text": "Yeah I got the same error, what fixed it was getting rid of the space between Paddle and Script and it worked but i dont think thats the reason why i fixed lol", "likes": 0}, {"author": "Dante Uribe", "text": "I'd really like that! Thanks :)", "likes": 0}, {"author": "Dante Uribe", "text": "Thanks! It turns out I've this error where Visual Studio doesn't always load some stuff (I don't know a thing about coding at all, so I don't really understand the error lol), but I just have to restart it (some times I have to restart Unity as well) and then it works again.", "likes": 0}]}, {"topLevelComment": {"author": "Mustafa Deniz", "text": "I applied every thing. But, I don't know how I can adjust these codes for androi :((", "likes": 1}, "replies": [{"author": "Vikram Reddy", "text": "Hi\nDid you got it. Could you please let me know how to adjust it for Android. Thanks", "likes": 0}, {"author": "Gorgest Boi", "text": "Mustafa Deniz you just need to change the code for the inputs. Maybe put two buttons to the side of the screen then if you tap the left horizontal = -1 and the right horizontal = 1. If you are still unsure you can look up a tutorial on andrioid/iOS input", "likes": 0}]}, {"topLevelComment": {"author": "Elderny", "text": "i want to learn c++ plz..", "likes": 0}, "replies": [{"author": "Syntax Logic", "text": "I think I like you guys more than Treehouse. xD", "likes": 0}, {"author": "Elderny", "text": "can u msg me on my email \n\nfarishackz112@gmail.com\n\n\nplz", "likes": 0}, {"author": "freeCodeCamp.org", "text": "C++ is coming soon to our channel.", "likes": 1}]}, {"topLevelComment": {"author": "Elderny", "text": "reply", "likes": 1}, "replies": [{"author": "Gorgest Boi", "text": "M8 means mate", "likes": 0}, {"author": "Elderny", "text": "what is m8", "likes": 0}, {"author": "Gorgest Boi", "text": "Hackzwith Faris r u good m8", "likes": 0}]}, {"topLevelComment": {"author": "Elderny", "text": "hello i like u", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Khan", "text": "activate eng subtitles please", "likes": 0}}, {"topLevelComment": {"author": "Game Dev Tutorials", "text": "Very good tutorial, you explained everything really well. Subbed!", "likes": 12}, "replies": [{"author": "themanix325", "text": "true but voice sound scratch my ears :)", "likes": 0}]}, {"topLevelComment": {"author": "Luis Albert Diaz Garcia", "text": "hi first at all, i didn't see the video but i have a question..it is.. are you using c# or javascript to make tha game?", "likes": 0}, "replies": [{"author": "a reddit channel to piss off apandah lol", "text": "The language is C#. But even if you only know Javascript id still encourage you to learn this if your interested! Learning a second language isn't too difficult after you've learned one. Good luck!", "likes": 4}]}]}