{"video": {"id": "o0Pi0966BOM", "title": "Computer Basics: What does 'Open Source' mean?", "description": "Hello campers, I'm Anthony also known as dapperAuteur on Free Code Camp and GitHub.\n\nThank you for joining me on this short hike about Open Source code.\n\nI'm going to explain open source code by comparing it to its opposite, closed source code.\n\nThere are a variety of models in between the two. Open source code is published, shared, public, and supported by the community. Closed source code is not published, not shared, not public, and it is not supported by a community.\n\nWhat makes open source code so important to us is the fact that it is supported by the community. Anything that is created with open source code is done by those who use it.\n\nAn example of open source code would be Linux software. It's opposite would be Windows or Apple's OSX operating systems. Linux was created and is available for free and it is supported by the community. \n\nHowever, all open source code isn't free. Some are, most are. But, the major difference between open source code and all other types of code is the fact that it's, the code is available for you to use and then improve upon. \n\nAn example would be a recipe. You can find recipes online. You buy the same products in stores and not have access to the recipes. \n\nOne example is Coca-Cola. You get Coca-Cola in a variety of flavors. If you want a new flavor of Coca-Cola, you must wait for the organization that owns the recipe to make that new flavor. You can ask for it, but there's no guarantee you'll get it. \n\nWith a recipe you can find for your own cola online, you can make changes to it. Make your own cola, your own cherry, your own vanilla, your own chocolate cola and then you can share that with the rest of the community and that will be an open source recipe, an open source product.\n\nAgain, open source public, published, shared.  Open source software is supported by and improved upon by the community. \n\n- \n\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at http://freecodecamp.com\n\nFollow us on twitter: https://twitter.com/intent/user?scree...\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson", "duration": "PT2M34S", "likes": 0, "views": "3225"}, "comments": [{"topLevelComment": {"author": "Charon IV", "text": "good", "likes": 0}}, {"topLevelComment": {"author": "Lee Hall", "text": "My question is, if it is freely shared, what stops someone from ruining the source code or planting a virus download in the source code?  -Putting arsenic in the coke recipe to poison the next person to use said recipe.", "likes": 1}, "replies": [{"author": "Sebastien Roux", "text": "Reviews before releases.", "likes": 0}, {"author": "Pettersson i Golvet", "text": "why did you put arsenic in the coke?", "likes": 0}]}, {"topLevelComment": {"author": "Narada", "text": "Nice", "likes": 0}}]}