{"video": {"id": "oz32JxUx1Fk", "publishedAt": "2015-08-24T21:48:42Z", "title": "Chrome Dev Tools: Elements Tab", "description": "Info and mini-lesson on the Elements tab of Chrome Dev Tools. Check out more in-depth documentation here: https://developers.google.com/web/tools/iterate/inspect-styles/basics\n\nWe will be using the webpage http://www.mckellen.com/ per suggestion of Free Code Camp user kmiasko.\n\nPlease check out the Chrome Dev Tools documentation at https://developers.google.com/web/tools/chrome-devtools/ \n\nIf you right click and select 'Inspect element', you can have access to the elements tab. You can change text, background color, text color, and any other CSS or HTML you'd like! \n\nThese changes don't set up automatically, so don't use this as an IDE or a place to create or edit anything you want to save. You can set up something called \"persistant authoring\" to save.\n\nCascade, inherit, and other css rules still apply, so keep that in mind as you play around. Additionally, overridden styles will be shown as having a strike through them.\n\nIt should also be noted that all of the code you're seeing in this 'tree' is current HTML, not original onload. If you use javascript or jquery to change something, it will be updated on this tree.\n\nPadding, border, and margins are easily inspected and edited using the colorful box on the right or bottom side.", "duration": "PT3M58S", "likes": "135", "views": "20515"}, "comments": [{"topLevelComment": {"id": "Ugyolld79f4NrQ68hcV4AaABAg", "publishedAt": "2022-06-14T11:16:07Z", "author": "Ernol Dawnbringer", "text": "this is how you imagine to be a hacker lol xD", "likes": 0}}, {"topLevelComment": {"id": "Ugw8cnD1ZUCTR_wg9RJ4AaABAg", "publishedAt": "2022-01-11T03:36:28Z", "author": "bert221221", "text": "I cannot stop laughing at the picture of the cat lol", "likes": 1}}, {"topLevelComment": {"id": "Ugxn75rpeIBg83Z8s4B4AaABAg", "publishedAt": "2017-11-16T00:32:09Z", "author": "Ian Mubangizi", "text": "Am I Colour Blind She Just Said that she changed the Colour to Purple ???", "likes": 1}}, {"topLevelComment": {"id": "UghCzVnSxusinXgCoAEC", "publishedAt": "2016-01-17T00:52:08Z", "author": "Hema", "text": "I've almost done with my first set of ziplines in FCC. These videos are fun to watch and helpful. Thank you. I got here through your medium post.", "likes": 0}}, {"topLevelComment": {"id": "UgjgiBj8sPW8zngCoAEC", "publishedAt": "2015-12-30T16:50:00Z", "author": "George Kousias", "text": "Can we save these elements on a browser? Google Chrome specifically.", "likes": 0}}]}