{"video": {"id": "PfN6d87r9uw", "title": "CSS Grid Changes Everything (About Web Layouts) - by Morten Rand-Hendriksen", "description": "In this talk you’ll get an intro to CSS Grid and learn how it changes pretty much everything when it comes to layouts on the web. Through examples, code snippets, and practical demos you’ll learn how to use CSS Grid in a theme for modern responsive layouts, and you’ll also learn how to handle older browsers without Grid support in a clean and straight-forward way.\n\nCSS Grid is here, and you can start using it today. This talk shows you how to do it right.\n\nEVENT: WordCamp Europe, Paris, France, June 2017\n\nSPEAKER: Morten Rand-Hendriksen\n\nSLIDES: http://mor10.com/wceu2017/\n\n-\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com\n\nCheck out our other channel for original software training videos: https://www.youtube.com/c/freecodecamp", "duration": "PT43M56S", "likes": "221", "views": "5698"}, "comments": [{"topLevelComment": {"id": "Ugy3qqaS53ZB3kbXRvx4AaABAg", "publishedAt": "2022-10-13T01:03:56Z", "author": "Anatoliy", "text": "Flex order also can do the job", "likes": 0}}, {"topLevelComment": {"id": "UgxsV_QOdvEvJm2U5MR4AaABAg", "publishedAt": "2020-11-22T15:04:25Z", "author": "Ernest Chan", "text": "just found this video about CSS grid and it is awesome. wondering whether Chrome made improvement in grid inspector? thanks.", "likes": 0}}, {"topLevelComment": {"id": "UgwIzEUZnggT1HhrN8t4AaABAg", "publishedAt": "2020-01-30T22:13:33Z", "author": "Carurosu", "text": "I inspected The New York Times and I couldn't find any display: grid use in there. Maybe I didn't inspect it well.", "likes": 0}}, {"topLevelComment": {"id": "UgxmdLpluyK6wZYbIcp4AaABAg", "publishedAt": "2018-02-24T12:23:26Z", "author": "twoc", "text": "Grid should be a generalization of flex boxes. As the number of columns reduces, grid has no way to allow content to spill into the next row... Sad.", "likes": 1}}, {"topLevelComment": {"id": "UgzSYfHo0fjYGAGdDgB4AaABAg", "publishedAt": "2018-02-24T01:27:36Z", "author": "Nastaran Heydari", "text": "this video was great. thanks", "likes": 1}}, {"topLevelComment": {"id": "Ugw2zn7b1ZxpaaOXoSp4AaABAg", "publishedAt": "2018-02-23T19:08:00Z", "author": "Linck192", "text": "they forgot to mention one of the most frequent complaints right now, which might not be that important, but people talk about it a lot, which is that you are limited to rectangles with grid, so you can't make tetris-blocks-like areas", "likes": 4}, "replies": [{"id": "Ugw2zn7b1ZxpaaOXoSp4AaABAg.8d0jBMIVcus8d3Uwhov45k", "publishedAt": "2018-02-24T20:52:30Z", "author": "Feniamin", "text": "I think it was all the time. there is few styles to use grid + flex (micro-macro)... you should look for tutorials I saw this way when you mark containers with letters and lay it out the way you want it. In the same time, you can nest in each letter another container and scale it up/narrow it. I just posted simple diagram but I'm sure with gird you can manipulate it just takes practice..", "likes": 1}, {"id": "Ugw2zn7b1ZxpaaOXoSp4AaABAg.8d0jBMIVcus8d3U-fBJ-zt", "publishedAt": "2018-02-24T20:44:18Z", "author": "Linck192", "text": "oh so it is supported now? that's pretty cool", "likes": 0}]}, {"topLevelComment": {"id": "UgyfWRwgNTqH4FMHhPx4AaABAg", "publishedAt": "2018-02-23T15:19:43Z", "author": "Hansiu", "text": "Great! As a junior I always asked myself why do I need bootstrap to do my landing page. Great explanation", "likes": 3}}, {"topLevelComment": {"id": "UgwW-m7YhdA4xEQNlkl4AaABAg", "publishedAt": "2018-02-23T15:06:11Z", "author": "Space Wad", "text": "Yay! I love CSS Grid...Combining Grid with FlexBox is gonna make frameworks less relevant...", "likes": 1}}]}