{"video": {"id": "PmDJIooZjBE", "title": "Industry Level REST API using .NET 6 – Tutorial for Beginners", "description": "Learn to use .NET 6 to build a REST API. This is a concise, start-to-finish course that developers can use as a template to onboard/structure small to medium sized industry-level CRUD applications.\n\n💻 Code: https://github.com/amantinband/buber-breakfast\n\n✏️ Course from Amichai Mantinband. Check out his channel: https://www.youtube.com/c/AmichaiMantinband\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Introduction\n⌨️ (03:29) Backend server architecture\n⌨️ (11:53) Implementing logic of API model\n⌨️ (16:40) Testing API requests\n⌨️ (20:04) Refactoring routes\n⌨️ (20:45) Create model for request data\n⌨️ (28:01) Create service interface\n⌨️ (30:47) Implement additional methods\n⌨️ (36:54) Handling errors\n⌨️ (41:10) Refactoring controller and services\n⌨️ (1:00:52) Refactoring error handling\n⌨️ (1:02:40) Testing API requests\n⌨️ (1:05:46) Conclusion\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H6M5S", "likes": "2206", "views": "83873"}, "comments": [{"topLevelComment": {"author": "Mohsin Afzal", "text": "After watching 15 minutes i am like.. kehna kya chahte ho.. however it's a good work sir but should be more descriptive.. especially for shortcuts", "likes": 0}}, {"topLevelComment": {"author": "Andre Graes", "text": "it's the first time I set the speed of the video to 75%! But it's a great content! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Polish", "text": "Thanks mate. 💌", "likes": 0}}, {"topLevelComment": {"author": "Michael", "text": "Can anyone help me understand the naming choice of the \"requestToBreakfastResult\" variable?", "likes": 0}}, {"topLevelComment": {"author": "Furkan Cengiz", "text": "I love you freeCodeCamp, just... just wanted to say that 😊", "likes": 0}}, {"topLevelComment": {"author": "Ituano Bota Vasco Pra Mamar", "text": "What extensions do you use on vscode?", "likes": 0}}, {"topLevelComment": {"author": "Amey Kulkarni", "text": "I couldn't understand why you were using VSC for backend as well. Because, when front end code will be written, it will all be getting mixed up. You should keep it separately as VS for backend and VSC for frontend. The speed was too fast. Most of the concepts you tried to explain were difficult to understand. Sorry to say but I didn't like your approach of coding. Surely not for the beginners.", "likes": 3}, "replies": [{"author": "Amey Kulkarni", "text": "@Hello World Agreed.I don't know how to write robust applications because I'm at beginners level. So, by reading the title I thought this might help me. But, still I don't think it's for beginners who wants to learn VS.", "likes": 0}, {"author": "Hello World", "text": "Get used to this approach you wanna write robust applications, you probably just missing some basics but as you keep practicing you'l like iy alot", "likes": 1}]}, {"topLevelComment": {"author": "mau91", "text": "my vscode doesnt add namespaces automatically as yours. why is that? tried a lot of related stuff i found on internet and nothing worked =/", "likes": 0}}, {"topLevelComment": {"author": "The Ace Programmer", "text": "This course is awesome! 💯👍", "likes": 0}}, {"topLevelComment": {"author": "TheString Breaker", "text": "*Phenomenal video!*", "likes": 0}}, {"topLevelComment": {"author": "RAHUL ROY", "text": "Yea...its professional level error handling", "likes": 0}}, {"topLevelComment": {"author": "AJ Bali", "text": "What code completion extension are you using? It is so cool!", "likes": 1}, "replies": [{"author": "sreejith shaji", "text": "u find it ?", "likes": 0}]}, {"topLevelComment": {"author": "XeronosKuro", "text": "So I am having several issues trying to get the test ID to respond on the Upsert, Get, and Delete breakfast http pages\nIt's giving me a 405 method not allowed error message after i click on Send Request.\n\nAm I using the wrong localport, or is there an actual setting that I've overlooked?", "likes": 1}, "replies": [{"author": "Matheus de Andrade", "text": "Did you solve it ?", "likes": 0}]}, {"topLevelComment": {"author": "Will", "text": "Why do you use Visual studio code instead of VS2022?", "likes": 0}, "replies": [{"author": "Hello World", "text": "Vs code is faster than vstudio", "likes": 0}]}, {"topLevelComment": {"author": "AveN7ers", "text": "It's a bit fast not gonna lie. I find myself pausing and rewinding every 5 seconds just to keep up. Either explain more what you're doing and why or label it as an intermediate/advanced course not a beginners course.", "likes": 11}, "replies": [{"author": "Christian Garcia", "text": "Well, the title says industry level, so I think that is not beginner level.", "likes": 1}, {"author": "Amey Kulkarni", "text": "Absolutely true.", "likes": 0}, {"author": "Hervinson Samson", "text": "I agree", "likes": 1}]}, {"topLevelComment": {"author": "Dylan J. Gerrits", "text": "The video is good, but it lacks of explanation about why and what you are doing something.", "likes": 4}}, {"topLevelComment": {"author": "Debankur Bhattacharjee", "text": "Which Database is used in making the REST API?", "likes": 0}, "replies": [{"author": "Rafał Chmiel", "text": "its whatever", "likes": 1}]}, {"topLevelComment": {"author": "Automation Guy", "text": "downloaded, it worked, the author ty", "likes": 0}}, {"topLevelComment": {"author": "Bakihz", "text": "Great video. Although I can't follow your shortcuts. Which shortcuts do you use? Can you point me to where I can learn these shortcuts? Which extension?", "likes": 7}}, {"topLevelComment": {"author": "Alvaro Albero", "text": "This video was amazing, I learned so much, thank you!\n\nI have one question regarding the From factory methods. Are they breaking the \"correct\" dependency direction? where your Model only needs to know about itself?\n\nThese seem very handy as you reuse code of creating a breakfast form a request. But now your Model needs to know about the Create and Upsert request records. And if you keep adding more types to create a breakfast from, your model needs to keep adding factory methods and have dependencies on all those external types. Could that be a problem? If so, what coudl be a solution to it?", "likes": 1}}, {"topLevelComment": {"author": "David Hoong", "text": "what's your used extension for IntelliSens ecode completion? It is pretty cool! I want it.", "likes": 1}, "replies": [{"author": "sreejith shaji", "text": "did u got it ??", "likes": 0}]}, {"topLevelComment": {"author": "bobsort", "text": "With windows 95, everyone was so excited that they don't have to stare into a black screen of text and don't have to write an entire line of commands to do a simple task like openning an editor. These days, seems developers are going retro all the way, and like to type in every command to do things that you can do with just a right click or a keyboard shortcut.\n\nAlso I wouldn't suggest surrounding blocks of code with braces unless it is really necessary, you are teaching a thing to new developers that will cause days of headache for seniors to debug.\n\nAs for data store, when I teach juniors, I always put the data in a different class that does the crud internally (DAL concept), then call methods of that class instead to avoid distracting them from what actually are trying to learn. (your storage is inside your service code", "likes": 3}, "replies": [{"author": "Ozious Megasus", "text": "personally, knowing how buttons of IDEs do the works is nessesary. Juniors then can use IDEs without questioning what lays under the hood. Furthermore, devs should know how to use terminal.", "likes": 0}]}, {"topLevelComment": {"author": "JPiert Palomino", "text": "dudes whats the name od that extension that autocomplete properties or constructors? :/\nPD.\nI like this course", "likes": 2}}, {"topLevelComment": {"author": "fieryscorpion", "text": "Amazing content. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Alexandro Lopes", "text": "Simple and objetive.\n\nWhich extension you used to auto complete the code?", "likes": 1}, "replies": [{"author": "AveN7ers", "text": "Visual Studio 2022 has that feature interestingly", "likes": 0}, {"author": "Alexandro Lopes", "text": "@Alvaro Albero really, have a robot int the footer of vs code", "likes": 0}, {"author": "Alvaro Albero", "text": "I believe it's GitHub copilot", "likes": 2}]}, {"topLevelComment": {"author": "Edwar J. Guzmán", "text": "Maravilloso!!!! One question, in which application did you make the Backend Service Architecture diagram? Thanks :)", "likes": 3}}, {"topLevelComment": {"author": "RAMAZAN KIZILKAYA", "text": "The tutor is very fast. The context does not not cover all the basics and far from being a beginner's tutorial and mostly focused on error management. Thanks anyway.", "likes": 4}}, {"topLevelComment": {"author": "Ildefonso Castro", "text": "Love the video i just encounter a problem, when trying 18:10 request i get \"HTTP/1.1 500 Internal Server Error\" why could it be?", "likes": 1}, "replies": [{"author": "Wei Zhao", "text": "me too, but i get an error 404...", "likes": 0}]}, {"topLevelComment": {"author": "Sunandsea", "text": "Great video !! Thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Quách Hêng Tôny", "text": ".NET goated", "likes": 2}}, {"topLevelComment": {"author": "Zhang zz", "text": "Hello, I'm from China. Since YouToBe is not accessible in China, can I upload your teaching video to China's domestic website? I'll flag the source of the video.", "likes": 2}}, {"topLevelComment": {"author": "whiteshooz", "text": "**intellisense makes suggestion**\nYeeees", "likes": 3}}, {"topLevelComment": {"author": "Smock", "text": "I'm gonna follow this one step by step tonight, since i've always developed .NET in Visual Studio and never in VSCode. However, i am quite confused as to what is happening in the testing at the end of the video. Maybe you can show us what shortcuts are you using to test the api with the URLs?", "likes": 1}, "replies": [{"author": "Mohsin Afzal", "text": "Don't go for this one if you want to learn code in vs code", "likes": 0}, {"author": "Maksim Ushakov", "text": "​@Quang Trần Minh https://youtu.be/m9HvsB1-hAo", "likes": 0}, {"author": "Quang Trần Minh", "text": "@Lior Dagan please the link, thank you", "likes": 0}, {"author": "Lior Dagan", "text": "He also has a vid on his channel explaining all of his VSCode setup, so I’d recommend that! 😁", "likes": 6}]}, {"topLevelComment": {"author": "shoeb sayyed", "text": "are you using Github Co-pilot for the intellisense ? or is it some extension ?", "likes": 1}, "replies": [{"author": "Lior Dagan", "text": "GitHub copilot 👍🏼 he has a vid on his channel explaining all his vscode setup where he talks about it", "likes": 1}, {"author": "exodia1181", "text": "I was wondering the same thing.", "likes": 0}]}, {"topLevelComment": {"author": "Suzan Ahmed Galal", "text": "0:50 There's 'f' missing in the header of the video", "likes": 0}}, {"topLevelComment": {"author": "Andrey Gritsay", "text": "I wonder why do people like .Net more than FastAPI. In my opinion FastAPI is much better", "likes": 0}, "replies": [{"author": "bobsort", "text": "@Andrey Gritsay I don't like braces in next line either and thats the first thing I change in code formatting options.", "likes": 0}, {"author": "bobsort", "text": "@fieryscorpion Unless you have tried FastAPI before, and know for fact that .NET Core is easier, you shouldn't be arguing that it is better. As for curly braces, I had a debug session that took about 2 days, a junior put semicolon after a for loop and then braces in next line, just the way that this video does for no reason, and that cause the loop to run just once. to avoid such annoying bugs I always suggest syntax of for loop is `for(){` not just `for()`", "likes": 0}, {"author": "fieryscorpion", "text": "@Andrey Gritsay In .NET 6 there’s file scoped namespaces, minimal APIs etc. and a lot has been done to reduce boilerplate. As for curly braces, I prefer it to just indentation; makes it easier to read someone’s messy legacy code for maintainability reasons.", "likes": 3}, {"author": "Andrey Gritsay", "text": "@fieryscorpion for me it's just C# looks ugly with its curly braces on separate lines and that everything starts with uppercase letter and also FastAPI generates automatically all documentation so it's impossible to forget to document something", "likes": 0}, {"author": "fieryscorpion", "text": ".NET is way more mature, robust and performant than FastAPI. Give it a try.", "likes": 3}]}, {"topLevelComment": {"author": "Phú Nguyễn Trọng", "text": "best, hope someday php also have industry-level tutorials like this", "likes": 0}, "replies": [{"author": "i am nobody", "text": "@fieryscorpion .NET is a framework, not a language.", "likes": 0}, {"author": "fieryscorpion", "text": ".NET is much more enjoyable to develop with compared to PHP, Java, Python etc.", "likes": 0}]}, {"topLevelComment": {"author": "Azim Lit.", "text": "Wonderful", "likes": 0}}, {"topLevelComment": {"author": "Das Fahrer", "text": "Why the choice to use web api instead of minimal?", "likes": 0}}, {"topLevelComment": {"author": "Ruslan Levkov", "text": "What terminal do you use? Please share the settings for it.", "likes": 2}}, {"topLevelComment": {"author": "Selva viswanath", "text": "Industry level. Thats what i need", "likes": 0}}, {"topLevelComment": {"author": "MR gaming bro", "text": "Please create Blender full course helpfull any people ❤️❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Hungry For Apples", "text": "For me MatchFirst() accepts a single error, not a List, thus not matching the Problem() arguments you have in your example. What am I missing?", "likes": 1}}, {"topLevelComment": {"author": "the Legit", "text": "Thank you for another great video, can't wait to finish it!", "likes": 0}}, {"topLevelComment": {"author": "krccmsitp", "text": "A comprehensive overview and introduction on .NET 6 REST API. I wonder, however, where does the content from your Api.md comes from and why do you use/need it?", "likes": 4}, "replies": [{"author": "Mohsin Afzal", "text": "I was too curious for that api.md it came sudden", "likes": 0}, {"author": "Amey Kulkarni", "text": "@Bipin Maharjan Is it a right approach then as he didn't explain that thing? I don't understand.", "likes": 0}, {"author": "Bipin Maharjan", "text": "you dont need it. He wrote if off the camera. Its just a documentation explaining how his api works.", "likes": 4}]}, {"topLevelComment": {"author": "N.O.S.E. - No Stress English ", "text": "good, thanks! I need to learn REST API", "likes": 1}}, {"topLevelComment": {"author": "Carlo Silipo", "text": "Hi, I like the way you quickly go thru the tutorial. Some presenters spend hrs on just one concept. Tks\n Carlo", "likes": 2}}, {"topLevelComment": {"author": "ItsMePhoebe", "text": "The timing on this is perfect, thank you!", "likes": 10}}, {"topLevelComment": {"author": "María De Los Ángeles Hernández Cedeño", "text": "Thank you, it works perfect!", "likes": 1}}, {"topLevelComment": {"author": "romanemul1", "text": "I think this video is only for refresher purposes.  Nothing new can be learned since nothing is explained.", "likes": 5}}, {"topLevelComment": {"author": "a", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "shareCodeCamp", "text": "Awesome work !.. 🥰🥰", "likes": 3}, "replies": [{"author": "Amichai Mantinband", "text": "Thanks! 🥰", "likes": 1}]}, {"topLevelComment": {"author": "Adeni", "text": "Can this also work on ASP.NET Core 5?", "likes": 0}, "replies": [{"author": "Amichai Mantinband", "text": "There are some features that aren't available in .NET 5, but the concepts and most of the code should look the same", "likes": 2}]}, {"topLevelComment": {"author": "SoftBlood", "text": "No Mininal API\nNo Database connection\n\nThis is not a complete course", "likes": 2}, "replies": [{"author": "SAC Dominiosoft", "text": "@Amichai Mantinband Hi, do you have some video showing the database connection with this project? I'm a begginer and dont know how to make a connection", "likes": 0}, {"author": "SoftBlood", "text": "@BeeJay I don't demand nothing, iam not even C# developer, I just say my opinion for content creators we have planty of \"beginner\" courses if you make it make it right.", "likes": 0}, {"author": "Amichai Mantinband", "text": "@SoftBlood I have a feeling you'll like my channel 😂 Regarding your comment, perhaps a database connection could be a good addition. For Minimal APIs, I would argue it isn't better or worse than controllers, especially in an application like this", "likes": 2}, {"author": "BeeJay", "text": "@SoftBloodRemember not to act entitled, appreciate then request.", "likes": 2}, {"author": "SoftBlood", "text": "@Amichai Mantinband This 2 i mention is not a big deal to implement its a few lines of code and very important especially database connection.\nI didn't ask for JWT or Oauth2 or Microservices. its 2 simple things would make your video more useful.", "likes": 0}]}, {"topLevelComment": {"author": "Riyan Khan", "text": "I really want to follow this course but it doesn't mention the prerequisites (which every course should) so as a beginner to programming, I don't want to waste my time watching something I don't understand :)", "likes": 6}, "replies": [{"author": "Bakihz", "text": "@Amichai Mantinband Thank you so much", "likes": 0}, {"author": "Amichai Mantinband", "text": "Ooh, that's great feedback. Thanks, Rayan!\r\nTech prerequisites:\r\nC#/.NET, JSON, HTTP, client-server communication\r\n\r\nSoftware prerequistes:\r\n.NET 6 SDK, VSCode\r\n\r\nI have a tutorial for setting VSCode similar to what I have in the video: https://youtu.be/m9HvsB1-hAo", "likes": 6}]}, {"topLevelComment": {"author": "yoan bello", "text": "Is this tutorial for beginners in the world of API?", "likes": 1}, "replies": [{"author": "yoan bello", "text": "@Amichai Mantinband i think is not si easy. Very fast pace", "likes": 2}, {"author": "Amichai Mantinband", "text": "Hi Yoan, I was hoping to create a tutorial that is suitable also for beginners in the world of web APIs. Would love to hear your feedback and if the various visuals help understand the concepts 🙂", "likes": 0}]}, {"topLevelComment": {"author": "Sean Mui", "text": "I've just seen real software engineering bare naked.. Thanks for the efforts to make this video.", "likes": 2}, "replies": [{"author": "Sean Mui", "text": "@Amichai Mantinband Following you via your Youtube Channel.", "likes": 0}, {"author": "Amichai Mantinband", "text": "Thanks, Sean 😊", "likes": 1}]}, {"topLevelComment": {"author": "Omer Friedman", "text": "Great tutorial!", "likes": 2}}, {"topLevelComment": {"author": "Amichai Mantinband", "text": "This was a fun one to make. Really eager to hear what you think! 🤙🏼", "likes": 25}, "replies": [{"author": "jan0195", "text": "This is the best video on the topic that I've seen.", "likes": 0}]}, {"topLevelComment": {"author": "YBXtreminal", "text": "יוחאי ימלך", "likes": 2}}, {"topLevelComment": {"author": "Keshav Mishra", "text": "Pleasure that we have freecode camp xD", "likes": 1}}, {"topLevelComment": {"author": "Louay Ghanney", "text": "this just makes me appreciate express js more", "likes": 5}, "replies": [{"author": "Obinna Okafor", "text": "Except the performance and robustness of the underlining platform", "likes": 11}, {"author": "Sir Xi Gutierrez von Wallenstein VI", "text": "Same here lmao. It is a whole process to do the same thing in the end.", "likes": 2}]}, {"topLevelComment": {"author": "tgfhtgfh", "text": "Learning APIs from Tyson Fury himself! What a day!", "likes": 35}, "replies": [{"author": "Obinna Iloanya", "text": "Lmfao 😂😂😂😂😂😂😂", "likes": 3}]}, {"topLevelComment": {"author": "IT Expert", "text": "great", "likes": 2}}, {"topLevelComment": {"author": "Vincent Groenewold", "text": "Someone is displaying features of some presentation software I think. :)", "likes": 4}, "replies": [{"author": "Amichai Mantinband", "text": "Haha It's figma 😎", "likes": 2}]}, {"topLevelComment": {"author": "Brian Dube", "text": ".Net 6 and Spring Boot are my favourite backend frameworks", "likes": 12}, "replies": [{"author": "fieryscorpion", "text": ".NET is much more enjoyable to develop with compared to Java/ Spring tbh.", "likes": 5}]}, {"topLevelComment": {"author": "CloudNey", "text": "Amazing!!", "likes": 6}, "replies": [{"author": "Amichai Mantinband", "text": "Thanks, CloudNey!", "likes": 1}]}, {"topLevelComment": {"author": "Bekhzod Rizayev", "text": "My congratulations to 6 million subscribers. Your channel is so cool🔥❤️", "likes": 5}}, {"topLevelComment": {"author": "king of his kingdom", "text": "Congratulations on 6M subscribers . The family is getting bigger day after day 🌹😍😍", "likes": 19}}, {"topLevelComment": {"author": "Hamid Bilhaj", "text": "❤", "likes": 1}}, {"topLevelComment": {"author": "Hemecan", "text": "Hello from Turkey 🇹🇷", "likes": 1}}, {"topLevelComment": {"author": "Soham Mahi", "text": "Very Good Knowledge", "likes": 6}, "replies": [{"author": "Dhanvi Akash", "text": "Can I know from where can I learn .net for web development in vs code not visual studio, because my lapy does not support visual studio", "likes": 0}, {"author": "Amichai Mantinband", "text": "Thanks, Soham 🙏", "likes": 0}]}, {"topLevelComment": {"author": "Brijesh Morya", "text": "Good content", "likes": 4}, "replies": [{"author": "Amichai Mantinband", "text": "Thanks, Brijesh 🤙", "likes": 1}]}, {"topLevelComment": {"author": "Soumadip Banerjee", "text": "❤️", "likes": 3}}]}