{"video": {"id": "Qd_V5hpYk_A", "title": "Todo List Tutorial - Angular 4 and Redux", "description": "A simple todo list application built with the Angular 4 framework and Redux! Learn how to use Redux to manage the state of your application while building this todo's list. \n\nAngular Webpack Starter:\n- Repo: https://github.com/Bigless27/Angular-webpack-starter\n- Video: https://youtu.be/qmIkoAnttlE\n\nRedux Dev Tools: https://chrome.google.com/webstore/detail/redux-devtools/lmhkpmbekcpmknklioeibfkpmmfibljd?hl=en\n        \n💾   Creating a Todo Form: 2:15\n\n💾   Initializing Redux: 7:07\n\n💾   Redux Create Action: 20:21\n\n💾   Redux Get Action: 39:43\n\n💾   Redux Complete and Delete Action: 47:27\n\nGithub Repo: https://github.com/Bigless27/Angular-Redux-Todos\n\nVideo created by Jordan Lesson.\nContact: Jordantreylesson@gmail.com\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT55M42S", "likes": "70", "views": "8909"}, "comments": [{"topLevelComment": {"author": "Abdelwahhab FELLAHI", "text": "would you please mention the IDE or the toolkit for every language for future videos please in the description ? by the Way excellent Job & Good luck for everyone there. Keep it up !", "likes": 0}}, {"topLevelComment": {"author": "D F", "text": "Thank you! I've been trying hard to get my head around Redux for a while and how to properly implement it in an Angular app because there seem to be so many different ways one can do that. Just looking at the Redux documentation it is not immediately apparent how to use it with Angular and there is so many videos that show different approaches. Thanks to your video I finally had my heureka moment! :D Also thank you TypeScript and intellisense! :D", "likes": 0}}, {"topLevelComment": {"author": "Rock Vnme", "text": "Thanks a lot, I hope the next project is Angular and GraphQL, :)", "likes": 1}}, {"topLevelComment": {"author": "Scott Berry", "text": "I'll like to add that Facebook didn't create Redux, but was inspired by their flux state management which was designed by Facebook, Redux was designed by Dan Abramov and Andrew Clark, and very much inspired by functional programming, one of the main influences was Elm.", "likes": 0}, "replies": [{"author": "Lesson on Coding", "text": "Looks like I need to follow him as well. lol. Yea, I don't see why not! I'll try to fit it in with an Angular 5 example as well! I really appreciate the request!", "likes": 0}, {"author": "Scott Berry", "text": "All good, the reason I know is because I follow Dan Abramov(Which for others reading, there's a course on Redux on EggHead by him), a rather big player in the functional programming world, I heard at the beginning you took a request, I mostly do React, but I like to see other implementations, would you be able to do a Graphql example for Angular, it would interesting to see how other frameworks implement it.\n\nYou could even use Github's new Graphql endpoints, saves on designing a simple backend.", "likes": 0}, {"author": "Lesson on Coding", "text": "Hey Scott thanks for pointing that out! I forget where I heard that FB created it, but now I'll be sure to let people know about the corrected history of Redux!", "likes": 0}]}, {"topLevelComment": {"author": "Rafael Cisneros Gómez", "text": "Awesome, I though this gonna be harder than a React-Redux application, this was helpful bro thanks for your time.", "likes": 3}}, {"topLevelComment": {"author": "Kudos", "text": "Is that the default theme?", "likes": 0}, "replies": [{"author": "Lesson on Coding", "text": "Brogrammer theme", "likes": 0}]}, {"topLevelComment": {"author": "Harshit Pant", "text": "You are the only developer I guess that uses sans serif font.", "likes": 4}}]}