{"video": {"id": "QeRSEoqpKVI", "title": "How to Learn from Free University Courses (Audit Classes Online)", "description": "Learn how to successfully audit public college computer science courses on the web! \n\nIn this video, students Seth Goldin and Sam Crombie discuss learning on the web, methods for choosing a topic and course, tips to consider when conducting your audit, and more!\n\n🔗 Find your next CS audit resource: https://collegecompendium.org\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Intro\n⌨️ (01:41) Learning on the Web\n⌨️ (08:35) What is \"Auditing\" a Course?\n⌨️ (13:27) Why Audit Courses?\n⌨️ (20:36) Choosing the Right Topic\n⌨️ (27:35) Choosing the Right Course\n⌨️ (34:49) Making the Most of Your Audit\n⌨️ (44:34) Next Steps\n⌨️ (47:44) Example Audits\n⌨️ (58:38) Outro\n\nDisclaimer: We are two students sharing our insights from our personal experiences about the process of auditing in an effort to potentially help you with your journey. We are not affiliated with any colleges, professors, or courses. \n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT59M59S", "likes": "7519", "views": "194902"}, "comments": [{"topLevelComment": {"author": "Hyper Crack", "text": "Education is free, Degrees and certificates are not.", "likes": 0}}, {"topLevelComment": {"author": "Louis911", "text": "Seth talks like he's being held hostage and forced to smile and talk on gunpoint", "likes": 0}}, {"topLevelComment": {"author": "Agulite ", "text": "Join the Global community as we explore Blockchain\r\n\r\nA gathering for blockchain enthusiasts, including industry professionals, developers, and traders.\r\nFeaturing: Smart Contract Development, Trading highlights, and Panel Sessions on how blockchain is impacting key industries\r\n\r\nDate: 19th - 21st April 2022\r\nLink: https://agulite.com/blockchain-week", "likes": 0}}, {"topLevelComment": {"author": "Your Startup Innovation", "text": "where I can found FULL MQL4 course here  ?", "likes": 0}}, {"topLevelComment": {"author": "Zazo", "text": "So boring way to present 😵 my brain is dead from listening 😵", "likes": 0}}, {"topLevelComment": {"author": "Study with Erisa", "text": "This video has been the most helpful in my journey to using online courses to get a job. Thank you for everything!", "likes": 3}}, {"topLevelComment": {"author": "snakeperson27", "text": "any opinions on taking more  than one course at the same time?", "likes": 0}}, {"topLevelComment": {"author": "Codex", "text": "People say the unique and advanced learnings have the heaviest accents. Once you get use to the accent, you might start looking for learnings with deep accents only, no?", "likes": 0}}, {"topLevelComment": {"author": "Felix Vasquez", "text": "50:00 College compendium", "likes": 0}}, {"topLevelComment": {"author": "Felix Vasquez", "text": "47:00 recursos de estudio de Github", "likes": 0}}, {"topLevelComment": {"author": "andy bosik", "text": "Yes, you-too can be indoctrinated by the Communist Professor’s for FREE! \nYay! Where do-I sign-up?", "likes": 0}}, {"topLevelComment": {"author": "Gary Martin", "text": "the college compendium website appears and quickly goes blank.", "likes": 0}}, {"topLevelComment": {"author": "Ben Angèlico SipeSol", "text": "Magistral 🔝", "likes": 0}}, {"topLevelComment": {"author": "Greg", "text": "Is Sam the dude from Billions? The quant?", "likes": 0}}, {"topLevelComment": {"author": "ZEPHIRISTO", "text": "i love how things is going in 2022...no excuse", "likes": 0}}, {"topLevelComment": {"author": "Joe Braybrook", "text": "Uni in the UK is £9000 a year...", "likes": 0}}, {"topLevelComment": {"author": "Ramone DeCurta", "text": "LinkedIn Learning and YT provide some of the best free courses.", "likes": 0}}, {"topLevelComment": {"author": "Hitanshu Gupta", "text": "TQ For Providing This Help And Community!!!!!!!", "likes": 1}}, {"topLevelComment": {"author": "Khigha Bisi", "text": "Thank you guys for this. Super helpful!!!", "likes": 1}}, {"topLevelComment": {"author": "aiman azzi", "text": "Man that helped me a lot, really glad to watch it thank you so much.", "likes": 1}}, {"topLevelComment": {"author": "Vero Vertex", "text": "There are few notes and comments I want to share, hope you are reading it (given the time I write this a bit later after you guys uploaded the video):\n\r\n1. Regarding the community thing, you forgot to mention one thing: *_contribute_* . This contribution can be in form of answering question, evaluating courses and report for errors, or sharing your code to the community via github. It is a cyclical process, someone answering your question, and in turn you should answer other question, if you are able to. And do not forget the Feynman Method: The best way to learn is by teaching it. Once you are able to explain or answer others question, your understanding is cemented in your mind. This also will build the community better.\r\n\r\n2. Its also better to include how to audit courses on Youtube. Sometimes videos in YT channels such as in freeCodeCamp channel is hours long and sometimes cannot be finished in one sitting. Fortunately, FCC provided timestamps so that we can return to our learning later. But the problem is how to manage your study if it is not structured like MOOCs, but rather just a pile of YT videos? I found that that theme is worth explaining too, and besides, you uploaded this video in FCC right? Lol 🤣🤣🤣.\n\nThank you for your amazing video, Seth and Sam! I think it is really an introductory course on learning online, which is as you described really different with in-class learning. I myself currently doing a masters, my topic is in e-learning and edtech (my research topic is in Self-Regulated Learning, which you guys amazingly covered, ten thumbs up for you guys 👍👍👍👍👍👍👍👍👍👍). And find myself need to revisiting my college algebra understanding to learn data science before delving into learning analytics. Hope you guys are successful in your study!", "likes": 8}}, {"topLevelComment": {"author": "rudr'a rajput", "text": "you are worthiness, your subscriber and helper will generate in India.\nI'm sharing this channel to the whole University's students.", "likes": 0}}, {"topLevelComment": {"author": "Phone Lab", "text": "People don't give credit to free resources.\nNTPEL is indeed one example just like MIT OCW", "likes": 0}}, {"topLevelComment": {"author": "Wandering Knight", "text": "Not very useful information", "likes": 0}}, {"topLevelComment": {"author": "Jaime Barragan", "text": "Thank you for the illustration, now I'm going to take some courses on MOOC platforms.", "likes": 1}}, {"topLevelComment": {"author": "Israel Noah", "text": "Thank you FreeCodeCamp fraternity and beau..I've learnt alot from this channel.", "likes": 0}}, {"topLevelComment": {"author": "mohamed amiin ishak ahmed", "text": "Thank you so much, you made good lecture. World needs such good people like you😍", "likes": 2}}, {"topLevelComment": {"author": "Indigo Rodent", "text": "Sad that many of these course sites have switched to purely paid courses with only free previews after the skillshare thing took off.", "likes": 0}}, {"topLevelComment": {"author": "Maruf Hassan", "text": "Can you guys please upload a video on how to search Google like a programmer. Most of the time people ask quite lame questions and I would just recommend your course to them.", "likes": 0}}, {"topLevelComment": {"author": "CHITUS💖⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻", "text": "This channel is gold. How can free education not be a good thing. Thankyou for educating me and the society. Hope people learn to give back to society and be grateful. Thank-you", "likes": 2}}, {"topLevelComment": {"author": "falling banana", "text": "a bit disappointed the whole things only for computer science", "likes": 0}}, {"topLevelComment": {"author": "MOHSIN Khan", "text": "Thank you Freecodecamp for making learning fun and intitutive 👍🏼", "likes": 4}}, {"topLevelComment": {"author": "APA HAYO...", "text": "Orang desa yg ga lancar bahasa Inggris nyimak 😌", "likes": 1}}, {"topLevelComment": {"author": "July", "text": "Way too long video lol 😂 but i like the excitement", "likes": 0}}, {"topLevelComment": {"author": "learnjaye", "text": "The best channel for learning in YouTube", "likes": 1}}, {"topLevelComment": {"author": "ZIA UR RAHMAN", "text": "Sir i have a question.\nAfter completing the course, how we should use the learning material in real world. For example if i learn java language and then i want to implement it as in the field of mobile application then what steps i should take?", "likes": 0}}, {"topLevelComment": {"author": "Abhishek Gupta", "text": "Thank you 😌 for sharing this", "likes": 1}}, {"topLevelComment": {"author": "Kali Lilith", "text": "udemy is amazing! I have over 100 certificates in computer science to voice sound healing certification ect between coursera and udemy! Thank you so much for talking about free courses because they ARE out there and I love it!!!", "likes": 2}}, {"topLevelComment": {"author": "Sandy V", "text": "Thanks for such a valuable channel. You guys rock… you are parallel to real education system preparing not only freshman but also experienced professionals. \nYou guys continue the good non profit work and dont fall for corporate greed…", "likes": 9}}, {"topLevelComment": {"author": "Citizen of Reality", "text": "wonderful lecture, great presenters, really worth watching.", "likes": 4}}, {"topLevelComment": {"author": "N L", "text": "Great jobb guys!", "likes": 1}}, {"topLevelComment": {"author": "Mumtahina Parvin766", "text": "My university is now  online . Those teachers who always teach offline ,they don't doing well in online. I was hopeless of my degree. When i met this channal i feel very much blessing. Compared to my university online classes these channal is best for computer science.", "likes": 0}}, {"topLevelComment": {"author": "Sara Khan", "text": "Can anyone tell me the all Source's name Which are showed in the vedio at 10.35 & 11.10?", "likes": 0}}, {"topLevelComment": {"author": "funny animal world", "text": "Arent universities and colledges are the worst way into it? I had my bit of expierience with them and one 3months course in colledge equaled to 5h crashcourse on youtube .so I think learning it is best from specialized websites or profesional teachers you can find on youtube or udemy and not from universities or colledges.", "likes": 1}}, {"topLevelComment": {"author": "Newbie ", "text": "Seth looks like Shawn Mendes lol", "likes": 0}}, {"topLevelComment": {"author": "Sameer Yasin", "text": "Can you upload Tutorial videos on Libre-Office", "likes": 0}}, {"topLevelComment": {"author": "Tahmina Akter Chaity", "text": "💌💌💌", "likes": 0}}, {"topLevelComment": {"author": "GARGI Mishra", "text": "It was so funny 😂 and it made me like 10 times more smarter in just one video the first time watching this channel already love it!", "likes": 4}}, {"topLevelComment": {"author": "😊 to", "text": "Edex is not free and very expensive we can't even audit full course for free", "likes": 0}}, {"topLevelComment": {"author": "TESTIFY", "text": "thank you for this", "likes": 1}}, {"topLevelComment": {"author": "Ajeeth Natarajan", "text": "So cool and very useful course! very motivate and valuble", "likes": 4}}, {"topLevelComment": {"author": "Spider-Maniac", "text": "FCC you can change the world ....keep going and we will keep learning !", "likes": 1}}, {"topLevelComment": {"author": "joe henry", "text": "Thank you..", "likes": 0}}, {"topLevelComment": {"author": "Rex", "text": "Is this for real this channel is gold mine but still I would consider it underrated \n\nI mean they are building career directly", "likes": 1}}, {"topLevelComment": {"author": "BearWithMe", "text": "Please keep the speaking volume loud like this video\nsome of your old video have small speaking volume, suddenly when advert play with loud volume I get startled, because my speaker volume set too high\nthis loud speaking volume is good because it will balance with advert volume.\n\nthankyou for the great video.", "likes": 1}}, {"topLevelComment": {"author": "Victor Montivero", "text": "Excelent material! I'm also doing CS 61B: Data Structures.", "likes": 3}}, {"topLevelComment": {"author": "Leonardo Gastopher", "text": "Hope any native english speaker can spend a little bit time to make subtitle for all freeCodeCamp course.", "likes": 0}}, {"topLevelComment": {"author": "Vi Sarathiel", "text": "Exactly what I need! Thanks a lot!", "likes": 1}}, {"topLevelComment": {"author": "RunOs", "text": "fCC is so awesome, especially if you're not fond of traditional structured learning.", "likes": 2}}, {"topLevelComment": {"author": "Sai Teja", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Martin Caroline", "text": "THE BEST DECISION I EVER MADE IN MY LIFE WAS\nINVESTING IN FINANCIAL MARKET. TRUST ME GUYS, IT\nPAYS!", "likes": 6}, "replies": [{"author": "James Kiora", "text": "Many of us don't know where to invest our money so We\ninvest it in wrong places and to the wrong people", "likes": 2}, {"author": "Sarah Clark", "text": "Crypto trading is very profitable when you trade well.", "likes": 2}, {"author": "Austin Fred", "text": "Investing in cryptocurrency is the best way of getting\nahead to build wealth, investing remains a priority. The\nstock market has plenty of opportunities to earn a\ndecent Payouts, with the rights skills and proper\nunderstanding of how the market works, i pray that\nanyone who reads this become successful in life.", "likes": 3}, {"author": "Austin Fred", "text": "You are right, to be a successful person in life requires\nhim or her of hard work and time", "likes": 4}]}, {"topLevelComment": {"author": "rainwave5", "text": "7:30 perfectly said. I probably should just finish the video first lol but I agree 100%. Each one has it's trade-offs and one has to learn to extract the benefit out of both.", "likes": 6}, "replies": [{"author": "rainwave5", "text": "And I love the fact that they make an effort to call it self-guided learning rather than self-taught which is a misnomer in my opinion", "likes": 2}]}, {"topLevelComment": {"author": "Hey Elon", "text": "If you want to learn Web development ! Check out this link:\n\nhttps://youtube.com/channel/UC34LEEfb4KjhEqZDoKopUuQ", "likes": 0}}, {"topLevelComment": {"author": "Motif", "text": "Thank you!!", "likes": 1}}, {"topLevelComment": {"author": "Create With Coding", "text": "on my computers in 2 different locations: Audit Over 700 CS Classes\r\nFrom Renowned Universities  (but on video it shows over 1000) weird. I'm amazed at what I'm discovering here!! Thanks!", "likes": 0}}, {"topLevelComment": {"author": "The Beautiful Game ⚽️", "text": "Steve jobs still alive ? :-)", "likes": 0}}, {"topLevelComment": {"author": "James White", "text": "MIT has good stuff too", "likes": 2}}, {"topLevelComment": {"author": "David Khutsishvili", "text": "My learning source for programming and IT related subjects:\nUdemy\nYouTube\nBooks\nDiscord server", "likes": 1}, "replies": [{"author": "David Khutsishvili", "text": "I should try MIT open course were", "likes": 0}]}, {"topLevelComment": {"author": "The Hacker", "text": "There is a difference between learning, and being recognized for having proper certification. \nPeople with certs _can be_ idiots, while everyone here who is learning because they want to learn, probably won't be hired due to not having proper certification.", "likes": 19}, "replies": [{"author": "Miss desire Independance", "text": "You can combine these courses with a degree. Your employer will view it as continuing education.", "likes": 0}, {"author": "Silent_Simulator", "text": "@illb2fast4u of couse you judged people... \"people who dont need their hand held..\" Always the same...those thinking that they are superior are insulting the \"inferior\" ... but quickly forget about it and dont admit it even happened. The next is, again always the same way : They are accusing their critics to  suffer from an inferiority complex. just turning the table to hide your not polite attitude..I dont care who you are or what you do , just dont judge people you dont know. Just because the op said there is a difference between \"just learning\" and \"proper certification\" doesnt mean that you can come up and tell the world that those \"self employed\" dont need certifications. You know what? Most people in the world..depends on their countries of course..dont even got the chance of being self employed..and there in such life circumstances it makes a fucking big difference if you \"learned something on the internet\" or got a certicfication. Because in most countries that counts more than the abilities you really got..", "likes": 1}, {"author": "illb2fast4u", "text": "@Silent_Simulator I didn't say I'm better than anyone. You seem to suffer from an inferiority complex. I stated the obvious. People who don't need to be spoon-fed, are generally self employed and as such we study only what is required, when it is required, for a specific purpose. We deliver projects and move on. We don't have time of the need to wave around tons of certificates and qualifications in the hopes that we impress somebody, who might employ us. PS: Generally we aren't impressed by stacks of paper either. We want to know; What projects did you do, what was your stake in the project, what was the flight plan and did you deliver ahead of schedule, on time or past the deployment date? If you went past the employment date, why? What roadblocks did you experience and what did you do to get around it. We know not all projects can be landed bang-on-time, in fact in the current world situation, they very seldom do. How you navigated your road to completion is way more important. Now tell me, in which set structure of learning do you have to deal with these variables? That my friend is why we do not care. PS: I never said I don't have any formal qualifications from an accredited University. I said employers do not care what your qualifications are if you can do the job. I have qualifications from formal Universities, but again, that was done through distance learning too. Certificates are overrated. Sitting whole day for years on end only studying is a form of procrastination.", "likes": 1}, {"author": "Silent_Simulator", "text": "@Martin McLean yeah..I don't think I'm better than anyone else just because I'm self employed or some other unimportant fact. Don't like it? Gtfo..be an a** and think you are better than other people....", "likes": 1}, {"author": "Martin McLean", "text": "@Silent_Simulator well you show us which one you are, now didn't you.", "likes": 3}]}, {"topLevelComment": {"author": "RS", "text": "Not gonna lie I’ve learned more by myself than all the time I was in college but also I went for graphic design in college (not really my choice) and now I’m working towards freelance as a developer hahah", "likes": 4}}, {"topLevelComment": {"author": "Michael Reginald", "text": "Thanks you for the information that you provide. They have been a lifeline for me as I upgrade my skills for re-entry into IT work.", "likes": 3}}, {"topLevelComment": {"author": "Peter Sedesse", "text": "meh, not really a fan of this one.  Auditing a class at a university is worse than using something like FCC or SoloLearn where at least you have a community of people to brainstorm with.  Also University professors are very likely far behind with tech.  So yeah, maybe if you want C++ or java classes it might be fine.  Also, if you audit classes, you can't really tell anyone you audited them.  You don't get transcripts, none of your work is graded or even looked at by anyone compared to online tools where you get feedback.", "likes": 0}}, {"topLevelComment": {"author": "CRISTIAN DAVID GONZALEZ RODRIGUEZ", "text": "great course", "likes": 1}}, {"topLevelComment": {"author": "how-to-get-over-the-rainbow", "text": "I'm on SSI-ssdi and I love watching the def con conferences hak5 and have been for year got married a few years ago and stopped playing with api's and game dev and rom hacks and I loved giving all that up to spend all my time with her kids and her taking care of the house but now that we are not together I need to start getting back into this but going to college is and probably never will be something I can could do but working at my own place is much better \n\nReally thanks", "likes": 2}}, {"topLevelComment": {"author": "Rishi Raj", "text": "Sir please give new leacture of c and c++", "likes": 0}}, {"topLevelComment": {"author": "Bill V", "text": "It is impossible to describe how valuable this channel is. My hardest classes become completely manageable, and my interest in learning grows exponentially", "likes": 158}, "replies": [{"author": "English through cartoons", "text": ".\n\n👍", "likes": 0}]}, {"topLevelComment": {"author": "OneBlurryLens", "text": "This is great!\nThis information should be distributed out to every public school out there. And private schools as well. In fact, this should be distributed out to all schools everywhere out there.\nWith the cost of education these days, using this to learn and continuing to learn should be a no brainer.\n\nIf this is not a national type program or recommendation, then it should be. Education should be free for everyone. And fully accessible.", "likes": 33}, "replies": [{"author": "Vs Sm", "text": "@waterandafter Good luck with that.", "likes": 2}, {"author": "waterandafter", "text": "@Vs Sm \nDemocratic Socialist countries have free education.", "likes": 1}, {"author": "Vs Sm", "text": "Who's gonna pay for your 'free' education? Communist countries used to have it free for everyone who can pass exams which was a perfect world for any kind of corruption, so it was not free either.", "likes": 2}]}, {"topLevelComment": {"author": "kiruba kirubakar", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "PaulNeu", "text": "Great Job. Really appreciate the content.", "likes": 1}}, {"topLevelComment": {"author": "Live & Let Live", "text": "Thanks a lot guys to introduce an old man(me)a nice  & easy way of learning! Highly appreciated🙏🍀", "likes": 1}}, {"topLevelComment": {"author": "Wapohead", "text": "Thanks for the time and effort you fellas put in to this vid. I don't know if this helped me decide or made me more frustrated. \nI have been in entertainment for 30yrs and have a love/hate relationship with the industry in general - I even own my own company in an Asian country.\nWhen I was 28, I thought I knew it all. I turned 30 and realized I didn't know squat. With each passing decade, it's compounding. I am turning 50 soon and want to learn absolutely everything! Since I am technically savvy, due to the nature of my profession, I build my own pc rigs and love troubleshooting. So sticking with pc related learning just seems logical. I am thinking Python coding first, but then I read or see something on AI or robotics and want to study those also - the list is endless.\n\nI love all sciences. And just like pc learning, I want to learn geology to quantum physics. I have sooooo many started audits and none completed.\n\nIf I were to focus (extremely hard to do) on just pc related learning and say a programming language, where would you suggest I start? Anyone please chime in ;) Thanks in advance!!\nBTW, I also have three kids and very irregular work hours.", "likes": 2}, "replies": [{"author": "Wapohead", "text": "I got a dislike for being thankful and honest about my journey. Silly :D", "likes": 0}]}, {"topLevelComment": {"author": "123 567", "text": "You guys are no less than angels from heaven for me", "likes": 2}}, {"topLevelComment": {"author": "Sa Play", "text": "Great sir", "likes": 2}}, {"topLevelComment": {"author": "Allanm", "text": "I have audited many courses myself.", "likes": 1}}, {"topLevelComment": {"author": "Baker Mrad", "text": "This is so valuable", "likes": 2}}, {"topLevelComment": {"author": "ath", "text": "These are all amazing materials and important to be addressed, but the presentation missed out on key limitations of auditing courses. Also, auditing typically being already enrolled as a student in an institution while taking a course that you’re not so sure you would like it. Auditing a course is generally still associated with tuition cost, unless the professor allows you to “sit in” the class. The definition of “auditing” mentioned in this video really means “take a free and open course offered by a university” rather than non-university, which is wonderful, but very different from the typical meaning of “auditing “ in higher education. One will be quite disappointed to find out that auditing is not as simple as the video suggested.", "likes": 0}, "replies": [{"author": "Counterfluxed", "text": "@ASS No, he’s right that you won’t get any certification", "likes": 0}, {"author": "ASS", "text": "@Counterfluxed  so can we take a certificate for completing such an audited course", "likes": 0}, {"author": "Counterfluxed", "text": "It does say at 8:50 \"In the American university system, “auditing” is traditionally when you take a course offered by an institution for no credit or grade. This primarily encompasses attending lectures without participating in examinations in an effort to learn more about a particular topic. Depending on the institution or platform, you’re able to access assignments or projects to work on independently without receiving feedback. Auditing a class may also require official instructor permission.\" which seems to cover that", "likes": 3}]}, {"topLevelComment": {"author": "Alamgir Hossien", "text": "In 2022 you can learn anything for free.", "likes": 0}}, {"topLevelComment": {"author": "Jack", "text": "great video. thank you lads", "likes": 1}}, {"topLevelComment": {"author": "Rishikesh Borate", "text": "There is only one course about Blockchain . It will very helpful if more courses added on that topic .", "likes": 7}}, {"topLevelComment": {"author": "ichibandude", "text": "I already have CS degree, but feel like going back to school.", "likes": 2}}, {"topLevelComment": {"author": "Arjune Krishna", "text": "guys, you can also try \"university lecture {keyword of the course}\" and search on youtube,  filter by playlist and you can pretty much find most of the university lectures.\n\nexample:\n\nsearch keyword - university lecture introduction to machine learning\nafter searching, go to filters and select 'playlist'\n\ngood luck!", "likes": 5}}, {"topLevelComment": {"author": "droptozro", "text": "Well the first one I looked at in more detail wasn't free... it was $349", "likes": 0}, "replies": [{"author": "droptozro", "text": "@Counterfluxed A full course on Unreal Engine Game development.", "likes": 0}, {"author": "Counterfluxed", "text": "Which one was that?", "likes": 0}]}, {"topLevelComment": {"author": "Aditya Ghimire", "text": "Awesome. Already knew about it, but still Loved it.", "likes": 3}}, {"topLevelComment": {"author": "Quincy Larson", "text": "\"Watching lectures at 2x speed will mean they'll be over faster. But your understanding and retention of the material might be hampered, too.\" Me watching this on double speed: 😅", "likes": 56}, "replies": [{"author": "waterandafter", "text": "I also retain more when I speed read too. I'm less likely to be distracted when I do it.", "likes": 3}, {"author": "Frost", "text": "@Benjamín Peña It certainly sounds weird for people I listen to regularly at 2x after forgetting how they normally sound.", "likes": 2}, {"author": "Benjamín Peña", "text": "@Frost Have you tried after a couple of minutes to take the speed down to normal? Sounds so weird lol", "likes": 3}, {"author": "Benjamín Peña", "text": "I have ADHD, I can only achieve retention when watching 2x, sounds fun, but the real world doesn't have a speed setting button lol.", "likes": 2}, {"author": "Frost", "text": "@Jason Spence I never knew about those, I just downloaded one myself and it works great.", "likes": 1}]}, {"topLevelComment": {"author": "Devasish kumar Badaik", "text": "🐾🐾🐾🐾🐾 way to right path.", "likes": 0}}, {"topLevelComment": {"author": "Rahul Chomal", "text": "❤️", "likes": 1}}, {"topLevelComment": {"author": "deadinside", "text": "This channel is gold. How can free education not be a good thing. Thankyou for educating me and the society. Hope people learn to give back to society and be grateful. Thank-you", "likes": 154}, "replies": [{"author": "how-to-get-over-the-rainbow", "text": "You are not lieing", "likes": 0}, {"author": "deadinside", "text": "@Sir Jere Archive well not everyone is educated equally. Hence they append lesser value to good education. \nNevertheless good deeds must be done without expecting any rewards. ❤️", "likes": 4}]}, {"topLevelComment": {"author": "manan jain", "text": "See IIT Madras BSc programme, it's free for people in India, and it even cost less for foreign students.", "likes": 3}}, {"topLevelComment": {"author": "Shah Zahid", "text": "FreeCodeCamp is helpful", "likes": 2}}, {"topLevelComment": {"author": "Ernest Chan", "text": "I am interested in taking a computer science course online and is there any good recommendations? Thanks", "likes": 2}, "replies": [{"author": "Aleksandar Stefanovic", "text": "cs50 harvard course is one of the best", "likes": 0}]}, {"topLevelComment": {"author": "Vigneshwar", "text": "Atlast i have seen a High elf", "likes": 3}}, {"topLevelComment": {"author": "Kit Walker", "text": "Your website is glitching. It appears and vanishes when the page is completely loaded.", "likes": 2}}, {"topLevelComment": {"author": "Vishal Oza", "text": "Thank you for all the invaluable information!", "likes": 3}}, {"topLevelComment": {"author": "Abhinav Singh", "text": "Thankyou free code academy I was searching for this only", "likes": 3}}, {"topLevelComment": {"author": "Ṣeye", "text": "Cheers lads!", "likes": 2}}, {"topLevelComment": {"author": "Stephen Henry", "text": "#freecodecamp... awesome platform for my CS studies", "likes": 4}}, {"topLevelComment": {"author": "Manash Behera", "text": "world education is changing!!! Happy learning!! and one extra like for freecodecamp!!", "likes": 8}}, {"topLevelComment": {"author": "Rishi Raj", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "béla", "text": "taking uni courses for free is called living in europe", "likes": 220}, "replies": [{"author": "Arjun", "text": "😂😂", "likes": 0}, {"author": "béla", "text": "@Jay in Japan Most american tax revenue gets pumped into the military while billionaires barely pay any taxes.", "likes": 0}, {"author": "Jay in Japan", "text": "\"Free\", but the average person also pays more in taxes to fund the universities. Most tax revenue in the US comes from the wealthiest third of Americans; the average American pays relatively little in taxes.", "likes": 0}, {"author": "Tutorial Heller", "text": "@Matteo Didonè i'm from Latam, Peru and these costs 200$ per month without 'audit' option", "likes": 0}, {"author": "Im NEZX", "text": "@J M nope", "likes": 0}]}, {"topLevelComment": {"author": "Benjamín Peña", "text": "You guys are a treasure to humanity!!", "likes": 27}}, {"topLevelComment": {"author": "Amrany", "text": "MashaAllah. This will help our world's people to achieve useful knowledge freely.", "likes": 14}}, {"topLevelComment": {"author": "Mister The M", "text": "Why would I want to learn from universities for free when I already have freecodecamp? 🤨", "likes": 7}}, {"topLevelComment": {"author": "All About Code", "text": "So basically a course on how to get a course", "likes": 21}}, {"topLevelComment": {"author": "Dragos Florin Milea", "text": "I'm speechless 😍😍😍 THANK YOU SO MUCH!", "likes": 6}}, {"topLevelComment": {"author": "Aditya Chimte", "text": "Thanku😘", "likes": 4}}, {"topLevelComment": {"author": "CTILET", "text": "Sometimes when you say \"free cousers\" in a real it is fist introduction FREE  LESSON, afterwards there is a choise to buy a course.", "likes": 11}, "replies": [{"author": "RR.STUDIOS ツ", "text": "That's true for most \"free courses\" online but NOT for the majority of courses on sites like edX, coursera, khanacademy...", "likes": 5}]}, {"topLevelComment": {"author": "Richard", "text": "I've been taking EdX and Open Courseware courses for a few years. Love it!", "likes": 47}, "replies": [{"author": "Richard", "text": "@smnr There are a lot of free courses on there. There are paid options as well.", "likes": 0}, {"author": "Kevin Portillo", "text": "I tried to do Courseware (a few years ago) but it was unclear to follow the content of some the courses, I’ll give it a shot again.", "likes": 2}, {"author": "STILL UNKNOWN ", "text": "@smnr its free If you got coupons and can find edx courses on other website", "likes": 2}, {"author": "smnr", "text": "edx isn't free?", "likes": 1}]}, {"topLevelComment": {"author": "Rehan Mansoor", "text": "You all videos are informative and best for education", "likes": 18}}, {"topLevelComment": {"author": "undisputed hacker", "text": "From Somalia 💯💯❤❤❤❤", "likes": 3}}, {"topLevelComment": {"author": "Alexandra 96", "text": "Greetings all programmers from Poland 🇵🇱", "likes": 15}}, {"topLevelComment": {"author": "undisputed hacker", "text": "We love you Freecodecamp", "likes": 6}}, {"topLevelComment": {"author": "vivek upadhyay", "text": "Learnig on the internet is so much better than college learning.", "likes": 24}, "replies": [{"author": "V - Sig", "text": "Sometimes college, or a private school, can be a good kickstart / relaunch, the main advantage being : you have people aproximately like you in the same situation; you have real humans as professors, sometimes in the real industry.", "likes": 0}, {"author": "Abdullah", "text": "@vivek upadhyay tbh getting a college degree is needed in the current world to get a job, so I dont blame you. However, having free education online available for everyone is a win!", "likes": 4}, {"author": "LLouG", "text": "@vivek upadhyay tbf having a college degree may give you some kind of advantage when you attempt to get hired by a company, personally I don't have the patience to stay inside a classroom, but with online classes getting more and more common I feel like eventually I won't be able to avoid it anymore(not a bad thing though).", "likes": 2}, {"author": "vivek upadhyay", "text": "@LLouG But this may sound hypocritical, but I am also in college for Bachelor in Computer Science.\nBut I agree that online learning is much better it's just that I'm in college just for the degree. 😅", "likes": 3}, {"author": "LLouG", "text": "Right? It gives us so much freedom to learn at our own pace.", "likes": 6}]}, {"topLevelComment": {"author": "With Talha", "text": "This is a legacy channel", "likes": 6}}, {"topLevelComment": {"author": "CodeWithAtharv", "text": "First", "likes": 0}}, {"topLevelComment": {"author": "Jakob arena 10", "text": "Second comment", "likes": 1}}, {"topLevelComment": {"author": "The Joker Memer", "text": "🔥", "likes": 1}}, {"topLevelComment": {"author": "عائشة محمد", "text": "Hello", "likes": 0}}, {"topLevelComment": {"author": "skilledWithNasim", "text": "Hi", "likes": 0}}, {"topLevelComment": {"author": "TheCoder1001Gaming", "text": "First", "likes": 0}}, {"topLevelComment": {"author": "Kartik Dhumal", "text": "👍🏻👍🏻", "likes": 4}}, {"topLevelComment": {"author": "Account Hacked", "text": "Hi", "likes": 0}}, {"topLevelComment": {"author": "Nigga Destroyer", "text": "Interesting. 🤔", "likes": 1}}, {"topLevelComment": {"author": "Z Masti Vlogs", "text": "Mere Chanel  ok  promote  kro  na  bro", "likes": 1}, "replies": [{"author": "STILL UNKNOWN ", "text": "Aisa kya ha tere mein", "likes": 0}, {"author": "Programmer Bd", "text": "Kiu?😌", "likes": 0}]}, {"topLevelComment": {"author": "sabari sabari", "text": "First like..", "likes": 1}}, {"topLevelComment": {"author": "Z Masti Vlogs", "text": "Nice video", "likes": 9}}]}