{"video": {"id": "QHOY7PyKDh0", "title": "Computer Basics 18: How Source Code works", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n   In this video we discuss what source code is, interpreters and compilers, and what open source means.\n  Let's talk about source code: what source code is, where you'll see it, and how the computer makes sense of it.\n  Source code itself is the actual text document that the programmer creates: they type it up, it's letters, numbers, and symbols.\n  If you give that to somebody and have them look at that document on their computer, that's not going to help them view their email, it's not going to be a browser, it's just a text document.\n  The computer has to have a way of interpreting that and making something really powerful run from it.\n  There are two main ways this is done: either by an interpreter or a compiler.\n  Every browser has an interpreter, and that's how javascript is processed.\n  Other languages, like C++, are used with a compiler.\n  Unlike an interpreter, the compiler does all of its work on the programmer's end.\n  They send out their package, their product, and it's already been compiled, it can already run on a machine.\n  Javascript, however, and other interpreter languages, you just write the javascript and the browser on the user's end has the capability to interpret it so you don't need a compiler.\n  Everyone has an opinion to which is better (interpreter or compiler), but really each has their pros and cons, and it goes on a case by case basis.\n  They're better at different things.\n  Now, let's focus on what open source means.\n  Free Code Camp is open source, meaning that all of the documentation and source code is open and accessable.\n  You may be thinking, \\so what?\\ but what's awesome is that if you want to change or improve Free Code Camp, you can write that improvement and maybe get it implemented.\n  It's a great way for websites and software to grow in a strong and fast way because of the community working together to improve it.\n  One unwritten rule of contributing to open source projects is that you should generally submit your improvements to also be open source, and by giving that improvement back to the public, you let others use your improvement as well.", "duration": "PT2M30S", "likes": 0, "views": "51217"}, "comments": [{"topLevelComment": {"author": "Lbaby Tutorials", "text": "Does this have to do with the movie?", "likes": 0}}, {"topLevelComment": {"author": "Mattias", "text": "If you Internet browser isn't a Web browser, it probably ha no use of JavaScript, for example if it is a glorious Gopher browser. And there are of course several reasons one may disable JavaScript or use a Web browser without JavaScript support.", "likes": 0}}, {"topLevelComment": {"author": "Matt R", "text": "Great sleep aid. If it wasn’t for her low cut top I would have been sleeping in 5 seconds.", "likes": 0}}, {"topLevelComment": {"author": "LaudeNuff", "text": "have my babies", "likes": 1}}, {"topLevelComment": {"author": "Lows Laurie", "text": "Every bit of information was very helpful, thank you so much!", "likes": 2}}, {"topLevelComment": {"author": "Aman Shrivastava", "text": "0:09", "likes": 1}}, {"topLevelComment": {"author": "Maninder Singh", "text": "I thought you gonna explain the movie", "likes": 1}, "replies": [{"author": "am rockstars", "text": ":-v", "likes": 0}]}, {"topLevelComment": {"author": "Watema 3", "text": "TF2 & CS:GO Leak Gang", "likes": 0}}, {"topLevelComment": {"author": "Joseph Stalin Chiden Communist Sniff Lord", "text": "Did your car give birth?", "likes": 2}}, {"topLevelComment": {"author": "Glen Freeman", "text": "Um. .  😍😍😍😍", "likes": 3}}, {"topLevelComment": {"author": "Matsuo", "text": "0:43", "likes": 4}}, {"topLevelComment": {"author": "SevenDeMagnus", "text": "Thank you.\nAdvanced Merry Christmas.\n\nGod bless, Proverbs 31", "likes": 4}}, {"topLevelComment": {"author": "Myles Gmail", "text": "TY!!!!", "likes": 2}}, {"topLevelComment": {"author": "arrow251", "text": "Fail !", "likes": 2}}, {"topLevelComment": {"author": "Loliboly", "text": "i need to read some  source codes from my xbox with my pc\nplease help", "likes": 3}, "replies": [{"author": "Astra Invictum", "text": "You can't", "likes": 1}]}, {"topLevelComment": {"author": "Bluesky", "text": "How the govt steals patents\nIn numerous articles from Americans for Innovation, the Anonymous Patriots have found unequivocal evidence that IBM’s Eclipse Foundation stole the original ideas and source code for Google and Facebook from Columbus, Ohio innovator Leader Technologies, Inc. through their patent attorney James P. Chandler III. Chandler was mentor of Barack Obama, Eric Holder, Robert Mueller, James Comey and John Podesta, to name but a few.\n\njames-p-chandlerChandler represented Leader Technologies, Inc. from the moment Leader realized their innovations were patentable in early 2000. But rather than file the patents immediately, Chandler suspiciously advised Leader to “reduce to practice” the invention before he would file them.\n\nHindsight shows that Chandler gave that advice in order to steal the actual source code when it was ready. Chandler bamboozled Leader into taking custody of a copy of the source code in 2002 which he immediately gave to the IBM Eclipse Foundation which then disseminated it to Zuckerberg/Facebook and other companies.", "likes": 1}}, {"topLevelComment": {"author": "Preety Dubey", "text": "I want to create a image of that type in which image of library present many books if touch one book on them then open all the information about that book and also purchase from there... So... Please suggest me how I make this.. please give fast reply.", "likes": 1}}, {"topLevelComment": {"author": "Domino 64", "text": "Wow I heard it too", "likes": 1}}, {"topLevelComment": {"author": "CRS LOGIC", "text": "how do you use them or run them!!!! >:(", "likes": 2}}, {"topLevelComment": {"author": "Ender slayer21", "text": "So source code is translated program?", "likes": 2}, "replies": [{"author": "KayOS Code", "text": "Nope. Source code is not translated yet, it is still readable by humans", "likes": 2}, {"author": "mr.MYSTERIOUS,YT", "text": "Ender slayer21 \nYes but hopefully you've got it a long time ago", "likes": 0}]}, {"topLevelComment": {"author": "blackbeardbastard", "text": "Feed your cat next time Briana!", "likes": 16}}, {"topLevelComment": {"author": "Kaishram Lalaram", "text": "Very nice video. Thank you.", "likes": 5}}]}