{"video": {"id": "qhuFviJn-es", "title": "ESLint Quickstart - find errors automatically", "description": "ESLint is the standard solution for linting your JavaScript projects. It's never been easier to add ESLint to your project.\n\nIn this short guide you'll learn how to get up and running with ESLint in under 5 minutes.\n\nVideo by Harry Wolff.\n\nHarry has a YouTube channel about JavaScript: https://www.youtube.com/channel/UCgdeMp2ZBnovi12THmLc47g\n\n--- \n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT8M52S", "likes": "2233", "views": "120118"}, "comments": [{"topLevelComment": {"author": "kiran kumar sukumar", "text": "very useful", "likes": 0}}, {"topLevelComment": {"author": "Alok Ranjan", "text": "Very nice", "likes": 0}}, {"topLevelComment": {"author": "liketocode", "text": "Nice. Just a point on presentation, would be helpful if your editor was full screen in order to better see the code. Probably for the visually impaired. Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Sadullo Buriev", "text": "Short, clear, super!!!😀", "likes": 0}}, {"topLevelComment": {"author": "Akshat Ramanathan", "text": "Jesus thank you 🙏", "likes": 0}}, {"topLevelComment": {"author": "tarunjyot kaur", "text": "Hey, I am getting TypeError: Failed to load plugin 'jest' declared in '.eslintrc': Class extends value undefined is not a constructor or null. Please help.", "likes": 0}}, {"topLevelComment": {"author": "Efe Buyuran", "text": "super clean info, thanks!", "likes": 0}}, {"topLevelComment": {"author": "Elton Bautista", "text": "How did he make that for loop right away at 2:00?", "likes": 0}}, {"topLevelComment": {"author": "Yehia Shouman", "text": "thanks for the video but i guess its better to have vscode in fullscreen and minimize your camera stream", "likes": 0}}, {"topLevelComment": {"author": "N. Amin R.", "text": "I'm new in js, node.js and vscode. For intellisense Currently starting with free tabnine. Which intellisense are you using in this tutorial?", "likes": 0}}, {"topLevelComment": {"author": "CodeWithP dev", "text": "Thanks for the good quick introduction of eslint 🥂", "likes": 0}}, {"topLevelComment": {"author": "Yash", "text": "hi, how do people have the branch name they are on shown in the terminal like you do \"git:(master)\" is it a mac only thing or some external package?", "likes": 0}}, {"topLevelComment": {"author": "Aryan", "text": "why there isn't an extension for this already?", "likes": 1}}, {"topLevelComment": {"author": "Ikram Zidane", "text": "Hi Harry, what is the theme that you are using for your vscode?", "likes": 0}}, {"topLevelComment": {"author": "How To Java", "text": "voice of a real developer 7:51", "likes": 0}}, {"topLevelComment": {"author": "Chandra Shekhar Neupane", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "PONYATNOE IT", "text": "Thanks man 👍", "likes": 0}}, {"topLevelComment": {"author": "Burak", "text": "Thank you for ending with a semicolon.", "likes": 1}, "replies": [{"author": "Tepung Goreng", "text": "haha", "likes": 1}]}, {"topLevelComment": {"author": "Wilmar Muñoz", "text": "great tutorial, quick and  just to the point", "likes": 2}}, {"topLevelComment": {"author": "Erenay", "text": "vscode eslint extension is already installed here, right?", "likes": 2}}, {"topLevelComment": {"author": "djgrin17", "text": "Great explanation! Thank you for help with eslint basics!", "likes": 1}}, {"topLevelComment": {"author": "Ray Ahmed", "text": "You da man", "likes": 0}}, {"topLevelComment": {"author": "Straight Coding", "text": "1:02 If you want to answers all the questions with yes at once, use \"npm init -y\"", "likes": 5}}, {"topLevelComment": {"author": "Filip Moniuszko", "text": "I am wondering why all tutorials I watch don't work on my pc. I get always errors and I cannot proceed...", "likes": 0}}, {"topLevelComment": {"author": "Tejkumar Kempaiah", "text": "Please find the ts code which is resulting in 24 problems and unable to solve it. \r\n\r\n-------------------------------------------------\r\n  async onmousemove(textToDisplay: string, elementToMouseHover: ElementFinder) {\r\n        it('mouse hover on ' + textToDisplay, async () => {\r\n            await browser.wait(ExpectedConditions.elementToBeClickable(elementToMouseHover));\r\n            await browser.driver.actions().mouseMove(elementToMouseHover).perform();\r\n            return;\r\n        });\r\n    }\r\n-------------------------------------------------\r\n',' expected.\r\nCannot find name 'async'.\r\nExpected 1-3 arguments, but got 6.\r\nCannot find name 'textToDisplay'.\r\n'string' only refers to a type, but is being used as a value here.\r\nCannot find name 'elementToMouseHover'.\r\nParameter '(Missing)' implicitly has an 'any' type.\r\n-------------------------------------------------\r\n-------------------------------------------------\r\n\r\n\r\nPlease share your comments to resolve the errors.", "likes": 0}}, {"topLevelComment": {"author": "Divine", "text": "vscode doesnot highlight any lint related warnings for me. why is that?", "likes": 0}}, {"topLevelComment": {"author": "Robin Hunter", "text": "love the bangin' intro music", "likes": 1}, "replies": [{"author": "Milan", "text": "Gotta love the Amen ;)", "likes": 0}]}, {"topLevelComment": {"author": "Yogxoth", "text": "Do I need eslint if I'm already using tsserver (CoC)?", "likes": 0}}, {"topLevelComment": {"author": "SAU", "text": "I wish I could become a good coder but I have trash memory and all then commands are so hard to remember. But so far I have been working on editing some json files to add spells to CDDA.", "likes": 1}}, {"topLevelComment": {"author": "Francisco Ochoa", "text": "What women say about me 1:04: \n\nyes\nyes\ngood\ngreat\nperfect\nlove it!\nyes!\nSwEet!", "likes": 0}}, {"topLevelComment": {"author": "UR982T", "text": "How do you get your terminal to look that way?", "likes": 0}}, {"topLevelComment": {"author": "Ziggy S.", "text": "How can I use gst for git status?\nWhat I have to do? its not working in my pc", "likes": 0}}, {"topLevelComment": {"author": "Yuta Mori", "text": "What's the command for eslint to automatically fix the errors in your js file? So instead of having to manually fix the errors, run that eslint command that fixes those errors for you. That should be possible right?", "likes": 1}, "replies": [{"author": "rizwan shaik", "text": "In this case, it is npm run lint --fix", "likes": 1}]}, {"topLevelComment": {"author": "opay1234", "text": "Nice explanation! Thank you", "likes": 0}}, {"topLevelComment": {"author": "May Yuhan", "text": "i dont know what that last part was meant for, starting at around 8:00.", "likes": 0}}, {"topLevelComment": {"author": "Pedro Castro", "text": "very clear demonstration, thanks", "likes": 0}}, {"topLevelComment": {"author": "Lutif", "text": "that colors in the terminal. how can i get it?", "likes": 0}, "replies": [{"author": "Umar Rauf", "text": "Those color are from GitBash. You will need to connect Git Bash with vs Code terminal.", "likes": 0}]}, {"topLevelComment": {"author": "Fallout__Boy", "text": "1:14 npm init -y instead", "likes": 1}}, {"topLevelComment": {"author": "Sameed Ali", "text": "Why did we add lint to scripts in package.json? How does it help?", "likes": 0}, "replies": [{"author": "Zayelion", "text": "It makes sure eslint is installed when it gets pulled down onto a new computer or build server, otherwise it would need to be installed separately. That could lead to problems.", "likes": 0}]}, {"topLevelComment": {"author": "Shaikh Faiz", "text": "2:20 that's how computer respond to my code😣.", "likes": 0}}, {"topLevelComment": {"author": "sabir khan", "text": "Amazing,very useful, thank you.Kindly make video for redux js.", "likes": 0}}, {"topLevelComment": {"author": "🦊 U+1F98A", "text": "The URL ends with 'es' nice'", "likes": 11}}, {"topLevelComment": {"author": "Travels Code", "text": "Also, ESLint can automatically fix a huge number of errors for '--fix' command. Example: npm run lint --fix. In this case, you do not need to change code by yourself.", "likes": 11}}, {"topLevelComment": {"author": "Spencer Davis", "text": "Great tutorial thanks", "likes": 0}}, {"topLevelComment": {"author": "John Doe", "text": "it's not working on sublime text, i's not highlighting anything", "likes": 0}, "replies": [{"author": "flexairz", "text": "Use VSCode", "likes": 0}]}, {"topLevelComment": {"author": "Phil Kondrat", "text": "cool breakbeat intro", "likes": 0}}, {"topLevelComment": {"author": "darkbrian", "text": "please can anybody suggest me how to install, initialize and use ESLint only, I am new to coding and this video just frustrates with things that I don't know but I must learn", "likes": 1}, "replies": [{"author": "Francisco Renteria", "text": "You must to put on terminal  npm install eslint -g or npm install eslint --save-dev. :) \nSorry for my english.", "likes": 0}]}, {"topLevelComment": {"author": "TwstedTV", "text": "Love the video, thanks :\nWhat frustrates me more as each day passes on is that every single time, I start a project, even if its just doodling (if you know what I mean)\nI have to go through this same motion every single time.\nBuy the time I init everything for git, npm, eslint  etc etc etc and everything in between that falls after.\nI dont want to code anymore, because I get so frustrated with having to do these same steps over and over just to code and play around with ideas that hour or day....\nIm really starting to contemplate on setting a bunch of stuff as global.", "likes": 7}}, {"topLevelComment": {"author": "Alessandro Almeida", "text": "Thank's a lot!!", "likes": 0}}, {"topLevelComment": {"author": "Manuel Gutiérrez Hermosilla", "text": "manso aporte hermano mio!", "likes": 0}}, {"topLevelComment": {"author": "paul tester", "text": "Would prefer to see the windows full screen, rather than waste half the view with you waving your hands about in that annoying, distracting manner... You could learn a lot from Traversy Media in terms of presentation.", "likes": 1}}, {"topLevelComment": {"author": "Philip Ibbotson T. Delling", "text": "Thanks for that, helped me to a lot! ^^", "likes": 1}}, {"topLevelComment": {"author": "Fernando Torres", "text": "The integrated terminal is looking great. What configuration did you use to have those colors??", "likes": 2}}, {"topLevelComment": {"author": "Cr00l", "text": "Good video, little hint here: you can just write down npm init -y and it will generate for you default package.json without answering questions", "likes": 10}}, {"topLevelComment": {"author": "TheCoder Store", "text": "Very useful video!", "likes": 0}}, {"topLevelComment": {"author": "Radek", "text": "It's ok if you just watch it but if you want to follow along with coding that is waaaay too fast. Constant pausing and rewinding is so distracting and frustrating that it actually makes the whole video pointless. IMHO, if you're supposed to teach someone something you shouldn't act as if it was some kind of race. There's no prize for whoever finishes their lesson first. After 3 min I decided to just watch it and watching without doing is not very helpful in learning.", "likes": 3}}, {"topLevelComment": {"author": "Mate Xxo", "text": "It would be interesting to know about your typing flow! Not only speed but shortcuts, layout, etc.", "likes": 0}}, {"topLevelComment": {"author": "Ankit Khandelwal", "text": "thats fast typing :)", "likes": 13}}, {"topLevelComment": {"author": "yad", "text": "How did the for loop pop up so fast? What is the name of that sorcery ?", "likes": 0}, "replies": [{"author": "Bryan Marley", "text": "It is just shortcut in editor that you can set up your way.", "likes": 2}]}, {"topLevelComment": {"author": "Emmanuel", "text": "I got a nice satisfying *that just clicked in my brain moment*, thanks!", "likes": 9}}, {"topLevelComment": {"author": "Munshi", "text": "One of the best videos about eslint", "likes": 1}}, {"topLevelComment": {"author": "phanCAbe", "text": "Nice, clean, and to the point! Excellent intro tutorial!", "likes": 3}}, {"topLevelComment": {"author": "Iago Rodrigues", "text": "Hi, can you help me with a problem in ESLINT?\nWhen I activate 'formatOnSave' in VSCode and save my modifications, every time the editor removes the space before a parentheses in a function definition (or, precisely, at 'methods' and 'computeds' objects in VueJs) and I need this space to work with my Lint (Standard). \n\nAlthough I activate this feature in the EsLint configuration (User Configuration in VSCode) and on .eslint file, the result is the same. \nHowever if I use and arrow function like below, the doesn't complain:\nmethods: {\n    KissMe: () => { ... }\n}\n\nDo you know how to fix this issue?", "likes": 0}, "replies": [{"author": "Rabindra Joshi", "text": "You've got a conflicting setting... There may be syntax errors on the user setting or there might be workspace setting that are superior to user. You may also be using other extensions such as Prettier and it's linting on save...\nNobody can say!", "likes": 0}]}, {"topLevelComment": {"author": "Regular", "text": "I love it. Tho I'd like to know if is there a way to config it as a built-in functionality on vscode? I wanna use it on all my projects but I don't actually like the idea of having it as a dev dependency.", "likes": 0}, "replies": [{"author": "Regular", "text": "Kai Xu I imagine it might be but not as much, unless you're creating repos for your personal projects. Then I'd rather use it on the package.json just so you can insure that anyone else that wants to debug or check your code would have the same enviropment you got. It also helps with code consistency. As using it on vscode though, keep in mind that (as far as I know) you'll still need a .eslintrc file on a project level, so it isn't that much of a deal anyway.", "likes": 0}, {"author": "Kai Xu", "text": "Similar question here: is there any advantage to use the eslint plugin in vscode rather than a node package, if 1) you always use vscdoe as the ide 2) for personal project only?", "likes": 0}, {"author": "Regular", "text": "Thats where I am atm, I just installed it globally but I still have to point to it in a project level as you said. While I understand that its better to have as a dev dependency in a common project, theres a lot of projects I only do for practice and they are pretty damn small, most of the times I don't even have repos for them. But still, I wanted to have eslinting on these cases as well. I thought it would be possible to have a global .eslintrc file and as I had a more specific .eslintrc on the project tree it would just simply override the global one. But oh well, I think thats just not possible then. Thanks anyway!", "likes": 0}, {"author": "Claude B.", "text": "You can install eslint globally on your machine, but you will still need to specify linting rules at the project level. So while that may work for you, it will fail for someone else who clones your project repo since they don't know eslint is a dependency. So in a collaborative environment, you are better off adding it as a dev dependency.", "likes": 0}]}, {"topLevelComment": {"author": "Jordan Christie", "text": "Ironic that I actually learned more about git commit workflow than ESLint on this tutorial. Thank you regardless!", "likes": 88}, "replies": [{"author": "Sebastian Mosneagu", "text": "@Erenay first commit?", "likes": 0}, {"author": "Erenay", "text": "@Andy Smart many thanks for the reply mate.. I just check and the spec says \"Tell the command to automatically stage files that have been modified and deleted, but new files you have not told Git about are not affected.\" so it seems for new files, git add is a must..\n\nI agree you, this tut was as good for git as eslint..", "likes": 2}, {"author": "Andy Smart", "text": "@Erenay maybe try caps -AM different consoles handle casing a little differently i have found.", "likes": 1}, {"author": "Erenay", "text": "@Andy Smart git commit -am didn't work here, he needed to execute git add . before that, you know why?", "likes": 0}, {"author": "Andy Smart", "text": "git commit -am ... priceless... My favorite part of this video is the amen break intro music! For ESLint I use Atom and a linter package.", "likes": 0}]}, {"topLevelComment": {"author": "Pamela R.", "text": "Very good! thanks", "likes": 1}}]}