{"video": {"id": "QkbXjknPoXc", "title": "Amazon Alexa Development 101 (full tutorial course - June 2018 version)", "description": "If you want to start building skills for Amazon Alexa and you're new to programming - this course was created especially for you! By the end of this course, you'll be able to create custom skills for Amazon Alexa - even if you've never written a line of code in your life.\n\nUpdated June 2018.\n\n⭐ Course Outline (all in this video) ⭐\n\n⌨ 00:00:05 - Lesson 01: Welcome & Course Introduction\n⌨ 00:01:27 - Lesson 02: A Technical Overview of Alexa\n⌨ 00:06:03 - Lesson 03: Skills Setup in the Developer Portal\n⌨ 00:14:16 - Lesson 04: Skill Service Setup in AWS\n⌨ 00:24:24 - Lesson 05: Testing Skill Services\n⌨ 00:31:37 - Lesson 06: Utterances, Intents, and Slots\n⌨ 00:45:12 - Lesson 07: Using Intents and Slots\n⌨ 00:58:41 - Lesson 08: Building Skills on Your Local Computer\n⌨ 01:06:27 - Lesson 09: Working with Skill Project Code\n⌨ 01:16:20 - Lesson 10: Creating a Complete Skill\n⌨ 01:28:22 - Lesson 11: Next Steps\n\n💻 Code, Links, and Resources: https://dabblelab.com/courses/alexa-development-101\n\n🔗 For more Alexa development videos, check out the Dabble Lab channel: https://www.youtube.com/dabblelab\n\n🐦 Creator Steve Tingiris on Twitter: https://twitter.com/tingiris\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT1H30M14S", "likes": "948", "views": "64095"}, "comments": [{"topLevelComment": {"author": "Jyoti Dudeja", "text": "Hi Steve The link for Code, Links, and Resources is not working. Can you please help?", "likes": 0}}, {"topLevelComment": {"author": "Antonio Reynes", "text": "how safe is this", "likes": 0}}, {"topLevelComment": {"author": "Mohit Juneja", "text": "Hi, first I am new on your channel and new subscriber obvious 😊 Really liked your channel. I have a question about Alexa integration with Power Automate and I trust you really help me. \r\n\nSo, I am facing a problem while passing slot value from Alexa to Power Automate stuff. In other words, Power Automate is unable to receive the slot value from Amazon Alexa. May be there is an issue with the schema or something. No idea. Uff!", "likes": 0}}, {"topLevelComment": {"author": "Yoss", "text": "Gracias! IMPRESIONANTE! El curso para mi mejor explicado sobre alexa skills de todos los que he visto...super completo y detallado.", "likes": 0}}, {"topLevelComment": {"author": "", "text": "Do I own the exclusive right from what I built? altc", "likes": 1}}, {"topLevelComment": {"author": "Timothy Summers", "text": "Someone teaches amazon alexa ninpo and tries to steal your existence.  They fucking eavesdropping on you.", "likes": 0}}, {"topLevelComment": {"author": "Sen Lee", "text": "Very helpful for a newbie just learning about Alexa development. Thank you :)", "likes": 0}}, {"topLevelComment": {"author": "Sakshi Singh", "text": "Hi Steve, I seem to run in an error where my intent envokes something not in the backend code, alexa still responds to it with something random off the internet! For example: i have configured \"get me a fact\" to an intent having a certain set of procedure to follow through the backend, so why does alexa sometimes give  the results i expect while other times just something random off the net!!??", "likes": 0}}, {"topLevelComment": {"author": "R NS", "text": "How can you profit from building alexa skills?", "likes": 2}}, {"topLevelComment": {"author": "Anuj Karn", "text": "14:00", "likes": 0}}, {"topLevelComment": {"author": "Anuj Karn", "text": "6:03", "likes": 0}}, {"topLevelComment": {"author": "Anuj Karn", "text": "24:00", "likes": 0}}, {"topLevelComment": {"author": "kitabalani", "text": "Please add a link for Windows VS studio installer, it's so frustrating that after trying whole day that Studio doesn't work.", "likes": 0}}, {"topLevelComment": {"author": "Nasser Abbassi", "text": "unfortunately the course is fully unstructured.", "likes": 0}}, {"topLevelComment": {"author": "Al Pringle", "text": "Good information.  Just a little painful to watch.", "likes": 3}}, {"topLevelComment": {"author": "Khwaja Taha", "text": "Can we test our skill on the Alexa Play Store app?", "likes": 2}}, {"topLevelComment": {"author": "Abhilash Kokkonda", "text": "Very slow", "likes": 0}}, {"topLevelComment": {"author": "MrAgent00i", "text": "I don't get it... I made the HelloIntent intent saved and built the model and updated the skill service code as shown, but when testing in the alexa simulator with \"tell space facts hello\" I only get a space fact. I even made a HelloRques Test to test the skill service...\n\n\"request\": { \n    \"type\": \"IntentRequest\",\n    [...]\n    \"intent\": {\n        \"name\": \"HelloIntent\",\n        \"confirmationStatus\": \"NONE\"\n    }\n  }\n\n...which runs succesfully with the following response:\n\n\n{\r\n  \"version\": \"1.0\",\r\n  \"response\": {\r\n    \"outputSpeech\": {\r\n      \"type\": \"SSML\",\r\n      \"ssml\": \"<speak>Hello</speak>\"\r\n    }\r\n  },\r\n  \"userAgent\": \"ask-node/2.0.0 Node/v8.10.0\",\r\n  \"sessionAttributes\": {}\r\n}\n\n\nAnyone help me please, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Remy Azhary Yosef", "text": "My current issue is that when I leave my home I'd tell Alexa to initiate home shutdown sequence (like switching off the lights and AC) via my Vera Z-wave hub and to arm my Blink cameras separately.\n\nSo I need this to integrate both skills in a single voice command.\n\nThe same goes when I come home. Thus, power up everything and disarm my security cameras.", "likes": 0}}, {"topLevelComment": {"author": "Elizabeth Samantha", "text": "I'm getiing and error Custom type values must not be empty. Error code: MissingTypeValues does anyone got this error and knows how to fix it ?\nthanks in advance", "likes": 0}}, {"topLevelComment": {"author": "john dsa", "text": "hey, we have a requirement to create a task in our task system when a user requests to create a task.Can we have a web service call triggered from Alexa skill to our system to create the task into our system? Can you demonstrate a simple skill which calls a web service. Also can we push notifications to alexa from our system ?", "likes": 0}, "replies": [{"author": "Matt Matt", "text": "The only thing I want is, something really really simple, well its a simple update, to the amazon alexa app, but I don't know who to talk to, to request/get this update.\n\nMy problem is, once you create a routine/routines, you get a list of them.\n\nI currently have over 1000 routines setup, so managing them, can get be a little daunting.\n\nFolder options, would help, so you can put certain type of routines, in one folder, to make it easier to go through them/manage them, but something else that would be even better is, well now, when you click on/into a routine, you can see the toggle switch, to see if the routine is enabled or disabled, but once you click into it, one it could already be disable or enabled, but once you hit the back button, it takes you all the way, back up to the top of your routine list, which is terrible, then you habe to scroll all the way back down, just to get to the routine you were just at.\n\nSo adding toggle switches, beside each routine, allowing you to know if their toggled on and off and allowing you to control them, without having to click into them, makes things allot easier/saves allot of time and frustration.\n\nAlso another thing that would be nice, is the ability to add multiple, preset routines, togeather/grouping routines, and adding a trigger word, like if you say arm day alarm, alexa will arm the alarm, vs having to open the app and scroll and look for a routine, or also the ability to add multiple triggers, so time could be one, voice word could be another, a certain day could be another, or adding multiple days at different times, anyway, doing these things, could make users less frustrated, and also unlock allot of features/create allot of versatility.", "likes": 0}]}, {"topLevelComment": {"author": "FJ R", "text": "Great course! The only problem I encountered is when loading one of your templates. Specifically, basic_starter. When I select it,  it creates the project but gives me a \"Hook Scripts failed\" message. Any ideas? Thanks for the great intro!", "likes": 0}}, {"topLevelComment": {"author": "Mobile Laser Quest Live Laser Gaming", "text": "Hi there. When I paste the Arn in the endpoint I get this error message. The Lambda ARN arn:aws:lambda:us-east-2:281788147582:function:serverlessrepo-alexa-skil-alexaskillskitnodejsfact-Y1HDBNKPEA6J is not valid for any of the supported regions. Error code: SkillManifestError.     Can you help with a solution please..... google gives me nothing", "likes": 0}}, {"topLevelComment": {"author": "James McDonald", "text": "Awesome! Thank you. Just starting on my Alexa Skill-building journey and found this super informative.", "likes": 1}}, {"topLevelComment": {"author": "vipul mapara", "text": "Excellent Introduction to Alexa. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Henry Michael", "text": "Learned more than enough to make a decent starter skill for a company I work for.  Thank you!", "likes": 1}}, {"topLevelComment": {"author": "PhilHarmonicus", "text": "Could I suggest that you thoroughly rehearse your presentation before switching on the camera?  There was a lot of hesitation and other off-putting moments that spoiled the flow.", "likes": 1}}, {"topLevelComment": {"author": "Android, AOSP, Mobile Development, Hacks, Cricket", "text": "Nice in depth tutorial with huge easter discount, try for sure.\nhttps://www.udemy.com/master-alexa-and-lex-skills-ultimate-edition/?couponCode=EASTEROFFER", "likes": 0}}, {"topLevelComment": {"author": "HCBCHEMISTRY", "text": "I know about saltwater fish.\n\nI want to set up a skill about how to set up a saltwater tank. \nIn the invitation do people always have to say, alexa open how to start a saltwater tank? Or can that be two different things.\n\nWhat would be the best invocation name for when people have other questions about fish and corals", "likes": 0}}, {"topLevelComment": {"author": "Michael Powell", "text": "Thanks, I enjoyed the course!", "likes": 0}}, {"topLevelComment": {"author": "Ricardo Montesinos", "text": "Is it possible to use AWS with Alexa and Google Home?", "likes": 1}}, {"topLevelComment": {"author": "Saravanan Ravi", "text": "Thank you for making this course. Very useful! Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Edu Mendoza", "text": "Thank you for sharing your tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Ankan Bhattacharyya", "text": "please reply\nurgent!", "likes": 0}}, {"topLevelComment": {"author": "Ankan Bhattacharyya", "text": "hi! i can get response using manual json that connect to my lambda but simulator won't connect to my lambda.", "likes": 0}}, {"topLevelComment": {"author": "Developer", "text": "Can you please tell how session is managed and how can i get user_id", "likes": 0}}, {"topLevelComment": {"author": "Arthur Henderson", "text": "This course is great for beginners and as a refresher course for those with a little more experience! We have published Skills and consider ourselves to be reasonably knowledgeable about Alex. I was searching to get a specific question answered and decided to watch your Alexa 101 video, and I am so glad I did! It put the big things about Alexa in better perspective, and I learned so many valuable little things which will simplify our development efforts. Thank you!!!", "likes": 0}, "replies": [{"author": "BotTalk - Create Alexa Skills and Google Actions", "text": "Arthur Henderson May be BotTalk can help? Ping us - we‘ll be happy to help you out", "likes": 0}]}, {"topLevelComment": {"author": "Sha T", "text": "ok  I have been on Amazon help for at least 2 weeks now.  Problem when I go to skills on my phone and open up skills.  it freezes up and shortly after that kicks me off.   I App works fine on my phone, but not on skills.  My phone is a Smasung. J7   .  Is there anything I can do?  working long hours with Amazon and they cannot figure it out.   Can you give me some ideas what to do?", "likes": 0}, "replies": [{"author": "Matt Matt", "text": "Try restarting your phone. Try deleting your cache for the app. Check the app store, for a application update. Check to see if your phone has an update/system update.\n\nThats where I would start.\n\nIf you are having other problems with other things as well/if its bad, back up, and try a factory reset on your phone, then get all your updates/re-download your apps.", "likes": 0}, {"author": "Kakashi Hatake (Kanav)", "text": "I have a j5 it works!!", "likes": 0}]}, {"topLevelComment": {"author": "Kyle Cunningham", "text": "AMAZING!", "likes": 1}}, {"topLevelComment": {"author": "Ranny Autrey", "text": "Need to know if there is a way to create a skill have Alexa answer incoming calls that are not being created on the Alexa app. My hold family loves the Alexa Show and all products.  We have Alexa in all rooms of the house.  My wife is quadriplegic  no use arms and hands hole body.  She really enjoys Alexa.  A app. that takes incoming call on her cell phone and transfers them to Alexa System so she can answer.  I Hope I make myself clear,  she missing a lot of calls because  she cant answer them.   Can reach me on You Tube or Face Book. Would like a reply from anyone who might help me with this skill.", "likes": 1}, "replies": [{"author": "Papa Adofo", "text": "https://www.zdnet.com/article/amazon-alexa-calling-how-to-set-it-up-and-use-it/", "likes": 1}]}, {"topLevelComment": {"author": "Hans Schiefelbein", "text": "my testing environment does not have I/O and my code for lambda function only has 77 lines of code, not your 100+", "likes": 1}}, {"topLevelComment": {"author": "Shubham Bhati", "text": "I'm Facing a problem in testing with Echo... Plz help", "likes": 0}}, {"topLevelComment": {"author": "CONSTITUTIONALLY CORRECT", "text": "allexa skills kit nodejs factskill, it's apparently no good anymore, it won't deploy in it's current state of failed.", "likes": 1}, "replies": [{"author": "CarlVay", "text": "Having the same issue. Failing in deployment", "likes": 0}]}, {"topLevelComment": {"author": "Psych n Stats Tutor", "text": "Awesome! though I got lost at 44:57 with intents and slots. So I am going to watch some other vids before returning to this one. At least I have a model ready to have facts added for testing! Thank you~", "likes": 0}}, {"topLevelComment": {"author": "Asaithambi R", "text": "nice video for beginners who wish to learn alexa skill sets. I need help that I want to use confirmation dialog directive and the lambda function should have a control over it. Furthermore, is there any possiblities to invoke Custom Intents programatically via aws lambda function. \nPlease provide the URLs to learn more about advanced dialog directives.\nThanks in advance.", "likes": 0}}, {"topLevelComment": {"author": "Wolfknightx", "text": "Thanks for creating this, it was pretty easy to follow and pick up some useful tricks I had not known about before.", "likes": 1}}, {"topLevelComment": {"author": "Aashish Shrivastava", "text": "do you have any github link for that code??", "likes": 1}, "replies": [{"author": "Amit Kumar", "text": "https://github.com/alexa", "likes": 0}]}, {"topLevelComment": {"author": "Remy Ecker", "text": "Your video is good, unfortunately it is not for beginner. Can't you make a video where you start at the beginning? I wanted to do a simple skill. You ask Alexa a few questions and you get the appropriate answer that you have entered.\nBut it would be important to see a step by step guide.\nI know that you can find something about blueprints. Amazon, but that's not how you learn it.\nIs there a video that will teach you these steps?", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Maybe this Alexa Skill playlist will help: https://www.youtube.com/playlist?list=PLWKjhJtqVAblMiJPkJBny7WbfTYc6z27r", "likes": 1}]}, {"topLevelComment": {"author": "Pallab Bhowmick", "text": "How do i set up Visual Studio Code for Alexa Development??? I ahve already downloaded node.js n git stuffs... n also configured my amazon aws and alexa development accounts.. But i am unable to setup the Visual Studio Code .. PLEASE HELP..", "likes": 0}}, {"topLevelComment": {"author": "DGameMkr", "text": "So for some reason it wont let me test its locking me out of the test area. Could you tell me why this is?", "likes": 0}, "replies": [{"author": "DGameMkr", "text": "I fixed this issue by going from firefox to chrome. now I am recieving an error occured response when alexa  tells space facts to say hello.", "likes": 0}]}, {"topLevelComment": {"author": "Brian Gass", "text": "Thanks, Steve. Great tutorial!", "likes": 1}}, {"topLevelComment": {"author": "Limba Telecom", "text": "BEWARE!!! SIGNING UP TO AWS WILL CHARGE YOU A MONTHLY FEE!! (£0.79 exactly) I guess this can be ok for people who want to start learning developing Alexa skills but you should mention that you will incur in an expense even if its minimal.", "likes": 0}, "replies": [{"author": "HammerheadIT", "text": "AWS in USA is free for me", "likes": 3}]}, {"topLevelComment": {"author": "Vishal Gupta", "text": "Question: Could anyone tell how to invoke an Alexa Skill using HTTP Requests, not the Developer Console -- I mean, testing locally? Preferably in Python, otherwise any other language.\nSuggest links of resources.", "likes": 0}, "replies": [{"author": "Matt Matt", "text": "The only thing I want is, something really really simple, well its a simple update, to the amazon alexa app, but I don't know who to talk to, to request/get this update.\n\nMy problem is, once you create a routine/routines, you get a list of them.\n\nI currently have over 1000 routines setup, so managing them, can get be a little daunting.\n\nFolder options, would help, so you can put certain type of routines, in one folder, to make it easier to go through them/manage them, but something else that would be even better is, well now, when you click on/into a routine, you can see the toggle switch, to see if the routine is enabled or disabled, but once you click into it, one it could already be disable or enabled, but once you hit the back button, it takes you all the way, back up to the top of your routine list, which is terrible, then you habe to scroll all the way back down, just to get to the routine you were just at.\n\nSo adding toggle switches, beside each routine, allowing you to know if their toggled on and off and allowing you to control them, without having to click into them, makes things allot easier/saves allot of time and frustration.\n\nAlso another thing that would be nice, is the ability to add multiple, preset routines, togeather/grouping routines, and adding a trigger word, like if you say arm day alarm, alexa will arm the alarm, vs having to open the app and scroll and look for a routine, or also the ability to add multiple triggers, so time could be one, voice word could be another, a certain day could be another, or adding multiple days at different times, anyway, doing these things, could make users less frustrated, and also unlock allot of features/create allot of versatility.", "likes": 0}, {"author": "vikas jain", "text": "you can run a webservice locally and then expose using ngrok and get the public URL and then use that for HTTP request", "likes": 0}]}, {"topLevelComment": {"author": "Carole Baskin (TM) Diary", "text": "Your courses are excellent.  Can you tell me if you have already covered how to call a random audio file from an S3 bucket?  I am not a coder but managed to set up the skill and the Lambda function by watching your tutorial.", "likes": 0}, "replies": [{"author": "Matt Matt", "text": "@Hans Schiefelbein The only thing I want is, something really really simple, well its a simple update, to the amazon alexa app, but I don't know who to talk to, to request/get this update.\n\nMy problem is, once you create a routine/routines, you get a list of them.\n\nI currently have over 1000 routines setup, so managing them, can get be a little daunting.\n\nFolder options, would help, so you can put certain type of routines, in one folder, to make it easier to go through them/manage them, but something else that would be even better is, well now, when you click on/into a routine, you can see the toggle switch, to see if the routine is enabled or disabled, but once you click into it, one it could already be disable or enabled, but once you hit the back button, it takes you all the way, back up to the top of your routine list, which is terrible, then you habe to scroll all the way back down, just to get to the routine you were just at.\n\nSo adding toggle switches, beside each routine, allowing you to know if their toggled on and off and allowing you to control them, without having to click into them, makes things allot easier/saves allot of time and frustration.\n\nAlso another thing that would be nice, is the ability to add multiple, preset routines, togeather/grouping routines, and adding a trigger word, like if you say arm day alarm, alexa will arm the alarm, vs having to open the app and scroll and look for a routine, or also the ability to add multiple triggers, so time could be one, voice word could be another, a certain day could be another, or adding multiple days at different times, anyway, doing these things, could make users less frustrated, and also unlock allot of features/create allot of versatility.", "likes": 0}, {"author": "Hans Schiefelbein", "text": "This is similar to what I want, except I want mine to play a certain audio file on a certain day.", "likes": 0}]}, {"topLevelComment": {"author": "Xavier CLAIRE", "text": "Hello Steve, really love your video, thanks about this.\nI have some questions about the french language, do you think the template will work with it, thx a lot, see U", "likes": 0}}, {"topLevelComment": {"author": "Posthumanist Potato", "text": "Man I ran into some road blocks with this course, but it was explained very well.  Seriously, you are a good teacher, I just politfully ask that in the future you do not send people to another video to set something up that needs to be done in order to continue the video.  Espeically if it's labeled a beginner's class.  Overall though this is a 4/5!", "likes": 2}, "replies": [{"author": "Matt Matt", "text": "The only thing I want is, something really really simple, well its a simple update, to the amazon alexa app, but I don't know who to talk to, to request/get this update.\n\nMy problem is, once you create a routine/routines, you get a list of them.\n\nI currently have over 1000 routines setup, so managing them, can get be a little daunting.\n\nFolder options, would help, so you can put certain type of routines, in one folder, to make it easier to go through them/manage them, but something else that would be even better is, well now, when you click on/into a routine, you can see the toggle switch, to see if the routine is enabled or disabled, but once you click into it, one it could already be disable or enabled, but once you hit the back button, it takes you all the way, back up to the top of your routine list, which is terrible, then you habe to scroll all the way back down, just to get to the routine you were just at.\n\nSo adding toggle switches, beside each routine, allowing you to know if their toggled on and off and allowing you to control them, without having to click into them, makes things allot easier/saves allot of time and frustration.\n\nAlso another thing that would be nice, is the ability to add multiple, preset routines, togeather/grouping routines, and adding a trigger word, like if you say arm day alarm, alexa will arm the alarm, vs having to open the app and scroll and look for a routine, or also the ability to add multiple triggers, so time could be one, voice word could be another, a certain day could be another, or adding multiple days at different times, anyway, doing these things, could make users less frustrated, and also unlock allot of features/create allot of versatility.", "likes": 0}]}, {"topLevelComment": {"author": "JD Traveler", "text": "Steve - Followed you all the way till the part where you switched to the Visual Studio tools. Do you have a video or how-to or anything on the setup / configuration of that too?", "likes": 0}, "replies": [{"author": "Matt Matt", "text": "The only thing I want is, something really really simple, well its a simple update, to the amazon alexa app, but I don't know who to talk to, to request/get this update.\n\nMy problem is, once you create a routine/routines, you get a list of them.\n\nI currently have over 1000 routines setup, so managing them, can get be a little daunting.\n\nFolder options, would help, so you can put certain type of routines, in one folder, to make it easier to go through them/manage them, but something else that would be even better is, well now, when you click on/into a routine, you can see the toggle switch, to see if the routine is enabled or disabled, but once you click into it, one it could already be disable or enabled, but once you hit the back button, it takes you all the way, back up to the top of your routine list, which is terrible, then you habe to scroll all the way back down, just to get to the routine you were just at.\n\nSo adding toggle switches, beside each routine, allowing you to know if their toggled on and off and allowing you to control them, without having to click into them, makes things allot easier/saves allot of time and frustration.\n\nAlso another thing that would be nice, is the ability to add multiple, preset routines, togeather/grouping routines, and adding a trigger word, like if you say arm day alarm, alexa will arm the alarm, vs having to open the app and scroll and look for a routine, or also the ability to add multiple triggers, so time could be one, voice word could be another, a certain day could be another, or adding multiple days at different times, anyway, doing these things, could make users less frustrated, and also unlock allot of features/create allot of versatility.", "likes": 0}, {"author": "JD Traveler", "text": "Go to this video: How to setup the Alexa Skills Kit Command Line Interface", "likes": 0}]}, {"topLevelComment": {"author": "Fidget Spinner", "text": "Can you transfer the skill to another user (ie. Developer hands it over to a client fully)", "likes": 0}, "replies": [{"author": "Clay M.", "text": "Do you have the option of developing in the client account or namespacing in your account for test (devname-sample-skill-name) and deploy to client as (clientname-sample-skill-name)? This might supply a path for testing and allow you to use your dev echo (Alexa enabled) device. With that said, it may make sense to develop a test / production set in the client account to control cost or access to resources. Hope this helps and have fun coding your skill sets.", "likes": 0}]}, {"topLevelComment": {"author": "Pedro Marcelino", "text": "Great course! It's amazing how we can build an Alexa skill in such a short period of time with this course. Thank you Steve!", "likes": 4}, "replies": [{"author": "Timothy Summers", "text": "What if someone is trying to program your mind if you carry a backpack with tweezerman tweezers acting like they are police by programming their alexa trying to kill you", "likes": 0}]}, {"topLevelComment": {"author": "Elbos", "text": "If i want to have a persistent parameter like my \"user Id\" how can i configure and pass it to the end point?", "likes": 0}}, {"topLevelComment": {"author": "Ethan Howe", "text": "I need help. I am trying to make a calculator skill I have an amazon.number slot and it prints fine by itself but when I try to add or multiply with the number it cannot do it for some reason.", "likes": 1}, "replies": [{"author": "Raj vijay", "text": "Brother Alexa can perform calculations on her own :)", "likes": 2}]}, {"topLevelComment": {"author": "Mathew Kelly", "text": "thanks so much for the updated video.\nwith amazon, the only constant is change!", "likes": 0}}, {"topLevelComment": {"author": "Kevin Hao", "text": "Thanks for making an updated version! Much appreciated. Awesome content.", "likes": 0}}]}