{"video": {"id": "r-uOLxNrNk8", "title": "Data Analysis with Python - Full Course for Beginners (Numpy, Pandas, Matplotlib, Seaborn)", "description": "Learn Data Analysis with Python in this comprehensive tutorial for beginners, with exercises included!\nNOTE: Check description for updated Notebook links.\n\nData Analysis has been around for a long time, but up until a few years ago, it was practiced using closed, expensive and limited tools like Excel or Tableau. Python, SQL and other open libraries have changed Data Analysis forever.\n\nIn this tutorial you'll learn the whole process of Data Analysis: reading data from multiple sources (CSVs, SQL, Excel, etc), processing them using NumPy and Pandas, visualize them using Matplotlib and Seaborn and clean and process it to create reports.\nAdditionally, we've included a thorough Jupyter Notebook tutorial, and a quick Python reference to refresh your programming skills.\n\n💻 Course created by Santiago Basulto from RMOTR\n🔗 Check out all Data Science courses from RMOTR: https://rmotr.com\n\n⚠️ Note: Instead of loading the notebooks on notebooks.ai, you should use Google Colab instead. Here are instructions on loading a notebook directly from GitHub into Google Colab: https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb#scrollTo=K-NVg7RjyeTk\n\n ⭐️ Course Contents ⭐️\n⌨️ Part 1: Introduction\nWhat is Data Analysis, why Python?, what other options are there? what's the cycle of a Data Analysis project? What's the difference between Data Analysis and Data Science?\n🔗 Slides for this section: https://docs.google.com/presentation/d/1fDpjlyMiOMJyuc7_jMekcYLPP2XlSl1eWw9F7yE7byk/edit?usp=sharing\n\n⌨️ Part 2: Real Life Example of a Python/Pandas Data Analysis project (00:11:11)\nA demonstration of a real life data analysis project using Python, Pandas, SQL and Seaborn. Don't worry, we'll dig deeper in the following sections\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/FreeCodeCamp-Pandas-Real-Life-Example\n\n⌨️ Part 3: Jupyter Notebooks Tutorial (00:30:50)\nA step by step tutorial to learn how to use Juptyer Notebooks\n🔗 Twitter Cheat Sheet: https://twitter.com/rmotr_com/status/1122176794696847361\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/ds-content-interactive-jupyterlab-tutorial\n\n⌨️ Part 4: Intro to NumPy (01:04:58)\nLearn why NumPy was such an important library for the data-processing world in Python. Learn about low level details of computations and memory storage, and why tools like Excel will always be limited when processing large volumes of data.\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/freecodecamp-intro-to-numpy\n\n⌨️ Part 5: Intro to Pandas (01:57:08)\nPandas is arguably the most important library for Data Processing in the Python world. Learn how it works and how its main data structure, the Data Frame, compares to other tools like spreadsheets or DFs used for Big Data\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/freecodecamp-intro-to-pandas\n\n⌨️ Part 6: Data Cleaning (02:47:18)\nLearn the different types of issues that we'll face with our data: null values, invalid values, statistical outliers, etc, and how to clean them.\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/data-cleaning-rmotr-freecodecamp\n\n⌨️ Part 7: Reading Data from other sources (03:25:15)\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/RDP-Reading-Data-with-Python-and-Pandas\n\n⌨️ Part 8: Python Recap (03:55:19)\nIf your Python or coding skills are rusty, check out this section for a quick recap of Python main features and control flow structures.\n🔗 Notebooks: https://github.com/ine-rmotr-curriculum/ds-content-python-under-10-minutes\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT4H22M13S", "likes": "49589", "views": "2292137"}, "comments": [{"topLevelComment": {"author": "freeCodeCamp.org", "text": "⚠️ Note: Instead of loading the notebooks on notebooks.ai, you should use Google Colab instead. Here are instructions on loading a notebook directly from GitHub into Google Colab: https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb#scrollTo=K-NVg7RjyeTk\n\nThe code links in the description have been updated to the content stored on GitHub.", "likes": 138}, "replies": [{"author": "ANTON MURSID", "text": "Antonmursid🙏🙏🙏🙏🙏✌🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩✌👌💝", "likes": 0}, {"author": "Ronald Maffei de Lavor", "text": "“Oh, Sagrada Face de Jesus Compadecei-Vos de Nós!”\n\nConsagração à Sagrada Face de Jesus\n\nÓ boníssimo Jesus, que quereis salvar o mundo de hoje, com aquele infinito amor com que fora criado e redimido. Incluí-me também no número dos que realmente trabalham pelo triunfo do vosso Reino de Amor na terra. Recebei, para este fim, a total entrega de todo o meu ser, dispondo de mim. Quero difundir a Imagem de Vossa Divina Face e as misericórdias do Vosso Sacratíssimo Coração para que a Vossa Imagem ilumine e vivifique todas as almas. Jesus, operai milagres de conversão!\n\nChamais os apóstolos para esta nova época, que por sua vez se encarreguem dessa sublime missão. Que as ondas do Vosso misericordioso Amor se espalhem sobre o mundo inteiro, e afundando o maligno e destruindo os males, renovem a terra e façam os homens, ao sentirem os seus corações tomados de caridade, viverem o Novo Testamento à Luz desse Sol que é a Vossa Divina Face e as misericórdias do Vosso Sacratíssimo Coração. Amém.\n\nSenhor, fazei resplandecer Vossa Sagrada Face sobre nós.\n\nAo Cordeiro de Deus que Se assenta no trono e habita nos Sacrários, toda honra, louvor, poder e glória, agora e para sempre, por todos os séculos dos séculos. Amém.\n\n História da Sagrada Face de Jesus\n\nEsta santa devoção teve origem com a impressão milagrosa do Rosto de Cristo no lenço de Verônica, uma tradição muito respeitada na Igreja. O Papa Bento XVI fez questão de venerar o Véu de Verônica na cidade de Manoppello na Itália, em setembro de 2006. Durante sua visita ao santuário, Bento XVI foi o primeiro Papa a poder novamente venerar a relíquia, meio milênio após seu desaparecimento da Basílica de São Pedro.\n\nEsta devoção cresceu muito também por causa da importância que a Divina Face teve na vida de Santa Teresinha do Menino Jesus e da Sagrada Face. Outro fato que fortaleceu a devoção foram os surpreendentes estudos da figura de JESUS no santo Sudário de Turim; além das revelações à Irmã M. Pierina de Micheli (†1945), a mensageira da Sagrada Face dos últimos tempos.\n\nEm maio de 1938, a Virgem Santíssima mostrou (em visão mística) à Irmã Pierina, um escapulário formado de dois paninhos. Num ela viu a Face de JESUS com as palavras ao redor: “Ilumina, Domine, vultum tuum super nos” (“Senhor, fazei resplandecer a Vossa Face sobre nós”). No outro estavam escritas em volta de uma hóstia as palavras: “Mane nobiscum, domine” (Senhor ficai conosco). Lentamente Nossa Senhora se aproximou e disse:\n\n“Escuta bem e transmite ao teu confessor que este escapulário é uma arma de defesa, escudo de fortaleza e penhor de misericórdia que JESUS quer dar ao mundo nestes tempos de sensualidade e de ódio contra DEUS e a Igreja. São poucos os verdadeiros apóstolos. É necessário um remédio divino e este remédio é a FACE de meu Filho.\n\nTodos aqueles que usarem o escapulário, e sendo lhes possível, cada terça feira visitar o Santíssimo Sacramento fazendo “Uma Hora Santa”, para reparar os ultrajes que recebeu e continua recebendo meu Filho, cada dia, no Sacramento Eucarístico, serão fortificados na Fé, estarão prontos para defendê-la e hão de suportar todas as dificuldades internas e externas. Além disso morrerão serenamente sob o olhar de meu Filho”.\n\nSemanas mais tarde JESUS apareceu também e disse:\n\n“Quero que Minha FACE seja honrada com uma festa própria na Terça-feira da Quinquagésima (terça-feira de carnaval) e que esta festa seja preparada por uma novena durante a qual todos os fiéis façam Comigo reparação”.\n\nEm vez de fazer escapulários a Irmã Pierina mandou cunhar medalhas. Preocupada por isso recorreu à Nossa Senhora que novamente lhe apareceu dizendo:\n\n“Minha filha, não se preocupe, pois, o escapulário é substituído pela medalha com todas as promessas e favores. Só resta difundi-la mais ainda. Ora, interessa-me muito a festa da Sagrada FACE de meu Filho. Diga ao Papa que esta festa muito me interessa”.\n\nIrmã M. Pierina falou três vezes ao Papa e o Sumo Pontífice, ciente do pedido do Céu, não se fez esperar. No dia 15 de março de 1957, havendo já aprovado a propagação da medalha, facultou a celebração da festa, isto é, aos Beneditinos Silvestrinos de Roma. Em 10 de janeiro de 1959 o Papa João XXIII concedeu a mesma licença, a todos os Bispos do Brasil.\n\nPara merecer as graças prometidas é necessário:\n\nUsar a medalha, contemplar com amor, muitas vezes a Sagrada FACE, zelar pela devoção, fazendo a Hora Santa, nas Terças-feiras, promover anualmente a novena em preparação à festa na terça-feira de carnaval, e seguindo o exemplo dos grandes devotos da Sagrada FACE, ler e meditar diariamente o Novo Testamento. Todos os dias rezar:\n\n5 Pai Nossos; 5 Ave Marias; 5 Glórias; em honra das cinco chagas de Nosso Senhor JESUS CRISTO, rezando também a oração composta por Pio IX, e a aspiração que a segue:\n\n“Ó meu JESUS, lançai sobre nós um olhar de misericórdia! Volvei Vossa Face para cada um de nós, como fizestes à Verônica, não para que A vejamos com os olhos corporais, pois não o merecemos. Mas volvei-A para os nossos corações, a fim de que, amparados sempre em Vós, possamos haurir nesta fonte inesgotável, as forças necessárias para nos entregarmos ao combate que temos que sustentar. Amém.\n\nSenhor, mostrai-nos a Vossa Face e seremos salvos!”\n\nNota: No livro ORAÇÕES DE TODOS OS TEMPOS DA IGREJA (Ed. Cléofas) há outras orações desta devoção: A Ladainha da Sagrada Face; a Oração de Consagração à Sagrada Face; Novena à Sagrada Face; e outras orações.\n\nProf. Felipe Aquino\n\nOração à Sagrada Face\n\n(Composta por Santa Teresinha)\n\nÓ Jesus, que na Vossa crudelíssima Paixão Vos tornastes “o opróbio dos homens e o homem das dores”, eu adoro a Vossa Divina Face sobre a qual resplandecem a beleza e ternura da Divindade e que agora se tornou para mim como a face de um “leproso” (Is. 53,4).\n\nMas sob estes traços desfigurados reconheço o Vosso infinito amor e ardentemente desejo amar-Vos e fazer-Vos amar por todos os homens.\n\nAs lágrimas que com tanta abundância correram dos Vossos olhos, se me afiguram quais pérolas preciosas, que eu quisera recolher para, com seu valor infinito, resgatar as almas dos pobres pecadores.\n\nÓ Jesus, Vossa Face é a única beleza que encanta o meu coração, de boa mente quero renunciar na terra à doçura do Vosso olhar e ao inefável ósculo de Vossa boca divina, mas suplico-Vos, imprimi em meu coração Vossa Divina Imagem, e inflamai-me com Vosso amor, a fim de que possa um dia contemplar a Vossa Face gloriosa no Céu. Amém.\n\nFonte:\n\nhttps://blog.cancaonova.com/felipeaquino/2015/03/04/devocao-a-sagrada-face-de-cristo/\n\nTerço da Sagrada Face\n\nIniciar fazendo cinco vezes o sinal da Santa Cruz, em honra as Cinco Santas Chagas de nosso Senhor Jesus Cristo. Após rezar o Creio, o Pai-Nosso a Ave-Maria e o Glória.\nNas contas do Pai-Nosso: Pai Eterno, ofereço-Vos a Face adorável de Vosso Divino Filho para abrandar a cólera de Vossa Justiça, obter a santificação do clero, o perdão dos pecadores e o alívio das almas do purgatório.\nNas contas da Ave-Maria: Oh! Sagrada Face de Jesus, compadecei-vos de nós e do mundo inteiro.\n\nNo final, rezar três Ave-Marias em louvor das dores que Nossa Senhora sofreu ao ver Jesus carregar a Cruz, ser pregado, vê-lo morrer e recebê-lo morto em seus amorosos e ternos e santos braços. No fim de cada Ave-Maria acrescentar a jaculatória: Nossa Senhora das Dores, rogai por nós!\n\nNo encerramento, rezar: Face adorável de meu Jesus, meu único amor, minha luz e minha vida, fazei que veja somente a Vós, nada conheça fora de Vós, ame-Vos unicamente, e que, enfim, não viva a não ser convosco, de Vós, por Vós e para Vós. Assim seja. Amém.\n\nRezar 1 Glória.\n\nQuem reza se salva\n\n                               \n\nLeigos em oração pela Santa Igreja Católica Apostólica Romana.\n\n© 2021 – Todos os direitos reservados – Política de Privacidade\n\nFeito com ❤ no Wordpress\n\nConteúdo acessível em libras usando o VLibras Widget com opções dos Avatares Ícaro ou Hozana.Conteúdo acessível em libras usando o VLibras Widget com opções dos Avatares Ícaro ou Hozana.", "likes": 0}, {"author": "tminus543", "text": "GET A BETTER NARRATOR.", "likes": 1}, {"author": "KXZ", "text": "bhnbmn", "likes": 0}, {"author": "Marcus", "text": "I thought it would have been explained more easily for Colab novices. I manually downloaded the csv from github and then loaded then created the 'data' folder in the Colab storage path. Pasted the csv file in there to mimic what was shown in the Video", "likes": 0}]}, {"topLevelComment": {"author": "Deepak Bhagwani", "text": "Trying to download the exercise file but don't know how to do it from GitHub. I am using anaconda for using jupytrer. Would someone be able to guide me?", "likes": 0}}, {"topLevelComment": {"author": "Henry Hsu", "text": "3:29:00", "likes": 0}}, {"topLevelComment": {"author": "Flashcards", "text": "This tutorial takes off  at the beginning with no real explanation for how the read csv function works and thus loses many beginners at the start", "likes": 1}}, {"topLevelComment": {"author": "Joanne Enalpe", "text": "Hello! Someone help me because I can't run read_csv function. What can I do? Thank you.", "likes": 0}, "replies": [{"author": "Flashcards", "text": "The problem is with google collab, if you run it in jupyter notebook it works fine. I wasted like 20 minutes trying to load the data in collab and then tried the same exact code in jupyter notebook and it worked.", "likes": 0}]}, {"topLevelComment": {"author": "Tanapat Smith", "text": "I would not recommend this course for totally beginners as the instructor just ran the code and you see series of the outputs of the code. Not much of the explanation of why the code is written what is written.", "likes": 1}}, {"topLevelComment": {"author": "Yilin Zuo", "text": "5:11 spelling mistake: Julia", "likes": 0}}, {"topLevelComment": {"author": "Ste", "text": "There was no seaborn stuff lol", "likes": 0}}, {"topLevelComment": {"author": "Павел Захаров", "text": "I advise you always keep the explained fragment in the center of the screen. Subtitles cover it at the bottom of the screen", "likes": 0}}, {"topLevelComment": {"author": "Thembelani Chamane", "text": "can i get a job with this course?", "likes": 0}}, {"topLevelComment": {"author": "Ivy Ivy Ivy", "text": "thank you for this lovely content", "likes": 0}}, {"topLevelComment": {"author": "Raynaldi", "text": "how can i donwload the csv?", "likes": 0}}, {"topLevelComment": {"author": "O D", "text": "I love how fast this instructor goes, instead of skipping I need to pause haha", "likes": 0}}, {"topLevelComment": {"author": "Nacho Podestá", "text": "The best tutorial ever! Excellent!", "likes": 0}}, {"topLevelComment": {"author": "miki silveira", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Mayavi K", "text": "Did Rmotr merge with INE?", "likes": 0}}, {"topLevelComment": {"author": "José Antonio: Estadística Aplicada", "text": "Personal timestamp 🕒 #1: 0:18:53", "likes": 0}, "replies": [{"author": "José Antonio: Estadística Aplicada", "text": "Personal timestamp 🕒 #2: 01:04:55", "likes": 0}]}, {"topLevelComment": {"author": "TechTrends.Programming", "text": "Top 10 Reason Why You Should Learn Python\nhttps://youtu.be/BkhILWyBWiM", "likes": 0}}, {"topLevelComment": {"author": "Daniel Hutchinson", "text": "Thank you Santiago.", "likes": 0}}, {"topLevelComment": {"author": "Udeme Umana", "text": "Please does anyone have the sales data or a link to where I can download it?", "likes": 0}}, {"topLevelComment": {"author": "Faizul Zubair", "text": "I'm a newbie, can anyone explain why we cant open the github file on jupyter instead?", "likes": 0}}, {"topLevelComment": {"author": "Alex Silvestri", "text": "thank you, theese videos are gold", "likes": 0}}, {"topLevelComment": {"author": "Brian Murithi", "text": "Commander of the matrix", "likes": 0}}, {"topLevelComment": {"author": "Whaff Fb", "text": "Ahhh bo lu daaaaa hablas español", "likes": 0}}, {"topLevelComment": {"author": "Farjana Faija", "text": "https://youtube.com/shorts/2AcxiKbaGXE?feature=share", "likes": 0}}, {"topLevelComment": {"author": "Spencer Chandlee", "text": "I'm trying to follow along by running the code from the imported notebooks (in colab), but everything's returning errors with the base code, haven't changed anything. Is it because the sites that they're pulling from have changed? Or should I be doing something differently?", "likes": 1}, "replies": [{"author": "Flashcards", "text": "use jupyter notebook instead and it works", "likes": 0}, {"author": "ted fabricio saenz", "text": "same error gonna cry", "likes": 0}, {"author": "Buła95", "text": "same, I get error about no file found (sales_data.csv)", "likes": 0}]}, {"topLevelComment": {"author": "moussa selim", "text": "Full Pandas Tutorial:\nhttps://youtu.be/V50CO0zVlsI", "likes": 0}, "replies": [{"author": "⁺ ①⑥⓪①⑨⑧⓪①⑥①④ WhatsApp ", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️…..", "likes": 0}]}, {"topLevelComment": {"author": "Robertgil Vicente", "text": "As a beginner, do we need to familiarize ourselves with Excel first before diving into Python?", "likes": 0}}, {"topLevelComment": {"author": "Automotive Legends", "text": "Please excuse me for this question but would I be able to follow and understand this video despite having zero knowledge of Python, SPSS and programming at all? Otherwise, I would familiarise myself from scratch first and then start watching and following this video. I need to learn data analysis for my final dissertation. Hope some of you can advise me so I can know if this tutorial would be possible for me to follow :)", "likes": 0}}, {"topLevelComment": {"author": "ANTON MURSID", "text": "Antonmursid🙏🙏🙏🙏🙏✌🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩✌👌💝", "likes": 0}}, {"topLevelComment": {"author": "ANTON MURSID", "text": "Antonmursid🙏🙏🙏🙏🙏✌👌🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩✌👌💝", "likes": 0}}, {"topLevelComment": {"author": "Karina Hulka", "text": "thanks so much!", "likes": 0}}, {"topLevelComment": {"author": "Marshal Thrasher", "text": "In the Jupyter section I keep getting that requests isn't defined and I can't import it. Any recommendations", "likes": 1}}, {"topLevelComment": {"author": "Manoj Kumar", "text": "twitter link is not working\ncan u help me out", "likes": 1}}, {"topLevelComment": {"author": "Adnan Rashid", "text": "I am unable to practice the Exercises ... please help.  I tried opening it in google Colab and Jupyter lite aswell but both show that the file not found.", "likes": 0}}, {"topLevelComment": {"author": "ibrahim sakr", "text": "Does the Data Analysis with Python consider as a branch from Artificial Intelligence ? if yes, how can i use it in the drilling of oil well branch ?", "likes": 0}}, {"topLevelComment": {"author": "Jean-marc Namour", "text": "Hello, how do i access the excel data sheets on google colab?", "likes": 0}}, {"topLevelComment": {"author": "Rabiul Islam", "text": "Wonderful tutorial for beginners. Easy to understand.", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Suleman", "text": "so how to get files that has been used in this video", "likes": 0}}, {"topLevelComment": {"author": "NotALlama", "text": "2:08:09 The difference where the upper limit is included only seems to apply if you've defined your own index.  It seems to work the same if you use the default numeric index.", "likes": 3}}, {"topLevelComment": {"author": "007.Adwaiy Pillai", "text": "Can anybody plz tell me at which part does this become a follow along tutorial?", "likes": 0}}, {"topLevelComment": {"author": "lenni", "text": "02:14:37", "likes": 0}}, {"topLevelComment": {"author": "mahmud", "text": "3:25:15", "likes": 0}}, {"topLevelComment": {"author": "lenni", "text": "1h.05m", "likes": 0}}, {"topLevelComment": {"author": "Eugene Tur", "text": "f", "likes": 0}}, {"topLevelComment": {"author": "Varun", "text": "Hi, I need to know if there are any prerequisite I need to learn before this since I am a rookie in terms of programming and barely know python, TIA", "likes": 0}}, {"topLevelComment": {"author": "Abdul Khan", "text": "Why the instructor is in such a hurry \nlike going on topics so fast", "likes": 0}}, {"topLevelComment": {"author": "Sahil Dass", "text": "From where to get the data sets, i already have jupyter installed", "likes": 0}}, {"topLevelComment": {"author": "Hoang Nguyen Nguyen", "text": "1:57:00", "likes": 0}}, {"topLevelComment": {"author": "michael egbujua", "text": "how do we get the dummy data so we can work along with the tutorial", "likes": 0}}, {"topLevelComment": {"author": "Anisha Joshi", "text": "Great tutorial! I am trying to practice using the data files he has however I am not able to load it for example\" sales=pd.read.csv('data/sales_data.csv', parse_dates-['date']). I am not able to start the hands on part since nothing is loading on Jupyter. Can anyone help? Thanks", "likes": 0}}, {"topLevelComment": {"author": "Leila Ait Hamou", "text": "pleaaase answer my question, at hour  2:32, i did the exaaact same code but it returned a NAN for all the rows of column language.. what is the problem ?", "likes": 0}}, {"topLevelComment": {"author": "Matin Ardestani", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "You can do", "text": "Thank you teacher you taught me a lot, thank you very much", "likes": 1}}, {"topLevelComment": {"author": "Lad Me", "text": "100 times better than my teacher 😭😭😭", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Umer Khan", "text": "Where can I find this 'cryptos.xlsx' file?", "likes": 0}}, {"topLevelComment": {"author": "Leni Engel", "text": "Successful people don't become that way overnight. What most people see at a glance-wealth, a great career, purpose is the result of hard work and hustle over time. I pray that anyone wMost people don't invest due to ignorance.ho reads this will be successful in life..", "likes": 182}, "replies": [{"author": "I traveled to Malawi", "text": "Well said ❤️", "likes": 0}, {"author": "Chloe Crosbie", "text": "@Navya Singh Thank you for the amazing recommendation it will help a lot", "likes": 0}, {"author": "Navya Singh", "text": "@Chloe Crosbie Trade with her and remember to share testimonies with others", "likes": 0}, {"author": "Navya Singh", "text": "Instagram ⬆️", "likes": 0}, {"author": "Navya Singh", "text": "Official Eleonore Russell", "likes": 0}]}, {"topLevelComment": {"author": "Bhagyashri Borude", "text": "Good course but find it quite speedy and a lot of scrolling and making it difficult to understand. Would appreciate it if you reduce the speed to normal and make short videos on each section.", "likes": 1}}, {"topLevelComment": {"author": "dnyaneshwar53", "text": "ALL I CAN SAY..... YOU ARE AWESOME..............................!", "likes": 0}}, {"topLevelComment": {"author": "Gregory Kackosky", "text": "Great thanks!", "likes": 0}}, {"topLevelComment": {"author": "Gregory Kackosky", "text": "1", "likes": 0}}, {"topLevelComment": {"author": "CeCe Wang", "text": "Where to download the .csv and related files in this video?", "likes": 0}, "replies": [{"author": "dnyaneshwar53", "text": "if you look at the \"description box\" under the video, each section has links that lead you to github. From github, you can access the exercises and data used in the videos", "likes": 0}]}, {"topLevelComment": {"author": "Eilidh Wells", "text": "Quite disappointed by the teaching structure. Nothing hands on, just endless narrations, code executions and assumptions. It is far from beginner friendly and seems rushed all the time. Not sure if the comments are legitimate because, I can't be the only one struggling to process and grasp the plenty methods and arguments while the course progresses. Started off well, but completely sunk from Numpys down.", "likes": 9}}, {"topLevelComment": {"author": "Jiks Vids", "text": "This is far better than many high-priced tutorial courses on the most popular MOOC platforms. I will forever keep this for future reference ❤❤", "likes": 7}}, {"topLevelComment": {"author": "Vinayakumar Pokkanayil", "text": "Awesome course... detailed explanation, easy to get the concept quickly. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Vaibhav Shewale", "text": "hope so i can complete it in a week", "likes": 1}}, {"topLevelComment": {"author": "Jimver Dalupan", "text": "wew", "likes": 1}}, {"topLevelComment": {"author": "shankar valmiki DR", "text": "thankyou from commandline", "likes": 0}}, {"topLevelComment": {"author": "shankar valmiki DR", "text": "great video", "likes": 0}}, {"topLevelComment": {"author": "shankar valmiki DR", "text": "Got introduced to REST API! #learnbydoing", "likes": 0}}, {"topLevelComment": {"author": "Frankie Tsoi", "text": "thanks for the great presentation.  where can i find the data to play with?", "likes": 0}}, {"topLevelComment": {"author": "Daniel Tochukwu", "text": "you could have explained better how one will get the jupyter notebook and install some of the files you used in the tutorial.  that would have made things easier for beguneers", "likes": 1}}, {"topLevelComment": {"author": "Serzh Tadevosyan", "text": "It brings up URLError when I read the file using csv or anything else, can anyone help me to solve this?", "likes": 0}}, {"topLevelComment": {"author": "me my", "text": "For some reason the the first excersize is broken. It doesn't find the sales_data.csv file, therefore the code doesn't work.", "likes": 0}}, {"topLevelComment": {"author": "Akbar Bukhariev", "text": "How can I download the Excel sheet?", "likes": 0}}, {"topLevelComment": {"author": "Muthoni Gathage", "text": "I appreciate the tutorial with the quick walk through,but the font isn't suitable for such a long video.", "likes": 0}}, {"topLevelComment": {"author": "Deepanshu Khandelwal", "text": "Data analysis is the process of exploring and analyzing large datasets to make predictions and boost data-driven decision-making. Data analytics allows us to collect, clean, and transform data to derive meaningful insights. It helps to answer questions, test hypotheses, or disprove theories.\r\n\r\n\r\n\r\nData analytics is used in most sectors of businesses. Here are some primary areas where data analytics does its magic:\r\n\r\n\r\n\r\nData analytics is used in the banking and e-commerce industries to detect fraudulent transactions.\r\n\r\n\r\n\r\n\r\n\r\nThe healthcare sector uses data analytics to improve patient health by detecting diseases before they happen. It is commonly used for cancer detection.\r\n\r\n\r\n\r\nData analytics finds its usage in inventory management to keep track of different items.\r\n\r\nLogistics companies use data analytics to ensure faster delivery of products by optimizing vehicle routes.\r\n\r\n\r\n\r\nMarketing professionals use analytics to reach out to the right customers and perform targeted marketing to increase ROI.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nData analytics can be used for city planning, to build smart cities.\r\n\r\nTypes of Data Analytics\r\n\r\nDescriptive Analytics\r\n\r\nPredictive Analytics", "likes": 1}}, {"topLevelComment": {"author": "Bo Knows", "text": "quoting Lei Xun below: \r\n1 year ago (edited)\r\n\r\n1. Table of Content 1:45\r\n2. Introduction 2:52\r\n2.1 What is data analysis 2:52\r\n2.2 Data analysis tools 4:38\r\n2.3 Data analysis process 7:31\r\n2.4 Data Analysis vs Data Science 8:56\r\n2.5 Python and PyData Ecosystem 9:28\r\n2.6 Python data analysis vs Excel 9:46\r\n3. Real example data analysis with Python: getting a sense of what you can learn from this course 11:00\r\n4. How to use Jupyter Notebooks 30:50\r\n5. Intro to NumPy 1:04:58\r\n5.1 Low-level basis: binary numbers, memory footprint 1:09:32\r\n5.2 Python is not memory efficient to store numbers since it wraps everything into objects. Whereas in NumPy, we can select the number of bits to represent numbers 1:22:50\r\n5.3 NumPy can compute arrays faster than Python 1:24:58\r\n5.4 NumPy tutorial: NumPy arrays, matrices 1:29:47\r\n5.5 Memory footprint and performance: Python vs NumPy 1:53:14\r\n6. Intro to Pandas: getting, processing and visualizing data 1:56:58\r\n6.1 Pandas data structure: Series 1:58:41\r\n6.2 We can change the index of Pandas series and this is fundamentally different from NumPy arrays 2:02:55\r\n6.3 The upper limit of slicing in Pandas series is included, whereas, in NumPy, the limit is excluded 2:07:55\r\n6.4 Pandas data structure: DataFrames 2:14:36\r\n6.5 Most operations in Pandas are immutable 2:29:10\r\n6.7 Reading external data 2:36:47\r\n6.8 Pandas plotting 2:44:41\r\n7. Data cleaning 2:47:18\r\n7.1 Handling miss data 2:51:40\r\n7.2 Cleaning invalidate values 3:03:17\r\n7.3 Handling duplicated data 3:06:09\r\n7.4 Handling text data 3:11:05\r\n7.5 Data visualization 3:13:41\r\n7.6 Matplotlib global API 3:14:25\r\n7.7 Matplotlib OOP API  3:18:27\r\n8. Working with data from(/to) SQL, CSV, txt, API etc. 3:25:15\r\n8.1 Python methods for working with files 3:26:37\r\n8.2 Python methods for working with CSV files 3:29:33\r\n8.3 Pandas methods for working with CSV files 3:30:05\r\n8.4 Python methods for working with SQL 3:36:17\r\n8.5 Pandas methods for working with SQL 3:38:58\r\n8.6 Pandas methods for working with HTML 3:43:09\r\n8.7 Pandas methods for working with Excel files 3:49:56\r\n9. Python recap 3:55:18", "likes": 0}}, {"topLevelComment": {"author": "Pavel Murtin", "text": "All in all, thanks for providing a free course for us :) \nJust started the course, Jupyter went great, I decided to use Jupyter lab instead of Jupyter Notebooks.\nWent through Numpy lecture, seemed good.\nNow I'm at Numpy Excercises, where I had trouble loading the notebook and I ran into a couple of errors in the Numpy Excercise problems.\n\nIf i run into more, i'll try to post them here for other people by editing the comment. Can't promise anything though.\n\nPossible error list:\n Numpy Excercises - Logical operations:  \nGiven the X numpy array, return True if any of its elements is zero (prosing a change to non zero here) because np.any()  is a  test for true (non zero) elements, and therefore the wrong answer.", "likes": 0}}, {"topLevelComment": {"author": "Tommy", "text": "Some feedback: Many times there is too much scrolling up and down. There is not enough time to read text or commands.", "likes": 0}}, {"topLevelComment": {"author": "Tommy", "text": "Good video. Note that not all exercise soulutions are correct. For instance, the exercise \"Given the X numpy array, return True if any of its elements is zero\" has an incorrect solution. Here is a correct (example) solution:\n\nX = np.array([-1, 2, 0, -4, 5, 6, 0, 0, -9, 10])\nprint(not all(X))\n\nY = np.array([1,-5,3,7])\nnot all(Y)", "likes": 2}, "replies": [{"author": "Tommy", "text": "@Ahmadu Suleiman No, \"not any\" is the same as \"none\" which is the same as \"all are zero\" which not what we want here. \"Not all\" (as I wrote) means that \"at least one is not non-zero\" which is the same as \"at least one is zero\" - and that is what we want.", "likes": 0}, {"author": "Ahmadu Suleiman", "text": "@Tommy shouldn't that be \"not any()\" since it negates the condition and returns true if any of the elements is zero?", "likes": 0}, {"author": "Tommy", "text": "@Ahmadu Suleiman I don't agree. I think that \"np.any()\" checks if any of its elements is NON-zero. But that was not the task.", "likes": 0}, {"author": "Ahmadu Suleiman", "text": "I think you're also wrong in your code. The correct form is \"np.any()\" and not \"not all()\"", "likes": 0}]}, {"topLevelComment": {"author": "Amiya Ranjan", "text": "Great contents. The speaker knows exactly what he's talking about and has great deal of detail knowledge about python and various libraries. Thank you for sharing.\nI'm just wondering if sharing the fundamentals and ground level details (numpy memory) could have been a separate course all together and this one could have just focused on data analysis, may be....", "likes": 1}}, {"topLevelComment": {"author": "usman eniola", "text": "Not beginner friendly 🫢🫢", "likes": 0}}, {"topLevelComment": {"author": "Wellington Silva", "text": "Don't you have the Slides for Download ?", "likes": 0}}, {"topLevelComment": {"author": "Luis M", "text": "How can I read a Billion Spanish word dataset without getting out of RAM?", "likes": 0}}, {"topLevelComment": {"author": "Furkan Koçak", "text": "When I use index_col = 0, and parse_dates = True, together, dtype still shows Timestap as object. Why is this?", "likes": 0}}, {"topLevelComment": {"author": "Kirollos Eisa", "text": "Add Arabic subtitle please 🙏", "likes": 0}}, {"topLevelComment": {"author": "Ha Man", "text": "Your video is great very much! You can send to me csv.file that you used in this video.Thanks", "likes": 0}}, {"topLevelComment": {"author": "Javed Khan", "text": "Can I get", "likes": 0}}, {"topLevelComment": {"author": "Muntean Ionut", "text": "Any idea how to connect to chinook without actually downloading the db file? Downloading the file and trying to \"connect\" to it does not work. Tried displaying all the tables using:\n\ncur.execute(\"SELECT name FROM sqlite_master WHERE type='table';\")\ncur.fetchall()\n\nbut this returns a blank list", "likes": 0}}, {"topLevelComment": {"author": "Ахмед Гайсумов", "text": "2:47:00", "likes": 0}}, {"topLevelComment": {"author": "Yuchen J.", "text": "I think part of the video is broken, around 1:34:00-1:36:00", "likes": 1}}, {"topLevelComment": {"author": "Pennheart", "text": "Awesome course!!!", "likes": 0}}, {"topLevelComment": {"author": "Aamir Ali", "text": "is this course enough to learn commands incorporated in python during  data anlaysis", "likes": 0}}, {"topLevelComment": {"author": "jinender thakur", "text": "I didn't under stand anything  i am non coder non cs background 😭", "likes": 0}}, {"topLevelComment": {"author": "Ismail shah", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Ashish Dangal", "text": "Hello, I am taking this course and the presenter mentions soem exercise but i am not able to find those exercises. Can someone please help me on that?", "likes": 1}}, {"topLevelComment": {"author": "KXZ", "text": "v", "likes": 0}}, {"topLevelComment": {"author": "Joseph Reddy Pentareddy", "text": "Screen is not readable. This video might have been recorded on a big monitor. I could not read the content on screen when watching this on my phone.", "likes": 0}}, {"topLevelComment": {"author": "李成香张玉仙", "text": "李成香，张玉仙，李慧瑾，郭云轩，郭伟民 ，家住四川绵阳游仙区科学城9区17栋3单元901。", "likes": 0}}, {"topLevelComment": {"author": "李成香张玉仙", "text": "李成香，张玉仙，李慧瑾，郭云轩，郭伟民 ，家住四川绵阳游仙区科学城9区17栋3单元901。", "likes": 0}}, {"topLevelComment": {"author": "李成香张玉仙", "text": "李成香，张玉仙，李慧瑾，郭云轩，郭伟民 ，家住四川绵阳游仙区科学城9区17栋3单元901。", "likes": 0}}, {"topLevelComment": {"author": "researchers, uk", "text": "this is not for beginner, disliked", "likes": 0}}, {"topLevelComment": {"author": "Asim Roy", "text": "<3", "likes": 0}}, {"topLevelComment": {"author": "Ankit Khanna", "text": "Hey, I am unable to download the sales_data.csv file. how should I move forward without it on my local jupyter notebook environment?", "likes": 1}}, {"topLevelComment": {"author": "caio vieira", "text": "Excelent course!", "likes": 0}}, {"topLevelComment": {"author": "Siyabonga Fortune", "text": "Great content👏, still rocking in 2022 💯", "likes": 0}}, {"topLevelComment": {"author": "fred jean-germain", "text": "What is the difference between;\n> dataFrame[\"age\"] \n   and \n> dataFrame.loc[\"age\"]", "likes": 0}}, {"topLevelComment": {"author": "Saim Masood", "text": "Bitcoin was only 9000 euros back then XD", "likes": 0}}, {"topLevelComment": {"author": "ruksana kabir", "text": "this is so bad for someone new to python there no steps he all over the place", "likes": 2}}, {"topLevelComment": {"author": "Elishva hi Gemes ^_^", "text": "z", "likes": 0}}, {"topLevelComment": {"author": "Johnny Chaves", "text": "The best tutorial in youtube", "likes": 0}}, {"topLevelComment": {"author": "Keshav Nayak", "text": "Is there something wrong with the video ? i keep getting playback error. all other videos play just fine. Internet is good. tried restarting router,browser,computer. Anyone face something like this?", "likes": 0}}, {"topLevelComment": {"author": "1776", "text": "You’re absolutely brilliant and generous for giving out this much information for all of us to learn, thank you!", "likes": 9}}, {"topLevelComment": {"author": "Jorge Hernandez", "text": "31:17", "likes": 0}}, {"topLevelComment": {"author": "Alireza Dehghan", "text": "useless long video!", "likes": 0}}, {"topLevelComment": {"author": "Dovahkiin VOKUL", "text": "Is this course enough?", "likes": 0}}, {"topLevelComment": {"author": "A2 THE GENIUS", "text": "00:30:50 i didn't get it", "likes": 0}}, {"topLevelComment": {"author": "Diksha Shukla", "text": "How can i get the exercise files mentioned in this video?", "likes": 0}}, {"topLevelComment": {"author": "J Work", "text": "Can't I just do this in Jupyter Notebook without going to google colab or notebook ai?", "likes": 0}}, {"topLevelComment": {"author": "And Another One", "text": "I am trying to be interactive, I can't get to download the csv sales data file.", "likes": 0}}, {"topLevelComment": {"author": "Khaled Nasr", "text": "I have just finished this course .. Conclusion I don't recommend any one of intermediate level people to follow this course. Because honestly I did not get any benefits of this course.", "likes": 0}}, {"topLevelComment": {"author": "timothy matome", "text": "Where is the Seaborn tutorial ?", "likes": 0}}, {"topLevelComment": {"author": "Dhiraj Patra", "text": "Font sizes are too small it is very difficult to see.", "likes": 0}}, {"topLevelComment": {"author": "vasu shanmugam", "text": "It would be great if you can upload some data file for access during the training which is used as running the python in videos", "likes": 1}}, {"topLevelComment": {"author": "goran mihajloski", "text": "Can someone tell me where can I find Jupyter notebook exercises (.ipynb format)  to practice datasets from the video?", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Siwji", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Alberto Martin Doorly", "text": "Hi, can anyone tell me how to connect the google colab to the data in order to do the exercises please?", "likes": 0}}, {"topLevelComment": {"author": "Technical Surani", "text": "Great Video. !! Appreciate it.", "likes": 0}}, {"topLevelComment": {"author": "khode qadir", "text": "Tnx", "likes": 0}}, {"topLevelComment": {"author": "khode qadir", "text": "Perfect", "likes": 0}}, {"topLevelComment": {"author": "채master", "text": "33년 전에 33가지 공약으로 20대 대선에서 국민을 구하는 선지자, 선각자, 선구자는 누구? 누구??? \n    33년 전에 이 시대의 문제를 알고 해답을 33가지로 담아 내니 가히 신의 경지라 하지 않을 수 없습니다. \n    그 당시는 물론 지금까지 사람들은 문제가 무언지, 왜 저런 공약이 필요한지 공감을 못하고, 무슨 소리인지 몰랐습니다.\n    이제 33년이 지나 부패한 지도층, 세계최고 자살률, 경제 파탄, 자영업자 붕괴, 환경파괴, 코로나, 가정 파괴, 가계 부채, 청년 실업, 결혼포기, 인구 감소 등 문제를 알게 되니 33공약이 왜 해답인지 알 수 있습니다.\n    허경영.     허경영을 대통령으로.     허경영을 청와대로. \n    나라에 도둑 떼를 정신교육대로 조용히 보내고 도탄에 빠진 국민을 살릴 대통령 후보입니다. \n    유튜브에 허경영을 검색하세요.&&", "likes": 0}}, {"topLevelComment": {"author": "video having just audio", "text": "It was weast of time for me.", "likes": 0}}, {"topLevelComment": {"author": "adamo Ja", "text": "3:04:07 you walking on thin ice there bro", "likes": 0}}, {"topLevelComment": {"author": "rahulmittal116", "text": "Want to learn SQL from scratch -\nSubscribe to https://www.youtube.com/channel/UC-yCdYQYwNy7ZVzQ9FfAgqA\nand start with 1st video.\n\nSQL Joins video - https://www.youtube.com/watch?v=jInp7Uy5DeE\n\nSQL tutorial is there for you.\nYou will learn it so quickly.", "likes": 0}}, {"topLevelComment": {"author": "wizard69", "text": "\"pythen\"", "likes": 0}}, {"topLevelComment": {"author": "Sung Jin Kim", "text": "Hi, I am learning a lot from your video. But your code nba.drop(range(22...) does not work. If you look at the HTML the header does not repeat every 20 rows, because there are some names that are repeated. And these names do not count. Can you help us out?\nhttps://youtu.be/r-uOLxNrNk8?t=13746", "likes": 0}}, {"topLevelComment": {"author": "Albert Antwi", "text": "I'm interested in learning data analysis \nPlease how can I register with you?", "likes": 0}}, {"topLevelComment": {"author": "Gianluca Muchetti", "text": "how can I get to the exercize?", "likes": 0}}, {"topLevelComment": {"author": "Kawipat Dabtong", "text": "2:37:12", "likes": 0}}, {"topLevelComment": {"author": "Khanh Tran", "text": "This is insane effort. Thank you, thank you !!!!", "likes": 0}}, {"topLevelComment": {"author": "Debdutta Bhattacharya", "text": "How can I run the codes in visual studio code?", "likes": 0}}, {"topLevelComment": {"author": "Sathya Sayesh", "text": "USD 60 bil, the worth of Bezos, an example the tutor quotes. As of now in Dec 2021, Bezos is worth upwards of USD 120 bil", "likes": 0}}, {"topLevelComment": {"author": "Elshaddai Harris", "text": "Very very useful!! Thank you so much for uploading this!", "likes": 0}}, {"topLevelComment": {"author": "Linda G.", "text": "is julia the feature?", "likes": 0}}, {"topLevelComment": {"author": "Rose Ballerine", "text": "I have no idea what's going on", "likes": 0}}, {"topLevelComment": {"author": "David", "text": "1:39:23 You can also do things like this A [  [   1 ,  2 : 5 ,  -1 ] ,  2 ]", "likes": 0}}, {"topLevelComment": {"author": "Luca Gallarati", "text": "Hey, can't open the notebook on colab. Can anybody help? Ty", "likes": 0}}, {"topLevelComment": {"author": "Mohd Najib Abdul Majid", "text": "How to get the data?", "likes": 0}}, {"topLevelComment": {"author": "Prashant singh Banafer", "text": "very good resource for beginners", "likes": 0}}, {"topLevelComment": {"author": "HG M", "text": "Data analyst here - Use PowerBi, R, Excel daily, and sometimes SQL. Love R, and think it is easy if you come from a Excel background to pickup, and you can do great ML stuff in there too. Often use R markdown for reports. However, think it is time to pull the Python band-aid off. Thanks for this course (only 10 min into it at the time of this comment). Will come back here in a few months to summarise thoughts on learning some Python with this background.", "likes": 8}, "replies": [{"author": "Spokey Dokey", "text": "8 months later, I'm genuinely interested in your thoughts now that you've tried both. Want to know if using python is just as good as R or not", "likes": 0}, {"author": "Siyabonga Fortune", "text": "replying 3 months after, any thoughts?", "likes": 2}]}, {"topLevelComment": {"author": "bigbro changus", "text": "25:00", "likes": 0}}, {"topLevelComment": {"author": "TNG ZHE XUAN", "text": "guys i need help it says there is no file located for the ales = pd.read_csv( part", "likes": 0}}, {"topLevelComment": {"author": "Tuan Dino", "text": "the course can be shorter", "likes": 0}}, {"topLevelComment": {"author": "yun king", "text": "💢從面相看 習近平即將下台？|真相傳媒\n\n习近平颧骨处出现了两条深深的纹路。在面相学上这叫“破颧纹”。我们看习近平历史照片可以发现，他一直都有一条较短的破颧纹，但不知为何今年十月他的“破颧纹”突然变长。\n\n习近平贵为中共主席，还有什么能影响他的事业发展呢？2018年习近平修改宪法，废除主席连任期限。这意味着习近平可以等同毛泽东一直当主席到死。 但根据外媒报道，这引起了各路派系的愤怒，都在想方设法的给习近平下绊子，将其拉下国家主席的位置。\n\n視頻來源：https://youtu.be/AZhrzUjNm18\n\n💜跟隨 真相傳媒 \n🧡Website 🧡YouTube 🧡Twitter", "likes": 0}}, {"topLevelComment": {"author": "Marzieh Farahani", "text": "Thanks, would you please check the pronunciation of Tuple, It is confusing for students.", "likes": 0}}, {"topLevelComment": {"author": "Frost Mactavish", "text": "any differneces between this course and the latest 9-hour version?", "likes": 0}}, {"topLevelComment": {"author": "Provokator - Provocateur", "text": "This guy looks like somebody who will bite you and eat you", "likes": 1}}, {"topLevelComment": {"author": "kepstein8888", "text": "You know how to teach.  Very rare skill.  Thanks for sharing this.", "likes": 0}}, {"topLevelComment": {"author": "THOMAS FRANZ STOCKHAMMER", "text": "lg", "likes": 1}}, {"topLevelComment": {"author": "Công Vinh Trần", "text": "Where can i download data ? please", "likes": 0}}, {"topLevelComment": {"author": "Rabeeh", "text": "Thank you sir for this wonderful course", "likes": 0}}, {"topLevelComment": {"author": "Mohammad Taeeb", "text": "Thank you sir", "likes": 0}}, {"topLevelComment": {"author": "He Loves Data", "text": "This channel is amazing.  Quality content. I had to subscribe", "likes": 0}}, {"topLevelComment": {"author": "Khalid KK", "text": "# i am struggling to get printed the maximum. \r\ncould you please help me? \r\n\r\ndef khalid():\r\n\r\n    li = database1\r\n    mp = database2\r\n    \r\n    for i in range(1, len(li)):\r\n        if i > 0:\r\n            for p in range(1, len(mp)):\r\n                if p > 0:\r\n                    sr = pd.Series(li[i]-mp[p-1])\r\n                 \r\n                    result = sr[[sr.idxmax()]]\r\n                    print ([result])\r\nkhalid()", "likes": 0}}, {"topLevelComment": {"author": "sadhguruXX", "text": "https://youtube.com/user/matejott", "likes": 0}}, {"topLevelComment": {"author": "higheloguy", "text": "1. How python in jupyter works\n2. How Jupyther works.\nNICE", "likes": 0}}, {"topLevelComment": {"author": "higheloguy", "text": "what is return key", "likes": 0}, "replies": [{"author": "Rayan Musa", "text": "It's equivalent to \"Enter\" key on Linux/Mac OS.", "likes": 0}]}, {"topLevelComment": {"author": "Yuning W", "text": "where can i find the notebook...?", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Ehsan", "text": "This is a fantastic introduction to Python!", "likes": 0}}, {"topLevelComment": {"author": "Ahmad Deeb", "text": "Github code for Part 7 is not working \r\nit says the Github Page is not found.", "likes": 0}}, {"topLevelComment": {"author": "Happy mindedness", "text": "I have been falling love in with this channel for one year ❤️", "likes": 0}}, {"topLevelComment": {"author": "Willians Rujano", "text": "Where are the notebooks for part 7? Does anyone have them?", "likes": 0}}, {"topLevelComment": {"author": "Felix JH", "text": "Me waiting for them to change the thumbnail.", "likes": 0}}, {"topLevelComment": {"author": "brutha_analog", "text": "This format with github and google colab is very confusing. You need to streamline this a little bit. Seriously.", "likes": 0}}, {"topLevelComment": {"author": "Arishavelle Kent Villanueva", "text": "1:57:01", "likes": 0}}, {"topLevelComment": {"author": "Misugi Kun", "text": "can u fix link for part 7 plz", "likes": 0}}, {"topLevelComment": {"author": "Daniel Sonnenwald", "text": "The !head command, shown around 12:48 doesn't seem to work any longer.", "likes": 0}, "replies": [{"author": "Roberto Prestigiacomo", "text": "! means that you're calling a system command. !head is a Linux/Unix command that works on Google Collab but not if you're on Windows.\nThis solves the problem (remove _!head data/sales_data.csv_ and copy paste the following):\n\n_%alias head powershell -command \"& {Get-Content %s}\"_\n_%head data/sales_data.csv_\n\nPS If you're using Anaconda, from the terminal you can download _posix_ ( _Conda install posix_ ). After that !head should work.", "likes": 0}]}, {"topLevelComment": {"author": "Austin John", "text": "Anyone come across this error when loading data? (command !head data/sales_data.csv)\nResponse:-\nhead: cannot open 'data/sales_data.csv' for reading: No such file or directory", "likes": 0}, "replies": [{"author": "Roberto Prestigiacomo", "text": "If you're still interested:\n\n! means that you're calling a system command. !head is a Linux/Unix command that works on Google Collab but not if you're on Windows.\nThis solves the problem (copy paste it in the cell in place of !head data/sales_data.csv):\n\n_%alias head powershell -command \"& {Get-Content %s}\"_\n_%head data/sales_data.csv_\n\nPS If you're using Anaconda, from the terminal you can execute _Conda install posix_ . After that !head should work.", "likes": 0}]}, {"topLevelComment": {"author": "Mo'cute", "text": "Can I write a code to undo all the thumbs down? Or at least break those thumbs. 😏", "likes": 0}}, {"topLevelComment": {"author": "Lee Murray", "text": "fantastic tutorial, thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "Natasha Samuel", "text": "Great class.\nKeep up the good work.\n\nThank You,\nNatasha Samuel", "likes": 1}}, {"topLevelComment": {"author": "Bassem Kabesh", "text": "can someone please guide me to the actual data that i need to work on, cause i am a bit confused", "likes": 0}}, {"topLevelComment": {"author": "Franklin", "text": "looks like a great video but Im too dumb always fall over getting the environment set up. I cant get jupyter lab set up no idea how. Installed with pip but mine looks nothing like the tutorial and dont understand what Im supposed to do with those links provided. As a beginner whose only ever done coding through pycharm which was super easy to just download and run its just really hard to figure out", "likes": 0}, "replies": [{"author": "Roberto Prestigiacomo", "text": "@Franklin No problems. I got throught the same frustration before I gave up on Google Collab.\n\nIf you use Jupyter Lab instead of the simple Jupyter Notebooks, it should look more similar to the video (ie you should have the list of files on a pane and can pass from file to file more smoothly). I haven't tried it myself so I don't know more about it.", "likes": 0}, {"author": "Franklin", "text": "@Roberto Prestigiacomo Thanks so much for taking the time to explain how you got set up. Cant wait to try it after work tonight", "likes": 0}, {"author": "Roberto Prestigiacomo", "text": "It doesn't look like in the video because the guy is running Jupyter through notebooks.ai.\nIn the video description they recommend to NOT use notebooks.ai and to open the notebooks he's working with in gogole Collab but good luck with that... I spent 2 days trying to figure out how to do it and I had to give up.\n\nBut if you have Jupyter in your machine what you can do is:\nOpen the GitHub links (the ones next to 🔗 Notebooks:) from the video description. On top of the list of files there's a green box saying \"Code\". That's a drop-down menu. At the bottom you have download ZIP.\nDownload it and unzip it somewhere in your machine (for example desktop).\nRun Jupyter (it should open automatically in your browser. I'm not sure if it can be used in other ways because I've never used it before this course) and it will show you a list of paths. Look for the folder where you have unzipped the project and you'll find the folder of the project.\nIt will show you a list of the files to work with (like the pane on the left side of his screen) and averytime you select a file, that will open in a bnew tab in your browser and you can work on it following the video through.\n\nIt's not as comfortable but that's the best I could do.", "likes": 1}]}, {"topLevelComment": {"author": "Boostinch", "text": "This is the worst teacher ever i dont know why people hire people to teach something in english when they don’t even know to speak english, the whole course is trash i had to pause the video and to search that topic on youtube everytime", "likes": 0}}, {"topLevelComment": {"author": "Wookii_cooki", "text": "Seriously thank you. Undergrad bio researcher and this help is invaluable. You're doing a great service to mankind.", "likes": 0}}, {"topLevelComment": {"author": "therzook", "text": "light background and small font, sorry it does not looks well on laptop screen, course is probably awsome..", "likes": 0}}, {"topLevelComment": {"author": "Bryan S", "text": "Life long Democrat. Voted for Obama 396 times ... I was looking to learn python not only because I love \"big snakes\", and massaging them for hours with this really expensive snake-oil I got from this really nice salesman,  but also because I heard if I got good at it, it could help me save my free bus-passes that get used while taking multiple trips to vote every time. because the stupid votingmasheens only let me vote 99 times per trip under my names because of something called \"limited numeric data fields that are restricted to a range of  -99 to +99\",  whatever that means... But I assumed if I learned how to python I could add more numbers like those Dumonion people do.... I don't know... Either way, The first problem I'm having, well besides my itchy Gendercitus is I can't find any Python lessons on youtube that I can just enter one of my names with a long racially-charged complaint and get my expert-award and start pythoning... Well, I gotta go. My uncle's friends all want their snakes massaged now since he told them how good I was.... ...Hopefully, theirs don't throw up every time like his does.. Byyyyyyeeeeeee", "likes": 0}}, {"topLevelComment": {"author": "SOMDEB SAR", "text": "1:42:36 kindly note that the method np.arange is \"arange\" instead of \"arrange\", there is single 'r' instead", "likes": 2}}, {"topLevelComment": {"author": "Maxi", "text": "Juca!!!!!!!!!!!", "likes": 1}}, {"topLevelComment": {"author": "Avantika Gupta", "text": "Is this course for a beginner in data analytics field with no prior experience/knowledge about data analytics?", "likes": 0}}, {"topLevelComment": {"author": "NotALlama", "text": "1:45:43 Notably you _can_ multiply arrays of different dimensions so long as the array with more dimensions is made up of arrays of the same shape as the smaller array.", "likes": 1}}, {"topLevelComment": {"author": "NotALlama", "text": "Timestamp for me to continue from: 3:38:12", "likes": 0}}, {"topLevelComment": {"author": "NotALlama", "text": "You can also hit 'h' in Jupyter Notebooks to bring up help, which lists all the keyboard shortcuts.", "likes": 1}}, {"topLevelComment": {"author": "Azza B", "text": "24:58", "likes": 0}}, {"topLevelComment": {"author": "N.Simovic", "text": "If I don't know any numpy I would be lost! You didn't explain dimensions properly, just flew over it. You also didn't explain the axis which is confusing for many people, you again just flew over it. I appreciate your effort to make this tutorial but you need to stay more on some topics if you really want to teach someone", "likes": 1}}, {"topLevelComment": {"author": "Mursal Mzarif", "text": "When I work on the exercises on google colab, I can't seem to work the projects because the files aren't recognized. I tries to upload the files from GitHub but I don't know how to only the exercises uploads. Does anyone know how to import the files in colab?", "likes": 2}, "replies": [{"author": "Roberto Prestigiacomo", "text": "It's easier if you download the projects for each section and run the notebooks on jupyter on your machine. \nAppearently the connection between GitHub and Collab sucks.", "likes": 0}]}, {"topLevelComment": {"author": "SAI ANANTH", "text": "@freeCodeCamp Please make complete data engineer course also", "likes": 1}, "replies": [{"author": "PrintF", "text": "YES", "likes": 0}]}, {"topLevelComment": {"author": "Esraa Hamada", "text": "I started the course on July 15th and I will add a comment when I finish it\n\nedit: I finished the course on August 2nd Considering that I know Python and spent seven days of time learning fast typing", "likes": 12}, "replies": [{"author": "Esraa Hamada", "text": "@Invin cibles You will need to learn the basics of python and the basics of statics for data analysis, and that will not take as many days as you think. It may take a couple of weeks. Just start, you'll get there at the end.", "likes": 0}, {"author": "Kartik Hegde", "text": "@Invin cibles if you are using VS Code they have notebook option. In command palette type 'create new notebook' experiment for a couple of days. And watch a separate tutorial . There are plenty available", "likes": 1}, {"author": "Invin cibles", "text": "@Kartik Hegde Thanks, I'm struggling to find the notebooks.ai demo or the interactive tutorial he's using, dont quite get the comment about google colab", "likes": 0}, {"author": "Kartik Hegde", "text": "@Invin cibles programming skill isn't required. but basic python should be known", "likes": 0}, {"author": "Invin cibles", "text": "is this video suitable for people who have no programming experience at all but want to look into using python for data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Phyllis Ho", "text": "How do u deal with the “dictionary not found” ??\nWhen I try to continue after closing my laptop for a while, It keeps poping up 😩", "likes": 0}}, {"topLevelComment": {"author": "Phyllis Ho", "text": "Anyone knows how to export the pdf from Jupiter notebook?\nSome say it needs to be converted to HTML format first.\nBut I am not sure how???", "likes": 0}}, {"topLevelComment": {"author": "Ashley", "text": "Can someone who has never coded anything before take your course and learn? Is it ultra beginner friendly? If not do you have any other recommendations? I would love to do freelance Data Scientist work and my family friend does it told me to learn c# and python. He makes like 700k a year as his own boss. would love to end up in a similar place just don't know where to start or learn from", "likes": 0}, "replies": [{"author": "Innovative Learning", "text": "Possible using python", "likes": 0}]}, {"topLevelComment": {"author": "Yuna S", "text": "1:30:00", "likes": 0}}, {"topLevelComment": {"author": "John Wesly G", "text": "Thankeuuuuuuuuuuuuuuuuuuuuuuu", "likes": 0}}, {"topLevelComment": {"author": "Piter Mandemaker", "text": "I love the way he explains but the text is on the small side. Have to use fullscreen. Which is inconvenient.", "likes": 1}}, {"topLevelComment": {"author": "Shalman S", "text": "2:45:08", "likes": 0}}, {"topLevelComment": {"author": "Vishal Singh", "text": "Great tutorial. Very grateful to have found this!", "likes": 0}}, {"topLevelComment": {"author": "ענבר אלקובי", "text": "I have to say, the tutorial technically is good and everything but the lack of explanation how to reach to jupyter notebook and managing to retrive all the files is just discouraging. it's not that obvious for most pepole, should add a guide or something to improve the experience", "likes": 0}}, {"topLevelComment": {"author": "Hayath Basha", "text": "Hi,\n\nIs it possible to convert below the input\n\nCustomer_Name,Product_1,Price_1,Product_2,Price_2\nZayn,Milk,30,Chocolate,40\nPeter,Cheese,190,Oil,80\nAndrew,Coconut,10,Milk,60\nDwayne,Soya,100,Butter,120\n\nto this output where the Product name should be ascending and it should also have its price in the next column\n\nCustomer_Name,Product_1,Price_1,Product_2,Price_2\nZayn,Chocolate,40,Milk,30\nPeter,Cheese,190,Oil,80\nAndrew,Coconut,10,Milk,60\nDwayne,Butter,120,Soya,100\n\n\nCan you please help", "likes": 0}}, {"topLevelComment": {"author": "Tony Soviet", "text": "As a data analyst in Maersk, I really appreciate this course in balancing between the technical foundations and actual executions! Most people only get to learn the codes without understanding the concepts, which are what separate workers from engineers!", "likes": 214}, "replies": [{"author": "Vegeto ssgss", "text": "I am 25 and I come from a strong pure and applied mathematical background, but I am a total newbie in programmation. I please have some questions:\n1/ Are SQL, Python and R enough to get a permanent position as a Data Analyst / Data Scientist?\n2/ How much time do I need to be able to manage and organize databases, and use them to produce statistical analysis and graphs?\n3/ If I am hired, can the employer change his / her mind and ask me to code in other languages that were not written in my curriculum, such as C++ or Java?", "likes": 0}, {"author": "Aero Dynamico", "text": "With a name like that, how come you are not yet sanctioned by Biden?", "likes": 0}, {"author": "Peter Jamali", "text": "how much do you earn asa data analyst", "likes": 0}, {"author": "TNG ZHE XUAN", "text": "Hi it seems like you were able to successfully complete the course did u have any troubles in accessing the sales file?", "likes": 0}]}, {"topLevelComment": {"author": "Michael", "text": "29:14 Why couldn't I use \"or\" in that line of code (have to use \" | \" instead)?", "likes": 0}}, {"topLevelComment": {"author": "Michel Schweinsberg", "text": "I can't believe this channel exists. I really truly can't.", "likes": 0}}, {"topLevelComment": {"author": "Joseph", "text": "This guide is better for an intermediate user as opposed to a beginner.  He is just flying through prewritten code and not explaining any of the programming elements.  Ugh.", "likes": 0}}, {"topLevelComment": {"author": "Katrina JUMADIAO", "text": "Twitter @rmotr_com doesn't exist 😔😔", "likes": 0}}, {"topLevelComment": {"author": "Mehboob Hussain", "text": "Excellent lesson, I learnt so much from this video. Thanks for sharing. I will check out more videos from you.", "likes": 0}}, {"topLevelComment": {"author": "Charles Carlos", "text": "Btw must you have prior knowledge of Python programming, to be able to Analyze data with python?", "likes": 1}, "replies": [{"author": "I'm dumb", "text": "Yes of course", "likes": 0}]}, {"topLevelComment": {"author": "TheyAdore", "text": "Coming from Excel to Python i found this really helped. Thank you for helping me get my bearings.", "likes": 1}}, {"topLevelComment": {"author": "MemberHomei", "text": "Can you please please pronounce identify as AIdentify?", "likes": 0}}, {"topLevelComment": {"author": "Steven Richards", "text": "Hi,\n\nI open up the exercises using the colab extension but keep getting the error \"sales is not defined\" even if I run the script which gives the answer.  It would be nice to see what output the should look like.", "likes": 0}}, {"topLevelComment": {"author": "dick sang", "text": "1:53:00 When you refer to dot product here, it is effectively a matrix multiplication by looking at its result! :)", "likes": 3}}, {"topLevelComment": {"author": "johnrey", "text": "I just stumbled upon a website where you may get free coins, gold, gems, diamons, etc.. It is called Gamecrook.", "likes": 0}}, {"topLevelComment": {"author": "LucidSonder", "text": "1:07:00\nthis is just a bookmark for me", "likes": 0}}, {"topLevelComment": {"author": "Tahir Hanif", "text": "Wow excellent explanation and easy to understand.  I love the presentation . Thank you 👏", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Sajjad", "text": "Good Start but was too fast at the  end.", "likes": 0}}, {"topLevelComment": {"author": "Geniousticly", "text": "Great Video! \nThanks for the awesome content 😃", "likes": 0}}, {"topLevelComment": {"author": "daniel knights", "text": "I just watched your whole video for over 4 hours to get paid, however, the site is a scam and you are using black hat SEO tactics. Should I report you to YouTube?", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Sajjad", "text": "no idea how to work on colab, can anyone help... since i am not ale to upload the csv or any file since i dont understand how to work on colab, cola extension also not installing on crome.", "likes": 0}}, {"topLevelComment": {"author": "Hans Wurst", "text": "Why does being extremely powerful get a thumb down?", "likes": 0}}, {"topLevelComment": {"author": "Yılmaz DALKIRAN", "text": "2:18 Please change the video description and use the index below\n\n00:00:00 Introduction\n00:11:11 Real Life Example of a Python/Pandas Data Analysis project\n00:30:50 Jupyter Notebooks Tutorial\n01:04:58 Intro to NumPy\n01:57:08 Intro to Pandas \n02:47:18 Data Cleaning \n03:25:15 Reading Data from other sources\n03:55:19 Python Recap \n\nSo we can jump out the section by using video process bar.", "likes": 8}, "replies": [{"author": "Neel's Tech Show", "text": "LEGEND", "likes": 1}]}, {"topLevelComment": {"author": "Wong Kit Long, Marcus", "text": "support", "likes": 0}}, {"topLevelComment": {"author": "Wong Kit Long, Marcus", "text": "best channel", "likes": 0}}, {"topLevelComment": {"author": "Mohit Sharma", "text": "I liked the first half of the tutorial, but the second half (starting from data cleaning) was a complete disappointment. It seemed like the tutor was in a rush and left many things unexplained. I wouldn't recommend the entire tutorial to anyone.", "likes": 0}}, {"topLevelComment": {"author": "Arthik Alexander", "text": "All those who have completed this entire course....how would you rate it? Compared to other paid or free options", "likes": 0}}, {"topLevelComment": {"author": "three name changes allowed", "text": "Please add captions", "likes": 0}}, {"topLevelComment": {"author": "ChangesOfTomorrow", "text": "If this is intended for people with no knowledge of Python, it's hard to follow. I don't get how to write commands or what the basic principles are, so it seems to me by 'beginners' you meant people who know some python and want to dive into data analysis using it.", "likes": 11}, "replies": [{"author": "Jeremy Joe", "text": "A beginner's course to Python is meant for people who are new to Python. Once you want to use Python for a specific goal, there is no reason to repeat the basics of Python since you can learn that in their Python course.", "likes": 2}]}, {"topLevelComment": {"author": "rene forbi", "text": "Thanks for the free content...but i don't know if you understand your audience", "likes": 0}}, {"topLevelComment": {"author": "Lakshmi Prabha", "text": "how to access the exercises in the lecture(hands-on)", "likes": 0}}, {"topLevelComment": {"author": "Panaishe Chibondo", "text": "can't find the link to the data you are using", "likes": 0}}, {"topLevelComment": {"author": "AadilVarsh", "text": "01:51:00", "likes": 0}}, {"topLevelComment": {"author": "Tim Gellings", "text": "\"Welcome to our Data Analasis with Python Tutorial. My name is Santiago and I will be your instructor.\" \n760.000 people: \"Ok, here we go\"", "likes": 6}}, {"topLevelComment": {"author": "Jose Antonio", "text": "This course is awesome !  The explanations are very clear  and the teaching way is very fine.  Thank you so much for all the hard work you put in making this !", "likes": 25}}, {"topLevelComment": {"author": "Jagmeet Sond", "text": "matplotlib is not explained well", "likes": 0}}, {"topLevelComment": {"author": "Susmit Singh", "text": "Cool intro, I liked it!", "likes": 0}}, {"topLevelComment": {"author": "Adarsh Kookal", "text": "കിടു 🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "Jagmeet Sond", "text": "you are moving too fast, l thought you would actually write code", "likes": 0}}, {"topLevelComment": {"author": "Nandit Srivastava", "text": "i dont know how many comments down here are real, but i think this tutorial was wayyy to direct for a beginner... Numpy and Pandas are explained very well no doubts on that...the data cleaning part was very direct, no beginner will get a bit of it, reading external files section was Ok, Matplotlib was explained like everyone knows about the attributes since birth.\n\nI am working as a data scientist from the past 4 years, i would not recommend this to anyone who is a beginner, except for the Intro , numpy , pandas and reading data from external sources section...", "likes": 30}, "replies": [{"author": "Ahmadu Suleiman", "text": "I disagree, I'm a beginner and this is very straight forward. A beginner in programmatic data analysis should know what he's going to get into and this lecturer definitely has a great breakdown of that", "likes": 0}, {"author": "Kasturi Das", "text": "Sir can you please recommend me some tutorials as I am completely beginner and don't know anything about python.\nBut I have to learn atleast basics within this month. It's urgent. Please recommend me some videos.", "likes": 1}, {"author": "shusma Kafle", "text": "Completely agreed.", "likes": 4}]}, {"topLevelComment": {"author": "Dev Desai", "text": "Along with this video, I referred to this article to learn Jupyter Notebook basics:\nhttps://realpython.com/jupyter-notebook-introduction/\nThe language is very easy to understand, hope it helps someone out there! :D", "likes": 2}, "replies": [{"author": "pranav Gupta", "text": "Hi Dev... Can you please tell me on what level do you have to know python to fully understand this course... Actually I just know the basics of python and sql.. should I start this course?? \nAny help would be appreciated.", "likes": 0}]}, {"topLevelComment": {"author": "Jamike Michel Ohia", "text": "Best Data science course on the planet period", "likes": 0}}, {"topLevelComment": {"author": "peopleclick india1", "text": "Study data science training in Bangalore from certified experts. Our job-oriented data science training in Bangalore helps you to learn a range of Python, R, SAS, and Tableau techniques. Data Science Content is built for newbie and intermediate level experts in accordance with real-world requirements. Many real-world issues and case studies have been implemented and discussed in the classroom with a lot of practical practices. We include business qualifications, real-time assignments, and career reviews for data science positions to Tier 1 businesses and banks. Be an expert in Data Science with our exclusive data science courses in Bangalore. We offer a Data Science course with both R and Python, Machine Learning, and Deep Learning concepts. Our classroom sessions taken by 10+ years of experienced trainers are highly interactive. There is a 24 X 7 online doubt clearing facility as well to ensure thorough learning. This course is ideally adapted for all kinds of people looking for data science training in BTM in the classroom and begins their data science career. We are considered one of Bangalore's best institutes for data science courses and training.\r\nFor More Details: +91 73384 97706\r\nVisit:\thttps://www.hadooptrainingbangalore.com/data-science-training-bangalore.html", "likes": 0}}, {"topLevelComment": {"author": "Arjun Goud", "text": "the content is excellent, Thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "Ismail K", "text": "why i need to learn if i know power bi? I know python is better for Data science but still few peoples are data scientists. for business Power BI or Tableu much more better", "likes": 0}}, {"topLevelComment": {"author": "Jay Bee", "text": "Pro-fittable 🤣👍🏾", "likes": 0}}, {"topLevelComment": {"author": "Frankie2727", "text": "Twitter link doesn't work....  why is that?", "likes": 0}}, {"topLevelComment": {"author": "Fajny Typ", "text": "This Tweet is unavailable.", "likes": 0}}, {"topLevelComment": {"author": "Ryan Blumenow", "text": "This content is great. Would it be possible to upload a pdf of the twitter cheat sheet? It tells me that tweet is not available.", "likes": 1}}, {"topLevelComment": {"author": "Hưng Bùi Ngọc", "text": "Hi, can we get the excel file?", "likes": 0}}, {"topLevelComment": {"author": "Peopleclick Techno Pvt.Ltd", "text": "Study data science training in Bangalore from certified experts. Our job-oriented data science training in Bangalore helps you to learn a range of Python, R, SAS and Tableau techniques. Data Science Content is built for newbie and intermediate level experts in accordance with real-world requirements. Many real-world issues and case studies have been implemented and discussed in the classroom with a lot of practical practices. We include business qualifications, real-time assignments and career reviews for data science positions to Tier 1 businesses and banks. Be an expert in Data Science with our exclusive data science courses in Bangalore. We offer a Data Science course with both R and Python, Machine Learning, and Deep Learning concepts. Our classroom sessions taken by 10+ years of experienced trainers are highly interactive. There is a 24 X 7 online doubt clearing facility as well to ensure thorough learning.This course is ideally adapted for all kinds of people looking for data science training in BTM in the classroom and begins their data science career. We are considered one of Bangalore's best institutes for data science courses and training.\r\nFor More Details: +91 76193 43002\r\nVisit:\thttps://www.hadooptrainingbangalore.com/data-science-training-bangalore.html", "likes": 0}}, {"topLevelComment": {"author": "Moriarity09", "text": "suggestion : Stick to the topic . Too much meandering . Part about binary math was mad.", "likes": 0}}, {"topLevelComment": {"author": "Raw Smoke", "text": "Thank you so much for this!", "likes": 1}}, {"topLevelComment": {"author": "Julius Miers", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Scott Newport", "text": "To get the first set of exercises to work with Google collab, I had to swap out the data with \nsales = pd.read_csv(\r\n    'https://raw.githubusercontent.com/ine-rmotr-curriculum/FreeCodeCamp-Pandas-Real-Life-Example/master/data/sales_data.csv',\r\n    parse_dates=['Date'])", "likes": 0}, "replies": [{"author": "胡金成", "text": "thanks for your address,it sloves my problem", "likes": 1}, {"author": "胡金成", "text": "me too", "likes": 1}]}, {"topLevelComment": {"author": "Enric Homs Rivera", "text": "Muchas gracias Santiago !!\nFantastic tutorial.", "likes": 0}}, {"topLevelComment": {"author": "paula martins", "text": "Hi am stuck, I can't import files into jupyter. I've uploaded the cover files into the jupyter but is not working. Both jupyter and files are in my desktop....please help me....", "likes": 1}}, {"topLevelComment": {"author": "monocot", "text": "I'm getting error that \"unable to open database file\" with sakila. I uploaded the file to my root directory in jupyter notebooks, and ran the code (only change was removing 'data to /sakila.db as I uploaded to root. Any one have suggestions?", "likes": 0}, "replies": [{"author": "monocot", "text": "@Arnav Roy (RA1911003010494) I did. And it's uploaded to my jupyter notebook instance. conn = sqlite3.connect('sakila.db')  and I tried sqlite3.connect('/sakila.db')I've also tried a path to the file on my desktop, and with that I get the error \"file is not a database\"", "likes": 0}, {"author": "Arnav Roy (RA1911003010494)", "text": "you should have done ../sakila.db or give the whole directory address of the file", "likes": 0}]}, {"topLevelComment": {"author": "And1 Roouf", "text": "For Statistics stuff better use R ... you're welcome :)", "likes": 1}, "replies": [{"author": "Jaybee BEE", "text": "Or SQL", "likes": 1}]}, {"topLevelComment": {"author": "Manoj Chauhan", "text": "Very well structured and delivered, Thank you.", "likes": 0}}, {"topLevelComment": {"author": "NiceDay美好的一天", "text": "Thank you very much", "likes": 0}}, {"topLevelComment": {"author": "tal wind", "text": "I can not run the code in excersice 1, importing the data is not succeed. I would like to get help", "likes": 0}}, {"topLevelComment": {"author": "Trung Nguyen", "text": "Great work, thank you so much!!", "likes": 0}}, {"topLevelComment": {"author": "yanko kolevski", "text": "Hello, probably the question was already made but in video at 1:52:32 did you mean divisible by 2?", "likes": 2}}, {"topLevelComment": {"author": "Jalal Karimov", "text": "Thank you for effort making this video, but it is not easy to follow it to be honest. Especially intro part to each topic was not smooth and hard to understand if you are on a beginner level.", "likes": 1}}, {"topLevelComment": {"author": "Hayath Basha", "text": "Hi sir\n\n1. I have 300 columns in one csv without headers where i need only 4 columns\n\n\npd.read_csv('ab.csv',names=[a1,......a300],usecols=[a1,a2,a34,a54])\n\n\nIs this efficient or further can be optimise\n\n\n\n2. In a csv i have uncommon columns \nRow 1: 15 columns\nRow2: 20 columns\n\nWhen i do readcsv it throws found 20 expected 15 columns\n\nPlease advise\n\n3. I have two csv where i need to compare row1 from csv1 to row1 from csv2\nCurrently using for loop \n\nPlease suggest better way", "likes": 0}}, {"topLevelComment": {"author": "Rumaisa Y", "text": "I am new to python. but I enjoyed this. If you are a newbie, dont focus on learning the syntax in this video. the best way to learn programming is to learn the functions first and then set aside sometime to work on your syntax skills. syntax overwhelms in the beginning. thank you for this. also loved your voice :)", "likes": 0}}, {"topLevelComment": {"author": "Allan S", "text": "I have to disagree with most of the comments here.  Simply having someone talk to you without any interaction is a very poor way to learn a subject.  All of the documentation is already complete so, I literally learn nothing.  Complete waste of my time", "likes": 0}, "replies": [{"author": "Jaybee BEE", "text": "I disagree.  I found it a great intro to Numpy, and you get some exercises to do. The part about Binary was an exception, and he could do some work on his pronunciation, but otherwise it was pretty good.", "likes": 0}]}, {"topLevelComment": {"author": "Zaraki Kenpachi", "text": "Are there any pre requisites for this?", "likes": 0}}, {"topLevelComment": {"author": "Shashank Pandey", "text": "NO algo expert,NOOO..i dont want to be a software developer at google.", "likes": 11}, "replies": [{"author": "Movies Night", "text": "@hüseyin susever iyk yk", "likes": 0}, {"author": "hüseyin susever", "text": "why not, Google is a big company", "likes": 0}]}, {"topLevelComment": {"author": "Maximilian", "text": "Great course. Though you should annotate the timeline.", "likes": 0}}, {"topLevelComment": {"author": "Parth Shingari", "text": "Any prerequisites for this course?", "likes": 0}}, {"topLevelComment": {"author": "Yathish S", "text": "unable to access the sakila database", "likes": 0}}, {"topLevelComment": {"author": "Dheeraj Verma", "text": "it takes approx. 27min to charge your laptop 4%...", "likes": 0}}, {"topLevelComment": {"author": "Elmer Villanueva", "text": "1:12:48 \"I'm making it up as we go.\" That quote says it all about this tutorial. I was expected a lot more organisation from the presenter, but it seems that he is content with a free-flowing presentation without clear signposting. I didn't enjoy this tutorial at all.", "likes": 2}}, {"topLevelComment": {"author": "Suyog", "text": "Really great lecture! Thanks for uploading on youtube for free.", "likes": 1}}, {"topLevelComment": {"author": "Ander Iparraguirre", "text": "In  1:24:36 he is able to use a \"autocomplete function\" very typical in R Studio but I dont know how to do it in Jupyter Notebooks. Anyone can tell me how he does it? Thanks!", "likes": 1}, "replies": [{"author": "Romain M", "text": "Start typing your function (i.e \"int\") and then tab ;)", "likes": 0}]}, {"topLevelComment": {"author": "Jack John", "text": "Can anyone tell me the timestamp for seaborn? Nice video tho", "likes": 0}}, {"topLevelComment": {"author": "Emmanuel Nwanegbo", "text": "Please I need the example files used in this tutorial.\nEmail address - arvel4life@gmail.com", "likes": 0}}, {"topLevelComment": {"author": "Araz Garayev", "text": "At notebook.ai I can not create project what should I do?", "likes": 0}}, {"topLevelComment": {"author": "Dreamingbig", "text": "Sir, what do you mean by \"spread shits\"? @11:59", "likes": 1}, "replies": [{"author": "Samin Haque", "text": "It is a mean to organise data, like \"things\". And by spreading it, it is more tidy.", "likes": 0}]}, {"topLevelComment": {"author": "Angelina Kancheva", "text": "Where can Jupyter notebook users find the practice datasets from the video, can anyone advise?", "likes": 0}}, {"topLevelComment": {"author": "Persona Incognito", "text": "This video was an unmitigated GODSEND!  Thanks ever so much for posting it, Santiago!  Since this has helped thousands of future DS folks out there (some of whom are struggling with a few of of these subjects like me),  1000000 karma points have been credited to your account :-)", "likes": 8}}, {"topLevelComment": {"author": "svitir ur", "text": "can i use jupyter notebook", "likes": 0}}, {"topLevelComment": {"author": "Thanh Vu", "text": "Great video. Please turn on subtitles. Thanks you!!!", "likes": 0}}, {"topLevelComment": {"author": "Thomas Myhre", "text": "This is great! Thank you for this.", "likes": 0}}, {"topLevelComment": {"author": "Seth A", "text": "Doesn't actually teach. Thought it was going to be like other freecodecamp python ones or Mosh. Really disappointed.\n\nEDIT:  I'm still not a fan of the videos, but the exercises in the accompanying files are really good. I'll give this a thumbs up now.", "likes": 2}}, {"topLevelComment": {"author": "Phúc", "text": "Can i ask the word use in 1:39:41? Is it \"next permutations\" or something? Tks", "likes": 0}}, {"topLevelComment": {"author": "Disini Movie Film", "text": "please include or enable subtitles, thankyou:)", "likes": 1}}, {"topLevelComment": {"author": "John Borja", "text": "Thank you!! is not loading the sales table to colab when I open the exercise", "likes": 0}}, {"topLevelComment": {"author": "LEARNING ENGLISH", "text": "Thankyou!", "likes": 0}}, {"topLevelComment": {"author": "vaibhav kumar gautam", "text": "worthwhile time spending", "likes": 0}}, {"topLevelComment": {"author": "Sayf Bouazizi", "text": "When i began learning SQL from this channel, i was really happy  i found such an amazing source of knowledge... But to be honest, this python course is not well explained. And unclear.", "likes": 0}}, {"topLevelComment": {"author": "Pierre Marais", "text": "real MVP! thanks", "likes": 0}}, {"topLevelComment": {"author": "Emmanuel Meshileya", "text": "do you offer training", "likes": 0}}, {"topLevelComment": {"author": "Nguyen Ngoc Lan Thanh", "text": "i am intern Data Analyses, my question is where could I find Data to practice ? Thanks", "likes": 1}, "replies": [{"author": "Diego Guisasola", "text": "Google All the datasets you need to practice data science skills AND make a great portfolio . The site Is towards data science", "likes": 2}, {"author": "Nguyen Ngoc Lan Thanh", "text": "@Vaan Pandian follow up with you =))", "likes": 0}, {"author": "Vaan Pandian", "text": "Same I am also looking for data to practice but not much is available on the internet. If freecodecamp could provide us with their data or any other links for data that we can extract and use for our analysis that would be great!", "likes": 0}]}, {"topLevelComment": {"author": "Ultra eye", "text": "Please zoom your video. My eyes are soooo paining. (Watching in mobile display)\n I love \"Programming with mosh\" channel. He uploads Good quality zoomed edited videos!", "likes": 2}}, {"topLevelComment": {"author": "Giulio 92", "text": "Invaluable resources on this channel! thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "ryuk6660", "text": "1:28:11", "likes": 0}}, {"topLevelComment": {"author": "Kevin Le", "text": "for the csv files in the course, they don't work for me when I try to do the examples. I'm assuming I would need to download the csv to my computer first and then the value I type in would be different?", "likes": 0}}, {"topLevelComment": {"author": "Carlos Martinez Cairo", "text": "que recucas es !head?", "likes": 0}}, {"topLevelComment": {"author": "Kaushik Sahoo", "text": "Just WoW", "likes": 1}}, {"topLevelComment": {"author": "Tim M", "text": "Exactly what I was looking for, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Yossi Kally", "text": "By far the best tutorial on data analysis. Have same on machine learning?", "likes": 0}}, {"topLevelComment": {"author": "Eustaquio Santimano", "text": "Thank you Santiago Basulto !  The beginner course training was excellent.  It was a delicious appetiser.  Now I am waiting in anticipation for the main dish :)", "likes": 1}}, {"topLevelComment": {"author": "Kiana Arabpour", "text": "54:37 is when he starts to actually teach. Just saying.", "likes": 31}, "replies": [{"author": "0167 Ferdous Hasan", "text": "You shouldnt discourage my brothet", "likes": 3}, {"author": "Santiago Basulto", "text": "Well, I was _teaching_ how to use Jupyter Notebooks before, some people might not know how they work.", "likes": 21}]}, {"topLevelComment": {"author": "prashanth Chandroth", "text": "This is so great and I have not seen a session like this before and its so well explained. Great job !!", "likes": 1}}, {"topLevelComment": {"author": "Akim Navim", "text": "Subtitle (CC) please :')", "likes": 2}}, {"topLevelComment": {"author": "Satyam Kishore", "text": "Thanks for the tutorial, It was quite extensive and cleared a few of the doubt which I had for a long time. One Q though,  is it possible to group the data and perform an aggregate function in Pandas DF ?", "likes": 1}, "replies": [{"author": "Santiago Basulto", "text": "Yes! We actually cover it a bit at the end. The method `groupby` is what you're looking for: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html \n\nJake has an amazing tutorial: https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html", "likes": 2}]}, {"topLevelComment": {"author": "Sajid Qamar", "text": "thankewe for this vid", "likes": 0}}, {"topLevelComment": {"author": "Prakash Raj", "text": "code https://youtu.be/xAY4iBRhGKo", "likes": 0}}, {"topLevelComment": {"author": "FRANKWHITE1996", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "EZ Coding", "text": "I AM ՏᑌᗷᗷIᑎᘜ TO ᗩᑎYOᑎᗴ ᗯᕼO ᒪIKᗴ’Տ TᕼIՏ ᑕOᗰᗰᗴᑎT\nᗩᑎᗪ ՏᑌᗷՏ TO ᗰᗴ 👈❤️ I'ᗰ ᖴᗩՏT 🔥\nI ain’t a liar you have my word :)", "likes": 0}}, {"topLevelComment": {"author": "N J", "text": "The flow in this needs some work in my opinion. I've been using Pandas/Matplotlib for like a year and I still had a hard time following this. It's normal to hit high-level discussion before diving into specifics, but the way it's done here is not the best example on this channel. Doesn't help that the guy's pace of speech is not great. Slows down at all the wrong parts and rattles off important info.", "likes": 9}, "replies": [{"author": "Brian Batista", "text": "I agree, he seems to start skimming more and more as you get deeper into the video which was disappointing..", "likes": 0}]}, {"topLevelComment": {"author": "shruthi boggarapu", "text": "How do I get the sales.csv?", "likes": 0}}, {"topLevelComment": {"author": "sufiya shaik", "text": "could anyone help me how to download the file", "likes": 0}}, {"topLevelComment": {"author": "Hai Le Quang", "text": "At the moment, Notebook AI has been discontinued.", "likes": 0}, "replies": [{"author": "Santiago Basulto", "text": "Yes, it's been closed down. We recommend Google Colab or Azure Notebooks.", "likes": 0}]}, {"topLevelComment": {"author": "Chong Vic Tor", "text": "Where is the analysis model?", "likes": 0}}, {"topLevelComment": {"author": "Veronica Alejandra Mas", "text": "Excelente tutorial!👏 Tenias que ser Argentino!  😊 Impresionante tu ingles!👏\nLo unico al final, y Phoebe?", "likes": 0}}, {"topLevelComment": {"author": "Matthew Sautter", "text": "I got tweet unavailable for the 'cheat sheet link', any other link that works for that?", "likes": 0}}, {"topLevelComment": {"author": "Sofus Axelsen", "text": "Hey Folks!\nDoes this course requires me to know the bacics of Python?", "likes": 0}}, {"topLevelComment": {"author": "Shreejan Shrestha", "text": "Anyone knows where can I get the dataset?", "likes": 0}}, {"topLevelComment": {"author": "Liam Huang", "text": "Hi, I am looking for the first section's file, where can I have it? Thank you very much!", "likes": 0}}, {"topLevelComment": {"author": "Z. jun", "text": "Hello, Thanks for your tutorial. But the Twitter Cheat Sheet doesn't exist anymore.", "likes": 0}}, {"topLevelComment": {"author": "Sagnik Mukherjee", "text": "I just finished it and the content is just awesome. It gets easy the way trainer explains things here. Thanks a ton for this lovely content.", "likes": 68}, "replies": [{"author": "Saumitra Pathak", "text": "hello, does this course have matplotlib, seaborn and all?", "likes": 0}, {"author": "Sheldon Cooper", "text": "@Sagnik Mukherjee thank you dada😊😊", "likes": 1}, {"author": "Sagnik Mukherjee", "text": "@Sheldon Cooper ekdom start kora jabe. Ami jokhon start korechilam ami o python r basic e jantam. Chotpot start kore dao. Khub valo kore e bujhiyeche. Best of luck.", "likes": 2}, {"author": "Sheldon Cooper", "text": "Accha course tar prerequisites ki ki? Ami c java valo kore jani.. python er ekdom basic gulo jani.. mane oi if else loop eisob gulo just. Python a Kono coding experience nei. Ei video ta start kora jbe?", "likes": 2}]}, {"topLevelComment": {"author": "Brenda Tafur", "text": "Someone know where can I get the csv file shown in the video?", "likes": 0}}, {"topLevelComment": {"author": "Haotian JIANG", "text": "Hey guy, I have a question and really have no idea how to solve...\n\nYou know, the tutor is using Jupyter Lab. If you have used jupyter notebook, you might know when you want to get information of a function (or an object), you can press Shift + Tab.\n\nHowever this function has been cancelled in Jupyter Lab, so how can I know about the oject?", "likes": 0}}, {"topLevelComment": {"author": "Sulaiman Khan", "text": "Change it to 1080 HD -- -", "likes": 0}}, {"topLevelComment": {"author": "Amtul J", "text": "Did he say his name was Antonio or Ontario (Lol) ?", "likes": 0}}, {"topLevelComment": {"author": "Abir Farhat", "text": "How do you load the sales_data.csv file for the purpose of the exercises please? Thanks.", "likes": 0}, "replies": [{"author": "Piyush Kumar", "text": "I am also looking for the same data. Could you please send", "likes": 0}]}, {"topLevelComment": {"author": "Die Regierung", "text": "0:00 O.. ok. Y... yes sir.", "likes": 0}}, {"topLevelComment": {"author": "Sounds and ambient videos", "text": "where are the datasets used in the class?", "likes": 0}}, {"topLevelComment": {"author": "I X", "text": "How'd you do that segregated copy at  04:13:17", "likes": 0}}, {"topLevelComment": {"author": "Ruchir Verma", "text": "Thanks for this tutorial. Can anyone tell me where can I find these csv files ?", "likes": 3}}, {"topLevelComment": {"author": "pravin pathade", "text": "showing CSV file error . i am running through google colab", "likes": 0}}, {"topLevelComment": {"author": "pravin pathade", "text": "where are those CSV files that used in video", "likes": 0}}, {"topLevelComment": {"author": "Steven D'Hondt", "text": "Where you compare performance between Numpy and Python (at 01:56:00) I need to explicitly add 'dtype=np.intp' to the Numpy array for it to function as it does in your notebook. In fact it wouldn't even get the right value, because the default dtype was too small... Why is this? How do I get my Numpy to pick the right dtype for me like it apparently does for you? XD", "likes": 1}}, {"topLevelComment": {"author": "ChristenKult", "text": "2:07:00", "likes": 0}}, {"topLevelComment": {"author": "Abhishek Salunke", "text": "Hello everyone,\nWill this content help me in building my foundation of Machine learning\nLooking for a reply.\nThanks a lot", "likes": 1}, "replies": [{"author": "Abhishek Salunke", "text": "@R'hollor thanks a lot", "likes": 0}, {"author": "R'hollor", "text": "It does help in the aspect of preparing the data.", "likes": 1}]}, {"topLevelComment": {"author": "Aaron Dennis", "text": "You know, you have to tell us about import requests. This isn't something python beginners automatically know exists. This is a big problem with all these \"learn code\" courses. You're not walking us through line by line and describing what the code does or when, why, how we should use it. It's great to see what python \"can\" do, but we need to know when to do what with it.\nThese courses are the equivalent of telling us that numbers exist, giving us 0-9, showing that numbers can be added and such, and then expecting us to go out into the real world and apply them to geometry without ever providing the intermediary steps.", "likes": 3}}, {"topLevelComment": {"author": "Vix xiv", "text": "thanks for the great work here. could you clarify please how to load the notebook/database used? thanks", "likes": 2}}, {"topLevelComment": {"author": "CR", "text": "can someone add subtitle to this video? :(", "likes": 0}}, {"topLevelComment": {"author": "10Stormzy10", "text": "Is it possible to use PyCharm IDE for data analysis or does it only work with Jupyter Notebook?", "likes": 0}}, {"topLevelComment": {"author": "Eslam Hosam", "text": "where i can get the dataset and note books for the tutorial ?", "likes": 1}, "replies": [{"author": "Santiago Basulto", "text": "The description has links to all the repos and data.", "likes": 1}]}, {"topLevelComment": {"author": "Dr. G S Singh", "text": "is it possible to have this wonderful resource for learning in document form like pdf or jupyter notebook. Thanks for the good work.", "likes": 0}}, {"topLevelComment": {"author": "Pragyanand Tiwari", "text": "The files for 'Reading Data from other sources' parts are not there on the github? \nWill they be updated?", "likes": 0}}, {"topLevelComment": {"author": "Juan Garassino", "text": "Is this guy argentinian?!", "likes": 0}}, {"topLevelComment": {"author": "Lyssa Preston", "text": "where do i find the excercises ? You talk about them around 24:50", "likes": 0}, "replies": [{"author": "Khalil Ben Safta", "text": "in the github notebooks, you can open them with the google collab extension as suggested by the lecturer", "likes": 0}]}, {"topLevelComment": {"author": "Abbas-M60", "text": "please translate this video", "likes": 0}}, {"topLevelComment": {"author": "Dixit Jain", "text": "Where are the exercises??", "likes": 0}}, {"topLevelComment": {"author": "Quỳnh Như Phan", "text": "Excuse me, how can I download the data in the video?", "likes": 0}}, {"topLevelComment": {"author": "Steven Nguyen", "text": "25:27 Hi everyone, can I ask why we have  ' ' ' when writing sql query?", "likes": 0}, "replies": [{"author": "Puneet Pandit", "text": "We write the whole querry in string format, hence for maintaining the indentations we need to use ' ' '  stuf  ' ' '  so that when it's converted by read_sql there are no errors.", "likes": 0}]}, {"topLevelComment": {"author": "James Fowler", "text": "Where do I find tutorial.ipymb?  I want to have my Jupyter notebook exactly like that in the tutorial so I can work along with you.", "likes": 0}, "replies": [{"author": "Santiago Basulto", "text": "There are repos with all the content of the course in the description.", "likes": 0}]}, {"topLevelComment": {"author": "Alex", "text": "Hi,\nwhere I can get this data?", "likes": 0}}, {"topLevelComment": {"author": "oriabure Hope Eromhosele", "text": "God bless you sir for this tutorial", "likes": 0}, "replies": [{"author": "Deepesh Dragoneel", "text": "hey is matplotlib covered", "likes": 0}]}, {"topLevelComment": {"author": "Dinh Thuan Nguyen", "text": "It is thousand times better than CS courses at college!!", "likes": 0}}, {"topLevelComment": {"author": "Letz_positive", "text": "If we have 4 columns like [week, fruits, vegetables, flowers], how to create a dataframe like df['fruits'] where week==36", "likes": 0}}, {"topLevelComment": {"author": "imad rashdi", "text": "BIG like for you", "likes": 1}}, {"topLevelComment": {"author": "Moon", "text": "'array' is not defined for me. Which library is it from when you use it alone?", "likes": 1}}, {"topLevelComment": {"author": "Ben Terem", "text": "Great course! The repo for part 7 doesn't exist, fyi", "likes": 16}, "replies": [{"author": "Santiago Basulto", "text": "I've updated it, should be working now!", "likes": 0}]}, {"topLevelComment": {"author": "Dimas Pulung Herjuno", "text": "thankyou", "likes": 0}}, {"topLevelComment": {"author": "Didimo Escobar", "text": "Great !!!, so it's posible use that code into pycharm or visual studio code ???", "likes": 0}}, {"topLevelComment": {"author": "Noran Viccanto", "text": "Just seen the first few minutes and I seem to loke it. You have one of the most easy, quick and to the point explanations. Subscribed and willing to complete the video...", "likes": 0}}, {"topLevelComment": {"author": "Ancient Mind", "text": "Auto Gen Subtitles would be well", "likes": 0}}, {"topLevelComment": {"author": "Recap Lord", "text": "Hurrayyyyyyy finally someone with normal pure English accent \nI love you ❤️", "likes": 0}}, {"topLevelComment": {"author": "Diogo S", "text": "High quality stuff, but I miss some of what he says because of the accent, subtitles would be highly helpful here. Just a suggestion, really good content either way.", "likes": 0}}, {"topLevelComment": {"author": "All In One", "text": "please add subtitles", "likes": 0}}, {"topLevelComment": {"author": "Juanjo Picon Cossio", "text": "Thanks for your work man, i love it, really apreciate , i learned a lot!! 👍", "likes": 1}}, {"topLevelComment": {"author": "ZK", "text": "Anyone can help to put up subtitles?", "likes": 1}}, {"topLevelComment": {"author": "rajesh gawade", "text": "Where can I download.. Example csv's please Help..!!!", "likes": 0}}, {"topLevelComment": {"author": "Luca Spinello", "text": "Thank you for the introductory course, I see you mentioned some examples with financial and price data on Cryptocurrencies, can you advise if you have some focused course on financial data studies and api interfacing. \nExample, getting data from exchanges and manipulate and study the data? \nThank you", "likes": 0}}, {"topLevelComment": {"author": "abhay soni", "text": "Big Thank you!! You guys are best!!", "likes": 0}}, {"topLevelComment": {"author": "Abdul Sami Shaik", "text": "so much knowledge but he was rushing to complete the video", "likes": 0}}, {"topLevelComment": {"author": "Bruno Martel", "text": "auto generated subs please!!", "likes": 0}}, {"topLevelComment": {"author": "Ali Maher Noori", "text": "please someone help me how to download the csv data", "likes": 0}}, {"topLevelComment": {"author": "ali kemal aydın", "text": "I have been watching your course for 2 weeks and I can say this is the best guide  I have ever seen. Thank you guys", "likes": 32}, "replies": [{"author": "Sugan", "text": "How you are doing the practicals? Can you help me out?", "likes": 0}, {"author": "Santiago Basulto", "text": "Thank you!", "likes": 3}]}, {"topLevelComment": {"author": "Nikesh Mangal", "text": "a bit confusing on how to connect to sql sakila db", "likes": 0}}, {"topLevelComment": {"author": "Programação Simples", "text": "What is the point of using iloc? If I type g7_pop[0] it returns the same thing as g7_pop.iloc[0]", "likes": 1}}, {"topLevelComment": {"author": "Lighting Flick", "text": "Do data analyst involve in creating machine learning ?", "likes": 0}}, {"topLevelComment": {"author": "MAD MAGGOT", "text": "So after completing this course am I able to work as a data analyst?", "likes": 0}}, {"topLevelComment": {"author": "Dortmund game", "text": "maybe you could subtitle your video is that my native language is portuguese and i want to learn to program i'm studying english but i know very little ...", "likes": 0}}, {"topLevelComment": {"author": "Patato Potate", "text": "Solution to Numpy Exercise : \"Given the X numpy matrix, show the last two elements on the last two rows\"\nis wrong? it show [2:,2:] shouldnt it be [-2:,-2:]", "likes": 0}}, {"topLevelComment": {"author": "Sam", "text": "Hi  I need your help. I wish to pursue a career in Data Analytics/Finance, I understand the tools I need learn( excel, SQL, python, Power BI etc) but I have no idea what math/statistics knowledge is required. Kindly advice on the area of math/statistics, curriculum that I should focus on , bearing in mind that I have just a basic knowledge of algebra. The only thing I currently have going on for me is my will power and grits. My morale is at 100% but I don't direction. Kindly assist me..", "likes": 0}}, {"topLevelComment": {"author": "Haniya Batool", "text": "And after forking project when I run it says df not recognized as name", "likes": 0}}, {"topLevelComment": {"author": "Haniya Batool", "text": "Do u separately need to install saqilla db in your harddrive or for practice u can use their and how u can ?", "likes": 0}}, {"topLevelComment": {"author": "Haniya Batool", "text": "How to fork the project to reveal it", "likes": 0}}, {"topLevelComment": {"author": "Ruben Arias", "text": "please enable subtitles", "likes": 0}}, {"topLevelComment": {"author": "jimmypopali", "text": "Thank you for all of this. Went through the whole video and was very valuable.", "likes": 3}}, {"topLevelComment": {"author": "CHARISH SANORIA", "text": "Best of the best channel for computer nerds", "likes": 0}}, {"topLevelComment": {"author": "Shilpi Chaudhary", "text": "Its all theory , I was expected practical stuff.", "likes": 2}, "replies": [{"author": "cmon yeba", "text": "Shilpi Chaudhary look at webscraping", "likes": 0}]}, {"topLevelComment": {"author": "Vimal Nair", "text": "Data and source code download available?", "likes": 0}}, {"topLevelComment": {"author": "Prabesh Acharya", "text": "found i was looking for. thank you so much.", "likes": 4}}, {"topLevelComment": {"author": "Ps", "text": "how helpful is this particular tutorial for finance professional trying to get into data analytics for finance?", "likes": 0}, "replies": [{"author": "Santiago Basulto", "text": "It's the first step into Data Analysis, this will be very helpful. From there, you should learn more about time series and econometrics.", "likes": 0}]}, {"topLevelComment": {"author": "Jacob Sander", "text": "35:09", "likes": 1}}, {"topLevelComment": {"author": "Sam", "text": "Why is he looking so angry. Lol", "likes": 1}}, {"topLevelComment": {"author": "Setty Dip", "text": "how we could get the \"btc market price csv\" file?", "likes": 0}, "replies": [{"author": "Santiago Basulto", "text": "Check AlphaVantage or cryptowatch", "likes": 0}]}, {"topLevelComment": {"author": "Shruthi S R", "text": "Very good explanation, am a Data Analyst and you have described things very realistically. Thanks", "likes": 2}, "replies": [{"author": "HappicTube", "text": "I just want to know how much a data analyst earns", "likes": 0}]}, {"topLevelComment": {"author": "Setty Dip", "text": "A = np.random.randint(100, size=(4,4))  \n\nanyone can  plz explain it . can't understand.", "likes": 0}, "replies": [{"author": "Setty Dip", "text": "@Krishnaraj plz see from 3.22 min to forward.", "likes": 0}, {"author": "Krishnaraj", "text": "@Setty Dipyea sure... But can you at exactly when so I can look it up? Coz imma have to try it..", "likes": 0}, {"author": "Setty Dip", "text": "@Krishnaraj hey, will you please help me? in the histogram part they written the code \"fig.savefig('hist.png) \" for saving the histogram . but it saves the scatter-diagram.  they don't even explain it . can you teach me this?", "likes": 0}, {"author": "Krishnaraj", "text": "@Setty Dip yupp", "likes": 0}, {"author": "Setty Dip", "text": "@Krishnaraj thanks, it means every time it will create a new  list of 4 rows and 4 columns?", "likes": 1}]}, {"topLevelComment": {"author": "Andrey Soldatov", "text": "please attach csv file", "likes": 0}}, {"topLevelComment": {"author": "Andrey Soldatov", "text": "please attach csv file", "likes": 0}}, {"topLevelComment": {"author": "Andrey Soldatov", "text": "please attach csv file", "likes": 0}}, {"topLevelComment": {"author": "Andrey Soldatov", "text": "please attach csv file", "likes": 0}}, {"topLevelComment": {"author": "Raihan Khan", "text": "took way too long to explain what we were gonna do...", "likes": 1}}, {"topLevelComment": {"author": "F- DTPWW", "text": "I'm using Anaconda-Jupyter Notebook for this lesson\nHow can I obtain a copy of the csv file you're reading from to follow along?\nThx", "likes": 2}, "replies": [{"author": "A L", "text": "Fred, DTPWW They are in the description for each part of the course.", "likes": 0}, {"author": "Haniya Batool", "text": "Same Q", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Uzair", "text": "Can I use VS code instead of jupyter notebook????", "likes": 0}}, {"topLevelComment": {"author": "Zhe Xiong", "text": "Just finished python in 4 hours today, time to learn Numpy, Pandas, and Ski-learn!", "likes": 2}, "replies": [{"author": "Jose Tijerino", "text": "me too", "likes": 0}]}, {"topLevelComment": {"author": "SahajaYogaforLife", "text": "Is the Jupyter Notebooks tutorial necessary for non Jupyter notebook users?", "likes": 0}}, {"topLevelComment": {"author": "Ajisegiri Sunday", "text": "This should be data analysis with python for professionals.. How does he want the beginners to understand when he had already prepared the sheets, just reading them to us", "likes": 0}}, {"topLevelComment": {"author": "Suhel Alatekar", "text": "@freecodecamp the font size is too small on the mobile phone", "likes": 0}}, {"topLevelComment": {"author": "Kirill Bylkov", "text": "Where can actual notebooks with exercise (.ipynb format) be found and used for practice?", "likes": 0}, "replies": [{"author": "A L", "text": "Kirill Bylkov They are in the description in each section of the course.", "likes": 0}]}, {"topLevelComment": {"author": "Yash Virani", "text": "Awesome guys", "likes": 0}}, {"topLevelComment": {"author": "Mehul Goyal", "text": "Can somebodu help me I cant run sys.getsizeof(2) query in my terminal", "likes": 0}}, {"topLevelComment": {"author": "Steven Luong Truong", "text": "Amazing. I feel very productive spending my time here. Thank you. 👍👍", "likes": 0}, "replies": [{"author": "Ahmadu Suleiman", "text": "It's great!", "likes": 0}]}, {"topLevelComment": {"author": "AnuarsTV", "text": "Which app do you use to write on screen?", "likes": 0}}, {"topLevelComment": {"author": "HEINRICH RUV", "text": "what about a \"freeMathCamp\"  or \"freeLogicCamp\" section?  \nSooner or later you will have to use math and logic in programming.", "likes": 11}, "replies": [{"author": "Mark", "text": "Check out their \"Mathematics\" playlist.", "likes": 0}]}, {"topLevelComment": {"author": "Sajal Agarwal", "text": "Thank you very much. Your video is very helpful.", "likes": 0}}, {"topLevelComment": {"author": "Brian Finch", "text": "Can you add auto subtitles to the video", "likes": 0}}, {"topLevelComment": {"author": "CS Success Gamer", "text": "where can we get the csv files?", "likes": 2}}, {"topLevelComment": {"author": "pranti datta", "text": "Please turn on the caption", "likes": 0}}, {"topLevelComment": {"author": "Gil Huberman", "text": "01:35:00 - i tried writing the same code exactly - \nbut when printing the shape i got (1, 4,  3) instead of (2, 2, 3) like in the video - \nexplanation?", "likes": 2}}, {"topLevelComment": {"author": "Peanut Butter", "text": "39:00", "likes": 0}}, {"topLevelComment": {"author": "Moein Ghahremani", "text": "Dear Santiago! Great thanks releasing the valuable video! You have rescued me from confusion in data science", "likes": 0}}, {"topLevelComment": {"author": "Michelle L", "text": "Thank you for the video, but I still don't understand the first difference you said between Numpy and Pandas.", "likes": 0}}, {"topLevelComment": {"author": "darshan kumar", "text": "the best channel,the best video,on this topic ,,really a damn costly course,getting for free,really lucky!!\nlong live free code camp!!!", "likes": 0}}, {"topLevelComment": {"author": "Dr. Amr MuhamEd", "text": "Great❤️", "likes": 0}}, {"topLevelComment": {"author": "Vani Ng", "text": "At 24:55 where Lecture 2 started, look like the Sakila database does not load, anything I can try to load for both lecture 2 and exercise 2? To clarify, the page is slowly loaded, but the noteboook cell does not load.", "likes": 0}}, {"topLevelComment": {"author": "Shivam Sharma", "text": "No caption ❓", "likes": 0}}, {"topLevelComment": {"author": "Basil Bench", "text": "Please correct me if I'm wrong isnt the description for Data Analysis at 4:30 also known as Business Intelligence?", "likes": 0}}, {"topLevelComment": {"author": "Rafi Khan Khadem", "text": "Can I use vscode instead of jupyter while watching this?", "likes": 0}}, {"topLevelComment": {"author": "Saida Tahuri", "text": "i have not started yet, but i think i will love it", "likes": 0}}, {"topLevelComment": {"author": "Jan Luis Antoc", "text": "I'm using PyCharm. I tried df.plot() but the graph was not shown? What seems to be the problem? Thank you.", "likes": 0}, "replies": [{"author": "RicksterRides38", "text": "Did you figure it out?", "likes": 0}]}, {"topLevelComment": {"author": "Jan Luis Antoc", "text": "At 2:44:38, how could you make both the \"Timestamp\" and \"Price'\" to be aligned to each other? Thank you!", "likes": 0}, "replies": [{"author": "Riya Tyagi", "text": "Santiago set the Timestamp to the index value. In a normal 2 column dataset graph, the index values are displayed on the x-axis (100, 200, etc.). If the index value is set to Timestamp instead of the traditional 0 to number of rows, both will appear on the graph.", "likes": 0}]}, {"topLevelComment": {"author": "Xxx Xxx", "text": "Great tutorial, only that I'm using vs code which also runs *.ipynb files.", "likes": 1}, "replies": [{"author": "rimini201", "text": "Really!? How do you do that? I’m only using VS Code right now", "likes": 0}]}, {"topLevelComment": {"author": "Lei Xun", "text": "*My takeaways:*\n*1. Table of Content* 1:45\n*2. Introduction **2:52*\n2.1 What is data analysis 2:52\n2.2 Data analysis tools 4:38\n2.3 Data analysis process 7:31\n2.4 Data Analysis vs Data Science 8:56\n2.5 Python and PyData Ecosystem 9:28\n2.6 Python data analysis vs Excel 9:46\n*3. Real example data analysis with Python: getting a sense of what you can learn from this course **11:00*\n*4. How to use Jupyter Notebooks **30:50*\n*5. Intro to NumPy **1:04:58*\n5.1 Low-level basis: binary numbers, memory footprint 1:09:32\n5.2 Python is not memory efficient to store numbers since it wraps everything into objects. Whereas in NumPy, we can select the number of bits to represent numbers 1:22:50\n5.3 NumPy can compute arrays faster than Python 1:24:58\n5.4 NumPy tutorial: NumPy arrays, matrices 1:29:47\n5.5 Memory footprint and performance: Python vs NumPy 1:53:14\n*6. Intro to Pandas: getting, processing and visualizing data **1:56:58*\n6.1 Pandas data structure: Series 1:58:41\n6.2 We can change the index of Pandas series and this is fundamentally different from NumPy arrays 2:02:55\n6.3 The upper limit of slicing in Pandas series is included, whereas, in NumPy, the limit is excluded 2:07:55\n6.4 Pandas data structure: DataFrames 2:14:36\n6.5 Most operations in Pandas are immutable 2:29:10\n6.7 Reading external data 2:36:47\n6.8 Pandas plotting 2:44:41\n*7. Data cleaning **2:47:18*\n7.1 Handling miss data 2:51:40\n7.2 Cleaning invalidate values 3:03:17\n7.3 Handling duplicated data 3:06:09\n7.4 Handling text data 3:11:05\n7.5 Data visualization 3:13:41\n7.6 Matplotlib global API 3:14:25\n7.7 Matplotlib OOP API  3:18:27\n*8. Working with data from(/to) SQL, CSV, txt, API etc. **3:25:15*\n8.1 Python methods for working with files 3:26:37\n8.2 Python methods for working with CSV files 3:29:33\n8.3 Pandas methods for working with CSV files 3:30:05\n8.4 Python methods for working with SQL 3:36:17\n8.5 Pandas methods for working with SQL 3:38:58\n8.6 Pandas methods for working with HTML 3:43:09\n8.7 Pandas methods for working with Excel files 3:49:56\n*9. Python recap **3:55:18*", "likes": 533}, "replies": [{"author": "Aruna Sunkanmi", "text": "⁰1", "likes": 0}, {"author": "annie sanket", "text": "pin thissxxsssxxx", "likes": 1}, {"author": "Amcn Reinhart", "text": "i love you man thanks!", "likes": 0}, {"author": "george osae", "text": "Many thanks", "likes": 0}, {"author": "Alexandro Sánchez", "text": "thank you so much from the bottom of my soul", "likes": 0}]}, {"topLevelComment": {"author": "Khoa Nguyen", "text": "This tutorial is perfect. Thank you very much for making it!", "likes": 3}}, {"topLevelComment": {"author": "mohamed alzenad", "text": "please help. where can i find the dataset \" btc-market-price\"?", "likes": 4}}, {"topLevelComment": {"author": "mohamed alzenad", "text": "please help. where can i find the dataset \" btc-market-price\"?", "likes": 0}}, {"topLevelComment": {"author": "KANKSH_Music", "text": "These courses are gonna make me a REAL TECH GURU!", "likes": 2}, "replies": [{"author": "See Data", "text": "If you are interested in data visualization, I think you can watch my channel and welcome 🙏", "likes": 0}]}, {"topLevelComment": {"author": "avi rathi", "text": "Really good video. You are great help to me.", "likes": 0}}, {"topLevelComment": {"author": "Gustavo De Oliveira", "text": "Why is 0 considered negative in the exercises? Is that somehow on purpose or just a small mistake?", "likes": 1}}, {"topLevelComment": {"author": "Gaurav Joshi", "text": "create more content on adv python comcepts", "likes": 0}}, {"topLevelComment": {"author": "Vijin Ap", "text": "Thanks a lot , for sharing knowledge !", "likes": 0}}, {"topLevelComment": {"author": "Xandro", "text": "Is there a matplotlib time stamp?", "likes": 0}}, {"topLevelComment": {"author": "Lucas Bravo", "text": "Que grande Santi Basulto. Un orgullo para Firulete escuela de futbol.", "likes": 0}}, {"topLevelComment": {"author": "Peter Montgomery", "text": "2:47:17", "likes": 0}}, {"topLevelComment": {"author": "Rafael Nardi", "text": "Huge thanks for this great video! And NINJA skills at 4:13:13", "likes": 0}, "replies": [{"author": "LordTejas", "text": "Wow", "likes": 0}]}, {"topLevelComment": {"author": "Vaibhav Raj", "text": "The first lesson that I learnt is  I am not a youth anymore.", "likes": 2}}, {"topLevelComment": {"author": "Daniel Gorringe", "text": "Anyone know how he cut multiple lines to make his list at 4:13:17 ? Must be some sort of keyboard function to cut across multiple lines like that?", "likes": 2}, "replies": [{"author": "S. Blandon", "text": "easy.. alt + left mouse button. But it works only on certain tools like teradata sql assistant, notepad++, some  python IDE's (visual studio, spyder, jupyter, etc). Takes some practice to achieve it so try it", "likes": 0}]}, {"topLevelComment": {"author": "Nick T", "text": "@1:39:58 what is the markdown to get that gradient line separator?", "likes": 0}}, {"topLevelComment": {"author": "Ani May", "text": "I love every second of this video. You're an INCREDIBLE teacher. I'm so grateful. Thank you.", "likes": 1}, "replies": [{"author": "Udit Kapoor", "text": "so are you.", "likes": 0}]}, {"topLevelComment": {"author": "YouMatter", "text": "Is there any product installation on this tutorial? I'm an hour in already, nothing.", "likes": 0}, "replies": [{"author": "Theoretical Physics", "text": "No, the libraries are included with jupyter. If beyond this tutorial, you want jupyter on your local system, look into downloading anaconda navigator.\n\nAs for using the libraries outside of jupyter, you might need to install them.", "likes": 0}]}, {"topLevelComment": {"author": "YouMatter", "text": "A Power BI Tutorial please and Thank You!!", "likes": 0}}, {"topLevelComment": {"author": "Ferdaous Somrani", "text": "Amazing videos. Super clear ans engaging!Thanks!  Do you have a detailed course on Text mining (sentiment analysis, cloud words, ..) with python! it would be a life changer. Thank you very much.", "likes": 0}}, {"topLevelComment": {"author": "Amit Shiuly", "text": "Can any one help me to carry out multi objective optimisation (nonlinear)  using PYTHON?", "likes": 0}}, {"topLevelComment": {"author": "PotLore", "text": "R u santiago gonzalez?!", "likes": 0}}, {"topLevelComment": {"author": "konishiwa sanni", "text": "you are the Best freeCodeCamp channel", "likes": 0}}, {"topLevelComment": {"author": "yashar ashtari", "text": "Thank you very much for this", "likes": 0}}, {"topLevelComment": {"author": "Nzube Onuigwe", "text": "Impressive and helpful tutorial. Thanks for this amazing teaching.", "likes": 3}}, {"topLevelComment": {"author": "Sri Krupa", "text": "Can someone please tell me how to find the solution for numpy exercises,like it is given as solution is hidden in fork project,can someone tell me what it means and how to view the solution for the numpy exercises", "likes": 1}, "replies": [{"author": "Haniya Batool", "text": "Kindly tell me how to view solutions and match with yours for all ,the starting exercises too", "likes": 0}]}, {"topLevelComment": {"author": "10 Tỷ Đồng 2022", "text": "oh my god , this is so cool !!", "likes": 0}}, {"topLevelComment": {"author": "putthecotdown", "text": "Thank you, the tutorial is really helpfull :)", "likes": 1}}, {"topLevelComment": {"author": "Snarky Mark", "text": "Title of video: Data Analysis with Python.\n\nSpends no time coding, just reading websites.  😠", "likes": 5}, "replies": [{"author": "Siva Prakash", "text": "Actually data analysis involve less coding more depends on analytical part", "likes": 0}]}, {"topLevelComment": {"author": "César Tonoli", "text": "Excellent course! Thank you very much!!", "likes": 1}}, {"topLevelComment": {"author": "Anubhav Srivastava", "text": "Any prequistic of this course?", "likes": 0}}, {"topLevelComment": {"author": "TheyAnonFromBeyond", "text": "Link to data used at 2:38:32?", "likes": 0}}, {"topLevelComment": {"author": "Radyo AlMikyel", "text": "where can i find the file csv thx", "likes": 4}}, {"topLevelComment": {"author": "motu chhotu", "text": "you guys r best", "likes": 0}}, {"topLevelComment": {"author": "Luis Garcia", "text": "Congratulations, what quality of information you provide us, I have perfected my learning with the help of this channel", "likes": 1}}, {"topLevelComment": {"author": "JvN", "text": "Is this an eye chart?", "likes": 0}}, {"topLevelComment": {"author": "David G", "text": "at 1:15:15 No. isn't that 8 numbers and not 7? In Binary, 0 is a number.", "likes": 0}, "replies": [{"author": "Gil Huberman", "text": "yes but think of this - you are [30] years old on your [31st] year of your life\nwhen a birthday comes - you finished that year and now that is your age.", "likes": 0}]}, {"topLevelComment": {"author": "Saurav Gupta", "text": "Is this course python for data science ?", "likes": 0}}, {"topLevelComment": {"author": "Cxxx Axxx", "text": "Some people can't listen the audio and they need the subtitles, could this channel support the eng subtitles auto translate by youtube subtitle translate function(even if some translation result is not correct, it's not the big problem) at least, thanks", "likes": 0}}, {"topLevelComment": {"author": "Ban Sharma", "text": "How to I access the datasets being used in this video", "likes": 0}}, {"topLevelComment": {"author": "akhila rayapati", "text": "Thank you for giving excellent content on pandas😊\n\nCan you please clarify the below question,:\n\nIf there was an excel of country and age peoples...\n\nFrom this i wanted to retrieve the age between greater than 10,10 to 20 and soon uptil the highest age when ever we select particular county so i need count of ages for cases by country country that is in the list of countries..\n\nI tried below code for one country but i am unable to get.\nCount =0\nfor var in df[\"country\"]:\n       if var== \"india\":\n            For age in df[\"age\"]:\n                    if age > 10 &age <20:\n                        Count+= 1\nI am getting error for this.\nMay i know further chnges to get the desired one.\n\nThank you in advance!", "likes": 0}}, {"topLevelComment": {"author": "Chuck Starwar", "text": "great teacher", "likes": 0}}, {"topLevelComment": {"author": "ActiveState", "text": "Very thorough video, does a great job of explaining intricate concepts in a simple way.", "likes": 1}}, {"topLevelComment": {"author": "Olainiyan Adewale", "text": "Please, where can I get sales_data.csv file. Please, this is very important", "likes": 0}}, {"topLevelComment": {"author": "Thinh Truong", "text": "Tks you guy making this video for us, but no sub available :((", "likes": 0}}, {"topLevelComment": {"author": "Sandra Fitri", "text": "Sir i have some trouble here. When download csv file its fine but in windows the extention not seem and i couldn't open in jupyter notebook. How to handle this please help me :\"", "likes": 0}, "replies": [{"author": "Stefan Tifigiu", "text": "where did you download the csv file from?", "likes": 0}]}, {"topLevelComment": {"author": "manish choudhary", "text": "amazing🤩🤩🤩", "likes": 0}}, {"topLevelComment": {"author": "Mobillo Edu", "text": "Your awesome..!!! great content..!! can we be youtube friends", "likes": 0}}, {"topLevelComment": {"author": "Лира З", "text": "Liking because Santiago", "likes": 0}}, {"topLevelComment": {"author": "siembiola", "text": "thank you very much for sharing your knowledge, I found this tutorial very useful!", "likes": 1}}, {"topLevelComment": {"author": "Himani Gulati", "text": "what is A @ B  returning....??", "likes": 0}}, {"topLevelComment": {"author": "melissalaparisienne", "text": "nice video!", "likes": 0}}, {"topLevelComment": {"author": "Will Bench", "text": "you really left us hanging there at 02:33:32", "likes": 0}}, {"topLevelComment": {"author": "Kylie Staraway", "text": "to the power means\nIn 8^2 the \"2\" says to use 8 twice in a multiplication,\r\nso 8^2 = 8 × 8 = 64", "likes": 0}}, {"topLevelComment": {"author": "PAUL DYKE", "text": "SHOUTOUT TO EVERYONE LEARNING HOW TO CODE ON THIS CORONA TIMES", "likes": 61}, "replies": [{"author": "John Wiley", "text": "if you want to go more in depth", "likes": 0}, {"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Shaswat Manoj Jha", "text": "1:52:26 Taught a very complex topic in the easiest way.", "likes": 2}}, {"topLevelComment": {"author": "Ric Don", "text": "For data series i can index by using positional number such as: g7_pop[0] without having to use g7_pop.iloc[0]. is that typical or is it bad practice?", "likes": 0}}, {"topLevelComment": {"author": "Sean MacKenzie Data Engineering", "text": "Great tutorial!", "likes": 0}}, {"topLevelComment": {"author": "saby", "text": "Thanks for the introduction part..kindly implement project also from start to end...", "likes": 4}}, {"topLevelComment": {"author": "Tripti Goyal", "text": "Very nice tutorial. Is source code and ppt available for share?", "likes": 0}}, {"topLevelComment": {"author": "Alvin Benson Gocheco", "text": "Help - Do I have to use jupyter notebook for this, or pycharm will suffice?", "likes": 2}}, {"topLevelComment": {"author": "Keep Kalm", "text": "To support: subscribe & like", "likes": 0}}, {"topLevelComment": {"author": "Data Monster", "text": "Please get Closed CCaptions for all your videos. I understand your instructions but sometimes want to speed things up and not miss something. Thanks. Great job", "likes": 0}}, {"topLevelComment": {"author": "Savan Rai", "text": "All who are from India leave a comment and press the like button 👆", "likes": 0}}, {"topLevelComment": {"author": "Samiur Rahman Tonmoy", "text": "Is this a beginner level course?", "likes": 0}}, {"topLevelComment": {"author": "Paresh", "text": "Please upload video in 720p", "likes": 0}}, {"topLevelComment": {"author": "Merlin i", "text": "I was looking for some tutorial some tells me both basics and helps me start with analysis. Thank you so much for this video. Its very helpful", "likes": 0}, "replies": [{"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Rebecca Sanchez", "text": "On section 2 of this video I get an error when trying to plot the density graph of the Unit_Cost data. (ModuleNotFoundError: No module named 'scipy.stats._distn_infrastructure') I'm not sure how to fix this. Can someone help me?", "likes": 0}}, {"topLevelComment": {"author": "Raghvendra Swarnakar", "text": "Part 1: Introduction\n Part 2: Real Life Example of a Python/Pandas Data Analysis project 00:11:11\nPart 3: Jupyter Notebooks Tutorial (00:30:50)\r\nPart 4: Intro to NumPy (01:04:58), (01:30:00)\n\nPart 5: Intro to Pandas (01:57:08)\r\nPart 6: Data Cleaning (02:47:18)\r\nPart 7: Reading Data from other sources (03:25:15)\r\nPart 8: Python Recap (03:55:19)", "likes": 890}, "replies": [{"author": "Araz Garayev", "text": "what is purpose og jupyter and notebook ? didnt get it?", "likes": 0}, {"author": "Vengal Rao", "text": "@Soafiavy Junior I am stuck over here ..next what to do... !", "likes": 0}, {"author": "Vengal Rao", "text": "@Aryan Jaiswal bro after this what to do ? Please guide me !", "likes": 0}, {"author": "Shoni Fari", "text": "Hero", "likes": 0}, {"author": "Deepesh Dragoneel", "text": "did he cover matplotlib", "likes": 1}]}, {"topLevelComment": {"author": "Sanjeev Kumar", "text": "I have completed whole tutorial I leant so much from this.. thanks free code camp and tutor..😍☺", "likes": 8}, "replies": [{"author": "Santiago Basulto", "text": "Happy it helped :)", "likes": 1}]}, {"topLevelComment": {"author": "H M", "text": "Ngl didn't watch...just wanted to ask whats the different between data analysis vs data science", "likes": 0}}, {"topLevelComment": {"author": "Sanjeev Kumar", "text": "Thank you sir", "likes": 0}}, {"topLevelComment": {"author": "Zhibek Turikpenova", "text": "Thank you for this great tutorial video", "likes": 0}}, {"topLevelComment": {"author": "Shantanu dolui", "text": "Is this tutorial is starting the journey of data analyst from scratch?", "likes": 0}}, {"topLevelComment": {"author": "Dakshesh Sharma", "text": "Bring back Mike Dane", "likes": 0}}, {"topLevelComment": {"author": "Shashank Raj", "text": "Excellent tutorial", "likes": 0}}, {"topLevelComment": {"author": "Amirul Clasher", "text": "eeeo", "likes": 0}}, {"topLevelComment": {"author": "David FE", "text": "It's great to see so many thankfulness from every corner. It would be even better to see some gratitude transformed into donations. Some day this videos/courses will be over otherwise, no one survives only from free gratitude :)", "likes": 9}}, {"topLevelComment": {"author": "Arthur Gusmão", "text": "Thank you from Brazil", "likes": 0}}, {"topLevelComment": {"author": "Giulio Mario Martena", "text": "I'm trying to do exercises, but everytime there's an exercise like \"Given the X array...\", there's no such thing visible and I have to go get it from the solution. Am I missing something?", "likes": 2}, "replies": [{"author": "Saurabh Kapur", "text": "No you just need to make a new array of your own.. Then perform any  operations on that array..", "likes": 0}]}, {"topLevelComment": {"author": "Yaya Koita", "text": "Cool guys Thanks man", "likes": 0}}, {"topLevelComment": {"author": "Prerak Shah", "text": "What are the prerequisites of this course?", "likes": 1}}, {"topLevelComment": {"author": "Bimal Bhaskaran", "text": "I found it from the SHOWMORE section :)\nThanks for the tutorial :)", "likes": 1}}, {"topLevelComment": {"author": "Bimal Bhaskaran", "text": "Where do I get thecodes and jupyter notebook files to download from'? Thanks", "likes": 0}}, {"topLevelComment": {"author": "Georgy Nasrallah", "text": "who ever wants to install jupyter and all the other libraries needed just go to anaconda and donwload the graphical installer for your operating system python 3.7 once downloaded install anaconda double check the first two boxes you see in the installer and then proceed normaly it take time so be patient  once done open the start menu and open anaconda navigator u see jupyter lab and all the other softwares , dont bother googling how to download its all comands and stuff wasting ur time", "likes": 1}}, {"topLevelComment": {"author": "Muhammad Prawira Yuda", "text": "sipp broo", "likes": 0}}, {"topLevelComment": {"author": "Brian Banda", "text": "Yes to appreciate and uncover the course content, from a distance it looks yummy!!! :) ;)", "likes": 0}, "replies": [{"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Jaseem", "text": "how i copy the link it every time showing error while i copying it", "likes": 0}}, {"topLevelComment": {"author": "iskandar zulkarnain", "text": "I swear this is the best channel in youtube ever.", "likes": 310}, "replies": [{"author": "Aziz Rajabov", "text": "100%", "likes": 0}, {"author": "muji", "text": "If you're into coding and programming", "likes": 0}, {"author": "Amjad Sabbagh", "text": "@10 Tỷ Đồng 2022  then you will start liking it here ;)", "likes": 0}, {"author": "أحدهم!", "text": "@10 Tỷ Đồng 2022  he speaks as a coders", "likes": 0}, {"author": "Subrajeet Maharana", "text": "var Iskandar comment = \"you swear wrong\"\n\nP.S:- I created variable unethically", "likes": 0}]}, {"topLevelComment": {"author": "Rally Buss", "text": "This is more of a video overview with external exercises (linked in the show more section). It seems useful but I'm not sure it works as a Youtube vid.  I wish it went through everything in real-time rather than having to do exercises on one's own without any visual feedback.", "likes": 2}}, {"topLevelComment": {"author": "Zig Zag", "text": "Hello Santiago, I'm Chile.", "likes": 0}}, {"topLevelComment": {"author": "Parag Kulkarni", "text": "Either lockdown or corona will kill us but u came as life saver", "likes": 0}}, {"topLevelComment": {"author": "J K", "text": "Sir you and Mike are from the same channel. Better you also use Mike methodology. He magnifies the Section he is talking about. That generates easiness for learner to concentrate on instructions as well as on the Subject running on the screen . \nRegards.", "likes": 0}}, {"topLevelComment": {"author": "Subramanian Ramajayam", "text": "how do i download the csv file?", "likes": 0}, "replies": [{"author": "Motlatsi Moea", "text": "did you ever manage to do it? I am struggling with the same issue", "likes": 1}]}, {"topLevelComment": {"author": "michel levy", "text": "Amazing video, really really good, thank you Santiago for offering such a great free class online.", "likes": 5}}, {"topLevelComment": {"author": "digigoliath", "text": "Awesome!! TQVM. 4 hours is not too long.", "likes": 0}}, {"topLevelComment": {"author": "George M", "text": "Do you issue a certificate of completion?", "likes": 0}}, {"topLevelComment": {"author": "Zacny Łoś", "text": "Please, turn on the auto- subtitles.", "likes": 0}, "replies": [{"author": "Nacho Tejera", "text": "@freeCodeCamp.org Is there any way we can enable it, using an external app or whatever?", "likes": 0}, {"author": "freeCodeCamp.org", "text": "Unfortunately, YouTube does not auto caption videos that are this long.", "likes": 0}]}, {"topLevelComment": {"author": "Sanjay kumar", "text": "Can I learn python 3.8.2 using lecture material of python 3.5.2???", "likes": 0}, "replies": [{"author": "Gil Huberman", "text": "@Sanjay kumar you have to download the version that corresponds woth your system settings\nif you run windows 32-bit you should download the 32-bit version (this applies to every software you use, regardless to Python)", "likes": 0}, {"author": "Sanjay kumar", "text": "@freeCodeCamp.org  what's the difference between 32 bit and 64 bit (while installing python)", "likes": 0}, {"author": "freeCodeCamp.org", "text": "Yes, there are only slight differences.", "likes": 0}]}, {"topLevelComment": {"author": "antvideo", "text": "who are all learning while in quarantine", "likes": 0}}, {"topLevelComment": {"author": "Nghiệp Crypto", "text": "I heard that we should focus on excel, sql skills for Data Analysis. People are now learning Python because it is getting popular.\nSo confused", "likes": 5}, "replies": [{"author": "潘Kiet", "text": "Excel is a good tool however it cannot deal with large data. Image doing all the analysis with even 5000 rows having to draw graph after graph onto different sheet. Excel gets very sluggish. With Python and their libraries with constant updates and support from the community, your good to go with even 1 million rows. Also like he said in the video, it gets cluster and tiring looking at the spreadsheets constantly, I find it quite distracting to do my analysis. SQL is good. I got no comments on that :)", "likes": 2}, {"author": "Savan Rai", "text": "Can you reply me because I have some confusion I want to clear it please help me", "likes": 1}, {"author": "Nghiệp Crypto", "text": "@ifabulocitygirl that makes sense. Thanks.", "likes": 1}]}, {"topLevelComment": {"author": "SAGALPREET SINGH", "text": "Can we have a video on some great flutter project from your side, maybe a complete e-commerce application? Anyways, your channel is much more than just awesome !", "likes": 0}}, {"topLevelComment": {"author": "Qamar Rasool", "text": "Sir can you teach here about email extracting software from fb, instagram etc\nIt will be helpfull thanks", "likes": 2}, "replies": [{"author": "Qamar Rasool", "text": "@edureka sir teach about email extracting software regards", "likes": 0}]}, {"topLevelComment": {"author": "Reshma Shaik", "text": "Wat is the difference between datamining and data analytics??", "likes": 0}}, {"topLevelComment": {"author": "Mnto Lee", "text": "I just want to marry you guys~ love the course!!", "likes": 10}, "replies": [{"author": "Collect Pad", "text": "coz of course marry", "likes": 0}]}, {"topLevelComment": {"author": "Steven Negishi", "text": "Been looking forward to this course since the beginning of the year. It could not have come at a better time. Thank you very much!", "likes": 36}, "replies": [{"author": "cmon yeba", "text": "Steven Negishi exaclty", "likes": 0}]}, {"topLevelComment": {"author": "Nor Priest", "text": "Which job makes more money:\nSoftware Developer vs Data Analyst?\n\nAnyone?\n\nAnd which job will die first and why?", "likes": 1}, "replies": [{"author": "Dave Budah", "text": "@Aaditya Sabharwal I love the last part of this answer.", "likes": 0}, {"author": "Prashant Solanki", "text": "Generally Software Developer will get you more salary but it is possible to have similar salary to a developer as a Data Analyst if you land in top tier companies.", "likes": 0}]}, {"topLevelComment": {"author": "M", "text": "Thanks alot", "likes": 0}}, {"topLevelComment": {"author": "Adriana Petrova", "text": "Just what I needed now :)", "likes": 0}}, {"topLevelComment": {"author": "A K", "text": "this great and exactly what i was looking for.", "likes": 2}, "replies": [{"author": "See Data", "text": "If you are interested in data visualization, you can watch my channel for more info 🙏", "likes": 0}]}, {"topLevelComment": {"author": "Charlie Do Amaral", "text": "Its really a shame that freecode camp its begining commercial, that is not the essence of freecodecamp. Commercial tutorial allways have a really bad content!.", "likes": 0}, "replies": [{"author": "Michael Gauci", "text": "@freeCodeCamp.org You'll always find these kinds of people on the internet who are trolls or never learnt how to say \"thank you\". Just ignore them. Your content is great and helps thousands of people each day.", "likes": 5}, {"author": "freeCodeCamp.org", "text": "We were not paid anything to post this course. We are trying to offer as many free courses as possible and some creators want to briefly promote other things in the courses they share with us. We think it's a fair trade. :)", "likes": 2}]}, {"topLevelComment": {"author": "Yatharth Verma", "text": "This channel is the best channel for learning programming.  It has inspired me to make many projects and learn new technologies. I also started my own channel to help others in javascript and angular, mut check out friends.😊", "likes": 2}}, {"topLevelComment": {"author": "Red's Tech", "text": "I am sharing free courses google drive link if any one need see on channel how to find it", "likes": 0}}, {"topLevelComment": {"author": "liquidX lucidity", "text": "Yes!!!!!", "likes": 1}}, {"topLevelComment": {"author": "Stapleman 007", "text": "Not sure if I'll ever use Notebook, but nice crash course for numpy, pandas, and matplotlib.", "likes": 0}}, {"topLevelComment": {"author": "Peter Piper", "text": "there's no point to read cue cards if it's obvious", "likes": 0}}, {"topLevelComment": {"author": "Eduardo Winterdaal", "text": "this is just awesomeee", "likes": 0}}, {"topLevelComment": {"author": "Deepanshu Chug", "text": "Timeline of Part 2 and Part 3 are interchanged in the descriptions. Part 2 : Jupyter Notebooks Tutorial starts at 30:50 and Part 3: Real Life Example of a Python/Pandas Data Analysis project  starts at 00:11:11", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Thanks, fixed.", "likes": 2}]}, {"topLevelComment": {"author": "Vk", "text": "When I have more than two values in a coloumn field, how can I normalize them?  So I can analyse or store in a database.", "likes": 0}}, {"topLevelComment": {"author": "Himansu Varghese", "text": "There's a special place in heaven for you guys. \nAfter the python course, I had to try different videos like numpy, pandas etc. This is way better!", "likes": 62}, "replies": [{"author": "Himani Gulati", "text": "i have reached the part where they r showing what we can do after this tutorial.. please help me out and let me know if i should practise more than the basic SQL before i continue this???", "likes": 0}]}, {"topLevelComment": {"author": "Samarth Dhroov", "text": "Cant imagine learning so good anywhere else :)", "likes": 17}}, {"topLevelComment": {"author": "Ratul R", "text": "Good introductory video for data analysis! \n\nAlso, you might want to swap the links mentioned in the description for part2 and part3.", "likes": 1}, "replies": [{"author": "Gil Huberman", "text": "@Sarvesh Gupta in such a fast growing technological world, nothing is ever enough.\nwe learn till the day we die", "likes": 1}, {"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Deodat Lawson", "text": "Yesss !!! I’ve been waiting for this for a long time !!", "likes": 11}, "replies": [{"author": "Kaushik Sahoo", "text": "Check IIIT Syllabus", "likes": 0}, {"author": "Kaushik Sahoo", "text": "No", "likes": 0}, {"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Shubham Panchal", "text": "Please add subtitles", "likes": 2}}, {"topLevelComment": {"author": "Madhur😎", "text": "Best channel on YouTube ☺️☺️☺️🙂🙂", "likes": 2}}, {"topLevelComment": {"author": "Jack Torrence", "text": "This is the best channel ever.\nNo one does  so clear, long and ad free videos....\nMy compliments 👏👏🤟👊🤙", "likes": 458}, "replies": [{"author": "Christopher Brown", "text": "I got a transfer of $39,000 to pay off my debts all thanks to thechinahacks", "likes": 0}, {"author": "Faizan Jallani", "text": "one makes and he is CodeWithHarry, but he speaks Hindi language but he is too funny in his videos and has a God-Gifted explaining things talent and also makes such longer videos.", "likes": 0}, {"author": "Chirag Raninga", "text": "@Sarvesh Gupta no dude", "likes": 1}, {"author": "Tito Mzamo", "text": "👌🏾👌🏾👌🏾", "likes": 0}, {"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 0}]}, {"topLevelComment": {"author": "Felipe Landim", "text": "Thank you for this.", "likes": 0}}, {"topLevelComment": {"author": "utkarsh bansal", "text": "Networking course please", "likes": 1}}, {"topLevelComment": {"author": "R P", "text": "Please enable auto subtitles for each video.Thanks", "likes": 0}}, {"topLevelComment": {"author": "HARRIS LAM", "text": "Muchísimas gracias Santiago!", "likes": 1}}, {"topLevelComment": {"author": "Jump Rope Monk", "text": "What is a  blessing, thanks so much!!", "likes": 2}}, {"topLevelComment": {"author": "rico d'sanchez", "text": "Really helpful great upload glad I subbed", "likes": 2}}, {"topLevelComment": {"author": "Jeswin", "text": "Just when I wanted it. Good timing.", "likes": 12}}, {"topLevelComment": {"author": "Electrical Coder", "text": "Awesome fantastic marvellous amazing....video..\nIf mins==32:\n YouTube.execute(2.9kviews)\nIf mins >33:\n YouTube.execute(me+\"100 likes\")", "likes": 1}}, {"topLevelComment": {"author": "datageekrj", "text": "Wonderful Course. \n\n\nIt is good to see you using matplotlib and seaborn. I have used them a lot in past but now i rely mostly on plotly\n\n\nIt is wonderful tool to create web based graphics and i wonder why there are very few videos on plotly.\n\n\n\nThis video is my video intro to animation in plotly https://youtu.be/uGIwbAcSMZM\n\n\nPlease check out this video and also my channel for more such interesting content. Please Provide Valuable FEEDBACK.\n\n\nThank You and PEACE", "likes": 1}}, {"topLevelComment": {"author": "Phil Toa", "text": "Thank you .", "likes": 0}}, {"topLevelComment": {"author": "DA BEST", "text": "This video be lit", "likes": 1}}, {"topLevelComment": {"author": "John Cena", "text": "Please upload a video on kivy python", "likes": 0}}, {"topLevelComment": {"author": "Daniel Lakshan", "text": "Oh, thank you so much brothers, I have been waiting for a course like this from you guys, your channel has been so much helpful for me to improve my coding skills. You guys deserve to receive an award for this incredible service. Thanks again brothers, keep it up. 😘", "likes": 55}, "replies": [{"author": "Sarvesh Gupta", "text": "Is that enough to study in data analysis?", "likes": 1}]}, {"topLevelComment": {"author": "GRE AT WORDS", "text": "++", "likes": 0}}, {"topLevelComment": {"author": "Noah Williams", "text": "It’s corona time", "likes": 0}}, {"topLevelComment": {"author": "Noxolo Ngcobo", "text": "Freecodecamp coming through for us like nobody's business wow i stan❤️", "likes": 48}}, {"topLevelComment": {"author": "navazbeats", "text": "yup gonna watch", "likes": 2}}, {"topLevelComment": {"author": "Lovely Friend", "text": "Which mathmatics subjects need for computer science", "likes": 1}, "replies": [{"author": "Fikrun", "text": "Algebra and discrete math, calculus, & statistic & probability", "likes": 2}]}, {"topLevelComment": {"author": "Kubogi", "text": "I'm new to data analysis and this video shows up. Appericiate it :)", "likes": 0}}, {"topLevelComment": {"author": "Francis2k4", "text": "1st to view and comment", "likes": 0}}, {"topLevelComment": {"author": "Yathiraj Raghavendra", "text": "Searching for data analysis course on the web... Bingo got the notification.. No search required 😁", "likes": 16}, "replies": [{"author": "Yathiraj Raghavendra", "text": "@Creative being yaah truly well said... I believe", "likes": 1}, {"author": "Creative being", "text": "Agar kisi chez ko dil se Chaho to puri kayanat tumhe usse Mila  deti hai😊", "likes": 3}]}, {"topLevelComment": {"author": "Shyamsundar Shrestha", "text": "Thank You Sir! Wonderful", "likes": 2}}, {"topLevelComment": {"author": "YOGESH KUMAR", "text": "#1 you are best", "likes": 0}}]}