{"video": {"id": "r1xBCi5SOjw", "title": "CSS Crash Course Tutorial", "description": "In this video we will cover everything you need to know to get up and running with CSS in just over 20 minutes. \n\nWe will cover CSS syntax, how to add CSS to your HTML, CSS colors, CSS units, the box model, and best practices for CSS walking through a full example of CSS being used to style an HTML page. By the end of this video you will know enough about CSS to style any basic web pages in your own projects!\n\nTutorial created by Web Dev Simplified. Check out their channel for more great content: https://www.youtube.com/channel/UCFbNIlppjAuEX4znoulh0Cw\n\nTwitter: https://twitter.com/DevSimplified\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT23M36S", "likes": "2487", "views": "77917"}, "comments": [{"topLevelComment": {"author": "Web Dev Simplified", "text": "Thanks Free Code Camp for featuring my video on CSS. If anyone has any questions about anything covered in this video please let me know, and I will get back to you as soon as I can.\nAgain, thank you Free Code Camp.", "likes": 91}, "replies": [{"author": "Akashy Ji", "text": "@Raul Melo LM mm.\n..llppm", "likes": 0}, {"author": "Web Dev Simplified", "text": "I actually already have a series that goes over positioning and a little responsive design for a band website. You can checkout the videos for that series here. https://www.youtube.com/watch?v=Sv_NAxi_jNs&list=PLZlA0Gpn_vH9D0J0Mtp6lIiD_8046k3si&index=2", "likes": 3}, {"author": "Rakesh Takkallapalli", "text": "Thanks for the video. It is very good. Are you planning to cover responsive design and positioning in future videos?", "likes": 2}, {"author": "Web Dev Simplified", "text": "I am doing good. Thank you for the kind words. In order to create this video and my other videos like this I use After Effects combined with Davinci Resolve.\n\nAs for learning the skills needed for these videos I watched a few YouTube tutorials on After Effects to get an idea of how to do general things, and then just jumped into After Effects learning as I went. I never actually took any courses so I don't have any recommendations in that regard, but if you just look for a general tutorial on After Effects you should be able to get the basics down well enough to start making your own videos.\n\nIt really just takes a lot of patience and time to learn and get better at editing videos. I know for me I have been able to cut the time it takes for me to edit a video down from multiple days to only a few hours by just constantly practicing.\n\nHopefully that is enough information to answer your question. Sorry I can't be of more help.\n\nPS: I use OBS for recording my screen.", "likes": 4}, {"author": "Raul Melo", "text": "Hey , how you doing?\nFirst of all excellent video and explanation.\n\nCould you help me with something? I really wish be able to create videos like that. What kind of course/knowlegde should I do? \n\nI have some ideas and I really want to do something like this. =D\n\nThank you so much", "likes": 1}]}, {"topLevelComment": {"author": "Computer Science Guy!", "text": "I want to make a website, why I want to.", "likes": 0}}, {"topLevelComment": {"author": "ninjoe", "text": "haha jokes on you i already subsccribed", "likes": 0}}, {"topLevelComment": {"author": "Jhonby Dimanche", "text": "Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Jhonby Dimanche", "text": "No offense but that first 9 mins was boring. I think it would be more educational to do the second part (coding) then do the first 9 mins.", "likes": 0}}, {"topLevelComment": {"author": "Daniel Petrov", "text": "Thanks for this great video! I decided to broaden my horizons by adding knowledge required for Full Stack positions to my memory, this is why I watched your video.", "likes": 0}}, {"topLevelComment": {"author": "chandu chandu", "text": "can you guys centre a div right now?", "likes": 0}}, {"topLevelComment": {"author": "Rahul Roy", "text": "Awesome tutorial ❤️. It is helping me so much. Thank you👍", "likes": 0}}, {"topLevelComment": {"author": "Younes Khellaf", "text": "This will be enough to go directly to learn bootstrap?", "likes": 0}}, {"topLevelComment": {"author": "Jay Braun", "text": "took HTML and CSS in high school and college almost 10 years ago, your videos are very helpful with refreshing my memories and helping me get back into what I enjoy doing without retaking class courses haha!", "likes": 7}}, {"topLevelComment": {"author": "Fuad Arfan", "text": "👍", "likes": 0}}, {"topLevelComment": {"author": "Archirno", "text": "Learning CSS for personal interest and most likely using it to develop a website from scratch. It provides more flexibility than using those web builders that u need to pay in order to remove the watermark from your web link", "likes": 1}}, {"topLevelComment": {"author": "Lejend Killa", "text": "Amazing, Stay Blessed.", "likes": 0}}, {"topLevelComment": {"author": "SRINATH S", "text": "position:sticky not working in nested table with overflow: scroll", "likes": 0}}, {"topLevelComment": {"author": "Pulse", "text": "Amazing . Thanks alot", "likes": 0}}, {"topLevelComment": {"author": "JP", "text": "im taking classes on udemy for front end development right now and these videos are fantastic to watch before i go into an analogous course so i have an idea of what's going on. Thank you!!", "likes": 3}}, {"topLevelComment": {"author": "Hamid", "text": "Bro how you did the animation at start of video?", "likes": 0}}, {"topLevelComment": {"author": "Nurzhan Amantay", "text": "Thaank you", "likes": 0}}, {"topLevelComment": {"author": "Christ Loves Us", "text": "thank you for this, was very helpful", "likes": 0}}, {"topLevelComment": {"author": "Ilias Suvanov", "text": "Thanks bro, explained well", "likes": 0}}, {"topLevelComment": {"author": "White Code", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Manuel Villegas", "text": "Damn, I read a whole book on css. I regret not going on youtube for this video haha. Great content and explanation!", "likes": 0}, "replies": [{"author": "Brandon den", "text": "I always check Youtube>Google>Reddit in that order whenever I want to learn something. If all those fail, then I buy a book.", "likes": 3}]}, {"topLevelComment": {"author": "Freelancer Mahmudul", "text": "loving channel", "likes": 0}}, {"topLevelComment": {"author": "ooo ooo", "text": "IDs are used when you want to test your software with say Selenium or alike or when you want to structure your page. Of course you can use other selectors using XPath but ID just identify an element simply.\n\nYou forgot the > selector which means direct child selector div > p selects p elements into a div  which are directly descending <div><span><p>... for instance is not selected. There are others but I think this one could have been told about.\n\nThere is certainly more to tell but in 20mn it is a fair amount of data. For the rest there are references. W3school being a good one.", "likes": 3}}, {"topLevelComment": {"author": "mrmachir03", "text": "4:49", "likes": 0}}, {"topLevelComment": {"author": "Wungkachui a shatsang", "text": "Hello sir... Which editor r u using...??", "likes": 2}}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "Thank u for this awesome video", "likes": 1}, "replies": [{"author": "Web Dev Simplified", "text": "You are very welcome. I am glad you enjoy it.", "likes": 0}]}, {"topLevelComment": {"author": "taariqq", "text": "Nice little presentation that one can keep for reference for css basics", "likes": 3}, "replies": [{"author": "Web Dev Simplified", "text": "@taariqq I actually have a series on my channel very similar to this idea where I walkthrough how to style specific things in CSS. Usually each video also focuses on a specific CSS concept. You can check them out here. CSS Challenges: https://www.youtube.com/playlist?list=PLZlA0Gpn_vH8mpXIUHjWoMAAgoCEinL0R", "likes": 1}, {"author": "taariqq", "text": "@Web Dev Simplified short videos that deal with just one or a few aspects of CSS would be great. That way you can label them \"CSS: how to style every odd element\" rather than \"learn CSS\". Something distinguishing and specific for searches.", "likes": 2}, {"author": "Web Dev Simplified", "text": "Thanks! I'm really glad you enjoyed the fact that I made the video shorter since that was one of my main goals with this video. I wanted to make it easy to digest and come back to.", "likes": 1}]}, {"topLevelComment": {"author": "Randy Sandberg", "text": "Short, but concise and on point. Well done.", "likes": 4}, "replies": [{"author": "Web Dev Simplified", "text": "Thank you! I am glad you enjoyed the video.", "likes": 1}]}, {"topLevelComment": {"author": "ShamR0cks", "text": "Traversy Knockoff", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "Brad Traversy is awesome! You should definitely watch his videos in addition to ours. You are right that he also has a great CSS Crash Course. I encourage everyone to watch it to get another perspective. https://www.youtube.com/watch?v=yfoY53QXEnI", "likes": 4}, {"author": "Web Dev Simplified", "text": "I take that as a huge compliment being compared to Brad Traversy. He is an amazing teacher and has helped and inspired so many people. He is one of the reasons I decided to pursue my passion of teaching, and I am loving every second of it.", "likes": 4}]}, {"topLevelComment": {"author": "Jose Pagan", "text": "I have spent a few months to learn Javascript, I totally forgot my CSS, this video is perfect to refresh my knowledge!", "likes": 27}, "replies": [{"author": "zlaten zlate", "text": "same ...", "likes": 0}, {"author": "DevLoop", "text": "Same problem me too", "likes": 0}, {"author": "Web Dev Simplified", "text": "I'm glad you enjoyed it! CSS is pretty easy to forget about with all the exciting things you can do with JavaScript. That is until you realize  your awesome interactive web page looks like it was built in the 90s. :P", "likes": 8}]}, {"topLevelComment": {"author": "Gurpreet Grewal", "text": "thank you....make part 2", "likes": 2}, "replies": [{"author": "Web Dev Simplified", "text": "What would you want to see in a part 2? I have a series that I consider a good followup for this video where I style an entire band website. It uses all of the knowledge from this video to create a modern looking website. You can find the series here. https://www.youtube.com/watch?v=Sv_NAxi_jNs&list=PLZlA0Gpn_vH9D0J0Mtp6lIiD_8046k3si&index=2", "likes": 0}]}, {"topLevelComment": {"author": "J_Net Reloaded", "text": "when using css to make buttons how do I make it run a function when pressed? it never works for me!?!?", "likes": 1}, "replies": [{"author": "Web Dev Simplified", "text": "I will. I am actually recording a video on this exact topic today, but it won't be released until next Thursday.", "likes": 1}, {"author": "J_Net Reloaded", "text": "Nie thanks, will you do a tut vid on this?", "likes": 0}, {"author": "Web Dev Simplified", "text": "Styling an element in CSS will only change the presentation of the element. If you want to add functionality to an element on your page you need to use JavaScript. The addEventListener function will allow you to add an event to listen to a click event on a button. For example in JavaScript you could write\n\nelement.addEventListener('click', function() { alert('clicked button') })\n\nIf you are still confused about the use cases of CSS and JavaScript, check out this video where I go over how the different technologies in the web work. https://youtu.be/88QJumITbQA", "likes": 3}]}, {"topLevelComment": {"author": "salv236", "text": "thanks for sharing i was told that using * {property: value;} is bad practice and that to use either html or root", "likes": 4}, "replies": [{"author": "Web Dev Simplified", "text": "In general using the everything selector is not a good idea, because it messes with inheritance and is a pain if you need to override it in certain elements. For things such as font-family using root or html is a good idea since font-family is inherited by default.\n\nProperties such as box-sizing, though, are not inherited by default, and when you want all elements on your page to have a specific box-sizing the everything selector is the only way to accomplish this.", "likes": 1}]}, {"topLevelComment": {"author": "subodh kamble", "text": "Love this class ❤️", "likes": 4}, "replies": [{"author": "Web Dev Simplified", "text": "Thank you! I'm glad you enjoyed the video. 😄", "likes": 0}]}, {"topLevelComment": {"author": "freeCodeCamp.org", "text": "Here are some other great CSS resources:\nCSS3 in 30 Days: https://www.youtube.com/playlist?list=PLWKjhJtqVAbl1AfjiGyYxwpdAPi5v-1OU\nInteractive CSS challenges: https://learn.freecodecamp.org/responsive-web-design/basic-css", "likes": 6}}, {"topLevelComment": {"author": "Midhun kp", "text": "Please give css3 full course", "likes": 0}}]}