{"video": {"id": "Rcntg9A3EGw", "publishedAt": "2015-07-17T08:31:51Z", "title": "Computer Basics 13: Software", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n   We discriminate between hardware and software, and also discuss the differences between an operating system and application software.\n  In this video, we'll discuss the basics of software.\n  We've already covered hardware, which are parts of the computer you can see and feel with your hands.\n  Software is the program or the programs that run on the hardware.\n  Software is the code that is written and imprinted onto hardware.\n  The two types of software we're going to talk about today are operating system software and applications.\n  There are three main operating systems: Windows, Mac, and Linux.\n  Applications comprise all other software, like your web browser, games, things like Photoshop, how you view your mail, editing documents, etc.", "duration": "PT1M15S", "likes": 0, "views": "23419"}, "comments": [{"topLevelComment": {"id": "UgjtREoVd_Y60ngCoAEC", "publishedAt": "2016-04-27T17:36:29Z", "author": "Noldy", "text": "Windows, mac, Linux...and no other? Android????", "likes": 1}, "replies": [{"id": "UgjtREoVd_Y60ngCoAEC.8DB5VTWsIOv8eufK1yyUdD", "publishedAt": "2018-04-11T18:22:20Z", "author": "Nayab Qureshi", "text": "Noldy good", "likes": 1}, {"id": "UgjtREoVd_Y60ngCoAEC.8DB5VTWsIOv8EJsbMPOHF9", "publishedAt": "2016-05-25T23:59:39Z", "author": "Ehab Younes", "text": "Android has a Linux kernel, so it's basically a version of Linux.\n\nOther OS include Unix (which is what Linux is based on, except Linux is an open source OS)", "likes": 5}]}]}