{"video": {"id": "RdMAEdGvtLA", "title": "COBOL Course - Programming with VSCode", "description": "This introductory COBOL course helps a novice learn the Structure of COBOL programs, Data types & Variable Handling, Intrinsic Functions, Branching logic and more. The goal of the course is to enable the participant to be able to write basic COBOL programs. Get ready to dive into some actual COBOL!\n\n🎥 This course was originally developed by IBM, who have shared it with our nonprofit. IBM is hosting an event called Z Day on Sept 15th, 2020. This free 1-day virtual conference is open to anyone interested in mainframe technologies. You can register for the event here: https://ibmzday.bemyapp.com/2020\n\n🔗 To access the COBOL Course book and hands-on labs please go to Open Mainframe Project: https://github.com/openmainframeproject/cobol-programming-course\n\n⭐️ Course Contents ⭐️\n\n⌨️ (00:00) *Welcome to COBOL*\n⌨️ (02:23) VS Code and Extensions\n⌨️ (05:21) Basic COBOL Syntax\n⌨️ (09:25) COBOL Divisions\n⌨️ (13:12) COBOL Variables\n⌨️ (19:06) Data Division\n⌨️ (21:32) File Handling\n⌨️ (27:40) Procedure Division\n⌨️ (31:36) Program Structure\n⌨️ (37:57) Paragraphs\n⌨️ (43:35) Program Linkage\n⌨️ (45:54) File Output and Reports\n⌨️ (52:15) Conditional Expressions\n⌨️ (59:13) Arithmetic Expressions\n⌨️ (1:05:02) Data Types\n⌨️ (1:09:58) Intrinsic Functions\n⌨️ (1:15:41) Closing\n\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT1H17M4S", "likes": "3051", "views": "111608"}, "comments": [{"topLevelComment": {"author": "lone wolf coding", "text": "is cobol language runs on von neuman architecture\nwhere cpu ram storage io are interconnectected to each other?\nif i use cobol how efficient it is and how they store data and how big data can cobol process?", "likes": 0}}, {"topLevelComment": {"author": "Sebastian Gudiño", "text": "Why is everyone like \"Great tutorial! Learned a lot!\"??? This ONE HOUR video didn't show a single line of code being written or executed. Yeah, there is a LOT of theory here, but that's kinda the point, here you are NOT learning cobol. you are learning what cobol IS. Which are two very very different things. One makes you a cobol developer, the other one makes you a guy who knoes ABOUT cobol.", "likes": 0}}, {"topLevelComment": {"author": "A bsolute", "text": "great tutorial but we never see to see this guy (cute guy) but bit distracting... its best to focus SOLELY on the work screen", "likes": 0}}, {"topLevelComment": {"author": "Rudy Torres", "text": "HELLO. I WOULD LIKE TO KNOW ABOUT VISUAL COBOL IN MS-VISUAL STUDIO FOR GIU DEVELOPERS.", "likes": 0}}, {"topLevelComment": {"author": "Steven Dorsey", "text": "21:23  --  I'm a little lost on what I'm supposed to be doing here.\nI have VS Code and Zowe Explorer set up and all that. I'm looking at the source code, but is there something I'm supposed to actually do with it? Submitting the JCL doesn't appear to give very much feedback on what's actually been done. \n\nLastly, as I'm new to this course thing, is there some website I'm supposed to go to that lists any assignments, labs, or tasks I'll be completing as I'm going through this video? Or at least details specifically where to look for my assignments/challenges, and how submitting JCLs actually works?", "likes": 0}}, {"topLevelComment": {"author": "Alex the Emperor Penguin", "text": "Is that letter still his favourite letter? 2022 is kinda messed up, but COBOL is still in use.", "likes": 0}}, {"topLevelComment": {"author": "Sonofabyss", "text": "I'm so hyped for this.", "likes": 0}}, {"topLevelComment": {"author": "WCR", "text": "Could you high-pass your audio in future videos thx", "likes": 0}}, {"topLevelComment": {"author": "Sajol Bhadra", "text": "excitement and without much blinking his eyes .. other level of dedication for his work", "likes": 3}}, {"topLevelComment": {"author": "Kenneth Funk", "text": "This video is inefficient and annoying.  You basically get dropped in the middle of something without being told how you get there.", "likes": 0}}, {"topLevelComment": {"author": "Soma Cruz", "text": "is it a profitable use of my time to learn this in 2022? Are American infrastructure engineers who know cobol in demand?", "likes": 0}}, {"topLevelComment": {"author": "Marcelo Marquez", "text": "My dear friend your code examples have many errors. To give you a couple of examples:\n1.  ADD sentence does not need to use the GIVING clause since the result is the same second operand of the ADD \"COUNTER\". It is a common error that generates unnecessary extra code. With ADD 1 TO COUNTER is enough.\n2. You can not use VALUE clause in a FD declaration because the FD is working inside the I/O AREA, so if the compiler rejects it or not, it does not make any sense because for the next record in the block the initial VALUES are not defined.\nIn the case of printing the different types of lines must be defined with all values needed inside the WS Section and the FD 01 level is just a container where the  WS lines are moved as needed.", "likes": 0}}, {"topLevelComment": {"author": "RegiiPad", "text": "The title of this video is misleading since it doesn’t show the development using vsCode, in fact shows too little about cobol itself and the workflow to develop a program. Frankly I don’t care much watching the instructor face all the time. Very disappointing", "likes": 0}}, {"topLevelComment": {"author": "Loke y", "text": "What brought me here? Hellsing abridged series. I seriously don't know how.", "likes": 0}}, {"topLevelComment": {"author": "totoplopp", "text": "Would have loved it if they skipped the whole tedious visual studio method of coding and just provided a browser playground. But great tutorial all in all, best one i found", "likes": 0}}, {"topLevelComment": {"author": "Babola10", "text": "Guys, do you recommend learn COBOL in this days?", "likes": 0}, "replies": [{"author": "Bob", "text": "If you plan to work as a programmer or an IT in the financial/insurance/data industries, it is still wildly used. BUT you don't program in COBOL to have fun. You must also learn mainframe stuff that goes along most of the time.\nOr just try a free version on your PC just to get a \"taste\" of it...", "likes": 0}]}, {"topLevelComment": {"author": "Scully", "text": "This is the code God used to create the universe, isn't it?", "likes": 0}}, {"topLevelComment": {"author": "Naughtius Maximus", "text": "16:15 This did not age well", "likes": 0}}, {"topLevelComment": {"author": "Pengbert Wu", "text": "the use of COBOL cripples the mind. - Dijkstra", "likes": 0}}, {"topLevelComment": {"author": "Star", "text": "Love how excited this dude is, great energy", "likes": 5}}, {"topLevelComment": {"author": "Γιώργος Τσιριόπουλος", "text": "Please can you make more COBOL videos?", "likes": 0}}, {"topLevelComment": {"author": "Augusto", "text": "I was using Ryan-Macfarlan’s enterprise COBOL compiler back then in late eighties on an IBM system. I have long forgotten now, brushing up here.", "likes": 0}}, {"topLevelComment": {"author": "DailyMangaREC", "text": "After Clicking the video i expected another wonderful tutorial that would spoon feed me what COBOL is and how to do it. \n\n\nI WAS WRONG. \n\n\nI didn't even watch the video and I think what I read so far far exceeds anything covered in the 1 hour video. \n\n\nClick the link, Ask around, Google, Download, Stay proactive. \n\n\nIt's separating the wheat from chaff!\n\nDon't even watch past 5:20 \n\nClick on the links and get serious. You'll see what I mean!", "likes": 0}}, {"topLevelComment": {"author": "fireball0", "text": "do they use it still? I learned it back in 2000 in undergrad, for fun. I learned RPG also when i was in high school.", "likes": 0}}, {"topLevelComment": {"author": "Ale Lloveras", "text": "2 digits for the year could lead humanity to extinction, that was called i2k centennials 😅", "likes": 0}}, {"topLevelComment": {"author": "Paweł Zięba", "text": "Is cobol a language worth learning as a cloud expert?", "likes": 0}}, {"topLevelComment": {"author": "Ben Dego", "text": "Would Cobol run on Mac M1?", "likes": 0}}, {"topLevelComment": {"author": "Justin Greenfeld", "text": "No ads? This is littered with ads\n\nGood video though for content", "likes": 0}}, {"topLevelComment": {"author": "J Kaushik", "text": "I used to write COBOL program exactly same way. Same comments and *-----------------------------\n         Procedure division\n        *-----------------------------\nVery nice experience of coding in COBOL.", "likes": 0}}, {"topLevelComment": {"author": "Tim Google Boland", "text": "for some reason it bothers me that hes not looking right at the camera", "likes": 0}}, {"topLevelComment": {"author": "Dee Codes Detroit", "text": "I am trying to follow the guide but it says I need to sign up to get the credentials to finish the setup.  Where do I go to register for the credentials? I am on page 14 of the get started manual.", "likes": 0}}, {"topLevelComment": {"author": "Peeter Joot's math and physics play", "text": "I have to laugh at the naive statement that COBOL is easy to understand because it is English like, doesn't account for the function-equivalent in COBOL (paragraph) cannot take parameters, so programs are held together by thousands of lines of global variables without clear connection to where they are used nor why.\n\nAlmost every COBOL program that I have seen so far, unless it is just an experimental toy program, is a horrendous mess of global variables with gotos or other non-obvious control transfer mechanisms that has to be reverse engineered to make the most trivial change, or even understand what it was attempting to accomplish.", "likes": 0}}, {"topLevelComment": {"author": "mo2k2", "text": "hes looking off to the side reading his script and its throwing me off big time lol", "likes": 0}}, {"topLevelComment": {"author": "City Walker", "text": "world need heroes (you not will be modern  but you will be golden) middle age of  cobol programmer 69 years old. But banks not will be change on other  langauage, \"why?? it work!\"", "likes": 0}}, {"topLevelComment": {"author": "John Doe", "text": "where is basic JCL concepts you mention on the video (27:04)?", "likes": 0}}, {"topLevelComment": {"author": "Akshay C", "text": "Is it worth doing a COBOL certification to get your first job as a developer?", "likes": 0}}, {"topLevelComment": {"author": "John Philippe Andam", "text": "Cobol programming language is my basic language i learned from my college course year 2000, cobol - turbo c - turbo c++", "likes": 0}}, {"topLevelComment": {"author": "The_MusicFan", "text": "Writing a program in Cobol is like creating a prayer.", "likes": 6}}, {"topLevelComment": {"author": "Hargunbeer Singh", "text": "did he even teach how to code in the video?!", "likes": 0}}, {"topLevelComment": {"author": "Matthew Kordon", "text": "The thumbnail claims no ads but I experienced several. Very high-quality crash course, so I can't stay mad.", "likes": 2}}, {"topLevelComment": {"author": "Omega_Dawg SuperQue", "text": "i registered for this through ibm, is that how i get my legit url for the z/os? looking forward to learning this.", "likes": 1}}, {"topLevelComment": {"author": "Omega_Dawg SuperQue", "text": "Holy cow. You know, ive been working the oldest government systems. I think...d...dare i say im trying to learn this? I just earned my cissp, i have no idea about coding but it attracts me.", "likes": 0}}, {"topLevelComment": {"author": "Ken Lemmond", "text": "For someone like me who suffers from extreme meticulosity all this structure is making me giddy!!!", "likes": 2}}, {"topLevelComment": {"author": "a_son", "text": "Neat!", "likes": 0}}, {"topLevelComment": {"author": "ZF12", "text": "You: Learning COBOL says \"I want to work on the most important code running on the most important systems running the types of things that the world depends on.\"\n\nMe: I want to learn COBOL because I like money and job security", "likes": 18}, "replies": [{"author": "Fabrice Alcindor", "text": "@Babola10 I would not necessarily advise a young programmer to invest in COBOL while he/she has many year in front of him to learn and develop in trendy language la python and Javascript where the demand is growing.  But for a middle age one, could make sense to slowly ramping-down to retirement on high-compensation job or mission in a low competition environment.", "likes": 0}, {"author": "Babola10", "text": "More than Python, JavaScript?", "likes": 0}, {"author": "Travelator", "text": "Me: I want to learn COBOL because that's the only way I can get a foot in the door in a company that can provide job security.", "likes": 3}]}, {"topLevelComment": {"author": "Elise Scher", "text": "How do I get the book/guide please?", "likes": 0}}, {"topLevelComment": {"author": "Dzmitry Krakadzeyau", "text": "\"STOP RUN.\"? NO-WAY!", "likes": 0}}, {"topLevelComment": {"author": "Mattias", "text": "1:01:53 I really hope they don't teach the kids in American that order of operations: it's incorrect. If you do all additions before subtractions or all multiplications before divisions, you get the wrong result. Normally you are thought multiplication and division at the same time, same for addition and subtractions, but you can also do, brackets, exponents, division, multiplication, subtraction, and then addition.", "likes": 0}, "replies": [{"author": "rodhoutx", "text": "I think he was just just saying the acronym, but didn't explain it in detail.  The acronym is explained in school the right way as you described. Though I think people tend to forget those details unless they work with numbers frequently.", "likes": 0}]}, {"topLevelComment": {"author": "Jake Meyer", "text": "I do always love a good Y2K joke...", "likes": 2}}, {"topLevelComment": {"author": "HR", "text": "Me after hearing that COBOL is surging in Demand hence why I'm here at this tutorial.", "likes": 7}}, {"topLevelComment": {"author": "ss vtb", "text": "Bahut achha dost.", "likes": 0}}, {"topLevelComment": {"author": "ss vtb", "text": "Very nice and good.", "likes": 0}}, {"topLevelComment": {"author": "ZachAndCheese", "text": "thumbnail says no ads\nthe actual video begs to differ", "likes": 0}}, {"topLevelComment": {"author": "Erik Zhou", "text": "My grandma died and now I need to learn COBOL to replace her. :(", "likes": 0}}, {"topLevelComment": {"author": "cts", "text": "Guy doesn't blink except when moving his head in excitement. Very creepy.", "likes": 0}}, {"topLevelComment": {"author": "Andy Liberopoulos", "text": "Awesome tutorial but why have „no ads“ in the thumbnail and then do the opposite?", "likes": 0}}, {"topLevelComment": {"author": "Gerald Britton", "text": "Who is the bearded guy?", "likes": 0}}, {"topLevelComment": {"author": "Bhushan Jungala", "text": "Those who are underestimating COBOL, C and C++ . Should  check performance of these languages. it's very fast. 👍👍", "likes": 8}}, {"topLevelComment": {"author": "Raushon Munni", "text": "This person is crazy. Who uses light theme", "likes": 0}}, {"topLevelComment": {"author": "stephen xu", "text": "How to use jcl to compile and run cobol programs in vs code？ is there any demo jcl for compile and run? or some example, thanks a lot", "likes": 1}}, {"topLevelComment": {"author": "Sharif Musa", "text": "Thanks for  this", "likes": 1}}, {"topLevelComment": {"author": "dietrevich", "text": "Aren't the 12 colonies from Cobol?", "likes": 0}}, {"topLevelComment": {"author": "brett knoss", "text": "4 digits for the year. You need four digits for the year.", "likes": 1}}, {"topLevelComment": {"author": "tonyfremont", "text": "Started programming using COBOL-68 in 1980.  It is a great language when used for what it was designed to do.", "likes": 0}, "replies": [{"author": "tonyfremont", "text": "@Sicket Mög business accounting and report generation mostly.", "likes": 1}, {"author": "Sicket Mög", "text": "What was it designed to do? I landed on this video a bit randomly.", "likes": 0}]}, {"topLevelComment": {"author": "mike chi", "text": "Honestly too much of the face, if you describing division, section... I prefer seeing something else instead of your fat face. I don't need to see you talk all the time. Put on PowerPoint slides over your face.", "likes": 0}}, {"topLevelComment": {"author": "Umar", "text": "The comments section pf this video is great", "likes": 1}}, {"topLevelComment": {"author": "LavaQ", "text": "btw, DD means \"Data Definition\" NOT, data declaration :P", "likes": 4}}, {"topLevelComment": {"author": "AirScholar", "text": "Wish I had a time machine so I can go back to the 70s and get a job in COBOL.", "likes": 4}}, {"topLevelComment": {"author": "ade spade", "text": "Very good intro to Cobol presented by an enthusiastic tutor", "likes": 5}}, {"topLevelComment": {"author": "ade spade", "text": "Make Cobol Great Again.", "likes": 0}}, {"topLevelComment": {"author": "Jeremy Thornton", "text": "STOP RUN", "likes": 0}}, {"topLevelComment": {"author": "anjcastillo", "text": "hello, can anybody tell me what is the purpose of 77 before WHO WHERE WHY RATE HOURS GROSS-PAY at 20:15", "likes": 1}}, {"topLevelComment": {"author": "Ali Ismail", "text": "The presenter's facial expressions make me think he finds me amusing because I am thicker than him. :)", "likes": 0}}, {"topLevelComment": {"author": "Fernando Reyna", "text": "It's not a good sign when one has to install two applications just to get a PDF built for this tutorial...", "likes": 0}}, {"topLevelComment": {"author": "Khandar William", "text": "it looks like he's holding his laughter the entire time reading the prompt", "likes": 11}}, {"topLevelComment": {"author": "Khandar William", "text": "preparation for that mainframe job", "likes": 3}}, {"topLevelComment": {"author": "Priyanshu Saraf", "text": "Never thought cobol was important", "likes": 0}}, {"topLevelComment": {"author": "jai ganesh", "text": "waiting for REXX tutorial!!!", "likes": 1}}, {"topLevelComment": {"author": "Code Forest", "text": "Although I do not know cobol, and I'm not an old programmer, this still feels nostalgic", "likes": 19}}, {"topLevelComment": {"author": "Sokhibjon Zamonov", "text": "Isn't COBOL a very low level language? I thought it already died before  revolutionary C.", "likes": 0}, "replies": [{"author": "Augusto", "text": "Just because it’s easier to code using the right syntax does not make it low grade. How many apps have you created using COBOL and how much have you earned?", "likes": 0}]}, {"topLevelComment": {"author": "Paul Fleischer-Djoleto", "text": "I coded in COBOL in the late 80s. I am happy to revisit it.", "likes": 5}, "replies": [{"author": "J Kaushik", "text": "Truly. It was Era of COBOL.", "likes": 0}]}, {"topLevelComment": {"author": "Mubashar Tariq", "text": "When I started java many years ago, all I needed was a PC. How one can learn COBOL without writing code? Where one would get a MF :)", "likes": 0}, "replies": [{"author": "MrSaabsucks", "text": "Exactly, how in the hell does IBM want to stay relevant when to learn their stuff you need to pay hundreds, maybe thousands of dollars for their courses or mainframe access. Want to learn SQL Server? I can get the SQL Server from MS for a 6-month trial version, and If I want, I can extend it. I took IBM free course Z/IDE, I got free 3-day access to the mainframe, 3-days. I can get 6 months to MS software or 1 year to AWS. IBM needs to change.", "likes": 1}]}, {"topLevelComment": {"author": "Mubashar Tariq", "text": "How many mainframe IBM sold in last 5 year? If someone gives an answer please provide the reference where you got that number. Thanks", "likes": 0}, "replies": [{"author": "francis J", "text": "IBM owns the hardware architecture and OS software end to end which  provides the best possible business transaction processing machine. Much like what apple is doing with its ecosystem hardware to software for the best consumer experience.", "likes": 0}, {"author": "francis J", "text": "mainframes are mainly leased. every two years or so a new mainframe is released and replaces many of the previous versions at many datacenters.. leases are renewed and its a continued cycle. https://esj.com/articles/2008/11/11/leasing-its-mainframe-future--with-an-option-to-buy.aspx", "likes": 0}]}, {"topLevelComment": {"author": "Joe Black", "text": "COBOL WILL NOT DIE. COBOL is like a vampire. I started in computers 1982 this was the main computer language and only on a mainframe computer which could never ever be in a home only in large places with huge AC system to keep those computer mainframes cool .wow stay kicking", "likes": 0}}, {"topLevelComment": {"author": "lucasterable", "text": "Just make sure that the reason you learn COBOL is to *migrate* systems to a more sensible technology.", "likes": 3}, "replies": [{"author": "Hank Jeffries", "text": "Tell me what is a suitable technology for processing a million credit card transactions per day, or tracking a bill-of-materials of a space station?", "likes": 0}]}, {"topLevelComment": {"author": "sreekumar menon", "text": "20k+ views for cobol video!", "likes": 0}}, {"topLevelComment": {"author": "Mike Prytherch", "text": "This takes me back 30 years when I first started, love it", "likes": 45}, "replies": [{"author": "Vinh-An Nguyen", "text": "same here", "likes": 1}]}, {"topLevelComment": {"author": "Reddit News Room", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "Anonymous Zone", "text": "How can i contact you brother my personal issues i give you money please don't ignore my comment 🙏🏻🙏🏻🙏🏻", "likes": 0}}, {"topLevelComment": {"author": "Anonymous Zone", "text": "Sir can i have your whatsapp number...?", "likes": 0}}, {"topLevelComment": {"author": "George Jetson", "text": "Thanks for doing this! COBOL. Learned at uni 40 years ago and worked PT there as an operator.  From System 360 to building and training AI models with Watson Studio.  😀", "likes": 11}}, {"topLevelComment": {"author": "anasvemmully", "text": "Any ways nice to have some class on it ...understanding it...", "likes": 0}}, {"topLevelComment": {"author": "anasvemmully", "text": "Iam wondering what COBOL is capable of....in 2020..?I thought it was abandoned ....don't blame Iam  a toddler in programming.🙃", "likes": 0}}, {"topLevelComment": {"author": "Daniel Eduardo Perez Rossi", "text": "WOW! Awesome work man!", "likes": 0}}, {"topLevelComment": {"author": "Comrade Red", "text": "Hello, world in movies: 201391209489123859032840939032ufijdbcghufwv9124098329742fvyudwgfyy249814729739872rgveugfugr89398981981838e9fhuehf327848139879dhwuiyf2u78378927e8eyfwuery2ry78rty7edgytrfufuierfiurhfuh47eeyre897r7849fure893rehnvid032840939032ufijdbcghufwv9124098329742fvyudwgfyy249814729739872rgveugfugr89398981981838e9fhuehf327848139879d139879dhwuiyf2u78378927e8eyfwuery2ry78rty7edgytrfufuierfiurhfuh47eeyre897r7849fure893rehnvid139879dhwuiyf2u78378927e8eyfwuery2ry78rty7edgytrfufuierfiurhfuh47eeyre897r7849fure893rehnvid09489123859032840939032ufijdbcghufwv9124098329742fvyudwgfyy249814729739872rgveugfugr89398981981838e9fhuehf3278481398gytrfufuierfiurhfuh47eeyre897r7849fure893rehnvid139879dhwuiyf2u78378927e8eyfwuery2ry78rty7edgytrfufuierfiurhfuh47eeyre897r7849fure893rehnvid09489123859032840939032ufijdbcghuf\r\nHello, world in real life: print(\"Hello, world\")", "likes": 1}}, {"topLevelComment": {"author": "CŌVĪD Nüremberg Trials", "text": "Last time I did COBOL and RPG was in 1995.  Is there a way to run RPG in linux yet?  Not the games but the archaic language.  When I first learned python I was thinking, position sensitive?  Is this like RPG?", "likes": 1}}, {"topLevelComment": {"author": "Diablo", "text": "<script>console.log(' sugondese ')</script>", "likes": 0}}, {"topLevelComment": {"author": "Paula Acedo", "text": "Thank you for this tutorial💗", "likes": 1}}, {"topLevelComment": {"author": "Hideoto", "text": "Thanks, but I'm looking for a Goofbal course", "likes": 0}}, {"topLevelComment": {"author": "Bayes TV", "text": "i watched without jump the any frame..\n\n\n\nwith 16x speed.", "likes": 0}}, {"topLevelComment": {"author": "Mark Pflug", "text": "Is this real life?", "likes": 0}}, {"topLevelComment": {"author": "Abel Avalos", "text": "Thank you for this tutorial. I used to teach RM-COBOL/86 back from 1992-1995. From Front-End(GUI)and Back-End(File and Data Management)  to How to print reports... This video was refreshing. But, I don't think going back to it is what we need. Computers are upgrading constantly and so are programming language. Goverment should spend money on computer upgrades instead of  COBOL programmers.", "likes": 2}, "replies": [{"author": "Tuaj Tuam Qhia Sawv Daws (Let Toua Teach You All) ", "text": "Good luck", "likes": 0}, {"author": "J Kaushik", "text": "@ade spade very true. I don't understand why that guy who used COBOL is now questioning on COBOL. No language can compete COBOL. It gives full control to programmer. If the program is written properly will never malfunction.", "likes": 2}, {"author": "ade spade", "text": "many of today's computer and SW problems are caused by over complexity, there's a lot to be said for going back to simplicity.", "likes": 2}]}, {"topLevelComment": {"author": "Solotron", "text": "Just to keep it real, COBOL exemplifies everything wrong with legacy programming: (1) it's verbose, (2) it's not object-oriented, (3) it has program-described files, (4) it uses job control language, (5) it's a beast to modify, (6) it uses fixed-length records, etc., etc.! Every program that used a 2-digit year during the Y2K era had to be examined, changed and tested in a test environment before going live. And what is the output of COBOL? Paper reports. Not exactly a nimble online, interactive system. I don't ever want to go back to 1970s programming.", "likes": 2}}, {"topLevelComment": {"author": "Daniel Esteves", "text": "Hello Watson", "likes": 0}}, {"topLevelComment": {"author": "Larry D", "text": "COBOL devs leaned to use 4 digits for year variables - the hard way.", "likes": 2}}, {"topLevelComment": {"author": "millstonebarn", "text": "Haha. Four digits for the year. Always!!   Only COBOL programmers get this joke.", "likes": 2}, "replies": [{"author": "Admirable Emanuel Aquila", "text": "Y2K...", "likes": 0}]}, {"topLevelComment": {"author": "Fabrication world", "text": "Hi sir", "likes": 0}}, {"topLevelComment": {"author": "Zhenocnra", "text": "I came here because I know we'll need to know COBOL 8 years from now, again. And then another 8 years from now, again.", "likes": 3}, "replies": [{"author": "@?!π", "text": "What's the reason we will need this", "likes": 0}]}, {"topLevelComment": {"author": "Luigi Zambetti", "text": "But is it Cobol still used today?", "likes": 0}, "replies": [{"author": "夏海", "text": "I think banks still use it, because it's too expensive to migrate to something else.", "likes": 0}]}, {"topLevelComment": {"author": "romi_devx", "text": "last time i used Cobol, my computer font color was cyan or green , i think it was on 1988, on PC called  CP500 and i used 5 1/2 floppy disks....", "likes": 1}}, {"topLevelComment": {"author": "Siddharth Jha", "text": "I m young and a COBOL dev☺️", "likes": 1}}, {"topLevelComment": {"author": "Edgar Nova", "text": "If you are learning this, hopefully is to help migrate out of it, not to keep it artificially alive.", "likes": 0}}, {"topLevelComment": {"author": "Yadav Dhakal", "text": "It looks more like sql than programming language", "likes": 2}, "replies": [{"author": "Bastien MILLET", "text": "But SQL is a programming language tho", "likes": 0}]}, {"topLevelComment": {"author": "Hamed Saeednia", "text": "What a waste of time. He was just talking and talking. Not even wrote a single code.", "likes": 1}}, {"topLevelComment": {"author": "Charles EA", "text": "Where is the green screen? No green screen no party! 😂 In my actual company we still have programs running in COBOL and RPG... we are migrating many of them to J2EE with services tho", "likes": 1}}, {"topLevelComment": {"author": "π", "text": "People are talking about cobol but no one talking about light theme.\nmy eyes are burning", "likes": 1}}, {"topLevelComment": {"author": "Zia Rahim", "text": "It's old with no use .", "likes": 0}}, {"topLevelComment": {"author": "Thanatos", "text": "I just finished my bachelor aplied computer science this year, and they told us that COBOL is a dead language. This is the second YT vid about COBOL?? what is going on here? xD", "likes": 0}, "replies": [{"author": "Geert Luchies", "text": "They lied to you, simple", "likes": 2}]}, {"topLevelComment": {"author": "Andres Lizarazo", "text": "He is only reading, but it s ok maybe", "likes": 0}}, {"topLevelComment": {"author": "pocoyo asoy", "text": "Delphi please", "likes": 0}}, {"topLevelComment": {"author": "Ankush Menat", "text": "Blink twice to let us know you're being held hostage by some COBOL advocacy group.", "likes": 118}, "replies": [{"author": "Umar", "text": "True", "likes": 0}, {"author": "Beatriz Mag", "text": "😹", "likes": 1}]}, {"topLevelComment": {"author": "Gabriel Lopes", "text": "🦖🦕", "likes": 0}}, {"topLevelComment": {"author": "Ricardo Bánffy", "text": "Love the font being used for the code examples. Very 3270-ish.", "likes": 7}, "replies": [{"author": "Jeffrey Bisti", "text": "Love a good monospaced typeface", "likes": 0}]}, {"topLevelComment": {"author": "Aromatic Snail", "text": "woah!This boomer programmer must have moisturized A LOT! He looks like a millennial!!!🤣", "likes": 6}, "replies": [{"author": "Jeffrey Bisti", "text": ".... Thank you?", "likes": 4}]}, {"topLevelComment": {"author": "Jimmy", "text": "Where is the time I had to learn Cobol at school 😁", "likes": 3}}, {"topLevelComment": {"author": "Chyke EGL", "text": "I'm so excited! Let's find out how to be a Cobol full stack dev", "likes": 6}, "replies": [{"author": "Vivek Pai", "text": "CICS, Webservices, JCL, DB2 or VSAM, COBOL - And you are a Mainframe Full stack Dev.. 😀😎", "likes": 10}, {"author": "Andres Lizarazo", "text": "Bash, XML, COBOL and dBase  ,,,😏", "likes": 5}]}, {"topLevelComment": {"author": "Xavier I.W.", "text": "OH HELL YES!!! YES!!!!", "likes": 0}}, {"topLevelComment": {"author": "ikuipleksolik", "text": "The pointless side-angle shooting is really annoying.", "likes": 9}}, {"topLevelComment": {"author": "Victor Pinas Arnault", "text": "The IBM Z systems is keeping up COBOL.", "likes": 14}}, {"topLevelComment": {"author": "TokyoXtreme", "text": "Would like to see a few hours on Commodore BASIC or assembly.", "likes": 8}, "replies": [{"author": "Daniel Zheleznov", "text": "@Jeffrey Bisti oh ok my mistake thank you for correcting iy", "likes": 0}, {"author": "Jeffrey Bisti", "text": "@Daniel Zheleznov I wouldn't count out Assembly as a dead language, it's fairly helpful in game development, the Linux kernel space, as well as ARM-based devices. Now that I think about it, I've seen a few very high-profile company rewrite core business logic in assembler to squeeze their operations into slightly fewer machine cycles. Multiplied by billions and billions of calls per day, it starts to add up.", "likes": 2}, {"author": "Daniel Zheleznov", "text": "Samme i also wanna know how to write basic or assem b ley even tho it is a dead language", "likes": 0}]}, {"topLevelComment": {"author": "George Liss", "text": "I thought COBOL was a thing in 1950's LOL", "likes": 2}}, {"topLevelComment": {"author": "Sky Net", "text": "Great, time to dust of those 5-1/4 floppy disks being used as beer coasters. My dot matrix printer powered up with excitement.", "likes": 3}, "replies": [{"author": "Jeffrey Bisti", "text": "That's gotta be some pretty stale beer by now", "likes": 0}]}, {"topLevelComment": {"author": "Федор Лапшин", "text": "Thanks for you. I have tried to find something like this and you made it. Thanks!", "likes": 1}, "replies": [{"author": "Федор Лапшин", "text": "@Jeffrey Bisti Okay... It's your course ?", "likes": 0}, {"author": "Jeffrey Bisti", "text": "We did! Please reach out if you have any questions.", "likes": 1}]}, {"topLevelComment": {"author": "hypeur", "text": "Me :\n - looks for a job on LinkedIn\n - sees IBM recruits COBOL developpers\nYoutube :", "likes": 110}, "replies": [{"author": "Caleb Russell", "text": "Turn off cookies", "likes": 2}, {"author": "Code Forest", "text": "Creepy", "likes": 4}]}, {"topLevelComment": {"author": "mesamunefire1", "text": "I find the hardest part of COBOL is not COBOL but the business processes that are behind the program itself. I worked with COBOL for about 5 years and didn't enjoy how may GOTOs without comments I came across.", "likes": 9}, "replies": [{"author": "Subhasis Dey", "text": "Actually even in Cobol the goto is not recommended. I have seen goto statements mostly in old programs.The Great Grand Pa's hardly followed any coding standards during their time and debugging such programs is one of the hardest things I believe 🤔. But in programs which are comparatively newer \"Perform\" serves the purpose.\nBut yeah I agree with you GoTo is a sucker in any language.😆", "likes": 4}, {"author": "Jeffrey Bisti", "text": "That was my experience as well. It's like writing the sheet music for a song you wrote. If you know the song, writing the music is just a chore, but you have to have the song in mind first. COBOL translates well from whiteboard to source code.", "likes": 1}]}, {"topLevelComment": {"author": "HARRIS LAM", "text": "We can work for the federal government now guys!", "likes": 3}}, {"topLevelComment": {"author": "Al Brio", "text": "Wow!!! is COBOL still alive? I did a search for jobs and did not see a single listing...", "likes": 0}, "replies": [{"author": "Chase", "text": "I checked my area and I saw more than 10 jobs. I was very surprised. The way I see it there's less competition maybe I'll actually learn it lol.", "likes": 4}]}, {"topLevelComment": {"author": "زلزال أندرويد Zilzal Android", "text": "Welcome Please activate contributions Forum so that we can translate the course into Arabic ❤️..", "likes": 1}}, {"topLevelComment": {"author": "Vinay Lobo", "text": "I can feel the excitement on his face, while he explains how important COBOL is... \n\nIt's like people finally care, after years of ignoring him 😜", "likes": 219}, "replies": [{"author": "Nicholas Silva", "text": "You mean that generic smile as he reads a prompter? Anybody can do that...", "likes": 0}, {"author": "Abhishek", "text": "@Jeffrey Bisti you are amazing brother make more videos like this \nI like your energy", "likes": 4}, {"author": "Fox", "text": "could also be the pay he gets from ibm for doing this", "likes": 8}, {"author": "Frame Slayer", "text": "Agreed with excitement, but all I can think of is him trying to keep up with a teleprompter.  The glare in the glasses sorta give it away IMO.  Great info either ways.", "likes": 4}, {"author": "Jeffrey Bisti", "text": "Finally, someone *gets* me!", "likes": 17}]}, {"topLevelComment": {"author": "Chandan Boss", "text": "👍", "likes": 1}}, {"topLevelComment": {"author": "Andrew Clarke", "text": "Cobol is an outdated language for modern times.  Still in use on old legacy systems but knowing COBOL is hardly going to enhance your job prospects.  Stick with learning new evolving technologies.  What next?  JCL for mainframes?", "likes": 0}}, {"topLevelComment": {"author": "vinny142", "text": "36:18 \"but it's easier to read\"\n\nNever say that a syntax is easier to read, because that's 100% subjective.\nFor example; I find Python's syntax much easie rto read:\n\nfor x in range(2, 30, 3):\n  // your stuff here\n\nI find the \"until counter equals 11\" to be  strangely confusing. It sounds like \"stop when you have done this 11 times\", but apparently it means \"stop when you are about to do it for the 11th time.", "likes": 1}, "replies": [{"author": "Jeffrey Bisti", "text": "Point taken. When I said that, I was thinking specifically about being able to show my code to a non-programmer and making sure what I wrote was in line with what they wanted done with the data. They'd probably have an easier time tracing the flow of the COBOL code than the Python code, though I will admit that's usually not a requirement, and like you said, it's entirely subjective. Thank you for watching and providing feedback, though!", "likes": 0}, {"author": "Sir Prize", "text": "Yes, it is subjective. But also for you, the Python loop is only easier to read because you already know Python (I guess). I'm very sure that a person who sees both examples for the first time says that the Cobol loop is easier to read.\n\nBut I agree with you that later on when you're a better it would be very annoying to always read \"until counter equals X\".", "likes": 4}]}, {"topLevelComment": {"author": "Giulian", "text": "Just like Latin is still the official language of Vatican City, COBOL is still the official language of American Bureaucracy", "likes": 158}, "replies": [{"author": "jkmstev", "text": "After 50+ years it is still very boring", "likes": 4}, {"author": "editorcillo01", "text": "And it's possible to change, interpret and enhance software build 50 years ago without crashing 😉", "likes": 7}, {"author": "Set Abominae", "text": "@Mujtaba Mahmood Actually the whole world.", "likes": 8}, {"author": "Mujtaba Mahmood", "text": "COBOL runs America! From Wall Street to  the CIA", "likes": 12}]}, {"topLevelComment": {"author": "Datascience Concepts", "text": "I didn't know people still use COBOL. Very Nice tutorial BTW!", "likes": 1}}, {"topLevelComment": {"author": "TazExprez", "text": "Thank you so much for doing this tutorial!  Thank you freeCodeCamp for putting this on your channel!", "likes": 4}}, {"topLevelComment": {"author": "Ashutosh Tiwari", "text": "People trolling COBOL are some jobless dudes making GUI bullshit in python and calling themselves as programmers ! \nCOBOL is widely used in banking sector upto 98% .", "likes": 1}}, {"topLevelComment": {"author": "Антон Андрусенко", "text": "Deno))))", "likes": 0}}, {"topLevelComment": {"author": "Patrick Bateman", "text": "*Can I make mobile responsive apps with COBOL ?*", "likes": 11}, "replies": [{"author": "Ankush Menat", "text": "It's turning complete so technically yes.", "likes": 3}, {"author": "Jeffrey Bisti", "text": "Nope, but a responsive frontend app could leverage a service on the backend that's powered by COBOL.", "likes": 4}, {"author": "Miguel Domingos", "text": "I am sure you can😎🤣", "likes": 4}]}, {"topLevelComment": {"author": "Fox", "text": "ibm really does need cobol programmers it seems", "likes": 7}}, {"topLevelComment": {"author": "Rahul Ahire", "text": "I just can't imagine that I watched this entire tutorial of this dying programming language which I'll never touch in my life", "likes": 7}, "replies": [{"author": "Rahul Ahire", "text": "@Jeffrey Bisti I completed agree with it", "likes": 0}, {"author": "Raptorzoz", "text": "@Jeffrey Bisti thank you for the upload, might be getting a job writing cobol, with a several month course preceding it, its awesome that there are resources like this to get some initial knowledge on this programming language", "likes": 0}, {"author": "Jeffrey Bisti", "text": "@Rahul Ahire Thank you! It was crazy making these during quarantine times, but I'm glad people are getting use from it. Newer systems like a shiny new z15 mainframe with the COBOL v6.3 Automatic Binary Optimizer? :) \nWe're actually in agreement on older systems, nobody should let their systems get to the point where they're just keeping them on life support. The longer a company waits to take action with their code, the fewer options they have left.", "likes": 2}, {"author": "Rahul Ahire", "text": "@Jeffrey Bisti oh yeah sure, video was dope by the way.\nBut I'd say older systems needed to be replaced with newer ones", "likes": 0}, {"author": "Set Abominae", "text": "People say it is dying since the 80's... And yet here I am, 29 yo, working with Cobol for a big Bank in 2020. Actually, almost all the banks I know uses Cobol.", "likes": 2}]}, {"topLevelComment": {"author": "Estrum", "text": "Banks like it", "likes": 0}}, {"topLevelComment": {"author": "ProgressDay", "text": "I learned COBOL in college. And then went to work on AS/400s. Tips: learn accounting/finance, sql and talking. You will be connecting to ppl walking around in suits. You may also encounter JCL/RPG/Easytrieve languages in your adventures.", "likes": 14}}, {"topLevelComment": {"author": "Ivan Yosifov", "text": "Programming in COBOL - makes you lose the ability to blink xD", "likes": 20}, "replies": [{"author": "V - Sig", "text": "Cannot be unseen ˆˆ'", "likes": 0}, {"author": "Jeffrey Bisti", "text": "Might have overdone the tea that morning", "likes": 1}]}, {"topLevelComment": {"author": "Unlimited Rulebook", "text": "I’m young and even I’m shocked to see this. This is great.", "likes": 36}, "replies": [{"author": "Arunanshu Biswas", "text": "COBOL is great? Are you on premium grade meth?", "likes": 2}, {"author": "ishdx", "text": "gustavo finge where is my 20003km/h of methe", "likes": 1}]}, {"topLevelComment": {"author": "Rodrigo Badin", "text": "COBOL is the Latin of the Programming Languages, it is seems \"dead\" but a lot of people still use it and will never going to stop being used.", "likes": 6}, "replies": [{"author": "Greg Dietrich", "text": "@Caio Matheus Yeah, the sun will burn out in a billion years give or take, so....", "likes": 0}, {"author": "Caio Matheus", "text": "Well, never is a strong word.", "likes": 8}]}, {"topLevelComment": {"author": "IAmAgainst", "text": "Can you make a tutorial about Windows? I heard it's something that allows to use a computer in colors..!", "likes": 26}, "replies": [{"author": "Bhoot", "text": "I wonder what kind of advanced device you are using to chat with us futurelings", "likes": 0}, {"author": "Miguel Domingos", "text": "Lol🤣", "likes": 3}]}, {"topLevelComment": {"author": "Kaustubh", "text": "I don't know what to say 😯", "likes": 0}, "replies": [{"author": "Jeffrey Bisti", "text": "🎶 you're welcome  🎶", "likes": 1}]}, {"topLevelComment": {"author": "Даниил Соловьев", "text": "Странно, я думал, что КОБОЛ ушел уже давно и нигде не используется, как АЛГОЛ и тому подобные. Поправьте меня, если я не прав)", "likes": 3}, "replies": [{"author": "kami_neko", "text": "Он очень активно используется в банковском и финансовых секторах, при этом и уйти с него не могут, т.к. это просто адовое количество кода надо перетащить не прекращая транзакции ни на секунду и поддерживать его уже особо некому, доков часто нет, а прогеров на коболе мало и им лет под 80", "likes": 1}, {"author": "Даниил Соловьев", "text": "​@memberwhen Hey, it's OK. Don't take it into your head :)\r\nМне просто было интересно, как много наших смотрит этот классный канал", "likes": 0}, {"author": "Антон Андрусенко", "text": "Ну тип поэтому и пытаются оживить", "likes": 0}, {"author": "Aleksei Aksenov", "text": "Кровавое легаси", "likes": 1}, {"author": "Shifronim", "text": "Ежедневно этим языком обрабатываются банковские транзакции на сумму три триллиона долларов - докладчик с этого начал:)", "likes": 2}]}, {"topLevelComment": {"author": "Kevin Yohe", "text": "is this punchcards?", "likes": 0}, "replies": [{"author": "Greg Dietrich", "text": "Nah, 3270 terminals", "likes": 0}]}, {"topLevelComment": {"author": "Rahul Ahire", "text": "Why freecodecamp?Why Teaching dying language?", "likes": 4}, "replies": [{"author": "Rahul Ahire", "text": "@Pa Ja node, python Java or Golang and other are 1000x easy to learn than COBOL, 10kx easy to manage and upgrade that doesn't rotten like it. Plus we can code in with x86 or arm architecture which is everywhere unlike mainframe.\n\nDid I forget to add that above methods are also economically superior than COBOL.\nYou can't use COBOL on AWS. I think it can't beat pip and npm ecosystem\n\nIt's the laziness of government and banking sector that haven't upgraded themselves for future proofing.\n\nAnd of course I don't know everything about programming.🙂", "likes": 0}, {"author": "Pa Ja", "text": "@Rahul Ahire That’s exactly the question. Clearly you’ve learned nothing about this language. Like Latin, COBOL has survived for a reason, despite being called a dead language for decades. \nIf you’re just learning it today, you’ll likely never be as proficient as those that learned it decades ago because you don’t have the patience for it. \nThat’s why it’s going to keep surviving, just like Latin.", "likes": 0}, {"author": "passions", "text": "@Ashutosh Tiwari correct bro..", "likes": 0}, {"author": "Giulian", "text": "@Rahul Ahire I guess they went with the \"if it ain't broke, don't fix it\" philosophy", "likes": 1}, {"author": "Rahul Ahire", "text": "@Ashutosh Tiwari the question isn't whether am I fool or not (which I'm) but rather why didn't they updated their backend over coming times", "likes": 0}]}, {"topLevelComment": {"author": "Useful Crewman", "text": "First for this amazing course", "likes": 0}}, {"topLevelComment": {"author": "Joshue Neyra", "text": "Nice!!!! 🙌🏼", "likes": 0}}, {"topLevelComment": {"author": "S", "text": "Wow back in the time, felt like in time machine lol", "likes": 4}}, {"topLevelComment": {"author": "masroor ullah baig", "text": "Awesome video!", "likes": 1}}, {"topLevelComment": {"author": "1 sub before 2021 ?", "text": "If u see this I wish you the best in life and god bless you ❤️💚❤️💚🙏🏼", "likes": 21}, "replies": [{"author": "Ryan Blais", "text": "I’m blind, but thanks...", "likes": 0}, {"author": "Patrick Bateman", "text": "🤣🤣🤣🤣🤣", "likes": 0}, {"author": "Thirsty Fox", "text": "Likewise and good luck on your sub goal!", "likes": 0}, {"author": "Cunningham's Pathe", "text": "facePalm", "likes": 1}, {"author": "Oak", "text": "How", "likes": 1}]}, {"topLevelComment": {"author": "Strenghtbadger", "text": "Right when COBOL programmers are needed in this crisis lmao", "likes": 55}, "replies": [{"author": "Mubashar Tariq", "text": "@JeX IBM was paying for COBOL training. Really!!", "likes": 0}, {"author": "editorcillo01", "text": "@memberwhen 90% of credit card transactions are supported by COBOL...", "likes": 4}, {"author": "Crabby", "text": "@memberwhen It's an exceptionally difficult transition to make, if they wanted to.", "likes": 0}, {"author": "JeX", "text": "memberwhen it's not that simple, works fine, switching could take a decade. I'd rather be the guy maintaining it for millions than the guy rewriting it for 300k a year.", "likes": 6}, {"author": "JeX", "text": "Luca Capelli very much so, the world is truly dependent on old mainframes and scarcely available engineers that know mainframes. IBM was panicking and paying for education for mainframe development / maintenance iirc.", "likes": 1}]}]}