{"video": {"id": "ROjZy1WbCIA", "title": "Linux Operating System - Crash Course for Beginners", "description": "Learn the basics of the Linux Operating System in this crash course for beginners. Linux is a clone of the UNIX operating system, so understanding one is understanding the other. The goal is for you to get a full understanding of how the Linux OS works. If you're still using Windows or Mac OS, you can still learn Linux using a virtual machine.\n\n✏️ Course from KeepItTechie. Check out his YouTube channel: https://www.youtube.com/channel/UCP2bshADPrVMoNrdJvZEQzw\n\n⭐️ Course Contents ⭐\n⌨️ (0:00:00) Intro\n⌨️ (0:08:09) Install Linux\n⌨️ (0:29:43) Desktop Environment\n⌨️ (0:41:18) Terminal\n⌨️ (0:49:25) Working with Directories\n⌨️ (1:15:49) Working with Files\n⌨️ (1:34:49) Working with File Content\n⌨️ (1:51:14) Linux File Structure\n⌨️ (2:03:68) System Information\n⌨️ (2:15:42) Networking\n⌨️ (2:20:10) Linux Package Manager\n⌨️ (2:34:10) Text Editor\n⌨️ (2:46:56) Outro\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT2H47M56S", "likes": "18896", "views": "834776"}, "comments": [{"topLevelComment": {"author": "KeepItTechie", "text": "Thanks for featuring my Content, FreeCodeCamp! Hope everyone learns something from this course! Thanks in advance for watching and please follow me on Youtube for more tutorials and videos: https://www.youtube.com/c/keepittechie", "likes": 499}, "replies": [{"author": "Vincent Angelo Larisma", "text": "I love how slow you talk,. It takes time for my brain to process info and you really helped me. Thank you! (No sarcasm, Just pure appreciation)", "likes": 0}, {"author": "KeepItTechie", "text": "@Kyle Waters This is the link to my user management video. It was made almost 2 years ago so I need to update it but this will help. https://youtu.be/H2u-aXVwvPM", "likes": 0}, {"author": "Kyle Waters", "text": "@KeepItTechie Can you put the link for that video, please? I couldn't find it.", "likes": 0}, {"author": "Kyle Waters", "text": "@KeepItTechie it’s all good. You are by far the best teacher for this.", "likes": 0}, {"author": "KeepItTechie", "text": "@Kyle Waters I took several months reviewing this course upon completion and I never caught that I missed this. Sorry about that. My channel has a video on creating sudo accounts.", "likes": 0}]}, {"topLevelComment": {"author": "JAN PAWEŁ II", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Richard G Buchanan Jr.", "text": "Great tutorial. I messed with Virtualbox several years ago, but I didn't have a guy like you to give me guidance. I forgot all about this app. But I didn't give up on Ubuntu/WSL, though.\nLooks like it is time for me to give Virtualbox another look.", "likes": 0}}, {"topLevelComment": {"author": "Tito Mejia", "text": "Thanks for this tutorial. I am now fan. Looking forward to more tutorials.", "likes": 1}}, {"topLevelComment": {"author": "Mahmoud tolba", "text": "THANKS  MAAAAAAAAAAAAN :)))))))))))", "likes": 0}}, {"topLevelComment": {"author": "David Daniszewski", "text": "This is like Ice Cube's long lost cousin teaching Linux. Dope.", "likes": 0}}, {"topLevelComment": {"author": "Everything Videos", "text": "I used Windows and Mac OS but never used Linux. I don't think I'd enjoy using Linux very much.", "likes": 0}}, {"topLevelComment": {"author": "Sea Gas", "text": "Yes Sir, one of the best ever presentations I have encountered. Thank you", "likes": 0}}, {"topLevelComment": {"author": "Jesso", "text": "You made this so easy to understand. Great video. Thank you! :)", "likes": 0}}, {"topLevelComment": {"author": "dandb", "text": "you will do linux+ comptia course soon? thank you so much man!!", "likes": 0}}, {"topLevelComment": {"author": "Dark knight 864", "text": "Wait so I don’t have any backups or an extra computer so should I install in on the cloud? Very important I’m new to this and would like to clarify", "likes": 0}}, {"topLevelComment": {"author": "Tanja Fijalkowski", "text": "this man is a genius", "likes": 0}}, {"topLevelComment": {"author": "Najib ZAKKABI", "text": "sir, thank you so much for all this nice work \nlots of infos to capture in there\nplz tell us what distro you're using", "likes": 0}}, {"topLevelComment": {"author": "ramu mothukuri", "text": "nice course", "likes": 0}}, {"topLevelComment": {"author": "Harry C", "text": "It sounds like Kanye West teaching Linux :) Great video.", "likes": 0}}, {"topLevelComment": {"author": "Sandra Dorr", "text": "I am enjoying this video and your teaching style.  Thank you for this beginners course!!!", "likes": 0}}, {"topLevelComment": {"author": "gigabashar", "text": "You are just GREAT! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Mason Colby", "text": "I think you can skip adding your ISO in storage. I was having trouble with that. What worked for me -- I found that on the first setting where you name the VM, the drop-down tab below that you can sync it right there.", "likes": 1}}, {"topLevelComment": {"author": "Avijit Pal", "text": "Vim ❤️", "likes": 0}}, {"topLevelComment": {"author": "Ram Prasaant", "text": "Hello , @freeCodeCamp , i am facing error - failed to send host log message . What should i do ? \nThanks in advance", "likes": 0}}, {"topLevelComment": {"author": "Olayemi Danialu", "text": "Thanks Josh for this video. Your approach and pace actually made learning Linux easier.", "likes": 0}, "replies": [{"author": "Motoryzen", "text": "EzeeLinux ( Joe Collins) is another excellent ...chilled out pace source of Linux content.\n\nHis bash script videos are awesome", "likes": 0}]}, {"topLevelComment": {"author": "Dr. Chuby", "text": "My first time ever commenting on a YouTube video. Hands down the best I have seen. Makes it easy for me especially since I'm switching from the medical field , things like these used to look like the Matrix movie to me. Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Microsoft Sarker", "text": "Thank you! I", "likes": 0}}, {"topLevelComment": {"author": "Facundo Nieto", "text": "seguir desde 1:07:36", "likes": 0}}, {"topLevelComment": {"author": "Yeelloo", "text": "Its a great video to start the Linux! good job men!", "likes": 0}}, {"topLevelComment": {"author": "afor odoma", "text": "I am glad I came across this video. Unfortunately, I have not been able to power my UBUNTU in my virtual box. I have tried using the bio mode route to turn it on. It did not work. Tried switching the hypervisor on via  turn windows feature on and off, and it still did not work. Instead it shows the message \"Hyper-V cannot be installed. The processor does not have required virtualization capabilities\". What would you advise? Are there other ways I can use UBUNTO without he virtualization capabilities?", "likes": 0}}, {"topLevelComment": {"author": "Amit Jaiswal", "text": "Very very enough Heartily forever ---000🇹🇱🇼🇸🇹🇱🇹🇱🇿🇼🇿🇼🇹🇱🇿🇼🇽🇰🇹🇱🇽🇰🇹🇱🇽🇰🇹🇱🧥🔊🔊👙🔊🇬🇶⛸️👘⛸️🏒🤔😱😱🤔🤨🤔😝🤔🤔😝🤔😌😞😞😖😵😣😿😿😾😻💖💖👨‍👧‍👦👩‍👩‍👧‍👧👩‍👩‍👦👩‍👧‍👦👩‍👩‍👧👩‍👩‍👧‍👧👪👨‍👨‍👦‍👦👩‍👩‍👧‍👧🗣️👩‍👩‍👧‍👧🗣️👤👩‍👩‍👧‍👧🤱👩‍👩‍👧‍👧🤰🤰🤱👤👤👥🌈🌧️🌦️☁️🌧️🌨️🌧️⭐🌓🦏🦍🦇🦍🐏🦍🐖🦘🐓🚗🚲🚒🚜🚜🚕🏎️🚒🚕🚌🚑🎥🎟️👢👟🥾💎💄⚗️💄⌚🕦⌛⌚📢🛎️🛎️♎🔺🔺⛎❗⏏️🔊🎼☢️🎵🇧🇦🇦🇼🇦🇿🇧🇳🇦🇿🇲🇼🇲🇼🇳🇦🇲🇽🇲🇾🇳🇷🇲🇾🇲🇾🇳🇺🇲🇴🇺🇿🇻🇦🇻🇦🇻🇨🇻🇨🇼🇸🇿🇼🇼🇸🇽🇰🇿🇼🇾🇹", "likes": 0}}, {"topLevelComment": {"author": "blackpanther6389", "text": "I know this is the least important aspect of your generosity, but it's nice to see black people doing educational things like this in the IT field. I just landed my first job as a software developer so it's very exciting to take in all of this knowledge and be able to apply it in a professional setting. Thank you for this!", "likes": 5}, "replies": [{"author": "blackpanther6389", "text": "@BruceLee'sDJstudio I got an associates at a community college for secure software development. Currently doing front end web development", "likes": 0}, {"author": "BruceLee'sDJstudio", "text": "awesome, did you have a bachelors, want to get into it too", "likes": 1}]}, {"topLevelComment": {"author": "Alexis Reid", "text": "Actually Unix was Linus torvolt", "likes": 0}}, {"topLevelComment": {"author": "Eyad Abuelezz", "text": "Thank you , great tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Gamer Account", "text": "Wow. No offense. But I am really proud that a black man is giving a course on Linux. Keep it up. I fully support", "likes": 0}}, {"topLevelComment": {"author": "SunnykGaming", "text": "this it literally all you need to do to grasp most day to day linux admin tasks. thanks alot", "likes": 0}}, {"topLevelComment": {"author": "George Piersall", "text": "Sir, Thank you so much for this video. I am currently in college for CIS-1107 - Intro to operating systems.  It's a section of my Cyber Investigations degree. I didn't know squat about using the terminal except maybe dos commands like \"ping.\"  This video really helped me understand the chapter I am about to read. Thanks again. Your efforts do not go unnoticed.", "likes": 4}}, {"topLevelComment": {"author": "Георги Карапеев", "text": "Hoard disk", "likes": 0}}, {"topLevelComment": {"author": "Vincent Padilla", "text": "any tips for installing ubuntu on a mac?", "likes": 0}}, {"topLevelComment": {"author": "Cholo Ghuri Bangladesh", "text": "A best into course for linux beginner. Thanks for your time. And also thanks freecodecamp.", "likes": 0}}, {"topLevelComment": {"author": "Amna Murtaza", "text": "Thanks for this great course!\nIt helped me a lot.", "likes": 0}}, {"topLevelComment": {"author": "aquinasd", "text": "He said 'the best way to become a guru is to keep using Linux'. Definitely motivated to learn more. Thanks as always.", "likes": 0}}, {"topLevelComment": {"author": "The Instant News ", "text": "I love his accent.", "likes": 0}}, {"topLevelComment": {"author": "Md Ismail Hossain Emon", "text": "good jobs", "likes": 0}}, {"topLevelComment": {"author": "Alexio Catan", "text": "“first command im finna show you” learn to speak english", "likes": 0}}, {"topLevelComment": {"author": "Alexio Catan", "text": "hord disk", "likes": 0}}, {"topLevelComment": {"author": "Mr2009KEVIN", "text": "yo can someone please help me understand. Like SOS!\n\nSo is Linux Kernel an OS?\n\nor\n\nKernel and OS are different.", "likes": 0}}, {"topLevelComment": {"author": "Question the Truth - Querzion [One]", "text": "Why the fudge would you teach a beginner to use the terminal? Windows also has a terminal, it's never talked about because it's a POWER TOOL. Not needed to be used by average users. What is it that you need to use the terminal for in a Ubuntu distribution anyways?", "likes": 0}}, {"topLevelComment": {"author": "Sulayman Matkuliyev", "text": "Thank you FreeCodeCamp and KeepItTech/Josh for nice tutorial 🙂", "likes": 0}}, {"topLevelComment": {"author": "Montrachaz", "text": "thanks man", "likes": 0}}, {"topLevelComment": {"author": "smoking one", "text": "Josh is the coolest dude who ever talked about linux :)", "likes": 0}}, {"topLevelComment": {"author": "Fedor Svisa", "text": "never thought Ice Cube would be teaching me Linux", "likes": 0}}, {"topLevelComment": {"author": "C.Michael Tracy", "text": "Bruh….  You did that.   Thank you for sharing your knowledge.", "likes": 0}}, {"topLevelComment": {"author": "rustavellyne", "text": "thank you - man!", "likes": 0}}, {"topLevelComment": {"author": "Derryl Sanders", "text": "great video man, thanks for the info", "likes": 0}}, {"topLevelComment": {"author": "Chrs P", "text": "Bit confused in the first 20mins - If downloading is problematic to hard drive what does Virtual box do instead ? I see the download is still emphasised but cant determine yet what method is being chosen to run linux on an average PC with windows.", "likes": 0}, "replies": [{"author": "Chrs P", "text": "​@Robert E. Ok I was able to focus on trying to do this again. I have read a number of excellent  tutorials  and they all say to use an image . Or they say install an image .Or they say run virtual install disk. It appears to be very manual setup but nowhere do they say .e.g   Obtain this file . Install this particular file . Run that file . Now Install this file. The tutorials say search for file x without detailing exactly which file as many similar ones are presented. For example these tutorials assume we know where the ignition key goes in the car but havent explained how we first  open the door , how to install ourselves where the ignition key is and where to insert  the key.", "likes": 0}, {"author": "Robert E.", "text": "So, most people turn on their comp and their OS (windows, linux, whatever) eventually loads.  This is because pressing the power button basically initiates BIOS on the motherboard and then BIOS initiates the OS on the hard drive.  \n\nWith a \"Virtual Box\" the OS isn't on the hard drive, but some other media (typically a Flashdrive/USB stick or a DVD).  So you press the power button, that initiates the BIOS on the motherboard,  and then the BIOS initiates the OS *on the virtualbox* (e.g. flashdrive/USB stick), completely bypassing the hard drive altogether.\n\nWith this setup, you can forever use Linux on the Virtualbox and never truly install it on your comp, OR, from the virtualbox, you can then install Linux on your harddrive (which is sort of synonymous saying that your installing it on your comp).\n\nIn this situation,  the OS the computer is running is not Windows, or MacOS, or whatever, it's the Linux distro (e.g. Ubuntu, RedHat, etx.) on the Virtualbox media.\n\nYou can install Linux (or really ANY OS) on a computer in addition to Windows (for example installing multiple harddrives each with its own OS or one large harddrive with correct \"partitions\"), but regardless of the method, with this type of setup, you can only boot into one OS at a time.*\n\n*when properly done, each time your comp starts up, you go into BIOS and select which OS you want to load, or you can sort of throw a tiny program inbetween the BIOS to OS sequence, a program like GRUB for example, so after the BIOS starts, it starts GRUB and then GRUB says, \"hey, user, you got more than one OS on this thing.  Which one would you like to boot into today?\"", "likes": 0}]}, {"topLevelComment": {"author": "Nick Leeds", "text": "Lost me after he started talking about virtual box at 2:35, where exactly do you find the virtual box application??", "likes": 0}, "replies": [{"author": "Javier Flores", "text": "Download and install it from the VirtualBox page. I can't post links since YT will delete my comment, but you can easily search for it on Google.", "likes": 0}]}, {"topLevelComment": {"author": "Moataz Abdelraouf", "text": "I am having difficulties running the Linux Ubuntu VM, I reached 23:13 but when I attempt the 'normal start' I get an 'aborted' error : Linux, Networking Qs, Assembly type questions\nUnsupported CPU (VERR_UNSUPPORTED_CPU Result Code: NS_ERROR_FAILURE(0X800004005) Component: ConsoleWrap Interface: Console{6ac83d89-6ee7-4e33-8ae6-b257b2e81be8} Can anyone please help me understand what the issue is", "likes": 0}}, {"topLevelComment": {"author": "chiqiang", "text": "using this and never lagging", "likes": 0}}, {"topLevelComment": {"author": "blazingwraith", "text": "what linux is the instructor using?", "likes": 0}}, {"topLevelComment": {"author": "soporte linux", "text": "hello friend , why do not you use ubuntu like yoour first operating system?", "likes": 0}}, {"topLevelComment": {"author": "Barry Chuckle", "text": "I'm only an hour in, but this is fantastic. It's exactly what I've been looking for. Online articles are so confusing. You explain it so well; for example, saying to use the arrow keys to go up and down the manuals. Thank you!", "likes": 2}}, {"topLevelComment": {"author": "Almog Arazi", "text": "thank you so much bro", "likes": 0}}, {"topLevelComment": {"author": "xno fox", "text": "Solid video - thank you!", "likes": 0}}, {"topLevelComment": {"author": "Dean Haycox", "text": "Not able to install , getting a back screen, any recommendations ??", "likes": 0}, "replies": [{"author": "Chrs P", "text": "which option did you chose to install . He doesnt appear to have clarified the actual option for smooth operation.", "likes": 0}]}, {"topLevelComment": {"author": "Oyemomi Mayowa", "text": "Thanks for the crash course @keepittechie, please, if I may ask, is there a way to input a line of text or text into different files using a single command?", "likes": 0}}, {"topLevelComment": {"author": "Zahid Kumail", "text": "I have a problem while downloading the ubuntu by VirtualBox \n\nFailed to open a session for the virtual machine Ubuntu ZAK.\r\n\r\nNot in a hypervisor partition (HVP=0) (VERR_NEM_NOT_AVAILABLE).\r\n\r\nVT-x is disabled in the BIOS for all CPU modes (VERR_VMX_MSR_ALL_VMX_DISABLED).\r\n\r\nResult Code: E_FAIL (0x80004005)\r\nComponent: ConsoleWrap\r\nInterface: IConsole {872da645-4a9b-1727-bee2-5585105b9eed}\r\n\r\nKindly guide me", "likes": 0}}, {"topLevelComment": {"author": "Mikael Arhelger", "text": "Why do you call Linux an OS when it is actually a Kernel?", "likes": 0}}, {"topLevelComment": {"author": "Ibraheem A. Rekany", "text": "Start", "likes": 0}}, {"topLevelComment": {"author": "Carnelian Knight", "text": "wish we had intermeddiate mini courses too. I know my basics like a desktop environment and the terminal and different distributions but I wanna get to the advanced stuff. But this course is pretty great. Nails the basics and helps set people up for using linux all the time.", "likes": 1}}, {"topLevelComment": {"author": "petra", "text": "THANK YOU SO MUCH!!!!", "likes": 0}}, {"topLevelComment": {"author": "JarppaGuru", "text": "31:06 now this is ubuntu/gnome crash course. can we get to linux crash course like black screen BASH. yes thats linux if want IT. who use GUI?if you are IT you SSH from windows or mac and you get bash xD why waist bandwith to send desktop that you not need!", "likes": 0}}, {"topLevelComment": {"author": "JarppaGuru", "text": "13:36 now you showing how linux install fresh clean machine. just like switch windows HDD of machine and put new HDD. to get mack windows just change drive. that easiest for \"crash course\" you need this if go IT. fail! you allready know if you think IT lol.\nthis is for windows peeps! and lets install server version bcoz if want learn linux its BASH! not gui", "likes": 0}}, {"topLevelComment": {"author": "JarppaGuru", "text": "10:13 fail! just boot that livecd and and click \"try\" thats all bout lesson need know. and if install linux for that need clean system or switch new HDD its that easy. your window system not touched at ALL. if want windows back switch HDD . easiest no multiboot no write any linux files even elf partition, but its linux livecd and its tutorial use \"live\" and its just gui if used windows can use linux gui but its not mean you can use macos thats so friiking stupid cant even find copy/paste any menu. user not need go top of screen select copy when it should be mouse right click menu LOL", "likes": 0}}, {"topLevelComment": {"author": "kauigirl808", "text": "Thank you for this. My friend is giving me a laptop that uses Linux OS. And I have no idea how to use it.", "likes": 0}}, {"topLevelComment": {"author": "demos113", "text": "Many thanks.  🙂", "likes": 0}}, {"topLevelComment": {"author": "JeSuisNerd", "text": "57:21 Just a tip: there's no man page for 'cd' because it's a shell built-in (bash does this).  You can get an equivalent help page with 'help cd' though!", "likes": 0}}, {"topLevelComment": {"author": "Cervo532", "text": "My brothers a Raiders fan I got him on Linux he was tired of the Windows 10 updates, he's been on Ubuntu for about 3 years now.", "likes": 0}}, {"topLevelComment": {"author": " Cyber Security Women(CSW) Cources", "text": "https://www.youtube.com/channel/UC9zVmz9afR7wIfE_xLPbwCg", "likes": 0}}, {"topLevelComment": {"author": "Jeevisoft ", "text": "Nice video for linux thank you\nFor more information about linux\nConnect with https://youtube.com/channel/UCW_gywl69bHD0BCVSytjs_A", "likes": 0}}, {"topLevelComment": {"author": "ogbuagu ifunanya", "text": "I have been  having issues inserting Guest Additions CD image on my ubuntu...please any solutions?", "likes": 0}}, {"topLevelComment": {"author": "JULIUS NANI GADAH", "text": "this is a great course", "likes": 0}}, {"topLevelComment": {"author": "Alejandro Suarez", "text": "Hello, no matter what I do I always get the error message:\r\n  [     0.133528] RETBleed: WARNING: Spectre v2 mitigation leaves CPU vulnerable to RETBleed attacks, data leaks possible!\r\n/dev/sda2: clean, 213060/622592 files, 2367718/2489856 blocks\r\n  [     2.008807] mtd device must be supplied (device name is empty)\r\n  [     2.166669] [drm:vmw_host_printf [vmwgfx]] ERROR Failed to send host log message\r\n\r\nI have watched multiple videos and read many forums but can't seem to find the fix anywhere. Any help is greatly appreciated!", "likes": 0}}, {"topLevelComment": {"author": "Elvis Gbolonyo", "text": "I don't know if you touched on, how to expand the Ubuntu desktop after setting it up in the VirtualBox. I tried the maximize tab but that didn't work. Thank you", "likes": 0}}, {"topLevelComment": {"author": "Le Thinh Andrew", "text": "That's an awsome tutorial thanks for your efforts", "likes": 0}}, {"topLevelComment": {"author": "Ramsty Don", "text": "I installed the ubuntu on the laptop. It installed, lots of files like boot, disk, casper etc appeared on a Drive D. not sure what to do next or get ubuntu running. This is my first time using linux or ubuntu. little help here", "likes": 0}, "replies": [{"author": "Frenchman Op", "text": "Those are i think windows staff", "likes": 0}]}, {"topLevelComment": {"author": "Camille Williams", "text": "Thanks for a great course. Very engaging. I enjoyed this a lot. 🎉", "likes": 0}}, {"topLevelComment": {"author": "Associate Minister & Reserve Deacon Mr. Terry Jones", "text": "A. Mr. Josh Do you think knowing The 8 Major Distribution Families help you understand Linux and and help you provide technical support for Linux?\n\nB. The 8 Major Distribution Families Are.\n1. Arch\n2. Debian\n3. Fedora\n4. Gentoo\n5. openSUSÉ \n6. Slackware \n7. Ubuntu\n8. Independent Distributions (Distributions not based on the 7 other Distributions listed above.) \n\nC. Mr. Josh please continue to get on life's stage and let your Godly inner light shine. Please continue to climb life's ladder and let the world see The Great and Wonderful Gifts, Talents, and Treasures that are inside of you.\n\nD. Mr. Josh You're a Great Gentleman!!! \nE. Mr. Hosh Please stay safe.  \nF. Mr. Josh God Bless You!!!", "likes": 0}}, {"topLevelComment": {"author": "Joy Utopia", "text": "ice cube vibes", "likes": 0}}, {"topLevelComment": {"author": "David Palm", "text": "Thanks. Good review!", "likes": 0}}, {"topLevelComment": {"author": "Subhi Sadik", "text": "can anyone help i want to install virtual box in ubuntu and use windows", "likes": 0}}, {"topLevelComment": {"author": "Simple DevOps", "text": "I have just finished this Linux Crash Course! Very clear and good explanation! Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Rob Bellacera", "text": "Damn, this is my 2nd week in trying to learn this and you have broken it down in such a simplistic manner. Much appreciated and you're teaching is so chill. Good job!", "likes": 1}}, {"topLevelComment": {"author": "Mina Naseh", "text": "(2:03:68) System Information is not hyperlinked", "likes": 0}}, {"topLevelComment": {"author": "Blue Dog", "text": "I’m having trouble getting a new os to work on my raspberry pi 400, I could really use some help", "likes": 0}, "replies": [{"author": "Frenchman Op", "text": "Just install Manjarolinux  arm version and then you will be good to go", "likes": 0}]}, {"topLevelComment": {"author": "Pandy official", "text": "how to stop hearing yourself in headphones when recording softs?", "likes": 0}}, {"topLevelComment": {"author": "L R", "text": "thanks man!!!", "likes": 0}}, {"topLevelComment": {"author": "manny CARRION", "text": "Linux got its name from the man who created Linux that is Linus the other guy he my have made the kenal but linus is the one who fix the kernal", "likes": 0}}, {"topLevelComment": {"author": "Omega Giga", "text": "Thank you, using cl is quite fun!", "likes": 0}}, {"topLevelComment": {"author": "Nick 111", "text": "40:00 Hahaha! ...Power of linux is in its command line. 😂 Linux ppls are really proud of their command line interface or say smitten by that. Kisi gyani purush ne sahi kaha hai \"Dil aaya gadhi pe toh pari kya cheez hai\" 🤪", "likes": 0}}, {"topLevelComment": {"author": "Victory Dickson", "text": "what video is next? I just started my journey into cloud architecture and linux is said to be compulsory", "likes": 0}}, {"topLevelComment": {"author": "ghostFace_murderer", "text": "\"No Space Left on Device\" when I use mkdir", "likes": 0}}, {"topLevelComment": {"author": "Andre Vinicius Bezerra da Silva", "text": "thanks this tutorial helped me a lot", "likes": 0}, "replies": [{"author": "Andre Vinicius Bezerra da Silva", "text": "parei em 1:16:00", "likes": 0}]}, {"topLevelComment": {"author": "Lisanne Schop", "text": "This is very helpful. I will be rewatching it and following along", "likes": 0}}, {"topLevelComment": {"author": "TheEndTrend", "text": "FCC is so awesome! 👏 😎", "likes": 0}}, {"topLevelComment": {"author": "Steven Lim", "text": "@KeepItTechie Thanks for the effort in producing this 2 hour plus video. I finished every second of it. As a beginner in Linux, i am now more confident of using ubuntu with the terminal mode.", "likes": 2}}, {"topLevelComment": {"author": "Daad AbdelRahman", "text": "thank you for the great video it really opened my appetite to learn more on linux, thank you very much.", "likes": 0}}, {"topLevelComment": {"author": "Aces", "text": "PSA / reminder: VirtualBox is not available for silicon MacBooks", "likes": 0}}, {"topLevelComment": {"author": "Suck my GME - Darck", "text": "absolutely amazing. thanks for this it's exactly what I have been wanting.", "likes": 0}}, {"topLevelComment": {"author": "piku", "text": "switching from windows to linux..very well explained, thanks a lot!<3", "likes": 0}}, {"topLevelComment": {"author": "Bo Jiang", "text": "Great course. Love it! Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Amgad-Ebaid", "text": "Oh man its a lot of man 🤯", "likes": 0}}, {"topLevelComment": {"author": "kz_cbble", "text": "1:52:45", "likes": 0}}, {"topLevelComment": {"author": "حسان البيوك", "text": "Very good explanation, but My friend got it wrong, the commands like cd , pwd are just commands built with the shell and not found in the /bin folder", "likes": 0}}, {"topLevelComment": {"author": "Edilmar", "text": "Gracias, felicidades muy buen curso, me dieron ganas de seguir investigando, cómo usar el editor de texto, la parte de networking", "likes": 0}}, {"topLevelComment": {"author": "Robert Phillips", "text": "Excellent introductory course, thank you. It's quite a brain strain to go from GUI to command line but worth it in the end. Two very minor comments, neither of them reduced the huge value of the course, I'm only mentioning them in case they help. At about 1h20 you used 'cd ..' but hadn't mentioned '..' before. Also in the section on 'apt' a quick description of what a linux 'package' is might help. Thanks again for a really helpful video.", "likes": 1}}, {"topLevelComment": {"author": "Internet Moddi how is my Internet support channel!", "text": "I can’t use VirtualBox on my MacBook Pro with 1 M with Touch Bar 2020 Edition! I hope it will be possible very soon! I have used Ubuntu on my PC laptop for some years ago, I have windows 10 on in because Wi-Fi  stopped working, my old PC laptop can only use with cable, for battery don’t work anymore! My 9 year old MacBook Pro 2012 edition how I get to my 40 years day 1 week beboer my 40 years day! It very good and nice if I can use Ubuntu on VirtualBox very soon so I can give away my old PC laptop, I Parallels Desktop is to expensive to use for me! It will be good and nice to use MacOS, windows 11, Ubuntu and more Linux distributions on same MacBook Pro! For I don’t have money to pay for morel computers! I will like to also have windows 10 and windows 11 on same computer! It is very good and nice to have many different OS or distributions of same OS for do computer support for more persons and people!", "likes": 0}}, {"topLevelComment": {"author": "LIFE SHOWTVFORALL", "text": "I really need your help I have setup kali Linux as second system but I can’t use WiFi because no adapter found", "likes": 0}}, {"topLevelComment": {"author": "Nicholas B", "text": "2:16:48 I found out that net-tools is discontinued thanks to arch linux wiki (YouTube wont let me paste the link you can search it if ya want source😓)\n\nNet-tools are deprecated on Arch and Ubuntu. Use iproute2.\n\nReplacement commands\nip neighbor (arp)\nip address, ip link (ifconfig)\nss (netstat)\nip route (route)", "likes": 1}}, {"topLevelComment": {"author": "Melissa Rainchild", "text": "hitting the Like from the intro on...super stuff, thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "04ELY", "text": "I know it's for the algorithm and I will thank you anyway but people, there's a distinction between the Linux OS and the shells. These programming related channels will obviously only teach you the command line interface but this is not Linux as a whole, this is just a part of it used in software development etc. Please stop giving the image of Linux = bash. I know dozens of people who think linux is the \"command line operating system\" similar to something like DOS. It may have the best command line interface but it's just a feature among the many. It has much more than the command line. It's something you can use. Anyway, thanks for making the course, will be helpful for software beginners but I clearly dislike the title.", "likes": 1}}, {"topLevelComment": {"author": "Temirlan", "text": "That’s what I needed, thanks", "likes": 0}}, {"topLevelComment": {"author": "Salaheddin AbuEin", "text": "Thank you.", "likes": 0}}, {"topLevelComment": {"author": "booqs", "text": "BRING KEEP IT TECHIE BACK!!!!!!! this was such a great and easy course to follow. please more of him for cyber security!!!!! THANK YOU FREECODE FOR THE ALL THE CONTENT!", "likes": 0}}, {"topLevelComment": {"author": "rgt35", "text": "Thanks for sharing.\nMr Josh.Good Job.", "likes": 0}}, {"topLevelComment": {"author": "Linux Administrator", "text": "If anyone wants complete LINUX notes ...we will provide...dm me", "likes": 0}}, {"topLevelComment": {"author": "K.Y", "text": "i was stupid enough to borrow intro linux textbook from library. \nand i find this video now. Great thx and you save my life!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Mau Ulate", "text": "Hey man great videos, when are you releasing the entire course for the Linux + certification?!", "likes": 0}}, {"topLevelComment": {"author": "Kilo J", "text": "This video was awesome! Thank you for doing this! It was extremely helpful. You're a great instructor!", "likes": 3}}, {"topLevelComment": {"author": "SprtWlf9", "text": "I always enjoy this channel. Everything is explained so well and not in a rush. Very easy to understand even for beginners. Excellent.", "likes": 3}}, {"topLevelComment": {"author": "Thatoyaone Bogopa", "text": "But really tho, How do I exit VIM?", "likes": 0}}, {"topLevelComment": {"author": "Jace D", "text": "Great video , I appreciate the info and how you presented it. thanks", "likes": 0}}, {"topLevelComment": {"author": "Saad Fathallah", "text": "how to install for windows please?😇", "likes": 0}}, {"topLevelComment": {"author": "Raphael Gman", "text": "This was an outstanding presentation, I've learned a lot, can't wait to absorb the next course from you. Some just know how to teach and some just confuse you my friend are the 1st.", "likes": 3}}, {"topLevelComment": {"author": "Chris Beasley", "text": "Excellent video.  Really appreciate the time, effort and pace.", "likes": 0}}, {"topLevelComment": {"author": "jcsnoopy", "text": "Just watched this and was able to run Ubuntu on VirtualBox for the first time in my life. Thank you for the video!", "likes": 0}}, {"topLevelComment": {"author": "Mahure Natasia", "text": "It's similar to git bash. Thank you soo much I've learnt alot deleting directories, putting files inside a file inside another file 😂thnx man.", "likes": 0}}, {"topLevelComment": {"author": "Turo_13", "text": "I can’t download virtual box on my Mac M1 cus it only runs on amd64 architecture, can I continue this crash course without this?", "likes": 0}, "replies": [{"author": "Javier Flores", "text": "A lot of the commands on Linux work on Mac. Ideally, you want to practice on a Linux system. I know Parallels for Mac supports M1 CPUs and you can install Linux that way. I don't think Parallels is free, though.", "likes": 0}]}, {"topLevelComment": {"author": "Stephen Munyiri", "text": "Thank you so much", "likes": 0}}, {"topLevelComment": {"author": "Scott", "text": "Excellent video with a great presentation style love this video easy to follow and understand please do lots more videos as you are perfect at teaching people in this way 😀", "likes": 0}}, {"topLevelComment": {"author": "Siam Imam", "text": "Thanks for being such a great teacher!! I learned so much. x100 better than all my college professors LOL", "likes": 0}}, {"topLevelComment": {"author": "Skeggjold Lokkar", "text": "You laid that out well thank you", "likes": 0}}, {"topLevelComment": {"author": "Achraf Karabila", "text": "Thank you Ice-Cube", "likes": 1}}, {"topLevelComment": {"author": "shank2340", "text": "I wish the LS command would default to -L (list view) all the time.\nBut what do I know, being an Amiga user.\nMaybe there is a DIR command that does this.\nThe biggest hurdle for me has been understanding adding programs to the system which is \"supposedly\" much easier than Windows. Hopefully this will be cleared up in this video.", "likes": 0}}, {"topLevelComment": {"author": "Phillyrebel", "text": "Can I get into the field with Coursea courses?", "likes": 0}}, {"topLevelComment": {"author": "Orter", "text": "Now I just need to learn programming, buy tons of black hoodies and BAM ! Hacker", "likes": 0}}, {"topLevelComment": {"author": "Bad Santa", "text": "Is linux used in the hood?", "likes": 1}}, {"topLevelComment": {"author": "George Demetriou", "text": "Thank you for this amazing introduction course to Linux!", "likes": 0}}, {"topLevelComment": {"author": "Mainevent93 Manny", "text": "Thank you, very much for this video.  I actually subscribed to the channel.  Can't wait to watch more videos.", "likes": 0}}, {"topLevelComment": {"author": "Amir", "text": "I am getting an error while installing latest updates (sudo apt upgrade) where it is saying \"You don't have enough free space in var/cache /apt/archives/. Please help as I am a total beginner :(((((( Thanks", "likes": 1}}, {"topLevelComment": {"author": "Godwin Uche", "text": "How do I practice commands on Linux if I don’t have enough files on my new system ? Please someone should help out I need a file to download", "likes": 0}, "replies": [{"author": "Javier Flores", "text": "Just download whatever files you want from the internet. That's how I would go on about it. You can download music, pictures, programs, etc", "likes": 0}]}, {"topLevelComment": {"author": "Godwin Uche", "text": "I just bought a new laptop where can I get files to practice Linux with ? You said you downloaded some files right ? Can you please put the link of the files for us to follow along in this course", "likes": 0}}, {"topLevelComment": {"author": "emma chuks udeji", "text": "Hello, thanks for this. I have questions.\n\n1. How do I connect the virtual box to internet. Or the Ubuntu I installed in virtual box to access the internet.\n\n2. The display settings of virtual box is set at Width 480px and height 640px. I want to change it but it is not granting me the permission to do that. My Ubuntu machine is looking like a small image on my wide screen. I want to change it.\n\nKindly help...", "likes": 1}}, {"topLevelComment": {"author": "Bloom", "text": "Wow", "likes": 1}}, {"topLevelComment": {"author": "Shahzad Mughal", "text": "41:22", "likes": 0}}, {"topLevelComment": {"author": "Ilya Price", "text": "Please, please, don’t teach “rm -rf” as a norm or another way to delete directories. It’s not safe. Please use this command sparingly and/or as last resort.", "likes": 0}, "replies": [{"author": "Mark H", "text": "I agree, better use rmdir dirname or rm -d dirname\nexample: rmdir test or rm -d test\nto avoid accidentally delete needed files or directories.", "likes": 0}]}, {"topLevelComment": {"author": "Atube Viewer", "text": "Ubuntu says - Please remove the installation medium then press enter. No idea where to do this or how?", "likes": 0}}, {"topLevelComment": {"author": "Rudy Lantican", "text": "Great tutorial! Super easy to understand!", "likes": 0}}, {"topLevelComment": {"author": "Raptor 09", "text": "Probably the best and most patient explanation of Linux of beginners out there. I've subscribed to your channel. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Just-Me -Cyber", "text": "Thank you Josh,   I am a College Student, age 48... You have been a Great Help to Me in my education, I Will watch this Video A few more times. Thanks man!!!", "likes": 0}}, {"topLevelComment": {"author": "Shayan", "text": "Thanks a lot <3", "likes": 0}}, {"topLevelComment": {"author": "Anu", "text": "I can't like this video enough. It's been so helpful!", "likes": 1}}, {"topLevelComment": {"author": "NemophilistPNW", "text": "1:15:00 Alternatively: rm Linux -rf", "likes": 0}}, {"topLevelComment": {"author": "N bent", "text": "A truly comprehensable tutorial for Linux begginers. Thanks a lot!", "likes": 1}}, {"topLevelComment": {"author": "Anthony Ryan", "text": "Good vid Guru Josh", "likes": 0}}, {"topLevelComment": {"author": "Gangyu Pan", "text": "Thanks for your sharing. It is so amazing for the all linux command line!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Taiwo Taiwo", "text": "Very solid introductory course. Awesome!", "likes": 0}}, {"topLevelComment": {"author": "Jonette Browning", "text": "I'm only 20 minutes in and you are making it easy for me (75 yo)  to understand most of what you are saying. Microsoft is killing my pc that may grandson built for me back in 2015 with os 7 which I upgraded to os 10 for free. But now it takes my system over 15 minutes to startup and it has a lot of os 11 being downloaded. All I use the computer (tower type) for is reading (52 inch monitor as I have bad eye sight) and surfing (T Mobile hub connection). I don't need the office stuff. Thanks for making it easy to comprehend as I'll be watching this for a while.", "likes": 351}, "replies": [{"author": "Aram Hayyan", "text": "I am thinking of moving to linux, Microsoft is not safe.", "likes": 1}, {"author": "Trap or Doom", "text": "Okay then, Jonette, go ‘head and get it witchya bad self!!! Go crazy!!!", "likes": 3}, {"author": "TheRealOne 78", "text": "GNU/Linux is a good OS :)", "likes": 5}, {"author": "FloopyBits", "text": "Welcome to linux community", "likes": 6}, {"author": "Socialogic", "text": "@Bruce Wayne  recently I was having the same issue. Three days ago microsoft gave me 3 updates on windows 11 and now it runs like new. I think Windows 11 was unstable before that. I will ask everyone to wait for the updates.", "likes": 4}]}, {"topLevelComment": {"author": "Cyber Monk ", "text": "take a shot every time he says right-fast\n\nYo great video KeepItTechie, this is a nice supplement to the reading I'm doing. Keep it up!", "likes": 1}}, {"topLevelComment": {"author": "Mislav Krleža", "text": "I knew it... The moment you actually to the point on how to prepare partitions - \"I won't go into it....\"", "likes": 0}}, {"topLevelComment": {"author": "Rene Jacques", "text": "Very good.  It was a good refresher and more.  What's the link to the more advanced linux course you mentioned in this video please?", "likes": 0}}, {"topLevelComment": {"author": "Micheal Dalu", "text": "Awesome course... Thanks 🙏🏽🙏🏽🙏🏽🙏🏽", "likes": 0}}, {"topLevelComment": {"author": "thermo77", "text": "Thanks josh", "likes": 0}}, {"topLevelComment": {"author": "leticia espino", "text": "Thanks I appreciate all the hardwork you put into making this video.", "likes": 0}}, {"topLevelComment": {"author": "SnoopyRogue3 !!!!!", "text": "Is the other course mentioned in the video available too", "likes": 0}}, {"topLevelComment": {"author": "Simon Oganga", "text": "Amazing content, great teaching", "likes": 0}}, {"topLevelComment": {"author": "Charlie Bucket", "text": "Appresh the vid bro", "likes": 0}}, {"topLevelComment": {"author": "Charlie Bucket", "text": "18:05 aka porn on your system...dynamic it is", "likes": 0}}, {"topLevelComment": {"author": "Charlie Bucket", "text": "Richard stalmans the man", "likes": 0}}, {"topLevelComment": {"author": "P1", "text": "Thanks for this video... at the begin we must make a new user rather than use root account . second how kan I install ansible-examples to fellow all commands. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Ceaser Madrazo", "text": "Dude, this made many things crystal clear for me.  I spent a lot of time looking for a decent beginner Linux course, and yours is by far the best I've found!  Thanks for making this!", "likes": 34}}, {"topLevelComment": {"author": "Darvin Dank", "text": "Really appreciate the useful information. Wish I could give more. ", "likes": 1}}, {"topLevelComment": {"author": "Odd Smith", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "ekle anthony", "text": "Thank you for the awesome and gentle introduction... I am switching into the Cyber security world.. your video was very helpful thanks. PLEASE I NEED MORE RECOMMENDATIONS TO ADVANCE MY LINUX SKILL for Pen-testing and Vulnerability analysis. Thanks in Advance", "likes": 0}}, {"topLevelComment": {"author": "Aarsh Pandey", "text": "What os are you using on your base system?", "likes": 0}}, {"topLevelComment": {"author": "Ifeanyi Nnaemego", "text": "How do you deal with this issue. Vscode is not allowed to edit content in a file or crate a new file", "likes": 0}}, {"topLevelComment": {"author": "KXLLMXR18 KILLME", "text": "🔥🔥🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "luckyayo", "text": "Thanks bro. Works like a charm 😊😜😎", "likes": 0}}, {"topLevelComment": {"author": "FILATEI ZACH", "text": "thank you brother", "likes": 0}}, {"topLevelComment": {"author": "Mahesh patel", "text": "Yo Brother, This was one of the best explanation on \" Introduction to Linux \". You look like a Pro !  Please make more Videos for Certification.", "likes": 3}}, {"topLevelComment": {"author": "ksxf", "text": "sudo was great!", "likes": 0}}, {"topLevelComment": {"author": "ksxf", "text": "sudo was great!", "likes": 0}}, {"topLevelComment": {"author": "Taksh Patel", "text": "Great to see you here @keepitTechie.", "likes": 0}}, {"topLevelComment": {"author": "Pieπ", "text": "Thank you for your knowledge.", "likes": 0}}, {"topLevelComment": {"author": "jeez", "text": "is this course enough to understand basic os for cloud?", "likes": 0}}, {"topLevelComment": {"author": "Sahil Sayyad", "text": "recommended watch in 2x", "likes": 0}}, {"topLevelComment": {"author": "Elco", "text": "Keywords: 4:3, 1920\nIf you want to fullscreen the vm, go to settings inside of ubuntu -> display -> resolution and bam.", "likes": 0}}, {"topLevelComment": {"author": "Loney Mutuma", "text": "Thank You", "likes": 0}}, {"topLevelComment": {"author": "Nnamdi Modebe", "text": "This is the best crash course to any course I've ever watched, I am so excited to learn more about linux. I would recommend linux basic for hackers for anyone who would love to go deeper. Thank you so much ❤❤❤", "likes": 5}}, {"topLevelComment": {"author": "yassinovo", "text": "Hi guys, is this an OS course ? like does it work for a CS major, or is it more like a know how to use Linux ?", "likes": 0}}, {"topLevelComment": {"author": "Βαγγέλης παναγιωτόπουλος", "text": "Speed @ 1.25 \nThank me later!", "likes": 0}}, {"topLevelComment": {"author": "miroslavmatovic", "text": "2:22 Did you just say \"ax\" ? Is this some ghetto version of Linux?", "likes": 0}}, {"topLevelComment": {"author": "Code Hype", "text": "The whole content is awesome, thanks a lot guys for this lesson!", "likes": 0}}, {"topLevelComment": {"author": "ksxf", "text": "Does somebodody have a link of slides?", "likes": 0}}, {"topLevelComment": {"author": "DiceGame Network", "text": "Who would’ve thought E-40 was proficient in Linux", "likes": 0}}, {"topLevelComment": {"author": "Tintamar5678", "text": "19:07 I wish you would have covered the shared clipboard and drag and drop. I ALWAYS have so many issues with Guest Additions.", "likes": 0}}, {"topLevelComment": {"author": "Santosh Kumar Doodala", "text": "for mac m1 ?", "likes": 0}}, {"topLevelComment": {"author": "Роберт Коваляускис", "text": "Great video! I enjoy it!", "likes": 0}}, {"topLevelComment": {"author": "RoseGoldHunii", "text": "This helped me so much with my intro courses!! Thank you for making this!!", "likes": 0}}, {"topLevelComment": {"author": "11ll11l1ll111l1", "text": "Will be learning linux asap. Self taught", "likes": 0}}, {"topLevelComment": {"author": "tinkiwinki", "text": "Great great video, thanks a lot! Helped me really understand, good way of teching!", "likes": 0}}, {"topLevelComment": {"author": "carfornia cars", "text": "too lame man (", "likes": 1}}, {"topLevelComment": {"author": "Mehrdad Kazemi", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Iyinoluwa Onaeko", "text": "Awesome video. Spent my day following this course, and it was worth every min of my time!", "likes": 6}}, {"topLevelComment": {"author": "milky way", "text": "that's hilariously useless", "likes": 0}}, {"topLevelComment": {"author": "Rumba Tumba", "text": "Amazing course for beginners, thank you so much.", "likes": 1}}, {"topLevelComment": {"author": "Joe rosello", "text": "Actually watched it from start to finish w/a second monitor running UBUNTU.. Awesome course and great method of making it very user-friendly! Learned alot and a great jumping board to more knowledge......thanku", "likes": 0}}, {"topLevelComment": {"author": "Prince Odidi", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Walter Nwaugo", "text": "Who knows the native OS he's using in his PC?", "likes": 0}}, {"topLevelComment": {"author": "Anthony Tucker", "text": "Thank you for your time, Linux for LIFE !!!", "likes": 2}}, {"topLevelComment": {"author": "Tamutan Julius", "text": "Am so happy i got to learn something today my 2 hours was not in vain. once more thank you", "likes": 1}}, {"topLevelComment": {"author": "AKINJIDE OKE", "text": "100/100 👌👌👌", "likes": 0}}, {"topLevelComment": {"author": "Sandra", "text": "It would be unfair to my conscience and humankind if I watched this video without leaving a review. I have watched a couple of Linux videos on Youtube, and I can tell you, that your teaching pattern is 10/10. you broke it down to the level that any layman could comprehend. Thank you so much!", "likes": 132}}, {"topLevelComment": {"author": "Joseph Steinhauser", "text": "2:07:55 To show \"ps\" list of processes, it is more useful to use \"ps -eaf\" rather than \"ps -A\" to show memory use, CPU time, how long ago started, user-ID, and more.\nThis usually outputs several pages of text, so you may also want to pipe it through grep, less, awk, or sort+head, to focus on the processes you want.\nThe \"pstree\" command will show which procs are related to each other, as parent & child, in a branch/indented tree.\nFor a quick screen of the heaviest process load on your machine... use command \"top\" which shows top CPU use, updated every 10 seconds. (press \"q\" to quit)", "likes": 19}}, {"topLevelComment": {"author": "The Almighty Anthony Analog", "text": "Thank you so much for this. Exactly what I need rn.", "likes": 1}}, {"topLevelComment": {"author": "Fernando ___", "text": "1:15:51 bookmark 🔖", "likes": 0}}, {"topLevelComment": {"author": "Shuv Shaw", "text": "Hi, Learners!\nYou might find these videos helpful to setup your Linux Environment using VirtualBox.\nAs a MACOSX user I was stuck in some problems. After watching so many videos with spending lots of time , I finally come to the actual solution.\nProblems :\n1. Kernel Driver Not Installed (rc=-1908) Error on Mac\nVideo solution link: https://youtu.be/Ftj0LvzN5Cw\n\n2. Can't resize my LINUX OS window rather it was changing the VirtualBox window.\nVideo solution link: https://youtu.be/Gk0NUAiK1IA", "likes": 2}}, {"topLevelComment": {"author": "Shuv Shaw", "text": "Failed to open a session for the virtual machine Ubuntu20.04.\n\nThe virtual machine 'Ubuntu20.04' has terminated unexpectedly during startup because of signal 6.\n\nResult Code: NS_ERROR_FAILURE (0x80004005)\nComponent: MachineWrap\nInterface: IMachine {85632c68-b5bb-4316-a900-5eb28d3413df}\n\n\nhow to fix it?", "likes": 0}}, {"topLevelComment": {"author": "Poonam Kamboj", "text": "thank you.. i was able to follow it easily", "likes": 1}}, {"topLevelComment": {"author": "Fatih D.", "text": "Wow, You are amazing!", "likes": 0}}, {"topLevelComment": {"author": "This&That", "text": "Your vid sold me, I was waiting for Linux to get to where I wanted it before switching. I'm 100% on board ASAP and I have all the thousands of coders doin their thing to thank for that.", "likes": 1}}, {"topLevelComment": {"author": "This&That", "text": "Terminal: looks like DOS to me. LOL Old skool: New skool", "likes": 0}}, {"topLevelComment": {"author": "jsaenzMusic", "text": "Man......glad to see someone who looks more like me in this field.  I'm a Hispanic causing panic but grew up a certain way.  I see you KeepItTechie!", "likes": 1}}, {"topLevelComment": {"author": "Koga Ryu", "text": "If isn't the correct way to say the work is like Ooboontoo (like ooze) = loosely Humanity spirit but more precisely like sharing and caring ...\nThe term is a South African Nguni native tongues, Mark was a South African.", "likes": 0}}, {"topLevelComment": {"author": "hrxy1", "text": "who on earth has the time, energy, patience to wade through this garbage verbiage. we want simplicity and ease of use, not this complex shite.", "likes": 0}}, {"topLevelComment": {"author": "Collins Kariuki", "text": "I am a beginner  in Linux and this course was truly amazing and helped me get grasp of Ubuntu OS. Thank you for sharing it. I'd recommend people play the video at a speed of 1.25.", "likes": 4}, "replies": [{"author": "borin account", "text": "what do we call -r or -i or -lt please help", "likes": 0}, {"author": "chefj", "text": "Did u also apply for the Proofpoint internship?", "likes": 0}]}, {"topLevelComment": {"author": "Bush Le", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Butch Go", "text": "If anyone can stay for 2:47:56 for a crash course he might as well take the whole full course.", "likes": 1}}, {"topLevelComment": {"author": "Kiefer Headbanger", "text": "Do you have or recommend a Linux course for a level just above this one? I’d like to keep learning about terminal. Thank you for the amazing content btw!", "likes": 1}}, {"topLevelComment": {"author": "Aqueeq Azam", "text": "Brilliant tutorial", "likes": 1}}, {"topLevelComment": {"author": "Josh Moore", "text": "are ubunutu linux command same in security OS, like kali and parrot?", "likes": 0}}, {"topLevelComment": {"author": "Scott", "text": "love this style of easy to follow video bro please do a lot more", "likes": 1}}, {"topLevelComment": {"author": "Scott", "text": "lol can't wait for the next one bro", "likes": 0}}, {"topLevelComment": {"author": "Scott", "text": "love this video bro would love to see whats next", "likes": 0}}, {"topLevelComment": {"author": "gracien Lebel", "text": "Wow, I have enjoyed your course so much! Thanks for making learning linux so pleasant bro. I will subscribe to your channel, thanks and looking forward for more of your courses", "likes": 2}}, {"topLevelComment": {"author": "Abiola Osota", "text": "Thank you soo much, completed the video", "likes": 1}}, {"topLevelComment": {"author": "Ronald Tucker", "text": "YOU are an amazing teacher! My first time ever looking at Linux. I was a Cobol programmer back in the 80's. Your presentation is so smooth. Keep up the good work.", "likes": 23}}, {"topLevelComment": {"author": "Veronica P", "text": "Is physical adapter and NiC the same thing?  What the difference between VM and host?", "likes": 0}}, {"topLevelComment": {"author": "Incube2", "text": "What application do you use for record the video? Camtasia?", "likes": 0}}, {"topLevelComment": {"author": "rfrancoi", "text": "Great stuff Sir.  Your material has a lot of substance for foundation learners.", "likes": 5}, "replies": [{"author": "rfrancoi", "text": "@borin account \"Switches\".  Please keep in mind that those switches have different uses when used with different commands.  If you want to find out what they are used for type  'man' followed by the command.  Hope I was able to help.", "likes": 2}, {"author": "borin account", "text": "what do we call -r or -i or -lt please help", "likes": 0}]}, {"topLevelComment": {"author": "Frank Lupu", "text": "Does anyone know why my VM only give me 32-bit option and how to fix that?", "likes": 0}}, {"topLevelComment": {"author": "TekChat", "text": "Excellent! > Thank you", "likes": 1}}, {"topLevelComment": {"author": "One For All", "text": "UBUNTU COURSE LMAO", "likes": 0}}, {"topLevelComment": {"author": "Pramod Kumar", "text": "Thank you sir!", "likes": 1}}, {"topLevelComment": {"author": "Steve Rudolph jr", "text": "Finally a black man😊", "likes": 0}}, {"topLevelComment": {"author": "Bernard Neal", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "dottedhippo", "text": "Can I use Virtual Box on my PC without having to worry about my own OS and files?", "likes": 0}}, {"topLevelComment": {"author": "Asura", "text": "Call me crazy, but is it just me, or do you sound like Snoop Dogg?", "likes": 0}}, {"topLevelComment": {"author": "Daniel Castaño", "text": "For those who are wondering, this is a very introductory course, do not expect to find here commands and concepts beyond the basics for a relatively standard use of the operating system.", "likes": 38}, "replies": [{"author": "EvoSchecter", "text": "He explains this.", "likes": 2}, {"author": "Nikki Legacy", "text": "Yes, AWESOME introductory course.", "likes": 6}, {"author": "ricky Pickens", "text": "1:00", "likes": 7}]}, {"topLevelComment": {"author": "Mustake5", "text": "Very good Linux os information class thanks for your time very clear and to the point the only thing I had a problem with is I never got the VM box to work I was trying to install it on Linux mint and crashed the system so I had to reinstall Linux mint.", "likes": 2}}, {"topLevelComment": {"author": "Amadey", "text": "Dislike, dont like his style, sorry dude.", "likes": 1}}, {"topLevelComment": {"author": "Steven Roy", "text": "Thx for sharing your knowledge. 💯", "likes": 2}}, {"topLevelComment": {"author": "Chiba", "text": "This Linux made easy.Thanks a lot for the video.", "likes": 1}}, {"topLevelComment": {"author": "Bat man", "text": "I appriciate zoomed UI\nNice and easy to watch", "likes": 1}}, {"topLevelComment": {"author": "Naskue", "text": "bro, you sound like a intelligent homeboi, like, bro?", "likes": 0}}, {"topLevelComment": {"author": "TechTycho", "text": "Just learn from DistroTube. I learned from him and I now use Arch Linux as a daily driver.", "likes": 1}}, {"topLevelComment": {"author": "Jigar James", "text": "Also try to provide commands pdf .", "likes": 0}}, {"topLevelComment": {"author": "Pastor Mike Segun Shodipe", "text": "How do you get to ubuntu desktop environment.? My case isn’t the same", "likes": 0}}, {"topLevelComment": {"author": "N. M", "text": "Ive been using Linux for years now. I listen to this video to fall asleep to this pleasant story. Linux and Gnu are amazing.", "likes": 5}}, {"topLevelComment": {"author": "Rudeboi Que", "text": "Nailed it Im subscribing forsure", "likes": 0}}, {"topLevelComment": {"author": "JustAddFIRE!", "text": "WestSIIiiiide!!!", "likes": 0}}, {"topLevelComment": {"author": "TheRightTriangle", "text": "Well I’m really happy I came across this video. I used to use Linux a long time ago around ten years ago. Then life happened and I no longer had a computer for a long time. I just bought a PC in the pandemic. And since that time I’ve slowly accumulated my favorite activities. I have been meaning to get back to playing around with a Linux distro. Thanks for uploading this video!🧐", "likes": 1}}, {"topLevelComment": {"author": "Galin Manolov", "text": "Thanks. I like the teacher. Feels like a rapper is teaching me Linux.", "likes": 4}}, {"topLevelComment": {"author": "John Reese", "text": "Thank you so very much!", "likes": 1}}, {"topLevelComment": {"author": "dkomso", "text": "you are the best", "likes": 0}}, {"topLevelComment": {"author": "i- -i", "text": "great to see this level of intro :)", "likes": 2}}, {"topLevelComment": {"author": "TAKSH Patel", "text": "👌👌👌", "likes": 0}}, {"topLevelComment": {"author": "Michael Brass", "text": "I'll for give you for the Raiders hat... LOL Get at me?!??! I'm just trying to broaden my network for educating the digitally excluded. Peace.", "likes": 0}}, {"topLevelComment": {"author": "Cristian Gonzalez", "text": "great course thank you very much", "likes": 1}}, {"topLevelComment": {"author": "Loyal_Believers", "text": "Thank you Very much for this easy to understand tutorial.", "likes": 3}}, {"topLevelComment": {"author": "hec gph", "text": "Thanks for this course!😁", "likes": 1}}, {"topLevelComment": {"author": "mehdi Shahsavari", "text": "That is soooo awesome and perfect\nThank u guys😘", "likes": 1}}, {"topLevelComment": {"author": "Mohamed Shakeel", "text": "Appreciate the time and effort you put into this ! Have a good one", "likes": 3}, "replies": [{"author": "borin account", "text": "what do we call -r or -i or -lt please help", "likes": 0}]}, {"topLevelComment": {"author": "Ghastly One", "text": "Amazing, thank you for sharing your knowledge", "likes": 6}}, {"topLevelComment": {"author": "Alexandru Teodor", "text": "Thank you for this course! :)", "likes": 2}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Talk of kgpg.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "No write virus of year 1998.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "More ftp of debian not run.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Not interested in your course. Know much phone's for example talk for phone with voice of woman or kiddie.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Like learn to are general doctor. So are 6 years in university.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Sco Unix don't use of year 1998.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Talk of server sparc with solaris. Solaris was write and personal opinion not are good.\n\nIf you delete solaris of server sparc, lost license", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Tecnic engineer and almost engineer of network.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "I understand how repair Macintosh or portable computer.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Linux are Unix system V, better freebsd and openbsd, debian hurd, aix, hp-ux Unix, netbsd.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Like learn medicine but in this moment don't money.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "Beginner advanced C/C++, little nasm, perl and awk.", "likes": 0}}, {"topLevelComment": {"author": "Jose Rodellas tudela", "text": "freebsd Unix 12.2, debian 10.9, Mac os big sur.\n\nWill write 15 Unix system V and BSD.\n\nBeginner advanced C/C+×.\n\n23 portables to write others Unix.\n\n6 Mac, Mac pro and Mac pro air.\n\nLittle nasm, not are adivine break someone keys 80 millions 4 seconds.\n\nTalk so know. \n\nSpectrum 48k and 128k, in school dragon 64k with Unix. \n\nDont have money to learn medecine in university. \n\nI understand source code of C/C++, 100 or 200k.\n\nIn free time learn tutorial makefile pdf.\n\nPrehacker but not are hacker and not interested enter in computers. \n\nAlso know how write virus of bios from year 1997.\n\nM/46/Barcelona.", "likes": 0}}, {"topLevelComment": {"author": "Ofem Monday", "text": "Please I need help... Each time I press 'Enter' to run a command on my terminal, it brings up the preferences window. Please how can I fix this?", "likes": 0}}, {"topLevelComment": {"author": "qin xiaoshu", "text": "Thank you, man, you are a good teacher, and it is a  perfect course for Linux beginners!", "likes": 9}}, {"topLevelComment": {"author": "CHITUS💖⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻", "text": "great video! if anyone was wondering how he finishes some lines so quick; he's just hitting the TAB key after typing some of the beginning of a file, its a nifty terminal trick.", "likes": 3}}, {"topLevelComment": {"author": "Zsolt Monostori", "text": "Great tutorial. While my main gaming PC (Windows) is undergoing repairs and is away, I decided to install Ubuntu on my laptop in the meantime to give it a try, I enjoy it so far, very elegant an OS.", "likes": 2}}, {"topLevelComment": {"author": "Kashyap Panchal", "text": "Super awesome stuff! It'd be great if you could also touch upon installing the VM Software as well. Otherwise, awesome content!", "likes": 2}}, {"topLevelComment": {"author": "Storcke: Unbox Channel", "text": "I will be using Mac OS for most things. Most of These concepts will certainly apply to UNIX as well. A very thorough course.", "likes": 3}}, {"topLevelComment": {"author": "sir robert downey senior", "text": "Hate Snaps. No place for closed source  software in opensource OS.", "likes": 0}}, {"topLevelComment": {"author": "Rishi Raj", "text": "🙏👍👍", "likes": 0}}, {"topLevelComment": {"author": "LuminousNutria", "text": "I thought ubuntu was pronounced oo-boon-too.", "likes": 0}}, {"topLevelComment": {"author": "Alaz Tetik", "text": "Good to see Linux videos on FCC ", "likes": 2}}, {"topLevelComment": {"author": "Vinod C S", "text": "I  have tried some commands/installation in Linux but was never confident becauz i don not the basics of the Linux OS. your session is super useful to get started and understand the basics. Thanks a lot, appreciate it.  Eagerly waiting for your next session which covers advanced stuff.", "likes": 7}}, {"topLevelComment": {"author": "Swapnanil Halder", "text": "Sorry freeCodeCamp, I like all your videos, but this video is not a Linux Operating System Crash Course, this is even barely Ubuntu touch and feel. Working with files and some very very basic tools is not gonna make the cut. No information about networking, no information about the power and conveniency of CLI, what we can do differently and efficiently in linux or UNIX like OSs than others. And if this is a video attracting newbies into Linux, I really think, KDE DE is the way to go, or Gnome 40+.\n\nJust some suggestions, not a rant . Love you Guys. Great effort BTW.", "likes": 0}}, {"topLevelComment": {"author": "Armando Romero", "text": "Smooth voice for the evening quiet storm", "likes": 0}}, {"topLevelComment": {"author": "Adi Setiawan", "text": "Great content! I also do reviews on Linux distributions.\n\nMy channel : https://www.youtube.com/c/AdiSetiawanLinux/", "likes": 0}}, {"topLevelComment": {"author": "Xameer", "text": "I love you freeCodeCamp", "likes": 0}}, {"topLevelComment": {"author": "NASSER NASSER", "text": "appreciate it thanks", "likes": 0}}, {"topLevelComment": {"author": "وقفة | Wa9fa", "text": "Thanks for sharing this with us and our thoughts on the other things 🎩", "likes": 1}}, {"topLevelComment": {"author": "vthreee", "text": "great video! if anyone was wondering how he finishes some lines so quick; he's just hitting the TAB key after typing some of the beginning of a file, its a nifty terminal trick.", "likes": 35}}, {"topLevelComment": {"author": "TJ O'Leary", "text": "Awesome course and video bro....have lots of experience with Linux but learned a few things!", "likes": 2}}, {"topLevelComment": {"author": "kaye Shafiq", "text": "It's a good timing for me since am getting ready for Linux essential cert exam. thanks very essential", "likes": 1}}, {"topLevelComment": {"author": "simsbob1", "text": "thanks this video helped me to under stand  better and put together what I had already seen other videos", "likes": 1}}, {"topLevelComment": {"author": "CyperN077", "text": "The only thing I wish you covered was how to move along the command line. How to delete the line, delete from the cursor to the beginning or the end etc.", "likes": 0}}, {"topLevelComment": {"author": "Shivmanu Mangat", "text": "You guys are amazing… and doing amazing job", "likes": 1}}, {"topLevelComment": {"author": "Moghutu Silver", "text": "Dude you are awesome, we need the part two of this ASAP! xD", "likes": 3}}, {"topLevelComment": {"author": "Francis", "text": "2hr of my life and I am no longer the same. Thanks for the course.", "likes": 2}}, {"topLevelComment": {"author": "Jason Lantz", "text": "Raiders? for real?", "likes": 0}}, {"topLevelComment": {"author": "Luís Fernandes", "text": "The timing couldn't have been more perfect", "likes": 1}}, {"topLevelComment": {"author": "Paul Dunn", "text": "Hi - great class - is ansible-examples part of the Ubuntu 20.4.4 full installation? I do not see the files posted in class content.", "likes": 0}, "replies": [{"author": "Sim Parmar", "text": "Ya i was wondering the same, my documents folder is empty too.", "likes": 0}]}, {"topLevelComment": {"author": "Danial Khan", "text": "16:18 VHD is used by Windows Hyper-V - just a correction\nVMDK used by VMware.", "likes": 0}}, {"topLevelComment": {"author": "ErFeR", "text": "ik keepittechie before this", "likes": 0}}, {"topLevelComment": {"author": "X M", "text": "lmao where did they get this teacher", "likes": 0}, "replies": [{"author": "Sean Walker", "text": "Why do you ask?", "likes": 1}]}, {"topLevelComment": {"author": "TY_B_60_Saiprasad", "text": "Pls can you make de dashboard videos", "likes": 0}}, {"topLevelComment": {"author": "Ángel Martinez", "text": "Can you do a course about gtk development?", "likes": 0}}, {"topLevelComment": {"author": "Vinh Nguyen", "text": "I don't know why but you remind me of ice cube. You're the ice cube of IT. LOL Great Video", "likes": 1}}, {"topLevelComment": {"author": "Kevtech IT Support", "text": "Good job keepittechnie. I shared your video with my helpdesk folks.", "likes": 1}}, {"topLevelComment": {"author": "Aiven White", "text": "I can't do full screen OS in VirtualBox. \nI try to solve this problem with VBoxWindowsAdditional, but have a error.", "likes": 0}}, {"topLevelComment": {"author": "sachin bisht", "text": "Nice content for beginners. Love it", "likes": 5}}, {"topLevelComment": {"author": "shen shu", "text": "very good!", "likes": 0}}, {"topLevelComment": {"author": "mdd1963", "text": "\"If you can shovel coal, you can learn to code, for Christ's sake...!\" FJB! :)", "likes": 0}}, {"topLevelComment": {"author": "Kirara's Mom", "text": "What is the best coding for beginners whom new at coding? I heard high school coding.\nI did not have coding when I was in school.", "likes": 0}, "replies": [{"author": "Tanmay Panadi", "text": "learn python, it's really easy to get into. but  I would also suggest picking up CPP or rust . it will teach you more about programming and how computers programs work.", "likes": 0}, {"author": "Muhamad Nazmi Bin Mokhtazar", "text": "I recommend python because its easy to learn and use in many field", "likes": 0}]}, {"topLevelComment": {"author": "DeShae", "text": "Virtual Box is giving me a difficult time. I followed the instructions and got up to the part of the install where VB said it needed to restart so I hit restart. I'm not sure if I was supposed to restart my actual laptop as well because it looked like it restarted INSIDE the Virtual Machine. \n\nAny insight would be greatly appreciated", "likes": 1}, "replies": [{"author": "Julian Pluas", "text": "Hi Deshae. You did it correctly, you only have to restart your VB machine.\nIf you start it again it should boot up.", "likes": 1}]}, {"topLevelComment": {"author": "تعلم مهاره كل يوم", "text": "that was good introduction .", "likes": 0}}, {"topLevelComment": {"author": "Japhet Kiplagat", "text": "guys any one with reebushed lapitop help  to start this course", "likes": 0}}, {"topLevelComment": {"author": "Jes _Warlock", "text": "''Can see on the screen this is 4 major linux distributions that r out there\" Show ubuntu, debian, kali, and red hat - that's was a hard pill for any Arch user btw xDDDD. I use ubuntu btw, as my daily drive", "likes": 0}, "replies": [{"author": "Tanmay Panadi", "text": "its fine he is recording a video . when you are staring at that camera it's easy to mess up", "likes": 0}]}, {"topLevelComment": {"author": "Pranav Nyavanandi", "text": "Perfect timing really. Was really looking for a comprehensive tutorial. I had basics of Linux this semester and it felt a little far fetched. For me, windows was a defining characteristic of a computer, till I found it's not.", "likes": 7}}, {"topLevelComment": {"author": "Kisha Rogers", "text": "This was awesome. You are a great teacher for beginners. Looking forward to more of your content Josh", "likes": 3}}, {"topLevelComment": {"author": "invader", "text": "Also why does my linux mint stops working when i update my nvidia driver?\nAnyone plz", "likes": 0}, "replies": [{"author": "Samir Oumghar", "text": "Windows is a practical and stable OS, it's difficult to replace it because is user fruendly and is powerful in term of productivity, hardware compatibility, software compatibility and support....", "likes": 0}, {"author": "Tanmay Panadi", "text": "try posting on a Linux mint forum on reddit I am sure someone will help you out.", "likes": 0}]}, {"topLevelComment": {"author": "invader", "text": "Thanks for a video\ni have recently shifted from windows to linux mint xfce\nit works so fast and smooth\nur videos will help me learn how to use it better", "likes": 3}}, {"topLevelComment": {"author": "Javi", "text": "RAAAAAIDERS!!!!!!!", "likes": 1}}, {"topLevelComment": {"author": "phoenixbyrd", "text": "As someone who's been using Linux since before Mandriva I can 100% tell you that years of use does not translate to having full or extensive knowledge on the Linux OS. I just barely have a grasp on grep after 20 years of linux use. I've always used linux the same as I've used Windows, as  a casual user rather than a power user where a ton of those tools are great for power users. Casual users only really need to focus on package management issues in my opinion. I'm actually using Linux on my Galaxy Fold 3 installed with Andronix through Termux being displayed on a portable monitor through VNC in DEX mode. Might not know Linux like a power user, but I can do other neat things :D", "likes": 0}}, {"topLevelComment": {"author": "24x7 Locks", "text": "You can also run dual boots. You can also run a live version from a thumb drive, etc....", "likes": 2}}, {"topLevelComment": {"author": "Rauf Babajanov", "text": "the information, knowledge he squize into 2.5 h course is great, I wish we could get next level, advance course made by Josh .", "likes": 2}}, {"topLevelComment": {"author": "TheEye?", "text": "AMAZING", "likes": 0}}, {"topLevelComment": {"author": "michalski", "text": "*gnu/linux operating system", "likes": 0}}, {"topLevelComment": {"author": "vootshi clone", "text": "The sound of \"man\" command will never be the same anymore...", "likes": 0}}, {"topLevelComment": {"author": "Josue Alarcon", "text": "Although this curse is for beginners, is really good for us who are learning or aren't native English speakers", "likes": 0}, "replies": [{"author": "Josue Alarcon", "text": "@Tanmay Panadi Thank you for the correction", "likes": 0}, {"author": "Tanmay Panadi", "text": "I think you ment course not curse. tc", "likes": 1}]}, {"topLevelComment": {"author": "Dylan Sampson", "text": "Can you do a lesson on vim?", "likes": 1}}, {"topLevelComment": {"author": "RaM727100", "text": "which are the pros of linux over windows guys?", "likes": 0}, "replies": [{"author": "Tanmay Panadi", "text": "Use what works for your workflow. \nthere are pros and cons to everything.\n\nIMO.\n\nlinux is for people who like their privacy and support open-source software .\n\nit just works on any hardware let it be 10 years old or new.\nyou can customize the system for what you want to do and how you want to do it no restrictions at all. \nit has really great speeds when ever I want to move large no of small files or just a big file around. \nthe network stack and options are very nice when using it for torrents and working with files.\n\nThe Linux filesystems like BTRFs and Ext4, ZFS is more advance and newer than NTFS. it is build with multiple users in mind.\nZFS and BTRFS files backups and restore functions that actually work unlike windows.\n\nwindows is really great for Adobe suite and gaming point of view.", "likes": 0}]}, {"topLevelComment": {"author": "Quick Tuts", "text": "Fun fact: Ubuntu was created by a South African and the word means Humanity.", "likes": 1}}, {"topLevelComment": {"author": "The Codfather", "text": "The timing... Honestly it's like you guys can read minds!", "likes": 41}, "replies": [{"author": "Mayank Rathore", "text": "@♜ Pinned  by_FreeCodeCamp Fake", "likes": 0}, {"author": "Mine Shadow", "text": "@The Codfather one thing about linux lesson class is so hard to find teacher that teaching about problem solving while a device with linux got broken, such as microphone not working or even speakers not working. That's made me frustrated about linux", "likes": 0}, {"author": "The Codfather", "text": "@Mine Shadow I wouldn't be surprised lol", "likes": 0}, {"author": "Mine Shadow", "text": "It's Google spying u with ur phone mate", "likes": 1}]}, {"topLevelComment": {"author": "therzook", "text": "The most badass system ever... one year ago my wife took only working laptop with her on a trip. All I was left with was old machine with stinky win7 on it that would stall everytime 2 or more tabs in chrome were open. Installed mint linux on it and refreshed my comm... terminal knowledge. Few months later and mouse is almost not in use (in windows too) and most of the time I use command line in both system. Guys at work thought at first I am mad until they realised that computer screen is not being actually used too...\nLinux is great once you learn piping and basic scripting...", "likes": 1}, "replies": [{"author": "Samir Oumghar", "text": "Windows is a practical and stable OS, it's difficult to replace it because is user fruendly and is powerful in term of productivity, hardware compatibility, software compatibility and support....", "likes": 0}, {"author": "InspireTheLiars", "text": "You got any recommendations for other learning material to look through? Been trying to get into linux myself lately.", "likes": 0}, {"author": "Tyre Wald", "text": "But only then....", "likes": 0}]}, {"topLevelComment": {"author": "Nishandh Mayiladan", "text": "Thankyou !", "likes": 0}}, {"topLevelComment": {"author": "Abdullahi Abdiaziz yousuf", "text": "Perfect timing 🙂🙂", "likes": 2}}, {"topLevelComment": {"author": "BIG BITCH420", "text": "amazing !!", "likes": 0}}, {"topLevelComment": {"author": "Iman Veisi", "text": "let's see what the ice cube is going to teach us", "likes": 1}, "replies": [{"author": "Tanmay Panadi", "text": "🤣", "likes": 0}]}, {"topLevelComment": {"author": "Samaya Asadullaeva", "text": "Thanks for that course. I definitely need it cause it is required in job that I want to apply for.", "likes": 1}, "replies": [{"author": "kaike95", "text": "@♜ Pinned  by_FreeCodeCamp trash bot", "likes": 0}]}, {"topLevelComment": {"author": "Nodsaibot", "text": "lol video starts at 41:20", "likes": 0}}, {"topLevelComment": {"author": "AquamenHD R", "text": "Great education material 👏🏽👏🏽", "likes": 3}}, {"topLevelComment": {"author": "Joshua Allen", "text": "Yes I will be jumping into LAMP this summer baby!!! Right now I am tearing apart Wordpress Themes and putting them back together.  I love the thumbnail !!! Brilliant people come in all shapes , colors and sizes. Hears to the future - Putin trying to start WW3.", "likes": 0}, "replies": [{"author": "Joshua Allen", "text": "@fang. Clarke c get off my feed pls. Thanks", "likes": 0}]}, {"topLevelComment": {"author": "Money Mase Windu", "text": "Bruh you look like Slink Johnson in the thumbnail", "likes": 0}}, {"topLevelComment": {"author": "Muntean Ionut", "text": "Would love to see a tutorial on licensing from you guys!", "likes": 5}}, {"topLevelComment": {"author": "Plunderer Ex", "text": "Indonesian project freeCodeCamp please ✌\n\nI think Your Project Indonesian will get minimum 2M Subscriber :)", "likes": 0}}, {"topLevelComment": {"author": "chillen", "text": "I already know how to use Linux but nice Raiders hat Josh", "likes": 0}}, {"topLevelComment": {"author": "That_Ptsd_Guy", "text": "ty", "likes": 1}}, {"topLevelComment": {"author": "vivek upadhyay", "text": "Its a good video for a beginner in linux", "likes": 0}}, {"topLevelComment": {"author": "Muneeb Ahmed", "text": "MS has copied almost everything from the Linux and rebranded under their own name. It’s so sad!", "likes": 1}, "replies": [{"author": "Muneeb Ahmed", "text": "@Samir Oumghar I agree with you on all but not on that is stable OS!", "likes": 0}, {"author": "Samir Oumghar", "text": "Windows is a practical and stable OS, it's difficult to replace it because is user fruendly and is powerful in term of productivity, hardware compatibility, software compatibility and support....", "likes": 0}, {"author": "Tanmay Panadi", "text": "it's not sad let them be dependent on Linux community so that windows user experience if also great.\nonly problem I have is how shitty Microsoft is pushing adware and telemetry .", "likes": 0}]}, {"topLevelComment": {"author": "Zubaer Hossain", "text": "Literally was just getting into linux xD", "likes": 1}, "replies": [{"author": "Aayush P.", "text": "same i just installed Linux today and this popped up like 3 hours ago", "likes": 0}]}, {"topLevelComment": {"author": "Hans Müller", "text": "Good that he talked a bit about Stallman. But he should have explained what free software actually means.\nFree has multiple meanings in english and in this case, it is about rights. It's not free as in free beer. Thus, sometimes free software is called libre software.\nStallman recommends to watch his TED talk in which he explained the importance of free software.\nSo yeah. Btw. if you are a new user you might want to join a community (forum, reddit, chat platform). By regularly checking a community, you will see what other people share and thus you might learn new things every few days. I for instance am active in the Linux Gaming community on Matrix and Discord (tho discord is not a good platfom and unfree software..).", "likes": 8}, "replies": [{"author": "Tanmay Panadi", "text": "there is also a Level1linux Channel and Level1techs Forum's. it is really great place to hang out and nerd out.", "likes": 0}]}, {"topLevelComment": {"author": "John Thrush", "text": "I'm only 15 minutes in and I sense this will be one of my favorite presenters", "likes": 6}}, {"topLevelComment": {"author": "Alireza Latifi", "text": "FreeCodeCampers, You guys are AWSOME! Appreciate it  @};-", "likes": 0}}, {"topLevelComment": {"author": "Chris Blue", "text": "Great course! I have an interview coming up in a couple hours and needed a refresh on this stuff. Thanks!", "likes": 11}}, {"topLevelComment": {"author": "Xrafter", "text": "No, the \"cd\" is a shell-built-in. You got to use \"help\" if you want to lnow about a built-in command.", "likes": 9}, "replies": [{"author": "Tanmay Panadi", "text": "@KeepItTechie it happens but the rest of the stuff is really helpful for someone diving head first into linux", "likes": 0}, {"author": "KeepItTechie", "text": "I totally forgot about that while recording. Thanks!", "likes": 7}]}, {"topLevelComment": {"author": "ko dongju", "text": "Hello guy could you make java video course please", "likes": 0}}, {"topLevelComment": {"author": "Tushar Wable", "text": "Thank you so much for this!!", "likes": 1}}, {"topLevelComment": {"author": "Danny Michelle", "text": "Linux is empowering. Once you get the hang of it, you're never getting back to doors or windows or whatever that is. Trust me", "likes": 10}, "replies": [{"author": "Samir Oumghar", "text": "Windows is a practical and stable OS, it's difficult to replace it because is user friendly and is powerful in term of productivity, hardware compatibility, software compatibility and support....", "likes": 1}, {"author": "Mine Shadow", "text": "I love linux but i hate it when it's broken ... Can't have microphone works or sound dead..", "likes": 0}]}, {"topLevelComment": {"author": "Arjen Janse ♫", "text": "Crash course... But I don't want it to crash!?", "likes": 1}, "replies": [{"author": "Tanmay Panadi", "text": "🤣", "likes": 0}]}, {"topLevelComment": {"author": "Zerotheory", "text": "I use Arch Linux, by the way.", "likes": 2}}, {"topLevelComment": {"author": "Vemula Darshan", "text": "Thanks for Linux course it came at a perfect time as my algo course instructor is encouraging  to do programming in Linux.", "likes": 6}}, {"topLevelComment": {"author": "AwsumTurtle", "text": "Bro how likely is that I just like 1 hour ago dual booted my Win10 with Ubuntu", "likes": 0}}, {"topLevelComment": {"author": "Cherrie Monis", "text": "Thank you so much people need more like you", "likes": 1}}, {"topLevelComment": {"author": "FERMIANO DE QUEIROZ FILHO", "text": "Wow!🔝 Thks! 🙏", "likes": 0}}, {"topLevelComment": {"author": "Victor Pinas Arnault", "text": "Like 895º\nI know him, from the channel KeepItTechie. I like him really much.", "likes": 0}}, {"topLevelComment": {"author": "Krishan Kant", "text": "I literally wanted to learn ubuntu and video pops up what a pop os feel", "likes": 1}}, {"topLevelComment": {"author": "Xeno Crimson", "text": "error in Chapter's its \"⌨️ (2:03:68) System Information\" its 2:03:63 instead of 2:04:07", "likes": 0}}, {"topLevelComment": {"author": "Infidel Castrato", "text": "I'm an hour in and still yet to learn how to make my linux crash", "likes": 0}, "replies": [{"author": "Infidel Castrato", "text": "@Xiefux it worked. Thanks", "likes": 0}, {"author": "Xiefux", "text": "its easy, just type \"sudo rm -rf /*\" in terminal", "likes": 1}]}, {"topLevelComment": {"author": "Gurmeet Singh", "text": "Do course Linux for system admin", "likes": 0}}, {"topLevelComment": {"author": "Jayson", "text": "Heeeyy keepittechie!! Thank you for this!!", "likes": 0}}, {"topLevelComment": {"author": "Dark GT", "text": "This is not very realistic beginners tutorial. It should be 30 min teaching you what is linux and 2 hours trying to install Nvidia's driver.", "likes": 0}, "replies": [{"author": "Samir Oumghar", "text": "Windows is a practical and stable OS, it's difficult to replace it because is user fruendly and is powerful in term of productivity, hardware compatibility, software compatibility and support....", "likes": 0}]}, {"topLevelComment": {"author": "Wesley Rademan", "text": "The timing could not be more perfect. I’m 3 weeks into my final semester of my Computer Science degree and one of the modules focus on the Linux OS. Thank you for the upload!", "likes": 137}, "replies": [{"author": "Pranav Nyavanandi", "text": "@Rayer 😄 I wonder the same.", "likes": 0}, {"author": "Anurag Gupta", "text": "@Xrafter Linux is a kernel, GNU is the collection of software which can be used as an OS.", "likes": 2}, {"author": "Christian Allen", "text": "I’m finished next year with my CS degree! Let’s go! 👊👊👍👍", "likes": 2}, {"author": "Wesley Rademan", "text": "@Rayer lmao bro I don’t even know, my college is just weird like that", "likes": 0}, {"author": "Xrafter", "text": "@Smeggers \nAh, yes. That what I Meant by fsf", "likes": 0}]}, {"topLevelComment": {"author": "Tuấn Nguyễn Ngọc", "text": "thanks so much", "likes": 0}}, {"topLevelComment": {"author": "Electricity", "text": "Which distro he use for his machine ?", "likes": 0}, "replies": [{"author": "Electricity", "text": "@xoldyckk I am not talking about os in the virtual machine. I'm looking for his main distro he uses", "likes": 0}, {"author": "xoldyckk", "text": "Ubuntu gnome", "likes": 0}]}, {"topLevelComment": {"author": "Omar E", "text": "Just what I wanted!!!", "likes": 2}}, {"topLevelComment": {"author": "Vedkumari Yadav", "text": "Awesome content 👍", "likes": 2}}, {"topLevelComment": {"author": "Rex", "text": "Some days ago I commented to bring a course on OS and here is the Linus OS guide\n\nI mean just how good is this channel", "likes": 3}}, {"topLevelComment": {"author": "Abhishek Sahu", "text": "I am so glad that I have found this channel!", "likes": 2}}, {"topLevelComment": {"author": "Evan MTZ", "text": "Couldn’t have been better timing. Currently taking the Odin project and I’m required to install the Linux OS since I’m on Microsoft.", "likes": 0}}, {"topLevelComment": {"author": "Pandu Damera", "text": "Can you please make one video shell scripting language longer duration same like as unix", "likes": 0}}, {"topLevelComment": {"author": "harikrishnan t", "text": "Thanks man., because in most videos we can't clearly see the text typed in terminal. 👍🙏", "likes": 2}, "replies": [{"author": "Xrafter", "text": "Just upgrade the resolution .\n\nThis should work.\n\nIf you have bad internet, then looking in the video notes(if there is one) might help you also.", "likes": 0}]}, {"topLevelComment": {"author": "Yuto", "text": "Perfect timing! Currently using Mint for programming right now. This video suprised me! Gonna watch it later. Thanks Free Code Camp!", "likes": 11}, "replies": [{"author": "Yuto", "text": "@Xrafter If I have week to re-install it again, sure.", "likes": 0}, {"author": "Xrafter", "text": "@Yuto \nTime to compile the kernel ?", "likes": 0}, {"author": "Yuto", "text": "@Osama Abbas Though I've used other distros like Arch, Gentoo, and Ubuntu. I'm currently using an old laptop for Mint Xfce so my priority is performance over customization. Currently running Windows 11 as my daily driver on another pc, and planning to dual-boot it with Gentoo using DWM or any related wm's to said PC. Only using Mint for programming and also learning Linux.", "likes": 0}, {"author": "Osama Abbas", "text": "Stick with Mint. Save yourself the frustration of Ubuntu (or Gnome 3 to be exact). Mint/Cinnamon is far better than Ubuntu/Gnome.\n\nIn the recent decade or so, Gnome has the habit of looking for any program that works just find, discarding it, and then they proceed to build an inferior version of it, with about 5% of its original functionality!\n\nJust compare Gnome Files to the original old Nautilus (Or Nemo in Mint).\n\nTl;dr: Stick with Mint/Cinnamon, Gnome is trash.", "likes": 0}, {"author": "Yuto", "text": "@Anynomous Sucker Is it your first time using Linux?", "likes": 0}]}, {"topLevelComment": {"author": "free name", "text": "FCC you'r my hero", "likes": 0}}, {"topLevelComment": {"author": "Shlok Suman", "text": "gotta love the youtube algorithms,,, really lookin forward to try out Linux", "likes": 60}, "replies": [{"author": "ricky Pickens", "text": "@Liquid Mobius how about yourself", "likes": 0}, {"author": "ricky Pickens", "text": "Welp I completely forgot all knowledge from this video but I am a Front-End Developer job hunting now and plan to rewatch to refresh memory  hahs", "likes": 0}, {"author": "Liquid Mobius", "text": "How's everyone's journey going so far?", "likes": 1}, {"author": "Oathseeker", "text": "I searched for this", "likes": 0}, {"author": "ricky Pickens", "text": "From future yussss", "likes": 0}]}, {"topLevelComment": {"author": "PeteRock496", "text": "Salute KeepItTechie!  Congrats & enjoy your contents as usual.", "likes": 3}}, {"topLevelComment": {"author": "Ben Huaysan", "text": "I can listen to this guy all day long", "likes": 3}}, {"topLevelComment": {"author": "Eskey", "text": "Thank you so much! this comes at the right time for me.", "likes": 3}}, {"topLevelComment": {"author": "Notes by Parker", "text": "Great Course!! Thanks guys!!", "likes": 3}}, {"topLevelComment": {"author": "Tricky", "text": "You guys are lifesavers!", "likes": 0}}, {"topLevelComment": {"author": "elie tahchy", "text": "Ty freecodecamp for all this valuables  contents", "likes": 0}}, {"topLevelComment": {"author": "Rishi Raj", "text": "🙏👍", "likes": 1}}, {"topLevelComment": {"author": "Ali imran Tahir", "text": "How to convert Linux chrome OS into windows? \n\nI have a chrome OS Chromebook, but I'm not comfortable in this, can I install windows in it?", "likes": 1}, "replies": [{"author": "Tanmay Panadi", "text": "windows experience on a Chromebook will be rough but remember to back up your data before you tinker with your OS.", "likes": 0}, {"author": "Qazi Zayad", "text": "@Speicherkanal  the process is same. You only have to download Windows Arm iso.", "likes": 0}, {"author": "Speicherkanal", "text": "@Qazi Zayad \nI don't think this will work. Chrome is running on ARM processors. You'd have to use a Arm version of Windows.", "likes": 0}, {"author": "Qazi Zayad", "text": "Purchase a bootable windows USB installer or get windows iso file online and make a bootable USB with that iso written on it. \n\nThen access your Computer's BIOS and change it's boot order, in order to boot from the USB. Then windows installer window will be in front of you. Then proceed with the onscreen instructions.", "likes": 0}]}, {"topLevelComment": {"author": "John Hack", "text": "Fantastic.", "likes": 1}}, {"topLevelComment": {"author": "Arsham", "text": "A perfect tutorial for 2022", "likes": 2}}, {"topLevelComment": {"author": "Joseph Parker", "text": "Keepittechie!!!! this is major. I just started messing with linux due to your recommendations. Thank you so much!", "likes": 10}, "replies": [{"author": "KeepItTechie", "text": "That's exactly how I was when I first found Linux. 😂💪🏾", "likes": 1}, {"author": "Press Start", "text": "I'm hooked. I've been slapping different distros on all my old PCs", "likes": 1}, {"author": "KeepItTechie", "text": "No problem bro! I appreciate it!", "likes": 2}]}, {"topLevelComment": {"author": "Burhan Aijaz", "text": "i wanted to shift from windows to linux and here u r with the course, thanks", "likes": 8}}, {"topLevelComment": {"author": "Alae Chakoud", "text": "Thank you so much 🙏🏻", "likes": 3}}, {"topLevelComment": {"author": "Edward Donatus", "text": "Wow I've been waiting.,👌 Who's waiting too?", "likes": 2}}, {"topLevelComment": {"author": "Lord", "text": "Yes!", "likes": 0}}, {"topLevelComment": {"author": "Kushal Kumar", "text": "1", "likes": 0}}, {"topLevelComment": {"author": "A S", "text": "1", "likes": 1}}, {"topLevelComment": {"author": "Amrit Singh", "text": "First like", "likes": 0}}, {"topLevelComment": {"author": "Anshul Soni", "text": "Yoo", "likes": 1}}, {"topLevelComment": {"author": "4pCA4pCA4pCA4pCA4pCA4pCA==", "text": "It's the ''I onLy UsE LinUx BecAuse iT's FrEe aNd OpEn SoUrCe'' moment", "likes": 4}}]}