{"video": {"id": "rZnaB8d_ZOw", "publishedAt": "2015-07-17T08:31:34Z", "title": "Computer Basics 8: Types of Computers", "description": "http://FreeCodeCamp.com is a community of busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nFollow us on twitter: https://twitter.com/intent/user?screen_name=freecodecamp\n\nFollow us on Twitch: twitch.tv/freecodecamp\n\nLike us on Facebook: https://www.facebook.com/freecodecamp\n\nFollow Quincy on Quora: http://www.quora.com/Quincy-Larson\n\n \n  This video covers the basics of supercomputers, servers, workstations, PCs, and microcontrollers.\n  Let's discuss the different types of computers.\n  The biggest type is called a super computer, a computer with lots of CPUS that work on the same problem at the same time using a technique called parallel processing.\n  The next type is called a server.\n  A server holds and accesses lots of data or programs.\n  Free Code Camp is hosted on a server which stores all of that information.\n  Let's talk now about a workstation computer - a computer that may look similar to a personal computer, but has a lot more power and is a lot pricier.\n  Toy Story was built on workstation computers.\n  Now, personal computers are by far the most common.\n  Maybe you've heard \\I'm a Mac!\\ or \\I'm a PC!\\ something indicating they're different, but really my own personal MacBook is still a PC, a personal compter.\n  It's both a Mac and a PC.\n  The last type of computer we'll talk about is a microcontroller, the type of computer you might have in your car that is really good at a small specialized task, but wouldn't be used the same way a PC would be.", "duration": "PT1M31S", "likes": 0, "views": "35355"}, "comments": [{"topLevelComment": {"id": "UgwaZR1ftcx6inlbSWZ4AaABAg", "publishedAt": "2022-07-08T11:45:21Z", "author": "A YouTube Channel", "text": "No \"hi\"?", "likes": 0}}, {"topLevelComment": {"id": "UgyveERjlOL7KYbpwVd4AaABAg", "publishedAt": "2020-10-25T15:41:37Z", "author": "B El", "text": "what about the raspberry pi? it can be used as a PC (admittedly, a very basic one) or a microcontroller, no?", "likes": 0}}, {"topLevelComment": {"id": "Ugwz2fMyTbAMMO-33jp4AaABAg", "publishedAt": "2017-11-17T08:44:31Z", "author": "Abdelmalek Lahmar", "text": "can we call computer with i7 or i5 or core2duo type of super computer", "likes": 2}}, {"topLevelComment": {"id": "UgiHae1ANML_qngCoAEC", "publishedAt": "2016-07-23T09:03:09Z", "author": "SamAI Software", "text": "How about mobile devices?", "likes": 3}, "replies": [{"id": "UgiHae1ANML_qngCoAEC.8GfBuolzSuO9WqqbFb-Q_9", "publishedAt": "2022-01-06T07:30:39Z", "author": "Dnouglas", "text": "@Ho Ho Chi phones aren't like microcontrollers, because they aren't specialized to do one single tasks. Phones can do anything a computer can do, maybe in a different way or not as quickly/efficiently, but it is still technically a pc. Microcontrollers basically do one and only one task, such as home heating systems, radios, etc.", "likes": 4}, {"id": "UgiHae1ANML_qngCoAEC.8GfBuolzSuO9KuA577DZVd", "publishedAt": "2021-03-15T08:10:37Z", "author": "Ho Ho Chi", "text": "Also, you won't expect a mobile device has a 16GB RAM like a notebook or iMac contained.", "likes": 0}, {"id": "UgiHae1ANML_qngCoAEC.8GfBuolzSuO9Ku9uYM9mCh", "publishedAt": "2021-03-15T08:09:02Z", "author": "Ho Ho Chi", "text": "@Nabil Tharwat So why aren't the mobile devices called microcontroller like the monitor using in car ?", "likes": 0}, {"id": "UgiHae1ANML_qngCoAEC.8GfBuolzSuO8LVzhxXeIFm", "publishedAt": "2016-11-20T16:32:22Z", "author": "Nabil Tharwat", "text": "Mobile devices are just like PCs, but just a little smaller, same components, similar performance.", "likes": 5}]}]}