{"video": {"id": "s0SdM2o4noQ", "title": "Pricing Table: CSS Tutorial (Day 10 of CSS3 in 30 Days)", "description": "⭐️Files you need ⭐️\n💻Pricing Table Code: https://www.dropbox.com/sh/884c73ionx2c7mn/AAA0WuGx_gh_ohsk6ftPIzXva?dl=0\n💻All tutorials in this series need this \"_theme-styles\" directory (only download once): https://www.dropbox.com/sh/890hx6ke34oovaz/AAByJ-jb-H5pWuIUx7t_GvQqa?dl=0\n\nThis video works as a stand-alone tutorial but is also day 10 of CSS3 in 30 Days. For the rest of the series, check out this playlist: https://www.youtube.com/playlist?list=PLWKjhJtqVAbl1AfjiGyYxwpdAPi5v-1OU\n\nCSS3 in 30 Days is developed by Brad Hussey. Check out his website for more great tutorials: https://codecollege.ca/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT23M20S", "likes": "314", "views": "15779"}, "comments": [{"topLevelComment": {"author": "Samir khan", "text": "Thank you so much for making this kind of video series. It's amazing best of the best I have ever seen.", "likes": 0}}, {"topLevelComment": {"author": "Rodolfo Vitangcol", "text": "Business Opportunity in Ruvol\n\nI have invented a Board Game [still unpublished and not yet out in the market] that I believe is guaranteed to be as challenging and exciting as CHESS.  I called it “RUVOL.”  \n\nIt is my hope that one day Ruvol may surpass chess as the “Number One Board Game in the World.” \n\nThe weakness of chess is it always starts in fixed positions that the opening moves become “memorizable.”  In fact, not a few have so mastered the moves that they can play against their opponents “blindfolded.”  It is for this very reason that the great Bobby Fischer introduced his so-called “Fischer Random Chess,” where the starting position of the pieces is “randomized” to make the memorization of openings impracticable.  Fortunately, it is also for this reason that I invented Ruvol where “every game” has been calculated to be a challenging one to play.\n\nHOW IS RUVOL PLAYED and HOW YOU CAN MONETIZE IT?\n\nI detailed everything in my YouTube video.  Here is the link:  https://www.youtube.com/watch?v=jcqth0m3-R0\n\nBIG MONEY POTENTIAL IN RUVOL!\n\nIt is worthwhile to note that the people who play chess will be the same people who will play Ruvol.  In my Google search, I learned there are around 800 million chess players in the world.  Even just a small percentage of these 800 million is good enough to earn big money from Ruvol either as an ONLINE GAME BUSINESS or as a PHYSICAL PRODUCT DISTRIBUTOR.\n\nYou may contact me at:  rodolfovitangcol@gmail.com.   \n\nThanks and God bless!\n \nRODOLFO MARTIN VITANGCOL\nThe Ruvol Inventor", "likes": 0}}, {"topLevelComment": {"author": "Cindy Mora", "text": "learn so many new things!", "likes": 0}}, {"topLevelComment": {"author": "Olcat", "text": "I really enjoyed the early tutorials in this series,  but day 9 and 10 were a disappointment. You shouldn't teach using float for layouts, it's too clunky. Flexbox and CSS Grid are what developers actually use to create clean and responsive layouts", "likes": 8}, "replies": [{"author": "Huỳnh Lợi Nguyễn", "text": "He does it on day 22. Basically this series were recorded back in 2017", "likes": 2}]}, {"topLevelComment": {"author": "Viral Raval", "text": "juan mata", "likes": 3}}, {"topLevelComment": {"author": "Messaoud Rahiche", "text": "You're awesome !! Thank you ❤", "likes": 2}}, {"topLevelComment": {"author": "Anis Dhouieb", "text": "I love  this series", "likes": 1}}, {"topLevelComment": {"author": "Milan", "text": "This is the best thing that happened on this channel :D", "likes": 12}}, {"topLevelComment": {"author": "Vitalii", "text": "hello world!", "likes": 1}}]}