{"video": {"id": "sHuuo9L3e5c", "title": "Blazor WebAssembly & Web API on .NET 6 – Full Course (C#)", "description": "Learn Blazor WebAssembly and Web API on .NET 6 by building a shopping cart application using C#. This course also provides a guide on how to integrate a payment gateway into your Blazor WebAssembly component, so that a user is able to pay for products through your application using a debit or credit card or PayPal account.\n\n✏️ Gavin Lon created this course. Check out his channel: https://www.youtube.com/c/GavinLon\n\n💻 Code: https://github.com/GavinLonDigital/ShopOnlineSolution\n\n⭐️ Resources ⭐️\n🔗 Copy Seed Data from GitHub: https://github.com/GavinLonDigital/ShopOnlineSolution/blob/main/ShopOnline.Api/CodeSnippets/OnModelCreating.txt\n🔗 Download Visual Studio 2022 for Widows (Community Edition): https://visualstudio.microsoft.com/vs/\n🔗 A Video on .NET 6: https://youtu.be/EoDY1MvYVx4\n🔗 Download SQL Server 2019: https://www.microsoft.com/en-us/sql-server/sql-server-downloads\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Introduction\n⌨️ (0:00:51) Create the Database using EF Core Code First Database Migrations\n⌨️ (0:26:05) Retrieve Product Data from Database (Web API component)\n⌨️ (0:30:17) Create Classes for Data Transfer Objects (DTOs)\n⌨️ (0:36:22) Create ProductRepository Class (Repository Design Pattern)\n⌨️ (0:43:05) Create ProductController Class\n⌨️ (0:51:08) Create DtoConversion Class (DTO Conversion Extension methods)\n⌨️ (0:57:45) Display Product Data to User (Blazor WebAssembly Component)\n⌨️ (1:39:59) Display Data for Specific Product to User (Web API and Blazor)\n⌨️ (2:06:07) Add Product to Shopping Cart (Web API and Blazor)\n⌨️ (2:52:40) Remove Product from Shopping Cart (Web API and Blazor)\n⌨️ (3:14:03) Update the Quantity of Products in the Shopping Cart (Web API, Blazor, Blazor JavaScript Interoperability)\n⌨️ (3:44:01) Update the Header Menu in Response to a Change to the State of the Shopping Cart (Creating Custom Events in Blazor)\n⌨️ (4:04:48) Integration of PayPal Payment Gateway into Blazor Component\n⌨️ (4:36:03) Dynamically Populate the Side-Bar Menu (Web API and Blazor)\n⌨️ (5:05:44) Optimise Code for Performance (Web API and Blazor)\n⌨️ (5:08:26) Use Include Extension Method in LINQ Query (Web API)\n⌨️ (5:14:00) User Local Storage Functionality (Blazor)\n⌨️ (5:35:42) Outro\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT5H36M45S", "likes": "3034", "views": "161048"}, "comments": [{"topLevelComment": {"author": "Gavin Lon", "text": "Hi everyone! I hope you enjoy and benefit from this course where we build a shopping cart application using Blazor WebAssembly and Web API on .NET 6. A special thank you to Beau for sharing the course on the fantastic FreeCodeCamp channel! - Gavin Lon", "likes": 75}, "replies": [{"author": "Sasha Maksyutenko", "text": "hello\ni have problems with injection paypal payment", "likes": 1}, {"author": "Philibert Ande", "text": "I have an important question concerning the fact that Microsoft strongly advises to use the HttpClientFactory instead of the regulat HttpClient to call the API (socket exhaustion etc..) from the client WASM. I went to another course project and had the same issue,with many other students left with it unanswered. I managed to transform the entire project switching to the use of the HttpClientFactory instead using among others communication technics between components to pass data. I need to know your thoughts about this important issue in your Blazor Bootcamp - .NET 6 (WASM and Server) courses. Possibly modifying the code to allow the use of this technology too?! is it worth it in a production environment?", "likes": 4}, {"author": "AveN7ers", "text": "Awe Bru. Nice course yislaaik. Sharp sharp ekse", "likes": 1}, {"author": "Demekech ቄስ firew", "text": "kk x", "likes": 2}]}, {"topLevelComment": {"author": "William Xiong", "text": "FreeCodeCamp never let me down! Fantastic post! I learnt it a lot from your channel. Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Chris Lamb", "text": "Great course!  It took a bit of time for me to get the cloned version working, perhaps this will help others, here is what worked for me:\n1. clone repo\n2. change connection string in appsetting.json for my server instance (server=localhost...)\n3. run migration in PM (add-migration initial)\n4. build database in PM (update-database)\n5. rt-clk Solution (choose Set Startup Projects - start multiple projects) change ShopOnline.Api to Start, and ShopOnline.Web to Start (need Api to start first, as mentioned in video)\n6. Hit Start\n\nI learned a great deal from this course.  Thank you Gavin for all your great work on this!", "likes": 0}}, {"topLevelComment": {"author": "Dave Storm", "text": "Thank you so very much for this course. It's always great to see the entire picture when learning this stuff with a lot of attention towards a more professional way of doing coding. I love that you broke everything down every step of the way without spending too much time on aesthetics (an \"advanced\" paid course, I had taken, spent 10% of their time on fiddling with CSS & HTML  when it was not even the topic - and, by the end, I didn't really learn anything I didn't already know as well as spending too much time on the obvious, then glossing over/zipping through the really important stuff w/o proper explanations - the instructor was a copy-pasta and didn't quite understand the material he was teaching).", "likes": 0}}, {"topLevelComment": {"author": "HCShuffle", "text": "Bootstrap, yuk.", "likes": 0}}, {"topLevelComment": {"author": "Yoga Rizki Pratama", "text": "Did anyone know how to deploy this app in netlify or other free host web?", "likes": 0}}, {"topLevelComment": {"author": "Warrenayiss", "text": "without surprise I failed the backend part ^^\"\nthe error when trying the update-databse: A network-related or instance-specific error occurred while establishing a connection to SQL Server. The server was not found or was not accessible. Verify that the instance name is correct and that SQL Server is configured to allow remote connections. (provider: Named Pipes Provider, error: 40 - Could not open a connection to SQL Server)", "likes": 0}}, {"topLevelComment": {"author": "Mr Gr33n", "text": "Ok so i think this tutorial is wrong, all that you do is only viable with project in your project. \nThe part where you add the connection to the Backend should be made by adding the SwashBuckle in your service. This would Auto Update AND Generate all the relevant object and component without the need of adding all by hand like what you did. You still add the HttpClient but that s all. This make it possible to have micro services with no Hard link to the backend project like you just did.", "likes": 0}}, {"topLevelComment": {"author": "tsopanaras", "text": "Good tutorial, never understood why relationships between entities were never created in the database though", "likes": 1}}, {"topLevelComment": {"author": "Ryan B", "text": "One of the best blazor courses I've seen.", "likes": 0}}, {"topLevelComment": {"author": "Tavern Talk", "text": "How should we go about the naming portion of the database? Yours starts with gavinlongspc. I’m unsure as to what I should do on my machine.", "likes": 0}}, {"topLevelComment": {"author": "Alex Shefer", "text": "I love the course but there is issue on Web. API is working well in swagger, but if you try to build web you will get error : no fetch data. I checked and see that request is not coming from product service on web to method GetItems in product controller in API. Does anyone know how to fix it?", "likes": 0}}, {"topLevelComment": {"author": "Facundo Vega", "text": "This tutorial is amazing! thanks a lot for this high quality content!", "likes": 1}}, {"topLevelComment": {"author": "Vic Y", "text": "Where is the GitHub link to download the code?", "likes": 0}}, {"topLevelComment": {"author": "Vic Y", "text": "Haven't finished watching yet but this is one of the best tutorial Videos I have every watched, very details and cleared.  I need to watch in stages to follow but best of the best.", "likes": 0}}, {"topLevelComment": {"author": "PikoMeter", "text": "This tutorial is a thousand times higher effort than any paid courses on udemy. Insane, Thank you very much.", "likes": 19}, "replies": [{"author": "Dave Storm", "text": "I know, right?", "likes": 0}]}, {"topLevelComment": {"author": "Val Trav", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "QuTie PhoeBe", "text": "Great vid.👍😁 I'm a bit new to blazor web assembly.  Can a web assembly consume multiple Web Api base addresses? \nLet's say the app is consuming 1 web api from amazon and another web api from Microsoft. Is that possible? Thanks.", "likes": 0}, "replies": [{"author": "Saleeem Jamali", "text": "Yes", "likes": 0}]}, {"topLevelComment": {"author": "Fabio Braghin", "text": "Thanks for the tutorials and the presentation. A really good point to start with for developing an application using Blazor. A side note for the excellent speaking skills.", "likes": 2}}, {"topLevelComment": {"author": "Programming", "text": "https://youtube.com/channel/UCIoB7EHLpc0bKpzhQhQCDgA", "likes": 0}}, {"topLevelComment": {"author": "Starr Duskk", "text": "How are you quick adding the properties? What key combo? thanks for the video!", "likes": 0}, "replies": [{"author": "kadel42", "text": "Type prop and double Tab.", "likes": 0}]}, {"topLevelComment": {"author": "Sasha Maksyutenko", "text": "Hello \nVery good course \nBut I have some mistakes. Can you help to fix it?\nHow can I give you my project?", "likes": 1}}, {"topLevelComment": {"author": "daniel goldin", "text": "i am getting a build error at 1:26 of the video:\n\r\nC:\\Users\\Yechiel Zidell\\Blazor\\ShopOnineSolution\\ShopOnine.Web\\Program.cs(8,28,8,31): error CS0246: The type or namespace name 'App' could not be found (are you missing a using directive or an assembly reference?)\r\n2>Done building project \"ShopOnine.Web.csproj\" -- FAILED.\nplease advise", "likes": 0}}, {"topLevelComment": {"author": "Reshma R", "text": "Can you please do it for AirPay Gateway?", "likes": 0}}, {"topLevelComment": {"author": "Your Answer", "text": "Great!", "likes": 1}}, {"topLevelComment": {"author": "Chauhan Shubham", "text": "loved this video learned so much from it", "likes": 1}}, {"topLevelComment": {"author": "Kourosh Salahshoor", "text": "I wonder why using web api when both backend and frontend understand c# object? I think serverside blazor is understimated", "likes": 0}, "replies": [{"author": "Ryan B", "text": "You can't create an offline implementation of a server app.  This project lends itself well to a Progressive Web App.", "likes": 0}]}, {"topLevelComment": {"author": "Patrick Makanga", "text": "Followed the course up to the end. Good Stuff!", "likes": 1}}, {"topLevelComment": {"author": "Khwima Khunga", "text": "the product displays are not showing after clicking on a product", "likes": 0}}, {"topLevelComment": {"author": "Mşk", "text": "I finished the project but  i am getting an error like this    '<' is an invalid start of a value. Path: $ | LineNumber: 0 | BytePositionInLine: 0.      I searched the internet but couldn't find a solution. can anyone help?", "likes": 0}}, {"topLevelComment": {"author": "Sanket Gandhi", "text": "Quick question \nDo we have video about publish and deployment of webassembly  project with .net 6?", "likes": 0}}, {"topLevelComment": {"author": "Marcos Pereda", "text": "Hi, I'm not able to do the spinner working ... I've alread changed the color to black, also in source code generate the spinner should be there\n<div class=\"lds-spinner\" b-d9zcn27csp=\"\"><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div><div b-d9zcn27csp=\"\"></div></div>\nbut is just not shown ... any ideias ? thanks :-)", "likes": 0}, "replies": [{"author": "Cisco Ramon Sanchez", "text": "For me this was a problem with css specificity. \nFor my case, to fix it I had to modify the `ìndex.html` file, hence it is there where there all css file are imported after compilation.\n\nJust make sure that any css file you include must be before these following:\n\n<!-- include all other css file in here, bootstrap and other and import the following in that order -->\n\n<link href=\"css/app.css\" rel=\"stylesheet\"/>\n<link href=\"ShopOnline.Web.styles.css\" rel=\"stylesheet\"/>", "likes": 0}]}, {"topLevelComment": {"author": "Philibert Ande", "text": "I have an important question concerning the fact that Microsoft strongly advises to use the HttpClientFactory instead of the regulat HttpClient to call the API (socket exhaustion etc..) from the client WASM. I went to another course project and had the same issue,with many other students left with it unanswered. I managed to transform the entire project switching to the use of the HttpClientFactory instead using among others communication technics between components to pass data. I need to know your thoughts about this important issue in your course. Possibly modifying the code to allow the use of this technology too?! is it worth it in a production environment? THANK YOU FOR ANSWERING THE FUCKING QUESTION", "likes": 0}}, {"topLevelComment": {"author": "Dick Baker", "text": "1. ShopOnlineSolution.sln expects to have .editorconfig but this is missing on GH repo\n2. even after creating a new .editorconfig, my new VS2022CE (17.3.0 Preview 1.1) kicks out MANY warnings (often due to NRT issues or \"xxx can be simplified\" optimisations)\n3. also no .gitignore, contributing.md, LICENSE.txt\nGavin : would you accept a PR so these code warnings go away ?", "likes": 0}}, {"topLevelComment": {"author": "Philibert Ande", "text": "I have an important question concerning the fact that Microsoft strongly advises to use the HttpClientFactory instead of the regulat HttpClient to call the API (socket exhaustion etc..) from the client WASM. I went to another course project and had the same issue,with many other students left with it unanswered. I managed to transform the entire project switching to the use of the HttpClientFactory instead using among others communication technics between components to pass data. I need to know your thoughts about this important issue in your Blazor Bootcamp - .NET 6 (WASM and Server) courses. Possibly modifying the code to allow the use of this technology too?! is it worth it in a production environment?", "likes": 1}, "replies": [{"author": "Mangekyō Sharingan", "text": "dejavu", "likes": 0}]}, {"topLevelComment": {"author": "Marc Durtal", "text": "I have an important question concerning the fact that Microsoft strongly advises to use the HttpClientFactory instead of the regulat HttpClient to call the API (socket exhaustion etc..) from the client WASM. I went to another course project and had the same issue,with many other students left with it unanswered. I managed to transform the entire project switching to the use of the HttpClientFactory instead using among others communication technics between components to pass data. I need to know your thoughts about this important issue in your Blazor Bootcamp - .NET 6 (WASM and Server) courses. Possibly modifying the code to allow the use of this technology too?! is it worth it in a production environment?", "likes": 3}, "replies": [{"author": "BushersNeto", "text": "Is crazy, because the template it includes HttpClient--", "likes": 0}]}, {"topLevelComment": {"author": "Scott Taylor", "text": "Why did you elect to use separate base classes for your razor components rather than just code behind files?  Base classes would make sense if they're to be reused across multiple razor subclasses (and I'm only halfway through the video, so maybe that happens later) but if there's only one razor component inheriting each base class, code behind seems much simpler and reduces clutter in the Solution Explorer.  I'm curious if I'm overlooking some advantage that the base class approach introduces.", "likes": 3}}, {"topLevelComment": {"author": "AryNova", "text": "If I will know this stuff, will I still need JavaScript?", "likes": 0}}, {"topLevelComment": {"author": "VORTEX-ASTRAL", "text": "vraiment je vais juste merci pour cette video, vous m'avez trop edifier avec c cours.", "likes": 0}}, {"topLevelComment": {"author": "Gamer Potato", "text": "at 1:20 I typed add-migration FixSpelling_Furniture but the created class doesnt have anything in the up() method. Anyone knows how to fix this?", "likes": 0}}, {"topLevelComment": {"author": "Browarus Pierogus", "text": "so what kind of magical service(s) is hosting that app calls", "likes": 1}}, {"topLevelComment": {"author": "TheyCallMeTojo", "text": "This video helped some. You do a lot of telling what to do and very little explaining why you're doing it.", "likes": 2}, "replies": [{"author": "Marcos Pereda", "text": "Maybe are just design patterns ?", "likes": 0}]}, {"topLevelComment": {"author": "Youssef Kassem", "text": "i love working with blazor, but i have an issue is that when i host my blazor project it is taking too much time to load via browser how can i solve this issue?", "likes": 0}}, {"topLevelComment": {"author": "Hào Nguyễn", "text": "Hey...the DtoConversions look nice...I usually use AutoMapper to map and transfer Dtos...nice to know one other way...", "likes": 3}}, {"topLevelComment": {"author": "Mike Clinton", "text": "So, anyone else can fork this and show us all how to add login/registration to this project?", "likes": 0}}, {"topLevelComment": {"author": "mwimb", "text": "would love to see a video on different methods to deploy an application like this", "likes": 2}}, {"topLevelComment": {"author": "mwimb", "text": "isn't using the repository pattern a bit of over-engineering for such a small app", "likes": 0}}, {"topLevelComment": {"author": "Elias Dargham", "text": "Quick question:\nThe ShopOnlineDbContext class and the HttpClient class both implement the IDisposable interface. Shouldn't they be wrapped in a using statement?", "likes": 3}, "replies": [{"author": "Gavin Lon", "text": "@Elias Dargham You are very welcome! :)", "likes": 1}, {"author": "Elias Dargham", "text": "@Gavin Lon Understood. Thank you very much for the clarification I appreciate it.", "likes": 2}, {"author": "Gavin Lon", "text": "The DI (Dependency Injection) system within .NET handles the lifetime of these objects. An example of a problem you may run into if you use the using statement to wrap the DbContext object is you'll run into problems with how entities are tracked or with tracked entities not saving when you think they should. This issue is among a lot of other issues that may be encountered when wrapping these objects in a using statement.", "likes": 6}]}, {"topLevelComment": {"author": "Devil mind", "text": "thanks even if i have no idea what I'm doing  :)", "likes": 0}}, {"topLevelComment": {"author": "Neolisk", "text": "Why the echo?", "likes": 0}}, {"topLevelComment": {"author": "Martin Kubus", "text": "Thanks for sharing this content. Great video.", "likes": 1}}, {"topLevelComment": {"author": "Bobby Cusicanqui", "text": "Thanks!", "likes": 2}}, {"topLevelComment": {"author": "Mohamed Cisse", "text": "Excellent \njust need to add pagination and filter", "likes": 0}}, {"topLevelComment": {"author": "Tisa Sav", "text": "Thank you for your great effort in this channel, but I hope you will put the translation into Arabic because we find it difficult to understand your content and thank you in advance", "likes": 0}}, {"topLevelComment": {"author": "Gerard Lanphear", "text": "Nice stuff.  One of the things about Code First that really gives me heartburn is the tendency to build data contexts with absolutely no constraints whatever.  It is so easy and less time consuming to create the database first and use the reverse engineer tool.  I have an application written with code first and no constraints.  Did you know that if a save to the context  is attempted and there is a value with a foreign key that does not exist such as 0 when the values are 1 through 5 a cascade failure can occur causing the web server to run out of memory? 😮 Try/Catch on the SaveChanges will not help you.", "likes": 9}, "replies": [{"author": "Dave Storm", "text": "Plus setting your user to \"god mode\" on SQL Server just to create a database, is bad practice. (note these tutorials all use SQL Express)", "likes": 1}, {"author": "Browarus Pierogus", "text": "good point - also some corrupted json objects can be very bad for protocol and crash despite catch blocks. Im guessing those dtos are self serializing/deserializing objects done invisibly by net. Some stuff without deeper knowledge here is quite hard to swallow", "likes": 0}]}, {"topLevelComment": {"author": "Şahin Cebe Videoları", "text": "‪🚀 Luffy 🚀Get luffy now and hold to become a future millionaire 🚀‬\n‪  $100 x $10000  💰‬\n\n‪  LuffyToken 🔥🔥🔥‬", "likes": 0}}, {"topLevelComment": {"author": "Programmer", "text": "Great Sir, ❤️", "likes": 1}}, {"topLevelComment": {"author": "Santiago Pacini", "text": "Please a full or crash course of PurgeCss its could be awesome🔥", "likes": 0}}, {"topLevelComment": {"author": "jitendra mistry", "text": "angular in depth", "likes": 0}}, {"topLevelComment": {"author": "Ty", "text": "Does this channel have any tutorials that do not use the Visual Studio framework? I'd appreciate being able to learn in a way I can take back to Linux without much hassle. Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Somele El Preemo", "text": "Hey there what are prerequisite before watching this video?", "likes": 0}}, {"topLevelComment": {"author": "SKEETER STUDIES", "text": "Please make a video on ussd application programing", "likes": 0}}, {"topLevelComment": {"author": "CodeDreamer_Ben", "text": "Really love it!", "likes": 1}}, {"topLevelComment": {"author": "John Kucharsky", "text": "I can do the same app in react for hour", "likes": 0}}, {"topLevelComment": {"author": "Sajid Husain", "text": "Which laptop to consider for a computer science student if don't wanna game?", "likes": 0}}, {"topLevelComment": {"author": "Dorothy Arnoldg", "text": "really love your coding, keep us updated", "likes": 4}}, {"topLevelComment": {"author": "Vincent Ray Alba", "text": "Hi I like to request make solid works video for beginners thanks.", "likes": 0}}, {"topLevelComment": {"author": "Clikum", "text": "At 23:52 when I use the update-database command I get an error that the server was not found or was not accessible. I never used SQL Server before, what steps are you supposed to take to set up the SQL server? I only downloaded SQL server management studio and SQL server configuration manager.", "likes": 2}, "replies": [{"author": "Clikum", "text": "I found the issue, the server name I entered in appsettings.json was not matching the server in SQL server management studio", "likes": 4}]}, {"topLevelComment": {"author": "Z S", "text": "An ad every 8 minutes! Come on, bro!", "likes": 0}}, {"topLevelComment": {"author": "Jeni Jmt", "text": "Can I get job from you I'll turn your article into voiceover", "likes": 0}}, {"topLevelComment": {"author": "Akrem Khelifi", "text": "Great work sir , could you make new video with .MAUI  with the same content", "likes": 4}}, {"topLevelComment": {"author": "murat useini", "text": "My question is about project structure, is it based on Clean architecture ( Onion architecture ) or just MVC ?? thank you :)", "likes": 3}}, {"topLevelComment": {"author": "Wina", "text": "Mrs Scarlett is legit and her method works like magic I keep on earning every single week with her new strategy", "likes": 39}, "replies": [{"author": "Fact Planes", "text": "Thieves, fellows don't fall for these thieves, they're scammers 🙏🙏🙏🙏🙏", "likes": 1}, {"author": "Maryann Brenda glam", "text": "@K¤u@k¤u Arm@nd Yes but do you know I have been paid out today", "likes": 0}, {"author": "K¤u@k¤u Arm@nd", "text": "Anyone who she handles he's or her trade for I believe is so lucky", "likes": 0}, {"author": "Ria Ricis Berbagi", "text": "𝐰𝐡𝐚_𝐭𝐬_𝐚𝐩𝐩 +𝟭𝟯𝟰𝟲𝟯𝟲𝟮𝟰𝟱𝟴𝟭", "likes": 0}, {"author": "Mūkåbärū", "text": "Please how do I get in touch with this famous MRS SCARLETT??", "likes": 0}]}, {"topLevelComment": {"author": "Programmer", "text": "But I have read and heard blazor is a failure and not many people are using it. Please guide me should I learn it?", "likes": 0}}, {"topLevelComment": {"author": "william programer", "text": "⭐⭐⭐⭐⭐", "likes": 3}}, {"topLevelComment": {"author": "Akash papnai", "text": "I love to work on Blazor but I've been facing difficulty implementing return URL.", "likes": 1}}, {"topLevelComment": {"author": "TWENTYHATE", "text": "Bro teaching us from the church", "likes": 3}}, {"topLevelComment": {"author": "mister coder", "text": "can i use blazor for creating standalone apps for linux (with no need for running a server at the customer pc)?", "likes": 3}}, {"topLevelComment": {"author": "Omprakash Acharya", "text": "I really like your contents. Keep on uploading good videos.", "likes": 6}}, {"topLevelComment": {"author": "Bernard Neal", "text": "Nice video", "likes": 2}}, {"topLevelComment": {"author": "Martin B.R", "text": "Love Blazor", "likes": 2}}, {"topLevelComment": {"author": "Hell Yeah Hydra", "text": "Webassembly with typescript please", "likes": 2}, "replies": [{"author": "Shivendra P. Singh", "text": "It's 1 liner to load a wasm module, use Webassemby.Instantiate function.\nNot worth whole tutorial series i guess.", "likes": 0}]}, {"topLevelComment": {"author": "Moon Dev", "text": "i just wanted to say thank you for clarifying blazor webassembly!", "likes": 4}}, {"topLevelComment": {"author": "Mr. Berry", "text": "I'm really liking Microsoft lately, minus Azure VMs.", "likes": 13}, "replies": [{"author": "Mr. Berry", "text": "@ioneocla Azure VMs tend to have more hours of downtime.  Nearly double the downtime of GCP or AWS.", "likes": 1}, {"author": "ioneocla", "text": "Why ?", "likes": 0}]}, {"topLevelComment": {"author": "Quantum E+", "text": "Very nice :)", "likes": 3}}, {"topLevelComment": {"author": "PYTHON SHORTS", "text": "I don't know god is present or not but I'll surely believe that everyone who teaches for free is god\n\nYou're god", "likes": 14}, "replies": [{"author": "AryNova", "text": "they still get paid", "likes": 0}, {"author": "Kobalt", "text": "You may be sarcastic but you should know that God is God", "likes": 3}]}, {"topLevelComment": {"author": "FKN XIV", "text": "Interesting!", "likes": 1}}, {"topLevelComment": {"author": "Ahmido Senadoro", "text": "💪", "likes": 2}}, {"topLevelComment": {"author": "MR.TAMILCRICKET", "text": "Wow 😳 Super", "likes": 2}}, {"topLevelComment": {"author": "The Codfather", "text": "Yes!!! Thank you so much ♥️", "likes": 6}}, {"topLevelComment": {"author": "MobileCoder", "text": "Hell yeah🔥🔥", "likes": 1}}]}