{"video": {"id": "SUS44Lj6oBI", "title": "The Definition of Ready - Agile Software Development", "description": "Have you ever started work on a user story that wasn’t ready to work on yet? Create a Definition of Ready to establish reasonable guidelines as to what conditions need to be met before you pull a user story into a sprint or begin work on it. Creating and following a Definition of Ready could double the speed of your team.\n\nVideo by Agile Coach Chris Gagné: https://chrisgagne.com/\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT3M14S", "likes": "249", "views": "22225"}, "comments": [{"topLevelComment": {"author": "Allan Atkinson", "text": "Nice clear, concise and actionable. Well done!", "likes": 0}}, {"topLevelComment": {"author": "jose donato", "text": "really good video. thanks", "likes": 0}}, {"topLevelComment": {"author": "Justin O'Neill", "text": "Great video Chris and perfect timing. I'm doing a deep dive on the proper elements of a \"User Story\". \n\nQuestion: What's your thoughts on Story Points vs Hour Estimates? I feel like hour estimates are more powerful because they can achieve both the weight and length of a user story at the same time. What do you think?", "likes": 2}, "replies": [{"author": "Justin O'Neill", "text": "@Chris Gagné 3 years later, but i've been using Story Points over hours and it makes total sense. Still waiting for that video though bro 😂", "likes": 3}, {"author": "Chris Gagné", "text": "Hi Justin, thanks!  the explanation is a bit much for a YouTube comment response, but in a nutshell: RAND found in the 1940's that relative estimates (such as story points) are both faster and more accurate than absolute estimates (such as hours). This was carried further by folks like Mike Cohn who invented Planning Poker. I'll probably make an explainer video about this because it's a contentious issue for many teams and I've got a lot more to say about this, so look forward to more in the near future! :)\n\nOne thought: keep in mind that we are trying to develop cross-functional teams. What may takes one person 8 hours might take another person 4 or 40. How does this account for pairing or mobbing? How does this account for highly complex or uncertain tasks?\n\nAnother thought: you can increase the number of story points your team completes in a sprint. Can you increase the number of hours you complete in a sprint? :)", "likes": 1}]}, {"topLevelComment": {"author": "erick garcia", "text": "cool video, thx", "likes": 4}, "replies": [{"author": "Chris Gagné", "text": "<3", "likes": 0}]}]}