{"video": {"id": "tS6oP1NveoI", "title": "requestAnimationFrame() - Beau teaches JavaScript", "description": "The window.requestAnimationFrame() method tells the browser that you wish to perform an animation and requests that the browser call a specified function to update an animation before the next repaint. \n\n💻 Code: https://codepen.io/beaucarnes/pen/ybzpZE?editors=1010\n\n🔗 More info: https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame\n\n🐦 Beau Carnes on Twitter: https://twitter.com/carnesbeau\n\n⭐JavaScript Tutorials Playlists⭐\n▶JavaScript Basics: https://www.youtube.com/playlist?list=PLWKjhJtqVAbk2qRZtWSzCIN38JC_NdhW5\n▶Data Structures and Algorithms: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkso-IbgiiP48n-O-JQA9PJ\n▶Design Patterns: https://www.youtube.com/playlist?list=PLWKjhJtqVAbnZtkAI3BqcYxKnfWn_C704\n▶ES6: https://www.youtube.com/playlist?list=PLWKjhJtqVAbljtmmeS0c-CEl2LdE-eR_F\n▶Clean Code: https://www.youtube.com/playlist?list=PLWKjhJtqVAbkK24EaPurzMq0-kw5U9pJh\n\n-\nWe're busy people who learn to code, then practice by building projects for nonprofits. Learn Full-stack JavaScript, build a portfolio, and get great references with our open source community.\n\nJoin our community at https://freecodecamp.com\nRead great tech articles at https://medium.freecodecamp.com", "duration": "PT4M22S", "likes": "562", "views": "39371"}, "comments": [{"topLevelComment": {"author": "Kostiantyn Karzhanov", "text": "thank you, Beau! It's a great lesson!", "likes": 0}}, {"topLevelComment": {"author": "Mustafa Habibi", "text": "I don't understand anything here 😒", "likes": 1}}, {"topLevelComment": {"author": "Rajik Kali", "text": "Good planning, bad execution. I know what you're saying because I'm a coder, but otherwise I think I wouldn't have any idea. Speak in human terms, not technical ones.", "likes": 2}}, {"topLevelComment": {"author": "Julian Hernandez", "text": "I thought I was the only one who thought this video was terrible.", "likes": 2}}, {"topLevelComment": {"author": "Carlos Benavides", "text": "Very poor explanation...", "likes": 1}}, {"topLevelComment": {"author": "Ischys", "text": "I watched this to understand how requestAnimationFrame works, now I need to find another PROPER video to understand.", "likes": 13}}, {"topLevelComment": {"author": "CANIHAZURDREAMSPLS", "text": "can you make a more clear video, bc I feel like this is a very important concept, and this video didn't do justice - PLEASE", "likes": 6}, "replies": [{"author": "CANIHAZURDREAMSPLS", "text": "@Charles Bungabong what...", "likes": 0}, {"author": "Charles Bungabong", "text": "beau teaches javascript, dude!", "likes": 0}]}, {"topLevelComment": {"author": "Raidou Ng", "text": "@freeCodeCamp perhaps it would be good to update this video ?:d The comments kind of indicate it would need some revision :d", "likes": 1}}, {"topLevelComment": {"author": "Rafał Dydkiem Machał", "text": "It looks to me like you don’t fully understand how it works. What’s the point in cancelling animation like that? You say you cancel animation, but it’s not like that, because requestAnimationFrame() doesn’t work like interval. It works like a timeout! The cancelAnimationFrame() is almost never needed in practice. Instead, you would just check condition before running requestAnimationFrame() in your loop.", "likes": 3}, "replies": [{"author": "Rafał Dydkiem Machał", "text": "@salmanrf well, it's not that stupid. It all depends what you need. JavaScript games, for example, call requestAnimationFrame() all the time - no matter if anything changed or not. So there's no single \"correct\" solution. It gets more tricky if you want to make sure that the speed of your app is consistent. In theory, requestAnimationFrame() may work in 1 millisecond or even a few seconds. You never know, because it depends on the hardware being ready. In practice it's quite consistent, but if you're ever about to make a JavaScript game, you'd probably want to use DateTime to check how much time actually passed between frames. In other words, assuming that 1 frame = 1 logic cycle is usually wrong. Do you get it?", "likes": 1}, {"author": "salmanrf", "text": "@Rafał Dydkiem Machał i mean, for example i want to animate a certain element to move for 1000 pixels,  what i did before was check if the distance traveled is less than 1000, and invoke the rAF outside the if statement, so it will always get called regardless the test, but now i realize that i need to put the rAF call in the if statement block, pretty stupid right ?", "likes": 0}, {"author": "Rafał Dydkiem Machał", "text": "salmanrf wait, wait. I'm not sure if I understand you correctly. If you call requestAnimationFrame() as the last step in the callback, you actually do it right. Just like with setTimeout(), which runs only once, requestAnimationFrame() does exactly the same thing. The only difference is when - setTimeout() runs after specified amount of time and requestAnimationFrame() runs along with the next animation frame (which means almost immediately - in a fraction of second).", "likes": 0}, {"author": "salmanrf", "text": "@Rafał Dydkiem Machał i just learned about this thing yesterday, it was so frustating at the beginning but now it is much clearer", "likes": 0}, {"author": "salmanrf", "text": "@Rafał Dydkiem Machał  @Rafał Dydkiem Machał ohh !, i just realized, ever since i learned this function, i always reinvoke the rAF as the last statement in the animation function, separate from the test condition, so even the animation is finished the rAF is still getting called over and over again, lol, that is a ridiculous mistake from me, and you just made me realize it, thank you so much", "likes": 0}]}, {"topLevelComment": {"author": "Vivek Raj", "text": "I can't understand timestamp😵", "likes": 7}, "replies": [{"author": "10 01", "text": "@Rafał Dydkiem Machał I spent a while to understand how it works through playing around with different elements but then I saw your comment...\nWell, at least I got the answer on my own", "likes": 0}, {"author": "Rafał Dydkiem Machał", "text": "Timestamp in this case is just the amount of time that passed since you loaded your page. It’s useful, because keep in mind that animation engine doesn’t guarantee any stable progress. In theory, you can get 10 frames per second and then after a while it can go up 60. If you simply assume that 1 frame = 1 point in time, you may get your animation, game or whatever weird in pace. For example, your character can go slow for a few seconds and then go fast, just because your computer now is ready to render more frames per seconds, for any reason.", "likes": 7}]}, {"topLevelComment": {"author": "airas yaqub", "text": "U didnt explain it good. U should shed some light on timestamp which is a very imp thing in rAF.", "likes": 15}, "replies": [{"author": "camelCazeLyrics", "text": "Yeah I have a hard time understanding it too. Its because thats not my native language I have to search every word lol", "likes": 0}, {"author": "Chowdhury Md Sami Al Muntahi", "text": "Right. I do not understand what timestamp is. Can you explain?", "likes": 1}]}, {"topLevelComment": {"author": "Marc Ziel", "text": "good video, but since I'm allergic to global variables and magic numbers I couldn't help myself and tweaked the code a bit. I've also changed the behavior of the box so that after toggling it starts movement from the position it was left at: https://codepen.io/marzelin/pen/MmQdMB", "likes": 4}}, {"topLevelComment": {"author": "coidoczego", "text": "No optimization? It's bad coding it supossed to be some like: \nfunction anim(timestamp) {\n  window.requestAnimationFrame(anim);\n  clear();\n  steps(actorList.steps);\n  draws(actorList.draws);\n}", "likes": 3}}]}