{"video": {"id": "tvfeBLMA_Q4", "title": "APIs in React Tutorial - Recipe App using React Router", "description": "Learn how to use external APIs with React and React Router. This tutorial shows how to create a recipe finder application in React.\n\n💻Starter Files: https://drive.google.com/drive/folders/1iGkTFjBYngPOlxTGgoOjH5IKKKKf14uL\n💻Source code: https://github.com/hamza-mirza/react-recipe-app\n\n🎥Tutorial from Hamza Mirza. Check out his YouTube channel: https://www.youtube.com/c/HamzaMirza\n📸Hamza on Instagram: https://www.instagram.com/hmz.js/", "duration": "PT1H33M11S", "likes": "1246", "views": "60990"}, "comments": [{"topLevelComment": {"author": "Nada", "text": "this really helped me a lot, thanks man : ) !!", "likes": 0}}, {"topLevelComment": {"author": "Dilan Ramanayaka", "text": "Learned so much. Thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Anonymous", "text": "Fun fact: you tried using instructor's API key instead of creating one", "likes": 0}}, {"topLevelComment": {"author": "Yaroslav S", "text": "thanks so much for the tutorial,\nso fork2food has shot down yet", "likes": 0}}, {"topLevelComment": {"author": "אבי טולדנו", "text": "I appreciate the work you put into this, but you should read pick up a book on JS and learn what 'this' is before giving a course.", "likes": 0}}, {"topLevelComment": {"author": "Andrew Lawgar", "text": "need timelines.", "likes": 0}}, {"topLevelComment": {"author": "supergaljoy1994", "text": "Good tutorial! Just finished today and I'm happy.\nA few things: \n1) I had to use a different API since the old one got somewhat shut down or whatever so I used Spoonacular instead. It was similar enough\n2) Used react Hooks instead of class components because I saw a video on hooks and wanted to try it out -> lots of useEffect and useState hooks\n3) Hardest part was understanding the equivalency between useEffect and componentDidMount/Update. If anyone is wondering how I got it working -> useEffect but empty dependencies list: [] == componentDidMount, then used a second useEffect hook for componentDidUpdate based on state.recipes as the dependency.  \nBoth will run on first go or when heading back to the main page but localstorage stays filled because once state.recipes is filled the first time, it'll just keep passing that data back and forth between state.recipes and localstorage so the main page data isnt lost. At least that's how I understood it.\n\nAnyway thanks again!", "likes": 5}, "replies": [{"author": "supergaljoy1994", "text": "@Baldstuck \nSo my main 2 useEffects look like this:\n\n  useEffect(() => {\n    // console.log(\"mounted\");\n    //  handle previous state\n    const json = localStorage.getItem(\"recipes\"); //happens before local storage is cleared\n    const savedRecipes = JSON.parse(json);\n    setState({recipes: savedRecipes}); // -> triggers the second useEffect hook\n  }, []) // no dependencies the equivalent of component did mount (runs once at initialization)\n\n  useEffect(() => {\n\n    //handle saving current state\n    const returnedRecipes = JSON.stringify(state.recipes);\n    localStorage.setItem(\"recipes\", returnedRecipes); \n    // this will stick when looking at indiv recipes\n    // and, effectively, local storage doesnt get cleared -> constantly reapplied with state\n\n    // console.log(\"updating\");\n  },[state.recipes]); //both mounts and updates based on state (refresh or new page). \n\nSo from how I understand useEffect with or without a dependency list [] or [state.recipes] useEffect is similar to componentDidMount in that it will always run when the component is used. However with a dependency list, it gains the added effect of componentDidUpdate when the state (data variable to watch) gets updated. \nI figured this method might work because localStorage was able to persist with data when I switched to a page for an individual recipe even though at that point the state updated. The first useEffect hook would come into play when that individual recipe would show and reset the state to whatever localStorage was holding.\nWhen going back to the main page localStorage would get cleared, but since the first useEffect hook saved the state, the second useEffect hook can reuse that state and set it back into localStorage.", "likes": 1}, {"author": "Baldstuck", "text": "Could you explain or share more  about 3. Im tryna use useEffect instead of class components as well, but I'm not sure how to write it.", "likes": 1}]}, {"topLevelComment": {"author": "Evgeny Levchenya", "text": "Deprecated", "likes": 0}}, {"topLevelComment": {"author": "Pritha Banerjee", "text": "most complicated tutorial i have seen", "likes": 0}}, {"topLevelComment": {"author": "Cheline Magsano", "text": "\"Okay, so..\" thank you for sharing this tutorial!", "likes": 1}}, {"topLevelComment": {"author": "Sridhar", "text": "I think there will be an issue when your search value has a space, because it is not url encoded.", "likes": 0}}, {"topLevelComment": {"author": "Mert", "text": "Food2Fork.com has shut down.", "likes": 2}}, {"topLevelComment": {"author": "Gabriel Gitonga", "text": "Hi, good job is done here with on-point clear explanations but currently the site you used as a backend is down, can you please update the tutorial backend API?", "likes": 0}}, {"topLevelComment": {"author": "Carlos Venegas", "text": "Anyone use useEffect for localStorage at the end?  I would love to see a solution.  thanks!", "likes": 1}}, {"topLevelComment": {"author": "Jennifer Purcell", "text": "i keep getting a rejection of \"type error:  cannot read property 'map' of null in the recipes.js file", "likes": 0}}, {"topLevelComment": {"author": "Mariem Benzineb", "text": "Great tutorial !! thank you", "likes": 0}}, {"topLevelComment": {"author": "Anil Mirge", "text": "Overall, great tutorial. Just for the benefit of beginners, my two cents in the video would be to handle the localStorage get in componentDidMount() method to avoid any unnecessary error when we test the starting page in a new window such as incognito or clear the localstorage key. \n\n\ncomponentDidMount() {\n\tconst json = localStorage.getItem('recipes');\n\tif (json) {\n\t\tconst recipes = JSON.parse(json);\n\t\tthis.setState({ recipes: recipes });\n\t}\n}\n\n\nPlus, before setting the recipes in the state, just throw an alert if the result for a search string didn't have any data back. This is to handle any search string say 'okra' that would not bring any results back. Providing some kind of feedback would be helpful to know what's really happened.\n\n\nif (recipes.length === 0) {\n\talert('No Recipes found for the given search item');\n}\nthis.setState({\n\trecipes: recipes,\n});\n\n\nLastly, if you could share how to best load some default recipes on page load the very first time (may be inside componentDidMount() method)?", "likes": 0}, "replies": [{"author": "SMaree", "text": "I see the api site is shut down? What did you use as an alternative?", "likes": 1}]}, {"topLevelComment": {"author": "Bonnie Simon", "text": "Hey man. Nice informative beginner friendly tutorial. Was able to follow along easily.\n\nI used hooks instead of class based components, and the part where you do the localStorage stuff is not working for me.\nLike the localStorage is working but the componentDidMount part is not working.\nAnd I have no idea on how to implement componentDidMount using Hooks.\nI tried googleing, but can't seem to find a solution that works for me.\nThanks in advance!!", "likes": 2}}, {"topLevelComment": {"author": "Adrean", "text": "I'm getting this error when I revisited the project \"You should not use <Link> outside a <Router>\". It was previously all good.", "likes": 0}}, {"topLevelComment": {"author": "Shaurya Kapoor", "text": "Did Anyone follow this exact tutorial and was able to finish and follow along with him without any errors?", "likes": 0}}, {"topLevelComment": {"author": "Ritik Jain", "text": "Actually in fetching the api with cors-anywhere is showing following response - \"cors anywhere herokuapp missing required request header\"", "likes": 0}}, {"topLevelComment": {"author": "ablanchi", "text": "Gunna take me 5 days to do this with the 50 request limit....", "likes": 0}, "replies": [{"author": "Shaurya Kapoor", "text": "Were you able to finish it?", "likes": 0}]}, {"topLevelComment": {"author": "OneShotWill", "text": "Does anybody know what VSCode theme this is?", "likes": 0}}, {"topLevelComment": {"author": "Ali Emir Şen", "text": "I tried to rewrite this app with only hooks.(Also i used api call with recipe id) Check it out at codesandbox https://codesandbox.io/s/recipeapp-okgus", "likes": 0}}, {"topLevelComment": {"author": "emmei rather", "text": "Nice tutorial Hamza... Thank you :)", "likes": 0}}, {"topLevelComment": {"author": "TechieWasp", "text": "Loved your tutorial. Thanks a zillion, Hamza Mirza.", "likes": 0}}, {"topLevelComment": {"author": "the reap", "text": "I don't understand what he says at 1:13:41?", "likes": 1}}, {"topLevelComment": {"author": "0y0", "text": "thank you :)", "likes": 0}}, {"topLevelComment": {"author": "Ragnar Lothbrok", "text": "Nice vid, all clear. I like that font, whats the name of it?", "likes": 0}}, {"topLevelComment": {"author": "MiLuMo_Eggawa", "text": "Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Priyadharshan Ravi", "text": "Hey guys, The API is not fetching any data. Can anybody help me with this??", "likes": 0}}, {"topLevelComment": {"author": "k m", "text": "Towards the end, if the localStorage is empty the app will crash. A check should be included in ComponentDidMount to skip setState if this is the case.", "likes": 3}, "replies": [{"author": "Adrean", "text": "nvm. if (localStorage.getItem(\"recipes\") !== null)", "likes": 1}, {"author": "Adrean", "text": "Do you know how to run that check?", "likes": 0}]}, {"topLevelComment": {"author": "Asad Malik", "text": "Neat , Simple and Clean .", "likes": 0}}, {"topLevelComment": {"author": "Sleek Silk", "text": "Awesome! freeCodeCamp and Hamza Mirza.  Gotta watch this again.", "likes": 0}}, {"topLevelComment": {"author": "Olivia Smith", "text": "If you provide a roadmap to be a web developer in 2019, it will be much appreciated by many students :)", "likes": 0}}, {"topLevelComment": {"author": "Thirsty pooch", "text": "Uncaught TypeError: Cannot read property 'map' of null in Recipes line  { props.recipes.map((recipe) => { //code} )     any thoughts ?", "likes": 0}, "replies": [{"author": "Shaurya Kapoor", "text": "Were you able to finish the project?", "likes": 0}, {"author": "dedZombie", "text": "Could be that you reached your limit on API calls. It's only 50 a day.", "likes": 0}]}, {"topLevelComment": {"author": "Nicolas Azoidis", "text": "No words to describe your majesty. RESPECT.", "likes": 1}}, {"topLevelComment": {"author": "Shahriar Kabir", "text": "I use my api key but its not working . show 403 (Forbidden)", "likes": 0}, "replies": [{"author": "Shaurya Kapoor", "text": "Were you able to make it work?", "likes": 0}]}, {"topLevelComment": {"author": "Jonathan Tuala", "text": "Sorry if this is a dumb question, but my Recipes component wants to render even when the Form component hasn't been filled in yet. Because the Form component is empty, my props are null and my code breaks. Not sure what I'm doing wrong. How do I prevent the Recipes component from rendering until the Form is completed?", "likes": 0}, "replies": [{"author": "Shaurya Kapoor", "text": "Were you able to finish the tutorial?", "likes": 0}, {"author": "Emmanuel Nwamaife", "text": "- Ensure that you tied the api-call to the OnSubmit event so that the recipes state variable is not changed until the button is clicked\n- In the componentDidMount method, run the localStorage.hasItem() method to confirm if there is any item before changing the recipes state.", "likes": 0}]}, {"topLevelComment": {"author": "Planet", "text": "Cool!", "likes": 0}}, {"topLevelComment": {"author": "dumi dantes", "text": "This will never be a production app because he stores the API keys on the client side if you want to create a production app you don't do it like this you need to use node.js as an example...I don't really understand the purpose of the tutorial. Correct me if I am wrong.", "likes": 2}}, {"topLevelComment": {"author": "Mehdi Yaghoubi", "text": "very helpful, tkx, can we use data in localstorage for seo !?", "likes": 0}}, {"topLevelComment": {"author": "Host Promo", "text": "A code recipe for the recipes 🙏", "likes": 1}}, {"topLevelComment": {"author": "schwamm", "text": "thank you! have subscribed your channel, you make things easy to understand!", "likes": 0}}, {"topLevelComment": {"author": "Daniel Cavalcanti", "text": "What extension do you use in VS?", "likes": 0}}, {"topLevelComment": {"author": "Daniel FS", "text": "This API supports only 50 Request/day for free usage.", "likes": 0}, "replies": [{"author": "PaperPegasus", "text": "which is okay because you're only learning.", "likes": 2}]}, {"topLevelComment": {"author": "intorek", "text": "I started  to get the error \"Uncaught TypeError: Cannot read property 'map' of null\" near the end of the video before realizing that I had hit the API's limit of 50 uses.", "likes": 0}, "replies": [{"author": "dinesh vankayalapati", "text": "i am also facing the same issue. Any solution??? @Hamza Mirza", "likes": 0}, {"author": "Thirsty pooch", "text": "me too,  was looking everywhere in the code for the problem, so is that the reason? hitting the API's limit?", "likes": 0}]}, {"topLevelComment": {"author": "John McLane", "text": "Maybe it would be nice if you make another project video with use of React Hook", "likes": 1}}, {"topLevelComment": {"author": "Abhishek Kumar Singh", "text": "Great tutorial\nOne point though, why didn't you use the id to search the individual recipe on /recipe page but the recipe title?", "likes": 2}}, {"topLevelComment": {"author": "Zahra AAAsra", "text": "Hamaz thank you", "likes": 0}}, {"topLevelComment": {"author": "dedZombie", "text": "Great tutorial, I love the way you explain those small details about React and how it works. \nCorrect me if I'm wrong, but aren't you supposed not to show your API keys? Those should be private, at least those I was using.", "likes": 4}, "replies": [{"author": "Joshua Isaac", "text": "for a real project, yes I would make the private. for tutorial purposes I guess its fine", "likes": 0}]}, {"topLevelComment": {"author": "Mitch G", "text": "Oi. \n\n\n\n\nDefinitely going to dive in on this one once I'm off work. Looks like a good one to learn.", "likes": 0}}, {"topLevelComment": {"author": "Business Youngsters", "text": "i just came on youtube for this and found that you guys just uploaded this. Love you Free Code Camp", "likes": 1}}, {"topLevelComment": {"author": "Pedro Pinto", "text": "Awesome. Love videos about React", "likes": 0}}, {"topLevelComment": {"author": "Bala Chandran", "text": "Nice video", "likes": 0}}, {"topLevelComment": {"author": "wilson chinedu", "text": "Just what i needed. tnks so much", "likes": 1}}]}