{"video": {"id": "u7n9t1cBei8", "title": "Theory of Neural Networks - Deep Learning Without Frameworks", "description": "Finally understand how deep learning and neural networks actually work. In this talk by Beau Carnes, you will learn the theory of neural networks. Instead of teaching about a framework such as Karas or TensorFlow, Beau gives an overview of the methods behind those frameworks.\n\nFirst, he explaining the key concepts of deep learning.  Then, he live codes a neural network using Python without using any frameworks. This will help you understand the concepts at a deeper level.\n\n🐦 Beau Carnes on Twitter: https://twitter.com/carnesbeau\n\n🔗 Beau's Deep Learning course from Manning Publications: https://www.manning.com/livevideo/grokking-deep-learning-in-motion?a_aid=algmotion&a_bid=5d7bc0ba\n\nTalk given at Moscow PythonConf++ 2018. Check out their YouTube channel: https://www.youtube.com/user/moscowdjangoru\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT1H14M27S", "likes": "1000", "views": "39248"}, "comments": [{"topLevelComment": {"author": "Tic Tac Toc", "text": "This video amkes me love machine learning after hating it for years", "likes": 0}}, {"topLevelComment": {"author": "David Shook", "text": "note the hand gestures have nothing to do with the content, just for distraction", "likes": 0}}, {"topLevelComment": {"author": "David Shook", "text": "melodramatic", "likes": 0}}, {"topLevelComment": {"author": "Jorgen B", "text": "How many people work on large ai projects like Tesla’s AI and how much time does large scale machine learning projects take? Do you recommend any books that explains the comprehensive mathematical algorithms and code together in an image classifier?", "likes": 0}}, {"topLevelComment": {"author": "Ƶεύς", "text": "thanks for the amazing content", "likes": 0}}, {"topLevelComment": {"author": "Александр Юсько", "text": "Is there a CNN part", "likes": 0}}, {"topLevelComment": {"author": "Qian Chen", "text": "Thank you so much!! Finally I understand the intuition of the hidden layers.", "likes": 0}, "replies": [{"author": "Ashish Singh", "text": "Yeah hidden layers is for correlation between input and output layers", "likes": 0}]}, {"topLevelComment": {"author": "venkatteja Raavi", "text": "This video was shot based on grokking deep learning Text book by Andrew Trask. Have a look at the official text book. The explanations are so damn cool", "likes": 1}}, {"topLevelComment": {"author": "cinegraphics", "text": "Who else was trying to clean up his monitor, only to find out that dirt spots are in fact in the video itself??", "likes": 0}}, {"topLevelComment": {"author": "Sam", "text": "Hey great talk! Is there the transcript of the code anywhere online? That would help a lot. Thanks", "likes": 0}}, {"topLevelComment": {"author": "Aikol Koikelov", "text": "Wow! The greatest explanation of neural networks!", "likes": 0}}, {"topLevelComment": {"author": "Newyorker 666", "text": "This is amazing thank you Beau", "likes": 1}}, {"topLevelComment": {"author": "MUNGADA PRASAD", "text": "I need sharechat app programming code sir", "likes": 0}}, {"topLevelComment": {"author": "Carl Summers", "text": "I didn't quite understand the part  on negative reversal. So essentially if I have negative input and I'm multiplying it by the weight , how would I make it go into the positive direction? Would I, in this case, square the negative value with itself to receive a positive value? Any explanation on this would be great.", "likes": 1}}, {"topLevelComment": {"author": "Bilguun Gantumur", "text": "thanks a lot really helpful", "likes": 0}}, {"topLevelComment": {"author": "Nico Robin", "text": "I don't understand how do you decide the value of the weight? .1, .2 ? How is this done?", "likes": 0}}, {"topLevelComment": {"author": "martin", "text": "Interesting talk. Thank you for sharing", "likes": 0}}, {"topLevelComment": {"author": "Ryan L", "text": "Great talk but the fact that none of his jokes fell made me uncomfortable lol", "likes": 1}}, {"topLevelComment": {"author": "Khalil Rhouma", "text": "thank you. That was a great video", "likes": 0}}, {"topLevelComment": {"author": "Timothy Schmidt", "text": "Good talk overall, but the slide at 3:52 is incorrect.  ML is one of the techniques used for AI, but AI also uses other techniques (eg: Search, Rule-Based Systems, Probability based decision making, etc.), so it would be more accurate to say AI is a superset of ML.", "likes": 21}, "replies": [{"author": "Vincent Randal", "text": "@Lucky I agree and I tried to imagine why the speaker did not draw it as a superset. I decided the speaker believes AI is in fact a subset of Deep Learning for some reason unknown to us. Maybe it’s this: Deep Learning brought us into the promised land.", "likes": 0}, {"author": "Lucky", "text": "ya, AI is a superset of ML.", "likes": 5}]}, {"topLevelComment": {"author": "Norman Henderson", "text": "So Frameworks is used to automatically generate the relevance or irrelevance of the assumption?", "likes": 0}}, {"topLevelComment": {"author": "Norman Henderson", "text": "The making of a mole: Come get your education.", "likes": 1}, "replies": [{"author": "John Smith", "text": "Lack of holism kills me too.", "likes": 0}]}, {"topLevelComment": {"author": "Norman Henderson", "text": "Sure sounds like a technique used to flush ‘bad people’ out, who later on might be insignificant relatively. I know how  you all do. Training the population to snoop on their own associates and the casually-known.", "likes": 0}}, {"topLevelComment": {"author": "Fernando Torres", "text": "Great explanation, simple and understandable. The need for more hidden layers finally make sense now, and the back propagation thing that I didn't really understand in some readings before makes a lot of sense also. Is there any place where I can find the source code Beau used by the way?", "likes": 2}, "replies": [{"author": "freeCodeCamp.org", "text": "Links to code are here: http://carnes.cc/moscow/", "likes": 1}]}, {"topLevelComment": {"author": "Andrey Voronov", "text": "Раз конференция в Москве, будет перевод или аналогичная сессия на русском?", "likes": 0}}, {"topLevelComment": {"author": "Raj Patel", "text": "Awesome talk.", "likes": 2}}, {"topLevelComment": {"author": "Kevin Zhang", "text": "Very simple and practical example ... it is perfect for me who is entry level for learning ML .... Thank you!!!!", "likes": 1}}, {"topLevelComment": {"author": "Mikhail Angela", "text": "Whats the website for helping with the translations?", "likes": 0}, "replies": [{"author": "Andrey Voronov", "text": "Ну я так понимаю: http://carnes.cc/moscow/ , которые у него на слайде. Там ссылки.", "likes": 0}]}, {"topLevelComment": {"author": "Marco CS", "text": "un mendicante", "likes": 1}}, {"topLevelComment": {"author": "Andre Schettini", "text": "Thanks for this wonderful video!", "likes": 1}}]}