{"video": {"id": "u9WOdMWjgso", "title": "Getting first React job without experience - Ask Preethi", "description": "Question:\nI am really keen on getting some React JS experience but anywhere I apply to, they seek an experienced React engineer. I have learn React on my own and recruiters do not seem to appreciate it. Further, at this stage at the big companies, I reach 1-2 rounds behind the final round and then they say they found a more experienced person for the role. Recently I got a rejection from the [COMPANY X] and [COMPANY Y . These both required 5-6 years of industry experience. My application took me to the initial rounds and they seemed interested in gauging my potential - only to find I was not as good as somebody they were looking for.\nNext week I am appearing for a full stack role at [COMPANY Z] but it is clearly out of my league - they are seeking at least 6 years experience in JavaScript. I am pursuing it for interview experience + what if it works out somehow?\nI do not know many people who can refer me. How do I get my first React job [without any industry experience]?\n\nAnswer:\n[See video]\n\nAbout Preethi:\nPreethi Kasireddy is an engineer based in San Francisco. She's an avid learner who taught herself programming and machine learning, and is passionate about understanding things clearly and explaining them to others via blog posts.\n\nShe was previously a front-end & API engineer at Coinbase, a digital currency platform, where she helped architect and rebuild their front-end in React, Mobx and Redux. Prior to that, she was a partner at the venture capital firm Andreessen Horowitz and an Investment Banker at Goldman Sachs. She studied Systems Engineering at USC.\n\nTwitter: https://twitter.com/iam_preethi\n\n-\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT14M37S", "likes": "2010", "views": "110059"}, "comments": [{"topLevelComment": {"author": "Tim Su", "text": "She's too beautiful to be a developer of any kind.", "likes": 0}}, {"topLevelComment": {"author": "Kaviarasan velayutham", "text": "Reddy garu. Please make this video crisp please. Don't waste our time. Thank you. From India...", "likes": 0}}, {"topLevelComment": {"author": "Brian Babu", "text": "Good on you for taking action and sharing that knowledge with others because most people would have taken the “it’s because of patriarchy that I don’t have a job” predicament. Hats off!!", "likes": 0}}, {"topLevelComment": {"author": "Siddharth Sharma", "text": "It's 3 years late but the concept is same. You are thinking too much as an applicant. You get hold of book, videos and some github examples. Learn React for a month. Then put a whole application in your resume for 5 years. Everyone else also is faking it. Nobody can put up with React for 5 years. You need to see the amount of garbage that coders put in the code. Everyone wants experienced person. But there were not so many react jobs before. So there could only be very few experienced people for all the experienced positions which have been filled in.", "likes": 0}}, {"topLevelComment": {"author": "Coogol", "text": "Job requirements are just a rough guideline. As a developer you need to understand how to pass coding interviews. There are a lot of materials for that.  You can always land a job at a less competitive company. The money is usually the same as major tech companies.", "likes": 0}, "replies": [{"author": "haha", "text": "No way the money is the same. Some of the less competitive company's shares mean nothing more than paper. At major tech companies, you can get hundreds of thousand even a million worth of shares within a timeframe.", "likes": 2}]}, {"topLevelComment": {"author": "Vinay Maheshwari", "text": "Woah you're indian ? \nExcept your name everything says you're not indian ❤️❤️ \nHaving a personality like this is a blessing", "likes": 0}}, {"topLevelComment": {"author": "Cindy❤️", "text": "Thanks so much for this.. Really needed it", "likes": 1}}, {"topLevelComment": {"author": "Dinkar Jain", "text": "The kind of confidence and perspective this video delivered is fresh and solid. Greatly appreciated your efforts. Thank you very much, Preethi. Keep up the good work.", "likes": 0}}, {"topLevelComment": {"author": "Александар Пајевић", "text": "you are such a cutie :D", "likes": 1}}, {"topLevelComment": {"author": "Tanner Barcelos", "text": "I like html, I like React, I like JavaScript and also dislike it (its a weird language lol) but CSS is my killer. I am getting my degree in CS soon, and have been on this front end engineering prep grind but the CSS is hindering and some javascript stuff is hindering me and i feel like i have to know it all for my first ever job. So, I am overloading myself. Does anyone  have advice?", "likes": 0}, "replies": [{"author": "the noja", "text": "css is the hardest", "likes": 0}]}, {"topLevelComment": {"author": "Code on Mars", "text": "What's your take on Web components", "likes": 1}}, {"topLevelComment": {"author": "Marko Shiva Pavlovic", "text": "I adore her", "likes": 0}, "replies": [{"author": "nightheist", "text": "😂😂", "likes": 0}]}, {"topLevelComment": {"author": "Dmitrij Gusev", "text": "Thanks for the tips. You are so beautiful. You have magic eyes.", "likes": 0}}, {"topLevelComment": {"author": "K K", "text": "Can I get internship in American company if I never study in University? But I have basic knowledge of JavaScript", "likes": 3}}, {"topLevelComment": {"author": "naspy971", "text": "Preethi is pretty", "likes": 1}}, {"topLevelComment": {"author": "AdamSpice", "text": "your really pretty", "likes": 1}}, {"topLevelComment": {"author": "ablay darkhanov", "text": "she's so sweeet OMG", "likes": 0}}, {"topLevelComment": {"author": "Novaz", "text": "I think she is very preethi 😍", "likes": 2}}, {"topLevelComment": {"author": "Mohit Bhatt", "text": "I have just come to 4th yr and in this summer I was like trying learn a new technology and I thought of doing it in React Js. So can you pls tell me the job availability of React Js developer in India.", "likes": 0}}, {"topLevelComment": {"author": "Arshad Hussain", "text": "Are you Indian?", "likes": 0}, "replies": [{"author": "unknown man", "text": "yes", "likes": 0}]}, {"topLevelComment": {"author": "Mykhailo Mikhnovych", "text": "Preethi you're pretty ;D", "likes": 3}, "replies": [{"author": "ouf cena", "text": "@Savier Ahmer I do NOT tolerate liars!", "likes": 0}, {"author": "Savier Ahmer", "text": "she's ugly as hell", "likes": 0}]}, {"topLevelComment": {"author": "Myles Gmail", "text": "TY! I'll tweet this!", "likes": 1}}, {"topLevelComment": {"author": "Allisa Mint", "text": "Remember that job specs are often written by morons in HR. They just pull a bunch of tech sounding terms out of their rears and post it as a job offer, often without even speaking to those working there as to the actual needs. I remember having a good laugh when leaving an IT position that I had done for the previous 5 years and seeing the posting put up for my replacement. I had NO idea what the posting was even talking about.", "likes": 111}, "replies": [{"author": "Elijah Gundorin", "text": "😂 that's hilarious and sad at the same time", "likes": 4}, {"author": "ouf cena", "text": "@Shruthi Baskar LOL! I thought this was a local disease.", "likes": 6}, {"author": "Shruthi Baskar", "text": "Exactly! Either this or they already reserved that role for their under qualified friend or relative and this is all just for the show", "likes": 10}]}, {"topLevelComment": {"author": "Al Darfco", "text": "Don't get discouraged by postings from big corps. Many of them of postings are fake and used for internal reasons and for political reasons such as labor reporting or campaigns to bring in HB1 visa people that can be easily exploited or to justify outsourcing. My suggestion to anyone trying to break into the software industry is to become involved with your local university. There are many entry jobs there for people as assistants and interns. Open sourced project involvements are another excellent idea.\n\nThe other off-topic recommendation is to get involved with ending the Federal Reserve and hanging the banksters and bringing back an honest money system back to the USA. The trillions that the parasitic banksters have leeched and stolen over the last hundred years should be in YOUR pocket. So get involved in the efforts to exterminate the banksters and bring prosperity back to you, your family, community and the nation.", "likes": 9}, "replies": [{"author": "The Entrepreneur", "text": "Let’s do it", "likes": 0}]}, {"topLevelComment": {"author": "Sunitha Reddy", "text": "Hi preethi . I m ur first cousin(kasi reddy pitchi reddy second daughter sunitha) frm india .  U r doing gud job", "likes": 2}, "replies": [{"author": "Amit", "text": "Hi Sunitha. I'm your second distant cousin 7th baby.", "likes": 0}, {"author": "Current Adda", "text": "Hi I m ur third cousin Sunita aunty 2nd baby", "likes": 1}, {"author": "unknown man", "text": "nice", "likes": 0}]}, {"topLevelComment": {"author": "Eliot Sanford", "text": "Great perspectives. It's easy to feel bad about rejection, but the facts of getting an interview without experience is a positive step. Without this failure the candidate wouldn't know what they need to work on or that experience can be gained in other ways like startups or smaller companies.", "likes": 1}}, {"topLevelComment": {"author": "Viper18", "text": "her name is so fitting!", "likes": 0}}, {"topLevelComment": {"author": "Alicia", "text": "Fresh out of a coding bootcamp - super helpful and motivating!", "likes": 4}, "replies": [{"author": "Fred ticoman.", "text": "Which one did you go to? Are you ready for jobs? And what languages did you learn? I am just starting out. Html first", "likes": 3}]}, {"topLevelComment": {"author": "Dave CJ", "text": "The easiest way for people without any prior corporate experience is to start working on freelance portals like Fiverr, Freelancer, UpWork, PeoplePerHour...etc. Once you have at least 5-6 order fulfilled and having good reviews on your profiles, you can easily go to the employers requiring 1 year of experience, show them your portfolio that you've build using freelance projects and there are ample chances that they will prefer you after reviewing your LIVE PROJECTS.", "likes": 1}}, {"topLevelComment": {"author": "Mukesh Chouhan", "text": "let me know if anyone in India can give me job in react. Tried a lot ! but got, need experience bla bla speech.", "likes": 1}, "replies": [{"author": "rohit singh", "text": "Do you have a portfolio?", "likes": 0}]}, {"topLevelComment": {"author": "Jonathan Parker", "text": "If people are interested in helping with an open source project there is a great project for charity. It's using .net core and angularjs with ionic.\n\nGithub: https://github.com/HTBox/allReady\n\nMain HTBox site: http://www.htbox.org/\n\nYoutube channel for standup meeting recordings: https://www.youtube.com/channel/UCMHQ4xrqudcTtaXFw4Bw54Q", "likes": 0}}, {"topLevelComment": {"author": "Adam Pasternack", "text": "Are you still going to offer that longer in depth functional programming course?", "likes": 2}}, {"topLevelComment": {"author": "sava milin", "text": "you are very pretty..;-))", "likes": 1}}, {"topLevelComment": {"author": "Pixel Art", "text": "Preethi you are so pretty 😍", "likes": 1}}, {"topLevelComment": {"author": "Waqas Ahmed", "text": "Thank you for sharing your thoughts.", "likes": 1}}, {"topLevelComment": {"author": "Jonathan Jackson", "text": "Can i get a link for week 3, its not in the playlist. Fantastic advice!", "likes": 0}}, {"topLevelComment": {"author": "gex", "text": "fucking HR's Im really curious if the have at least one of these skills which they list in the job offer", "likes": 0}, "replies": [{"author": "Jonny W", "text": "I doubt it lol they probably did a meme degree like sociology or something.", "likes": 0}]}, {"topLevelComment": {"author": "k c", "text": "Why was your video on Javascript - easy to reason about deleted???Can you please re-upload this video- it was great!", "likes": 1}}, {"topLevelComment": {"author": "Emmanuel Florac", "text": "This is all Preethi good advice.  I'm K(u)asi reddy to start working with React now... Sorry I'm outta here :)", "likes": 2}}, {"topLevelComment": {"author": "FlippantFishTaco", "text": "The requirements listed in the job descriptions are often a front. Even jobs which include a degree in the requirements can be gotten without having a degree, in many cases. It's really just about whether you can do the job the employer has in mind for your chosen position, and conveying it during your interview.", "likes": 52}}, {"topLevelComment": {"author": "Sebastian Cheung", "text": "Why you want to break into React when you were already IB at Goldman Sachs, don't they already pay handsomely? :)", "likes": 5}}, {"topLevelComment": {"author": "rudebloke1", "text": "love your response @Preethi but please you do not have to read the whole question - you can summarize it and give the answer - thanks for the video", "likes": 0}}, {"topLevelComment": {"author": "Travis Dukkovski", "text": "I'm 48 and have been trying for 18 years to finally get a decent job as a programmer. I think my bad luck is because I am not pretty like you. I'm an INTP, so I am perfect (the best) for software engineering...but it seems a super cool personality matters way more. IDK what to do. I finally have a chance (working for room and board only) to start developing projects using Java (or even Scala). Anyone have tips for me? Give up?", "likes": 0}, "replies": [{"author": "Jonathan Parker", "text": "Have you been continually investing in learning for 18 years? It's often hard if you don't get a chance to learn at work. Hence the reason why a lot of people say you need the passion. The passion translates into interest and time being invested outside of work hours. If you do that then you'll get a good job based on what you know, not what you've been doing in your day job because the people interviewing you will understand that some jobs are restrictive and they will give you a chance to get experience doing things the right way.\nIt's hard. I've been a developer for 10+ years and not yet got a dream job. Possibly I've not invested enough time outside of work.", "likes": 0}]}, {"topLevelComment": {"author": "Anon Anon", "text": "Good advises .", "likes": 1}}, {"topLevelComment": {"author": "Zain Syed", "text": "Apply for contract/freelancer jobs to start with. Companies are more flexible as if they don't like you - you're out the door the next day and they haven't lost much. No long notice/probation period etc for them!", "likes": 0}}, {"topLevelComment": {"author": "Thales Avila", "text": "Awesome content, keep it up", "likes": 1}}, {"topLevelComment": {"author": "Cosmopolitan Guy", "text": "nuvvu keka ehe!!!11", "likes": 2}}, {"topLevelComment": {"author": "SAI RADHA", "text": "Does your advice apply to people in India?Kindly reply as I am in India.", "likes": 0}, "replies": [{"author": "SAI RADHA", "text": "Why don't all others  like me  just die.It is not a issue until it effects us", "likes": 0}, {"author": "D3FKON Music™", "text": "SAI RADHA You need marks more than anything. Because it's fucking India.\n7+ SGPA or don't bother wasting time.\nIndia is the king", "likes": 2}, {"author": "Sagar Sehwag", "text": "I would say, Yeah it does.", "likes": 0}]}, {"topLevelComment": {"author": "Paul Centeno", "text": "Thank you for this video and helping with our/my confidence when applying to jobs. I am working through freecodecamp and other courses on Udemy and Coursera at the moment. I am trying to get some experience through sites such as Upwork but the easy stuff I feel confident that I can do have 20+ people already giving proposals. I am also adding to my portfolio bit by bit, but I feel torn on so many things I should or could do, learn language A or B or framework C or D and I need to hurry up and finish something. I need to keep reminding myself that being really good at one thing is better than being so-so and many things. I can learn whatever the job needs once they hire me, I just need to prove to them that I am worth hiring.", "likes": 1}, "replies": [{"author": "ouf cena", "text": "I'm curious too, plz do tell", "likes": 0}, {"author": "Afeef Rb", "text": "Yes right on the point on \"learning once they hire\". There are so many languages and frameworks, that if you start learning all of them, you will go crazy. Hey Paul, you have commented 2 years ago. How are you doing now with regards to your work as a developer?", "likes": 0}]}, {"topLevelComment": {"author": "prakashyadav008", "text": "there is no tutorial for REACT on freecodecamp", "likes": 0}, "replies": [{"author": "groninge", "text": "Quincy Larson Is there also one for angular?", "likes": 0}, {"author": "Quincy Larson", "text": "It's still in beta: http://hysterical-amusement.surge.sh/", "likes": 1}]}, {"topLevelComment": {"author": "your virtuoso", "text": "Thanks for this", "likes": 1}}, {"topLevelComment": {"author": "Joseph Jones", "text": "I like how this video not only has nothing to do with react jobs like the job in question, but she says to get other people you know to refer you and work on side projects LOL.  Honestly, anyone applying to any of these jobs knows all the useless information she's talking about.", "likes": 1}}, {"topLevelComment": {"author": "Albert Cardona II", "text": "Awesome video. I have been told by many people that work in software API documents to learn how to do things logically and then learn the syntax of a language. I don't understand how to do this properly what would be the best approach? I been in and out of web designing for a while but because I had been in and out of different countries or in training when I was in the military. Now that I am retired and don't have a job I would love to start pursing something I dreamed about doing for a long time. What would be the best advise about coding in general, should I be trying to code everyday?", "likes": 2}, "replies": [{"author": "Keith", "text": "Hello Albert, I'm Keith from france. I can feel your struggle as i have been going through the same phase for years. I found in coding salvation to finally be able to get back on track and follow my dream, wich is to become an engineer. So here are some advice i use every day to get better at coding and anything else. \n\nIt might look daunting at first, but it actually avoid the abysmal and endless search for material and guidance and hours of aimlessly searching for the wrong things, so try to bare with this and you'll succed.\n\nStep 1. First, you need guidance and/or a good overview of your goal. If you have someone close that has the job you would like, this person would be the best starting point. If not, you need to research, based on your goal, the industry you wanna work in and the needs of this industry. For me, i'm going from software engineering to, later on, add electrical engineering (from software to hardware...yeah you guessed it, i wanna build Jarvis and then an iron-man!). so my closest target is \"how to be a software engineer\". \n\nStep 2. I then layed out a plan to become a good \"full stack\" software engineer using my own definition of \"full\" stack. Because full stack is the closest thing to having a good grasp of the maximum of software skills before going to hardware skills. This plan you can write on paper, excel sheets or anything really, you just need to implement it every now and of course be sure to always come back to it each time you progress to refresh your goals or situation. It does not need to be thorough. you can just write the skills you really need or want. \nLike \"front dev = html and css = 3 months / back dev = Javascript + php + symphony2 = 6 months / full stack = add java EE for android and or iOS swift = 2 months\".  \n\nStep 3. Then, research the places to learn online that works best for you, both learning wise and money wise. There are tons of learning platforms now and you can learn anything through tutorials on youtube too. Prices can go from free (freecodecamp.com) to around 300 a month for a full degree with a recognized certification. If you are in usa, you probably have access for free to Lynda.com through your municipal library. Just get a card.\n\nStep 4. Stick to 1~4 of these plateform. sometimes you don't understand well on one, for any reason, then hop on the second platform and maybee you'll have that click. It is important to not get stuck and drive yourself crazy on one particular point. Best way to get unstuck is by having a different point of view for the same thing. If you do understand but feel there is a gap in your ability to use said knowledge, then multiply projects involving said skill.\nFor exemple, i did not understand at all Bootstrap on codeacademy, but it got very clear on codeschool! And as of now, though i finally understand everything about bootstrap, i feel a huge gap when i want to use jquery with it. So i am currently doing lots of side projects to increase usage of jquery and slowly get more efficient using it. This is probably the best way for anyone to progress. Know when there is a lack of clarity on the teacher side and when there is a lack of experience (usage) on your side. \n\nStep 5. The universal learning skill. No gimmicks, no tricks. To learn and progress efficiently, after you have set a goal, is just to cut everything in very tiny bits. doesn't matter the time it takes, little chunks you do everyday will always trump big whole chunks you do once a month. It will also stuck much better in your long term memory and after a while, if you implement it right, it becomes more than a habit, it becomes a game you absolutely need to play to get better and break your own records! \nYou don't need to code every day, you only need to get involved with code every day. That means, if you are lazy today, it's okay, just rest, but take ten to thirty minutes to enjoy a video with this guy https://www.youtube.com/watch?v=AaGK-fj-BAM \nYou don't need to strugle bro, enjoy coding. \n\nStep 6. When you feel confident enough, give back !  you can write a blog like Preethi, help a project on github or help an association for free...or you can just go to a club or any event involving code near you. It's a great way to make friends, get mentors, networking, have fun with fellow coder, sometimes get free food and at least learn something new or see it through more experienced people's eyes. \n\nThat's it, hope it helps and get you through the day. good luck man and thanks for your service.", "likes": 1}]}, {"topLevelComment": {"author": "Wiktor Tkaczyński", "text": "I created open source React app for school project and it helped me a lot to get my first React job. If you have anything that can be open sourced, do it!", "likes": 48}, "replies": [{"author": "Salma EL BARMAKI", "text": "Can you tell us more about the app ?", "likes": 1}]}, {"topLevelComment": {"author": "Richard Rouzeau", "text": "I really like the part about asking what you could have done better. By the way, crossfading your cuts might make them a bit less  jarring. Alright, I'm done :)", "likes": 4}}, {"topLevelComment": {"author": "winar jin", "text": "Side project, open source project, write a post , these are absolutely great methods to improve oneself.  Thanks , you really inspire me a lot.", "likes": 23}}, {"topLevelComment": {"author": "shibnath roy", "text": "Great Advice.", "likes": 1}}, {"topLevelComment": {"author": "Self-Love", "text": "So good! Thank you, Preethi!", "likes": 5}}, {"topLevelComment": {"author": "SelfSage", "text": "wow preethi, you are very talented!!  thanks", "likes": 3}}, {"topLevelComment": {"author": "Byron Kaiju", "text": "This helps me out a lot, I'm in school for computer science, but I want to engage in a job while I'm in school. So this is just informative", "likes": 4}}, {"topLevelComment": {"author": "Kadir Suleymanoglu", "text": "i guess i would hit up non-profits, even if it is just an unpaid internship and try and do great work there (re-design sites, refactor code, etc) and try and show that as relevant experience when applying for 'real' jobs.", "likes": 1}}, {"topLevelComment": {"author": "gmac231984", "text": "Nomen est omen.", "likes": 0}}, {"topLevelComment": {"author": "i PwnPancakes", "text": "Thank you for your advice! I definitely feel more motivated now. I live in a non tech city and because of my current situation I am unable to move. So I am forced to work either in freelancing or remotely. I'm still very much a beginner even after starting a little over 2 years ago, but I will work through it!", "likes": 41}, "replies": [{"author": "Shaurya Mishra", "text": "ayyy everyone's working remotely now lmao", "likes": 0}, {"author": "JoeTinnySpace !", "text": "Good Luck", "likes": 5}]}, {"topLevelComment": {"author": "Ivan Šostarec", "text": "Great talk, love it! Very motivating and eye-opening!", "likes": 5}}, {"topLevelComment": {"author": "MrMrwilson11", "text": "I would not go for the massive companys first. There are thousands of small corporations that need web developers and other positions. Many of the developers I have followed on here worked at places I had never heard of. Think about working in a  design house where they might take you on as an apprentice as well.", "likes": 68}, "replies": [{"author": "Arthur Lima", "text": "@Marco V hahaha", "likes": 2}, {"author": "Marco V", "text": "what's a design house?", "likes": 6}]}, {"topLevelComment": {"author": "Sudeepto Dutta", "text": "I think for React, if someone wants a job as a fresher, they should target small startups rather than established companies. \n\nOnce they have enough experience, they'll get better opportunities in the future.", "likes": 43}, "replies": [{"author": "Thecountofsudan", "text": "@sieve5 would help me how to find startups  as a fresh React developer , i try to find remote jobs as well.", "likes": 1}, {"author": "Abhishek Ranjan", "text": "@Øath betrayer But they push you harder to grow. which is more beneficial in long term.", "likes": 0}, {"author": "sieve5", "text": "+1 on that. Also do small projects instead of big ones. It's all about the references and testimonials from your bosses/clients. I went the freelancing route and have done several MVP's for startups.", "likes": 5}]}, {"topLevelComment": {"author": "Husayn Jibril Muhammad", "text": "Great video! Lot of great tips in there! Thanks for sharing!", "likes": 1}}, {"topLevelComment": {"author": "bob2000and10", "text": "Excellent advice", "likes": 5}}, {"topLevelComment": {"author": "Andrzej", "text": "Thank you for sharing your story.", "likes": 6}}, {"topLevelComment": {"author": "MisterTracks", "text": "Fantastic video! Keep it up!", "likes": 5}}]}