{"video": {"id": "Uszj_k0DGsg", "title": "Git for Professionals Tutorial - Tools & Concepts for Mastering Version Control with Git", "description": "Git has the power to make you a better software developer. But you'll have to go beyond the basic \"commit, push, pull\" to use it effectively! In this course, we'll look at some of the more advanced concepts and tools to make you more productive and confident with Git.\n\nThis course focuses on using Git with the command line.\n\n✏️ This course was created by Tobias Günther from Tower. You can download Tower's Git desktop UI here: https://www.git-tower.com\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Introduction\n⌨️ (00:52) Hosted by Tower\n⌨️ (01:27) The perfect commit\n⌨️ (08:07) Branching strategies\n⌨️ (17:16) Pull requests\n⌨️ (24:07) Merge conflicts\n⌨️ (33:48) Merge vs. rebase\n⌨️ (40:05) The Advanced Git Kit: https://www.git-tower.com/learn/git/advanced-git-kit/\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Wong Voon jinq\n👾 hexploitation\n👾 Katia Moran\n👾 BlckPhantom\n👾 Nick Raker\n👾 Otis Morgan\n👾 DeezMaster\n👾 AppWrite\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT40M42S", "likes": "27865", "views": "1039412"}, "comments": [{"topLevelComment": {"author": "Fra Zuppi", "text": "this video is truly amazing, thanks a lot", "likes": 1}}, {"topLevelComment": {"author": "TON 618", "text": "Once you know git cherry-pick, all your life problems will be resolved.", "likes": 0}}, {"topLevelComment": {"author": "nostalgia", "text": "thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Black Ranger", "text": "so SIMPLE explanation of REBASE. Thank you for that 🥰", "likes": 0}}, {"topLevelComment": {"author": "Angel Acevedo", "text": "I tried to create the commit for a part of the file with git add -p but it show me all the changes in just one chunk of changes instead of several to choose. Somebody knows why is that happening?", "likes": 0}}, {"topLevelComment": {"author": "BURGER CHILD", "text": "This would have been an excellent 40 minute class in college. The knowledge is there in college, just spread out. this is clear and consise. Thanks for your work!", "likes": 1}}, {"topLevelComment": {"author": "kiwi welch", "text": "Something so simple is so complicated and nerve racking", "likes": 0}}, {"topLevelComment": {"author": "Serpil Sever", "text": "Thanks step bro 🥰", "likes": 0}}, {"topLevelComment": {"author": "mark cuello", "text": "HELP", "likes": 0}}, {"topLevelComment": {"author": "Lam Nguyen", "text": "straightfoward to the necessary, i feel enlighted", "likes": 0}}, {"topLevelComment": {"author": "Anupam Pandey", "text": "Very nice! thanks", "likes": 0}}, {"topLevelComment": {"author": "Rashid Khan", "text": "beautifully explained, really helped. thanks a mil!", "likes": 0}}, {"topLevelComment": {"author": "John Henckel", "text": "At 15:59 there is an error.  You say \"develop is also the starting point for any new releases\".  However this is false.  Main is the starting point for a release branch, as you can see in the picture.", "likes": 0}}, {"topLevelComment": {"author": "Ayush Aryan", "text": "Thank you for great explanation of Rebase and Merge.", "likes": 0}}, {"topLevelComment": {"author": "Tk", "text": "A very important consideration when you start spliting a file into multiple commits is to be very careful about not breaking or creating errors into one of the two generated commits, especially if a CI pipeline is using them.", "likes": 3}}, {"topLevelComment": {"author": "Roman Mäsiar", "text": "The way you explain things is simply....awesome. Thanks !!!", "likes": 0}}, {"topLevelComment": {"author": "HForGames", "text": "github desktop is a huge help when going around with git stuff", "likes": 1}}, {"topLevelComment": {"author": "Dheeraj Kumar", "text": "One of the time wasting😡😡😡😡😡😡😡😡😡😡", "likes": 0}}, {"topLevelComment": {"author": "Sequoia Kanies", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "ТехноМир", "text": "Concise explanation, a lot of useful info jammed. Thank you for your excellent work.", "likes": 0}}, {"topLevelComment": {"author": "shsiskebasb", "text": "Good video, thanks. You sound a lot -- if not exactly -- like Christoph Waltz.", "likes": 0}}, {"topLevelComment": {"author": "islam tareq", "text": "That's a really  helpful Video THAAANK YOUUU SOO MUCH", "likes": 0}}, {"topLevelComment": {"author": "Hardware News Network", "text": "Thanks was great. If you were so inclined it would br", "likes": 0}, "replies": [{"author": "Hardware News Network", "text": "Agh. It would be great if you could share something more on the culture of Git, especially as regards branching thanks again.", "likes": 0}]}, {"topLevelComment": {"author": "Tubular Animator", "text": "I really enjoyed my experience watching this. Tobias teaches in a delightfully soothing way.", "likes": 1}}, {"topLevelComment": {"author": "hakan akdag", "text": "wow this was great. couldn't be better explained. for who wonders, time moves forward from left to right. I got confused initially.", "likes": 1}}, {"topLevelComment": {"author": "Tal Kohavy", "text": "I consider myself as pretty profficiant with git,\nyet I'm doing this thing where i'm occasionally revisiting known technologies to maybe learn some new things.\nAnyhow, just I wanted to say that this 40-minutes long video was ALL WORTH IT just for the sake of learning about the git add with the -p flag to only mark some parts of a file to be included in the commit :) Love it! definitely gonna use it in the future♥ Thank you!", "likes": 44}, "replies": [{"author": "Tal Kohavy", "text": "@シムカ Plus, it doesn't work very well. Since posting this comment I tried using it, and man it sucks... sometimes it takes 2 or 3 rows and considers them as ONE CHANGE! Take it or leave it! When in fact each row is a chance on it's own, where I want only one of them. And yeah, the point you made is also valid. Haven't used it since. But it's nice to know all these \"secret\" git command. like git rerere for instance 😉", "likes": 0}, {"author": "シムカ", "text": "this is an introductory video, and \"-p\" flag is useless. As in the real work, most ppl uses temporary local branch with a logical name for each commit, thus no need to deal with staging or splitting commits especially in case of 50+ modified files.", "likes": 0}]}, {"topLevelComment": {"author": "baze", "text": "Git: easy to make mess, hard to get out of that mess :) Powerful but costly if there's a larger team.", "likes": 0}}, {"topLevelComment": {"author": "Yacine Khaldi", "text": "Thanks, it was very helpful.", "likes": 0}}, {"topLevelComment": {"author": "Violet J. M.", "text": "I've been using git since its inception because it is the best tool for SCM, but I just wish that it were more intuitive and more robust. great tools are intuitive so that EVERYONE on the team / project understands how to use it and does not fall into the many pitfalls / traps of the tool being used. If just one person screws up, it can mess everything up.", "likes": 0}}, {"topLevelComment": {"author": "chilly21", "text": "i am lost throughout", "likes": 0}, "replies": [{"author": "Toby", "text": "He lost me when in the command window @ 4:00. I need more visuals.", "likes": 0}]}, {"topLevelComment": {"author": "Justina Parma", "text": "\"You an always abort and try again\" loved it, thanks!", "likes": 0}}, {"topLevelComment": {"author": "maweibezahn", "text": "Only in Germany do people make \"imprint.html\" pages :D Seriously though, thanks for the video!", "likes": 0}, "replies": [{"author": "maweibezahn", "text": "@Toby imprint.html is often the name of the file that contains the contact information. This section of the site is considered the \"Impressum\" in Germany and is legally required in many cases (e.g. commercial sites). \"Impressum\" is often translated to \"imprint\" by Germans, but this is a false friend. A more suitable name would be \"Legal Info\" or something similar.", "likes": 0}, {"author": "Toby", "text": "What's your point? What is imprint.html?", "likes": 0}]}, {"topLevelComment": {"author": "Bobby", "text": "git is absolutely horrendous", "likes": 1}}, {"topLevelComment": {"author": "Asish Binu Mathew", "text": "The warnings come at the end :)", "likes": 0}}, {"topLevelComment": {"author": "steve hoff", "text": "While he's composing his perfect commit, I've already closed the stories...", "likes": 0}}, {"topLevelComment": {"author": "Milan Prokop", "text": "It's good video overall but I would categorize it as intermediate, definitely not advanced.", "likes": 0}}, {"topLevelComment": {"author": "nim int3", "text": "5:40 This is not fully right. When I make feature in C# I have to commit all files, otherwise I might get a compilation error.", "likes": 0}, "replies": [{"author": "Toby", "text": "That's not a Git issue. That's about what you're committing.", "likes": 0}]}, {"topLevelComment": {"author": "Claudio Benjamin Osorio", "text": "Man I love these videos. I wish I had the time to watch the whole channel and visit every contributor. Much love <3", "likes": 0}}, {"topLevelComment": {"author": "Công Minh Lưu", "text": "that's such a cool explanation of rebase. The visual helped a lot! Glad I stuck till the end", "likes": 0}}, {"topLevelComment": {"author": "Saket Modi", "text": "New stuff:\ngit add -p", "likes": 0}}, {"topLevelComment": {"author": "Said Course", "text": "can i get the slides please", "likes": 0}}, {"topLevelComment": {"author": "Jonathan", "text": "I heard somewhere that commit messages should be present tense but I don't think there was a reason given. For me, it often seems more natural to write them in past tense. Any opinions on this?", "likes": 0}}, {"topLevelComment": {"author": "Meme Machine", "text": "NGL just seems mad pretension for people that spend more time in directories than programming.", "likes": 1}}, {"topLevelComment": {"author": "Siddharth Sharma", "text": "Great video,\nHowever I see at time 34:44 (and many other times too), there are 2 arrows. One shows where branch is progressing. The other one points in other direction i.e. the directionwhere branch started(on c3 -> c2 -> c1). (the opposite arrow is orange in color)\n\nWhy is one arrow opposite from other? Whats the purpose?\n\nAgain thank you for the great content. Cleared up so many things for me", "likes": 3}, "replies": [{"author": "Siddharth Sharma", "text": "So I have learned a bit more about git, the arrows are a good tracking tool. So for example, say you make a commit, you can follow the arrows to see what past commits this new commit is built upon. \n\nSay you have a commit and you can trace all the arrows from that commit to any other commit, if you can cover all the paths following arrows, you can be sure that this new commit has all the previous commit history.\n\nThe purpose of the arrow is to \n1. Find parent commit \n2. More generally follow commit path", "likes": 0}, {"author": "Siddharth Sharma", "text": "@Oliver Smith still waiting for an answer", "likes": 2}, {"author": "Oliver Smith", "text": "I got confused by this too, the arrows seem to go in the wrong direction?", "likes": 3}]}, {"topLevelComment": {"author": "暴食天王ALEX", "text": "I do think its hard to understand the opposite directions of the narrows for different branches.", "likes": 0}}, {"topLevelComment": {"author": "Milton Paucar", "text": "master", "likes": 0}}, {"topLevelComment": {"author": "Barıs Balli", "text": "This video helped me a lot! Thx!", "likes": 0}}, {"topLevelComment": {"author": "Srivatsa Marichi", "text": "Is there a copy of the presentation available out to reuse? If not is that something which is shareable? Thanks", "likes": 0}}, {"topLevelComment": {"author": "Ioane Nikoladze", "text": "Thank you! <3", "likes": 0}}, {"topLevelComment": {"author": "jernejj5", "text": "Using single branch is the same as using SVN. In my company we are using SVN and have a team of testers who check CI and nightly tests. I am one of the testers. In my opinion this is easier to spot bugs and report to developers which commit broke tests. And you do it in few days. If bugs are reported soon, developer still know what he was doing and bug fix can be quick.", "likes": 0}, "replies": [{"author": "Toby", "text": "I prefer SVN. Git is overly complex for no good reason.", "likes": 0}]}, {"topLevelComment": {"author": "Marc d'Entremont", "text": "I really enjoyed your talk. It really helped in understanding git in a more wholistic manner.", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Mesum Hussain", "text": "Why is Tower not available on Linux?", "likes": 0}}, {"topLevelComment": {"author": "Márlon Ferreira", "text": "Thank you for the info Jesse. Now let's get back to cooking.", "likes": 2}}, {"topLevelComment": {"author": "Всеслав Полоцкий", "text": "Taking into account the video name \"Git for Professionals...\" (professional housekeepers?) rebase explanation is quite fluffy and misleading. What really happens when you do the 'git rebase branch_b' from branch_a is that that commit history on branch_b left untouched (nothing is moved to branch_b, as the branch is just a pointer), and just unique commits from branch_b are applied one-by-one (cherry-picked) to branch_a and the branch_a pointer moved to the last applied commit.", "likes": 0}}, {"topLevelComment": {"author": "mark cuello", "text": "Help me", "likes": 0}}, {"topLevelComment": {"author": "Jakub Červinka", "text": "I recommend playing this on 1.25 speed, maybe even 1.5, otherwise you'll fall asleep.\nAlso, it's not a tutorial for professionals.. its just a long beginner tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Steven Schelling", "text": "Phenomenal video. These types of dev tutorials can be so dry but you made it highly visible and explained things simply and clearly. Thanks!", "likes": 2}}, {"topLevelComment": {"author": "Moayad .AlMoghrabi", "text": "Super helpful!", "likes": 0}}, {"topLevelComment": {"author": "Salaheddin AbuEin", "text": "As always, thank you so much.", "likes": 0}}, {"topLevelComment": {"author": "lik pop", "text": "Thanks for nice and useful material on git! Only one funny remark - You failed to correctly describe Subject of Perfect Commit message - you wrote: concise message of what happened. In reality ideal message tells what a task was so Pull Request reviewer knows the task and can see if you actually even understood that. What makes this funny - all commit messages that I noticed in a video were written correctly this way - so you do it correctly yourself just trick people with wrong definition ;)", "likes": 0}}, {"topLevelComment": {"author": "Stephane", "text": "I’ve been working with GIT for a few years but never got deeper than basic concepts. The patching was neat and will come in handy.", "likes": 1}, "replies": [{"author": "mark cuello", "text": "What is `Patching`?", "likes": 0}]}, {"topLevelComment": {"author": "Philip Oakley", "text": "Good. \nCould be useful to mention where the the merge-base (third source for the merge) comes from.  \nAlso, maybe worth mentioning on the branching strategies, how it interacts with the team's server fork strategy (or lack of, should it be continuous integrated/merged to the core server approach, e.g. why that rebase warning comment)", "likes": 1}}, {"topLevelComment": {"author": "Jeff Vinter", "text": "very great tutorial, solved many questions I had, which I never looked up in past...Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Mihail Colun", "text": "Am I the only one triggered by the direction of arrows between commits, they are opposite direction of the timeline.\nOther that that great video. Thanks a lot :)", "likes": 0}}, {"topLevelComment": {"author": "Natisha Ramos", "text": "wow really great", "likes": 0}}, {"topLevelComment": {"author": "marcello42", "text": "What are you doing to avoid following scenario - I am not sure how often this happens, but I think this could occur quite often:\n\nPerson A changes a file - let's say a parameter in a function, which was perhaps a bug\nPerson B works on a different branch, tests it's new feature wasn't aware that there is a change in a function he used..\n\nboth gets merged into dev - no conflicts obviously..\n\nAre dev branches freezed usually to be tested completely before merging into main and at a certain point there are done only tests without any further merges into dev to avoid this situation?\n\nAnd is someone who works on a different branch constantly pulling changes from the current (dev) branch?\nEspecially this is in my interest how people are dealing with this.", "likes": 0}, "replies": [{"author": "Toby", "text": "All final testing should be performed on the release branch in my opinion (whichever that is). Git typically complicates things by there being extra branches hanging around (feature branches) and them getting out of date causing unnecessary conflicts.", "likes": 0}]}, {"topLevelComment": {"author": "Cezar A.P.", "text": "I loved the content, thanks for the video, but oh lord your ASMR voice just drives me nutsss :`(", "likes": 0}}, {"topLevelComment": {"author": "Exorcisamus", "text": "asmr is strong with this one\nsuch a calming voice", "likes": 1}}, {"topLevelComment": {"author": "irfnrdh", "text": "woala", "likes": 0}}, {"topLevelComment": {"author": "Jason Sykes", "text": "This guy should be a Yoga Instructor.  He has such a soothing voice.", "likes": 0}}, {"topLevelComment": {"author": "veziop", "text": "this is outstanding quality. The pace and the tone might seem irrelevant but they really helps", "likes": 0}}, {"topLevelComment": {"author": "Basil Ndonga", "text": "Great explanation, precision and clarity on important git concepts. Thank you", "likes": 1}}, {"topLevelComment": {"author": "Nomaan Butt", "text": "Great video.", "likes": 0}}, {"topLevelComment": {"author": "Coding Freaks", "text": "Great content, in first10 mins of this session, I learnt two concepts, Thanks FreeCodeCamp", "likes": 0}}, {"topLevelComment": {"author": "TheQuietCity", "text": "tied to someone cluelessly smart from tw", "likes": 0}, "replies": [{"author": "TheQuietCity", "text": "first glance  brilliant", "likes": 0}]}, {"topLevelComment": {"author": "Charanjeet Kaur", "text": "Thank you so much, Guru Ji💖🙏, You are an amazing teacher! You taught us so much useful information in such a short period and made it a lot easier to understand. Thanks a lot for providing us free education. I'm the greatest fan of your work and knowledge. Keep it up! 🙌 This is one of my most favorite channels on Youtube 😍🥰", "likes": 1}}, {"topLevelComment": {"author": "Max Minenko", "text": "Where's the source code (the github link)?", "likes": 0}}, {"topLevelComment": {"author": "Paul K", "text": "Very informative and comprehensive on the main topics we work with in Git. I just saved myself several google searches trying to understand the concepts. Thank you @freeCodeCamp!", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Kholilurrohman", "text": "New subscriber here :) Thanks for the nice explanation!", "likes": 0}}, {"topLevelComment": {"author": "Fatemeh Ghasemi", "text": "That was very helpful! Thanks", "likes": 0}}, {"topLevelComment": {"author": "Joe Pham", "text": "Thank you Tobias for the wonderful tutorial 💯", "likes": 0}}, {"topLevelComment": {"author": "Vlache", "text": "start was interesting, but alot of  \"water\" that not  makes sense, can be converted from 40 min to 10-20min ! why show that you  use a 100+ megabit connection and so on/...\nUse  \"git mergetool\" + meld  and forget about  git conflicts! however i still cant understand, why you are do not use \"mate\" IDE  to solve conflit? or that IDE do not help?  so why not  start to use ATOM, its free and powerful as jetbains or web studio!", "likes": 0}}, {"topLevelComment": {"author": "Sergey Romanov", "text": "Good tutorial. Regarding GitFlow I recently created an extension for VS Code serhioromano.gitflow that creates visual interface and helps manage a project with that branching model. There is much more to GitFlow, with support type branch that allows to have LTS versions, and tags management.", "likes": 0}}, {"topLevelComment": {"author": "Ankit Choudhary", "text": "The video was informative but the tranier is saying re-FUC@tring  at 14:21 sec 🤣", "likes": 0}}, {"topLevelComment": {"author": "Metao Cloud Studio", "text": "Good but  at lats part where merge vs. rebases explained, at least one example would be  helpful", "likes": 0}}, {"topLevelComment": {"author": "Mozartos Khan", "text": "To Bias or Not To Bias", "likes": 0}}, {"topLevelComment": {"author": "Rajat Singla", "text": "I wish I had such clarity of mind as the person explaining these concepts", "likes": 0}}, {"topLevelComment": {"author": "James Allan", "text": "Great video!", "likes": 0}}, {"topLevelComment": {"author": "Yohanes Pradono", "text": "what's your microphone?", "likes": 0}}, {"topLevelComment": {"author": "Stephan Hoyer", "text": "For me the most important thing that belongs in a commit message is: Why this change. This should go in the subject not the What, because the What can be seen easily by looking at the changes. I think commit-messages as annotations to the changed lines, not describing the history of the project. So I write the messages for `git blame` and not for `git log`", "likes": 0}}, {"topLevelComment": {"author": "Steven Chang", "text": "Being confused by your commit arrows in \"merge & rebase\"", "likes": 0}}, {"topLevelComment": {"author": "Lim Soon Sim", "text": "Love this talk. Concise but clear explanations on some of the concepts that people misunderstand. Would love to see something similar about the basics e.g. how git work (local vs origin), how commits work etc.", "likes": 5}, "replies": [{"author": "1willFALL", "text": "the intricacies on how commits are created via globs gets very fine detailed, I would recommend reading Pro Git, unless you find some YouTube video that explains it, please do tell.", "likes": 0}]}, {"topLevelComment": {"author": "Juancrhcp", "text": "Thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "Pasindu SRL", "text": "A great lesson. Thanks", "likes": 0}}, {"topLevelComment": {"author": "huzifa30", "text": "thank you very much , keep the good work", "likes": 0}}, {"topLevelComment": {"author": "Brian Fontana", "text": "This was very helpful", "likes": 0}}, {"topLevelComment": {"author": "Parviz Eyvazov", "text": "would be awesome to have that pdf presentation", "likes": 0}}, {"topLevelComment": {"author": "David Lindes", "text": "I'm glad you started with git add -p.  I always teach that to folks when I can... it's so useful!", "likes": 0}}, {"topLevelComment": {"author": "Gmak6 Tutorials and More", "text": "https://youtu.be/tPYhPlcIjAE if you need the tutorial link for gmak6, i tried it and it is working i hope i helped you :)", "likes": 0}}, {"topLevelComment": {"author": "Ashfaq Jan", "text": "vey very precise and accurate for Git hub Learner", "likes": 0}}, {"topLevelComment": {"author": "Neil Clay", "text": "Brilliant, thanks", "likes": 0}}, {"topLevelComment": {"author": "Zarak Khan", "text": "a very important video would love to see more like these and some advanced as well!!!", "likes": 0}}, {"topLevelComment": {"author": "Music Creation", "text": "Fantastic ... ty!!!", "likes": 0}}, {"topLevelComment": {"author": "Adam Rolczyk", "text": "Awesome tips!", "likes": 0}}, {"topLevelComment": {"author": "Rohan Bhale", "text": "Can anyone please explain why the arrows after the branch labels are pointing forward, while those for the commit labels pointing backwards? What is the convention being followed? For Eg look @35:46", "likes": 0}}, {"topLevelComment": {"author": "Kenichi Mori", "text": "Active coding x.", "likes": 0}}, {"topLevelComment": {"author": "Dreamworksgoal", "text": "Is it only for education purpose or have you ever collaborated with your channel user projects??!!", "likes": 0}}, {"topLevelComment": {"author": "Jack Marshall McCombe", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "David Sorensen", "text": "Can someone explain to me why the arrows point to the left and not the right?", "likes": 0}}, {"topLevelComment": {"author": "Zucc", "text": "One topic in and I knew this is premium stuff. Thank you for this!", "likes": 0}}, {"topLevelComment": {"author": "यडा कि खुळा", "text": "Should’ve mentioned about merging whether to do fast forward, merge commits or squashes etc.", "likes": 0}}, {"topLevelComment": {"author": "Achraf Trabelsi", "text": "Thank you for this amazing share !", "likes": 0}}, {"topLevelComment": {"author": "Abdulaziz Marie", "text": "amazing work. i finally understood the difference between pr and merge.\nthanks for the amazing explanation.", "likes": 0}}, {"topLevelComment": {"author": "Humayun Javed", "text": "can we get slides?", "likes": 0}}, {"topLevelComment": {"author": "antihuman", "text": "I don't like git! Version Control is better!", "likes": 1}}, {"topLevelComment": {"author": "Bogusz Jeliński", "text": "I just wander if we need to change pronunciation of German names so that developers feel comfortable ...", "likes": 0}}, {"topLevelComment": {"author": "Hasan Ali", "text": "notes to self:\nonly combine changes of a single topic in the same commit,\ngit add -p  enables staging parts of the changes of a file (patch level), of course, the file must already be tracked (using git add).\nmerge: combining two different branches, it creates a merge commit in the process. with merge the two branches keep there own history seperated:\nb1-------- c1---------c2-----------------cm\n        b2    |----c1-----c2--- c3 -------|\nrebase: rebase will unite the two commit histories of both branches, do not use rebase changes pushed to remote repo, rebase diagram:\n           before rebase:\n           b1:  c1-------------c3------------\n           b2    |-------c2-----------c4-----\n           after rebase:\n           c1-----c2-----c4-----c3*\nnotice that c3 is at the end, rebase moves commits that happened on b1 after the common ancestor, this means that c3 has changed (different parent)", "likes": 3}}, {"topLevelComment": {"author": "Perry van den Hondel", "text": "A small remark; please clarify. Seems to me that the arrows are placed in the opposite direction of the development flow. Should I read them as a change is pulled from a previous step?  I presume the diagrams need to be read from from left to right but the arrows seem to point against this direction.", "likes": 11}, "replies": [{"author": "JM", "text": "@Californ1a Thanks for clarifying this; it was somehow strange to see the newer commits at the right, but the arrows pointing to the opposite direction. Now it makes sense.", "likes": 0}, {"author": "Adel Imamovic", "text": "Are you referring to the red arrows e.g. at https://youtu.be/Uszj_k0DGsg?t=949? Every commit is a knot in a directed acyclic graph and refers to a previous commit.", "likes": 0}, {"author": "Californ1a", "text": "The arrows point to the parent of the commit, whatever previous commit that one references since that's how git tracks history, using a reference to the previous commit. He's showing how git \"looks back\" through that history, and follows those references backward to find the common ancestor.", "likes": 2}]}, {"topLevelComment": {"author": "Ali Bokhari", "text": "Awesome stuff 🔥", "likes": 0}}, {"topLevelComment": {"author": "Lazy Rishabh", "text": "I really appreciate this tutorial . It was worth it. Learned something new with excellent explanation", "likes": 1}}, {"topLevelComment": {"author": "Caio Eduardo", "text": "Very good, Thank's!!!", "likes": 1}}, {"topLevelComment": {"author": "crazyconan28", "text": "Thank you, this gave me a better idea on rebase.", "likes": 0}}, {"topLevelComment": {"author": "Jean Rodrigues", "text": "Antonio", "likes": 0}}, {"topLevelComment": {"author": "hello Cheng", "text": "The video is so clear and helpful , thank you!", "likes": 0}}, {"topLevelComment": {"author": "Anthony", "text": "Thanks man, nice video!", "likes": 0}}, {"topLevelComment": {"author": "Aaron Carter", "text": "git: 'da' is not a git command. See 'git --help'", "likes": 0}}, {"topLevelComment": {"author": "Carlos Peraza", "text": "Excellent, Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Adam Weber", "text": "What about intentional commits?", "likes": 0}}, {"topLevelComment": {"author": "GBlade", "text": "Very humble guy! 👍🏽", "likes": 0}}, {"topLevelComment": {"author": "Rursus", "text": "Git-Tower: where is the Linux version?", "likes": 0}}, {"topLevelComment": {"author": "Andrey Sivak", "text": "Excellent! Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Shavarsh Shahoyan", "text": "very nice and useful video, I like the way you are explaining, good luck and thank you!", "likes": 0}}, {"topLevelComment": {"author": "Bakhtiyar Gillani", "text": "Re-Fucked at 14:22 felt nice", "likes": 0}}, {"topLevelComment": {"author": "Quách Hêng Tôny", "text": "Git commit has subject AND body 💥", "likes": 0}}, {"topLevelComment": {"author": "Amit Sahu", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Dhanvika_Vlogs", "text": "Can you share the PDF that was discussed here?", "likes": 0}}, {"topLevelComment": {"author": "private private", "text": "Trying to access webpage with advanced-git-kit.zip all I get is this error message\n\nError 503 Response object too large\n\nResponse object too large\nGuru Mediation:\n\nDetails: cache-lhr6629-LHR 1636733279 644113994\n\nVarnish cache server", "likes": 0}}, {"topLevelComment": {"author": "Maksim Muruev", "text": "So tower is for Mac and Shindows what about proper dev os support? ) You know it shares the same creator with git :)", "likes": 0}}, {"topLevelComment": {"author": "Shantanu Shekhar's June rft", "text": "Found this very helpful!! Are there books or videos on git usages for devops? I have seen devops use more commands than developers to provide good workflows for pipelines.", "likes": 0}}, {"topLevelComment": {"author": "Zach Sandvik", "text": "My compliments to the speaker. You are a very good teacher. Speaking in a relaxed way makes listening to you a huge pleasure in following your explanations. Top!!!", "likes": 4}}, {"topLevelComment": {"author": "Paul Gaida", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Ryan Kearney", "text": "This guy sounds exactly like Christoph Waltz.", "likes": 0}}, {"topLevelComment": {"author": "seddik alaoui ismaili", "text": "Hi\ncould explain if it's best practice to merge master into long lived branch? I have seen many developers do that.", "likes": 0}}, {"topLevelComment": {"author": "Yury Zaytsev", "text": "Why arrows point from new commits to old commits on all illustrations? this so bothering lol", "likes": 0}}, {"topLevelComment": {"author": "Guy Cohen", "text": "thanks for the demo!\ntime = 05:05, is it really stage this hunk? no chunk? :)", "likes": 0}}, {"topLevelComment": {"author": "Kernix", "text": "at 6:40, what do you mean you get an editor window to type the commit message? Does that automatically happen when you just type \"git commit\"?", "likes": 0}}, {"topLevelComment": {"author": "ALBIN PAUL", "text": "I like merge commit because if there are conflicts and I have lots of commits then I don't need to commit several times with conflicts resolved. I can do it in one shot.", "likes": 0}}, {"topLevelComment": {"author": "Plínio José", "text": "i worked with a cooworker that was stoling the branch commits that our team was doing just the purpose of getting more evaluation point at the company. I think he used a more complex approuch than \"rebase\" to do it, ecause he was replacing the commits author for himself. This cost his job, but it was a serious act.\nHope to see a more indepth video to show how to detect and avoid this kind of situations.", "likes": 0}}, {"topLevelComment": {"author": "Jorge Wander Santana Ureña", "text": "Thanks.\n\nIt is really helpful to know about git merge/rebase --abort to fast-undo last merge. And good to know about fast-forward, merge-commit & the one done by rebase (I don't know the name)\n\nI like the tip about commit-message-schema.\n\nAnd about branch-strategy, I would prefer short-live branches. \n\nI love Pull Requests, you can even undo the whole pull request if needed. Even if there are a lot of commits. You only have to revert the pull request. Thats great.", "likes": 1}}, {"topLevelComment": {"author": "Hoàng Anh", "text": "Thanks a lot!!!", "likes": 0}}, {"topLevelComment": {"author": "Pois Chiche", "text": "I'd like to thank you for this video. English is not my native language & I'm a little bit rusty for now, but your spelling is clearly comprehensible. This is great, thanks.\n\nBesides this, your advice is a pure jewel. Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Ashley Engle", "text": "Super well articulated thorough and solid knowledge here. Thank you! 💕", "likes": 1}}, {"topLevelComment": {"author": "debbah", "text": "4:41 a \"simple\" question with 11 possible answers :D", "likes": 0}}, {"topLevelComment": {"author": "Daryl Adhitya Henry", "text": "Hi. Thanks for great tutorial. But I have some confusion in \"pull request\". Is it must be on fork to get this feature?\n\nAnd why do we want to rebase? I mean, we still love to have those commits on other branch right? So we can undo something within those commits maybe?\n\nThanks.", "likes": 0}}, {"topLevelComment": {"author": "archit jain", "text": "\"You can live a happy Git life just using merge\", I felt it!", "likes": 12}}, {"topLevelComment": {"author": "Mehmet Emin BAŞOĞLU", "text": "This is video is awesome. Thank you for all the effort. I admire your work.", "likes": 0}}, {"topLevelComment": {"author": "Lothar Scholz", "text": "Seriously when did you ever use the git history browing feature? \nIn my lifetime it more or less is always used as just file synchronizing and of course branch support. But really going through the history via commit messages to find old files is never used. Adam Thornhill from \"Code as a crime Scene\" is the first real usecase i saw for that.", "likes": 0}}, {"topLevelComment": {"author": "Tomasz Madera", "text": "TEST", "likes": 0}}, {"topLevelComment": {"author": "Evgeniy Polyakov", "text": "The perfect commit requires --allow-empty option!", "likes": 0}}, {"topLevelComment": {"author": "Daniel Wilkowski", "text": "This is supposed to be \"Professionals tutorial\"? No resets? No reverts? No cherry-picks? No interactive REBASE? No patches? No octopus-merge? No risks of push -f?\n\nTo me this is just another begginers tutorial.", "likes": 2}}, {"topLevelComment": {"author": "David Clark", "text": "Good content.  However, I think you missed one of the more common patterns involving rebase and merge.  In your case of an LT branchA and work branchB with changes on both you rebased the changes in branchA on the changes in branchB.   In my experience, it is more common to rebase the changes in branchB on the changes in branchA (checkout branchB, rebase branchA, <resolve conflicts, build, test>, commit) then merge the resolved changes back into branchA (checkout branchA, merge branchB).  That final merge MUST be a fast-forward.  If it isn't, start over.  This completely avoids the problem of rewriting history on branchA that you alluded to.  Given branchA may be used as a base by other developers and could be hosted on a server that disallows history changes, that is essential.", "likes": 48}, "replies": [{"author": "Hamid R", "text": "To update a branch we can pull master to that branch :\nGit checkout b1 \nGut pull origin master", "likes": 0}, {"author": "Alok Baluni", "text": "@mark cuello branch is pointer to the recent commit", "likes": 0}, {"author": "mark cuello", "text": "@Aram Rodríguez González What is `Re-base`?", "likes": 1}, {"author": "mark cuello", "text": "What`s a branch?", "likes": 1}, {"author": "Aram Rodríguez González", "text": "Also even if you like to rebase an already pushed branch, you could do it safetely using the \"git push --force-with-lease\" and the \"git pull --rebase\" options, that will avoid you overwritten any changes made in the remote branch.", "likes": 3}]}, {"topLevelComment": {"author": "Natasha Samuel", "text": "Great class.\nKeep up the good work.\n\nThank You,\nNatasha Samuel", "likes": 0}}, {"topLevelComment": {"author": "Sri Krishna Nunna", "text": "This video is awesome. I derespected Merge vs Rebase ! Thanks again!", "likes": 0}}, {"topLevelComment": {"author": "Never Code Alone", "text": "Very useful - thx a lot", "likes": 0}}, {"topLevelComment": {"author": "Martin Geremi Flores", "text": "a lot of great content in this video.", "likes": 0}}, {"topLevelComment": {"author": "Dennis Lindqvist", "text": "Dude, branch instead…", "likes": 0}}, {"topLevelComment": {"author": "Keven Webb", "text": "This was very well done. I am sending it on to others. Best video for git at this level that I have seen.", "likes": 0}}, {"topLevelComment": {"author": "joross8", "text": "Tobias you have a fantastic speaking voice and presentation style. Really enjoyed this practical no bs review of how to use Git effectively,", "likes": 0}}, {"topLevelComment": {"author": "B.T. Franklin", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "voyageruk2002", "text": "What a beautifully crafted tutorial.", "likes": 0}}, {"topLevelComment": {"author": "Yi Zhang", "text": "Btw, you could be an excellent English tutor for ESL students.", "likes": 0}}, {"topLevelComment": {"author": "Mark Brathwaite", "text": "Very helpful review of concepts - thank you.", "likes": 0}}, {"topLevelComment": {"author": "Kevin H.", "text": "It is said in the introduction it’s an intermediate course,  more advanced that what we find in basic beginner git tutorials but I found a lot of it was slow paced and very much for first time git users. Some interesting content at the very end on the behind the scenes of rebase and merge but nothing very substantial. For instance, author could have gone into interactive rebase and squashing, explaining with concrete example the conflicts that can arise.To be honest, just a bit disappointed as this lasted 40m and I did not learn anything from this video (and I’m by far not an expert git user).", "likes": 0}}, {"topLevelComment": {"author": "Erik Grundy", "text": "I'm quite a big fan of \"git add -i\". This lets you do all the hunk-specific addition, while avoiding having to retype commands", "likes": 3}}, {"topLevelComment": {"author": "p-a", "text": "Very good tutorial! Even though I feel quite a familiar with git already, I have learned some new stuff again! :) Btw, very nice solution of solving merge conflicts in Tower! Thanks.", "likes": 0}}, {"topLevelComment": {"author": "Michael Theos", "text": "You should never rebase on a branch that someone else could work on, but if you're the only one working on a branch then it's safe to rebase and force-push new history.\nI do it quite often so that you can break down the changes in a PR by commit.", "likes": 0}, "replies": [{"author": "Adam Spiers", "text": "Incorrect, many Open Source projects require rebasing of PR branches, and there are many good reasons for this. Your advice could be more accurately rephrased as \"never rebase a shared branch without making sure that there is a clear expectation that this can happen\".", "likes": 0}]}, {"topLevelComment": {"author": "Pratik Adarsh", "text": "This wasn't as deep as I was hoping for, most of the beginner tutorials on git do cover 80% of the topics covered here. The last part about merge vs. rebase was interesting though.", "likes": 16}}, {"topLevelComment": {"author": "Orlando Reyes", "text": "Excellent!! this video has helped me to finally undestand git commands easy explained. Thanks.", "likes": 1}}, {"topLevelComment": {"author": "Sandro Jorge Oliveira", "text": "Hi Günther, thank you about this amazing training! The best for you!", "likes": 0}}, {"topLevelComment": {"author": "ליאור רוקח", "text": "Great!!! Thank you:)", "likes": 0}}, {"topLevelComment": {"author": "Shailendra Kumar", "text": "Great Job! Now I am confident enough to manage any size code  base. Thank You.", "likes": 1}}, {"topLevelComment": {"author": "Jelmergu", "text": "small point, at ~16:24 you are talking about release branches in git flow. You say that a release gets applied to the main branch, however the slide does not reflect this, it only shows the release branch getting applied to the develop branch. Just a small point where the images don't line up with the spoken explaination", "likes": 0}, "replies": [{"author": "Jelmergu", "text": "ow, never mind, it does, just was looking at the arrows the wrong way around", "likes": 0}]}, {"topLevelComment": {"author": "Aj Jo", "text": "Very informative video. Every thing was very well explained!", "likes": 0}}, {"topLevelComment": {"author": "Alexander Lyabah", "text": "Since when creating forks and making pull requests are advanced topics?", "likes": 0}}, {"topLevelComment": {"author": "Nibbana Patipada", "text": "Man! your voice is soo soothing, whenever I get started watching this video, I fall asleep in 5 minutes.", "likes": 1}}, {"topLevelComment": {"author": "Joseph Gutierrez", "text": "40 minutes sounds like a long time, but it was all jam packed with legitimate information and no fluff. Great video. Watched the whole thing and didn't even notice the time.", "likes": 153}, "replies": [{"author": "Rafael Alves", "text": "for me 40 min is when the guy is straight to the infos and not 5+ hours of beginner talk", "likes": 0}]}, {"topLevelComment": {"author": "Marcellin Wabo", "text": "Thanks a bunch for this great tutorial. I have just learned many new thing by watching.", "likes": 0}}, {"topLevelComment": {"author": "Gerald Okioma", "text": "Loved the tutorial! Could we have one on Readme file best practices for professionals too?!", "likes": 4}}, {"topLevelComment": {"author": "Leonhz", "text": "Each five minutes I want to give another like to this video. 😅 Thank youuuu.", "likes": 0}}, {"topLevelComment": {"author": "Emir K", "text": "I do lots of small commits when I am working, should I rebase these onto 1 big commit before merging with everyone else or is a cluttered commit history ok? Part of the reason is I work from multiple machines and I want to push and pull via github the code so I can work on it elsewhere. So I might only be half done with something and I have to make a commit just to finish up the day, push, then pull from home, or I might have to \"save\" by committing and then working on another branch.", "likes": 1}}, {"topLevelComment": {"author": "Dragon", "text": "I was always writing a long commit msg but now I will be dividing it in subject and body thanks", "likes": 0}}, {"topLevelComment": {"author": "Manfred Lotz", "text": "Only one comment: this video is excellent!!", "likes": 0}}, {"topLevelComment": {"author": "Alex Koshuta", "text": "rename it to \"git fore beginners\", otherwise its useless", "likes": 0}}, {"topLevelComment": {"author": "USONOFAV", "text": "I worked on intellij and I love the merge tool it got. Exactly looked liked the one shown here. My work though still uses eclipse so I might use this git tower app.", "likes": 1}}, {"topLevelComment": {"author": "Jemz", "text": "Who else heard \"Happy Git life\"1😆", "likes": 1}}, {"topLevelComment": {"author": "geizka fahriza", "text": "you sound like hans landa from inglorious basterds, and i feel like the french guy getting interogated", "likes": 0}}, {"topLevelComment": {"author": "Alberto Harres", "text": "I didn't knew about rebase cons, thanks a lot for sharing this valuable info!", "likes": 1}}, {"topLevelComment": {"author": "Nathaniel Daniels", "text": "It took me a minute to realize that merging had to be done a certain way to not delete all the work you just did.", "likes": 1}}, {"topLevelComment": {"author": "Tibor Polgar", "text": "Thank you so much for this amazing course!", "likes": 0}}, {"topLevelComment": {"author": "ste3191", "text": "Perforce is the king. Git a toy :)", "likes": 0}}, {"topLevelComment": {"author": "d ë p r é ß ß e d   K ñ i g h t", "text": "cool.. thank you so much\n it's really helpful ✌️", "likes": 0}}, {"topLevelComment": {"author": "Ethan Neff", "text": "This is way too complex. Ban long running branches. Force squash merge on pull requests. Require all pull requests to be updated to date with master. Keep the process simple. Anything else is just organizing waste with the illusion of being productive. The most productive thing an engineer can do is ship production code. Make your processes prioritize that.", "likes": 1}, "replies": [{"author": "Vorrnth", "text": "I am pretty much against such squashing. Makes things harder to follow IMO. And banning long running branches? Not always possible.", "likes": 0}]}, {"topLevelComment": {"author": "Bob Smith", "text": "The advanced git tutorial you link to never sends the link to the videos. Only signs you up for the Git Tower newsletter. 😡", "likes": 0}}, {"topLevelComment": {"author": "Armin Linzbauer", "text": "I'm totally getting Christoph Waltz vibes from him!", "likes": 0}}, {"topLevelComment": {"author": "pepu", "text": "Hi, could you please make a Rust course? I would be extremely happy if you do ;D", "likes": 1}}, {"topLevelComment": {"author": "Mikey", "text": "This is an awesome intro on some intermediate git techniques. Looking forward to the Advacned Git tips and tricks!", "likes": 27}, "replies": [{"author": "Eelguneezmemmedov", "text": "+", "likes": 1}]}, {"topLevelComment": {"author": "Luffy Baki", "text": "Can anyone help me with credit sussie global codeing challenge.", "likes": 1}}, {"topLevelComment": {"author": "Ahmad Jamal Mughal", "text": "Man you were so clear and to the point. Thanks for the tutorial it was very informative man.", "likes": 1}}, {"topLevelComment": {"author": "Andrej Marinić", "text": "a very awesome presentation, thanks :)", "likes": 0}}, {"topLevelComment": {"author": "Emmanuel Okwuidegbe", "text": "Awesome video.\nVery impactful!", "likes": 1}}, {"topLevelComment": {"author": "drazenboy", "text": "This is great, thanks! Btw the expression is \"last but not least\", not \"last and least\"", "likes": 0}}, {"topLevelComment": {"author": "Potato Kitty", "text": "This is interesting.", "likes": 0}}, {"topLevelComment": {"author": "kunal phaltankar", "text": "Absolute gem 🥳🙌", "likes": 0}}, {"topLevelComment": {"author": "SeaJay Oceans", "text": "This will really help me  git it right !  :-)", "likes": 1}}, {"topLevelComment": {"author": "Jim Morrison", "text": "Version control used to be simple, something you never really had to think about.\nThen GIT arrived.\nNow, we have to spend our days cherry picking, rebasing, and watching videos like this.\nBefore you disagree with me, have you ever used any other version control system?", "likes": 7}, "replies": [{"author": "Jim Morrison", "text": "@Vorrnth I know Git very well. I have been using it for years. Yes, it doesn't need to be complex, but the problem is that it is too easy to abuse. People love overcomplicating solutions, and Git allows this too much. You ask a question about Git to a team people of people, and you will get ten different answers. Maybe five of them will work, and five of them won't. Anyway, thanks for your reply.", "likes": 1}, {"author": "Vorrnth", "text": "I have used CVS, subversion and some IBM tool. And I very much prefer git. It can be complex but does not need to. Just stick to the simple commands and it is not any more complex than basic CVS. But the branching and merging is way easier.", "likes": 1}, {"author": "Jim Morrison", "text": "@James Hamann Clearcase, CVS, Subversion.\nSometimes the geeky Linus fanboy crowd wins.", "likes": 0}, {"author": "James Hamann", "text": "What else is there? Why do you think Git took over like it did?", "likes": 1}, {"author": "senko gaming", "text": "idk man, I'm unemployed so I've never used git in a formal enviroment", "likes": 3}]}, {"topLevelComment": {"author": "Arnab Personal", "text": "This is what I was looking for", "likes": 0}}, {"topLevelComment": {"author": "Icon's World", "text": "99 commenth", "likes": 0}}, {"topLevelComment": {"author": "HycrosxGladeum", "text": "Plz make a cry engine Full course", "likes": 1}}, {"topLevelComment": {"author": "13 16", "text": "อยากให้มีซับไทยจังครับ", "likes": 0}}, {"topLevelComment": {"author": "ifStatement ifStatement", "text": "This git thing man. I make a pull request and all my local data is gone.", "likes": 1}}, {"topLevelComment": {"author": "dilson manjenje", "text": "Im not new to Git… But this was very helpful, Thank you…! Obrigado 🇦🇴", "likes": 1}}, {"topLevelComment": {"author": "John Brain", "text": "Very good content, learned a lot through this course, Just a tiny little request: can you please share the slides? So I can make notes more easily.", "likes": 22}}, {"topLevelComment": {"author": "Kritesh Agarwal", "text": "Gosh! I needed this. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Wikode medias", "text": "Thank you for this amazing course ! Perfect narration !", "likes": 4}}, {"topLevelComment": {"author": "Rinat Valiullov", "text": "4:43\n\n How to make that `git add -p` will divide changes to several chunks? \nI made changes in different places of one file but `git add -p` didn't suggest that file to split into several chunks.", "likes": 0}, "replies": [{"author": "Rinat Valiullov", "text": "I found the solution myself. The `s` key - `split the current hunk into smaller hunks`", "likes": 1}]}, {"topLevelComment": {"author": "Masa", "text": "I can concentrate well while watch this video, and understood more quickly and deeply, because of your speaking speed that is more comfortable for me. Thanks a lot.", "likes": 0}}, {"topLevelComment": {"author": "Bharath Kumar", "text": "Very well explained, short and sweet :)", "likes": 0}}, {"topLevelComment": {"author": "Cow Dee", "text": "Blink twice if you're being held at gun point.", "likes": 2}}, {"topLevelComment": {"author": "Parlor 311", "text": "I wish you elaborated more on when and when not to use rebase instead of focusing on what it does technically. I feel it might become the new norm for companies nowadays.", "likes": 4}, "replies": [{"author": "Gregory Stocker", "text": "@Nick Schmitt Right, to squash your own individual local commits together. I meant it’s usually not advised to rebase a collaboration branch. Or at least that’s how I was taught to best avoid merge conflicts due to separate histories etc..", "likes": 0}, {"author": "Nick Schmitt", "text": "@Gregory Stocker No, it's common for individual team members to rebase their local commits before pushing to remote.", "likes": 0}, {"author": "Andrej Marinić", "text": "the answer to the question of \"when should I use rebase?\" is \"never.\" rebase promises to \"keep the history clean\", whereas I would say it does exactly the opposite. for me, a clean history is one that shows everything, the good and the bad. rebase erases the bad if things go well, or erases the good, if things go bad. there's nothing clean about that, just lies. dirty lies I say!!!", "likes": 1}, {"author": "Gregory Stocker", "text": "Rebase is usually discouraged when collaborating with others because because it rearranges your history and can really mess things up. \n\nIt’s usually better to add to an existing code base with a new merge commit than to scramble what was there before to fit your new change linearly. \n\nRebase is good for when you want a single, linear history for yourself and don’t care about losing a true path for how things evolved. \n\nPerforming merges that are considered “fast forwards” is key when collaborating with others using a shared dev branch and ensures no merge conflicts.", "likes": 1}]}, {"topLevelComment": {"author": "Karan Shyam Mittal", "text": "The video on branching and now this video. Thank you so much for making these difficult concepts easy for me.", "likes": 0}}, {"topLevelComment": {"author": "pranay p", "text": "Thank you so much for this man. Your content is a better than a lot of paid courses out there !", "likes": 0}}, {"topLevelComment": {"author": "- -r", "text": "22:35 **when the last command was good**", "likes": 0}}, {"topLevelComment": {"author": "Wandile Mawelela", "text": "Thank you fCC! ❤", "likes": 0}}, {"topLevelComment": {"author": "Jeaf Gilbert", "text": "I have question:\nMy feature branch should always be 'rebased' to master, but the feature branch itself is restricted and cannot be forced push to avoid new commit replacement. I know I can change the force push setting, but that's not the case. How to do this concept with merge?", "likes": 0}}, {"topLevelComment": {"author": "Kevin Nelson", "text": "14:21 come again? Lol", "likes": 3}}, {"topLevelComment": {"author": "Hi Eu", "text": "I never use the first tip, rather do small commits after each minor changes instead.", "likes": 0}}, {"topLevelComment": {"author": "Shawn Ke", "text": "Very nice!", "likes": 0}}, {"topLevelComment": {"author": "Girish Jangam", "text": "Please upload modern javascript course", "likes": 0}}, {"topLevelComment": {"author": "Savita Pandey", "text": "This is the best channel i would suggest every one if they are beginners", "likes": 1}}, {"topLevelComment": {"author": "SLHooLigON", "text": "superb explanation. Nice and Clean.  thank you", "likes": 0}}, {"topLevelComment": {"author": "Bitter Thread", "text": "The first few lines made me already confident", "likes": 1}}, {"topLevelComment": {"author": "Pratik Wadekar", "text": "I had a single index.html file wherein I added a link tag and a script with 3 lines of code. But everything was considered as a single hunk when I ran git add -p. How are those hunks decided by Git ?", "likes": 0}}, {"topLevelComment": {"author": "Avon", "text": "I was not aware of the -p parameter who give me the ability to add only a specific part to the staging area.", "likes": 194}, "replies": [{"author": "Alexagrigorieff", "text": "@Toihir Halim You can also edit the patch to be staged (*e* option), for example when you need to only stage some lines of a contiguous changed block.", "likes": 1}, {"author": "Never Code Alone", "text": "Super useful yes", "likes": 0}, {"author": "Vorrnth", "text": "I usually do that kind of stuff in git gui.", "likes": 3}, {"author": "d ë p r é ß ß e d   K ñ i g h t", "text": "really.. 😶", "likes": 0}, {"author": "Ahmad Jamal Mughal", "text": "I swear me neither.", "likes": 1}]}, {"topLevelComment": {"author": "Abdullah Adam", "text": "Great video! Something which can be useful for finding files with merge conflict markers:\ngit diff —check", "likes": 2}}, {"topLevelComment": {"author": "MsOffice Learning", "text": "Thank for your sharing.", "likes": 0}}, {"topLevelComment": {"author": "Thanos Mourtzoukos", "text": "truly one of the best git concepts tutorial", "likes": 1}}, {"topLevelComment": {"author": "Vandana Tiwari", "text": "The way you narrated the whole concept is so awesome, everything got stick to the mind perfectly. Thanks for this beautiful content.", "likes": 57}, "replies": [{"author": "d ë p r é ß ß e d   K ñ i g h t", "text": "my thoughts exactly", "likes": 1}]}, {"topLevelComment": {"author": "hariyanto Prasetyo", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Ricardo Rosa", "text": "Real good instructor!! 5 Star*\nThank you so much!", "likes": 1}}, {"topLevelComment": {"author": "etc_chmod", "text": "Danke!", "likes": 0}}, {"topLevelComment": {"author": "Timur Kasiev", "text": "Thanks", "likes": 1}}, {"topLevelComment": {"author": "coder", "text": "Make a video on electronjs", "likes": 0}}, {"topLevelComment": {"author": "Matt Graves", "text": "I was just asking for more Tobias!\nThank you!!!", "likes": 0}}, {"topLevelComment": {"author": "Andy Wang", "text": "super clear", "likes": 0}}, {"topLevelComment": {"author": "Bart Zumba", "text": "I love you", "likes": 0}}, {"topLevelComment": {"author": "Meiya Chan", "text": "Well presented and well explained! Clarified my long-time confusion of merge and rebase <3.", "likes": 3}}, {"topLevelComment": {"author": "ITSPERSIE", "text": "most valuable channel on yt for me rn ✨\nthanks 🤧", "likes": 3}}, {"topLevelComment": {"author": "dfh348", "text": "1.25x playback speed for normal speech", "likes": 0}}, {"topLevelComment": {"author": "ABob", "text": "You sound like Dr Schultz from Django.  Cool 😎", "likes": 1}}, {"topLevelComment": {"author": "Игор Ташевски", "text": "What's intermediate in this?", "likes": 0}}, {"topLevelComment": {"author": "Braulio Andre", "text": "I've just realized I didn't know Git at all lol. Thank so much for this.", "likes": 36}}, {"topLevelComment": {"author": "Giovanni Chrysostomo", "text": "First I'd like to thank you FCC and thank all your collaborators that bring content to us! I promise that I'll try to get as much experience as I can to get better and I will retribute all your efforts. \n\nRegards from Brazil!", "likes": 7}}, {"topLevelComment": {"author": "David Michael", "text": "\"Be the channel you want to see in the world\". Thank you FCC!", "likes": 0}}, {"topLevelComment": {"author": "flamingwoodz", "text": "You are a great teacher!", "likes": 0}}, {"topLevelComment": {"author": "Barrientos Cardenas Lino Fernando", "text": "Yesterday finished the git for beginners course", "likes": 0}}, {"topLevelComment": {"author": "Sugam Karki", "text": "\"Only in great need, force push you must.\"\n                                                           -- Yoda", "likes": 4}}, {"topLevelComment": {"author": "Adeni", "text": "I think I saw another video from him but I forget what it was about", "likes": 0}}, {"topLevelComment": {"author": "Gary Lau", "text": "Git is so difficult to use, for me, it's even more difficult than learning programming!", "likes": 4}, "replies": [{"author": "Vorrnth", "text": "@Edward Sanville CVS for everyone :)", "likes": 0}, {"author": "Vorrnth", "text": "If you stick to the basic features it is as easy as any contemporary competing vcs.", "likes": 0}]}, {"topLevelComment": {"author": "TheVertical92", "text": "perfect timing.\nI just commited to a project and was thinking about how i should structure my pull-requests.", "likes": 1}}, {"topLevelComment": {"author": "Nikhil Singh", "text": "When tower for linux?", "likes": 0}}, {"topLevelComment": {"author": "Terence Dew", "text": "Your voice was so relaxing it put me to sleep but when I woke up I knew how rebasing works, so thank you!", "likes": 382}, "replies": [{"author": "🔥 Bibek Joshi Vlogs 🔥", "text": "It's a complement or comment 🤣🤣", "likes": 0}, {"author": "DeShark88", "text": "If only he drank a glass of water beforehand so the glacking wasn't so bad!", "likes": 0}, {"author": "Kieran Milligan", "text": "This is outstanding 👌", "likes": 0}, {"author": "Honey Badger", "text": "😭😂", "likes": 0}, {"author": "Sudeep Jadhav", "text": "Git lulabu", "likes": 0}]}, {"topLevelComment": {"author": "Shafayat", "text": "This video came just before our first group project for my uni course. Thanks!", "likes": 7}, "replies": [{"author": "Ahmad Jamal Mughal", "text": "Good luck man.", "likes": 0}]}, {"topLevelComment": {"author": "Hashir Nouman", "text": "please release ethereum development course", "likes": 0}}, {"topLevelComment": {"author": "Owais Farooqi", "text": "Could you please share these slides too. Thank you", "likes": 0}}, {"topLevelComment": {"author": "thecashewtrader", "text": "I love this.", "likes": 0}}, {"topLevelComment": {"author": "Atharva Athaley", "text": "Man. My boss just told me to learn git and then I saw notification for this video.", "likes": 0}}, {"topLevelComment": {"author": "Jéan-Pierre Schutte", "text": "I was literally looking for these advanced concepts earlier this week! Thank you!", "likes": 20}}, {"topLevelComment": {"author": "Talha Yousuf", "text": "This channel is killingly beautiful", "likes": 3}}, {"topLevelComment": {"author": "Elian", "text": "I was literally just watching the other video on git, oh well I guess I have another one to watch 😂", "likes": 2}}, {"topLevelComment": {"author": "Jett The Coder", "text": "Wow I love these vids", "likes": 0}}, {"topLevelComment": {"author": "KING", "text": "This channel is just amazing, and other youtubers also follow this channel", "likes": 6}}, {"topLevelComment": {"author": "Coding With Mike", "text": "This is making me feel really guilty for making my message something like \"small changes\" so many times 😅", "likes": 3}}, {"topLevelComment": {"author": "Ana Maria", "text": "Thank you!! 🚀💙", "likes": 0}}, {"topLevelComment": {"author": "Memnoch Williams", "text": "Thanks!", "likes": 3}}, {"topLevelComment": {"author": "Jiren", "text": "WOW! I was just looking for this. Thanks y'all", "likes": 1}}, {"topLevelComment": {"author": "SUPER•SNAKE", "text": "Very cool", "likes": 1}}, {"topLevelComment": {"author": "Sreehari Meledam", "text": "Great", "likes": 0}}, {"topLevelComment": {"author": "Ammar Ouds أعواد عمار", "text": "Will be watching it tonight", "likes": 0}}, {"topLevelComment": {"author": "Nikki saha", "text": "So it doesn't teach basics?", "likes": 0}, "replies": [{"author": "Nikki saha", "text": "Thank you so much ❤️ you guys are the best ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "likes": 1}, {"author": "freeCodeCamp.org", "text": "Learn the basics with this video: https://www.youtube.com/watch?v=RGOj5yH7evk", "likes": 1}, {"author": "Nikki saha", "text": "@Shafayat ok I'll check it , thank you", "likes": 0}, {"author": "Shafayat", "text": "There is another video on this channel that teaches the basics. :)", "likes": 0}]}, {"topLevelComment": {"author": "Python Tutorials for Digital Humanities", "text": "Looking forward to this!", "likes": 1}}, {"topLevelComment": {"author": "LOOK AT MY PROFILE PICTUE", "text": "Cool", "likes": 2}}]}