{"video": {"id": "vb9uYBtqmeM", "title": "Learn to use CodePen from a co-founder of CodePen", "description": "Chis Coyier, who co-founded CodePen, demonstrates how to use CodePen and shares some little-known tricks.\n\nCodePen is a social development environment that allows you to write code in the browser, and see the results of it as you build. \n\n🔗https://codepen.io/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT22M50S", "likes": "2065", "views": "106953"}, "comments": [{"topLevelComment": {"author": "FA SE", "text": "thx a lot senior sir", "likes": 0}}, {"topLevelComment": {"author": "Bloomy Redwood", "text": "What is the difference between compiled css and uncompiled?", "likes": 0}}, {"topLevelComment": {"author": "The one that’s never gives up😈", "text": "Note’s", "likes": 0}}, {"topLevelComment": {"author": "Avril Yielena", "text": "You have dad vibes.", "likes": 0}}, {"topLevelComment": {"author": "david abba", "text": "PREACH!!!!!!!!!!!The GoSpel Of TruTh\nthanks alot\ncodepen...\nluv at first site", "likes": 0}}, {"topLevelComment": {"author": "Bryan Larrauri", "text": "Hi, am I the only one who's not able to see the Dashboard option? Thank", "likes": 0}}, {"topLevelComment": {"author": "Repentance: The Missing Link Of True Salvation", "text": "FEAR GOD.Repent of your Sin and have faith in our Lord and Saviour Jesus Christ forever; for the forgiveness of your sin and for the salvation of your soul. \n\nThe Lord Jesus Christ can grant us everlasting life; afterlife here on earth without pain, suffering and death. (Revelation 21:4) when we Believe, have faith and love Him with all our heart, soul, mind and all our strength (Mark 12:30-31) to the glory of God the father (Philippians 2:10-11)\n\nMark 16:15-16\nNew King James Version\n15 (A)And He said to them, “Go into all the world (B)and preach the gospel to every creature. 16 (C)He who believes and is baptized will be saved; (D)but he who does not believe will be condemned.\n\nI love you as a brother/Sister in Christ  enough to tell you the truth, I don’t want you to end up in Hell because of your sins; it takes my breath away. Bro/Sis for your own sake; Humble yourself before the almighty God and His son our Lord and saviour  Jesus Christ for the forgiveness of all your sins . Before it’s too late. Repent; confess and forsake your sins  and trust in Lord Jesus Christ for the forgiveness of your sins and for your eternal salvation. The choice is yours .  \n\nWe are all sinners and desperately need God’s mercy. (Romans 3:23)\n\nWe have violated His moral law the Ten Commandments. You shall not lie , you shall not steal , you shall not covet , you shall not used God’s name in vain such as telling OMG TO express disgust , you shall not commit adultery, you shall have no other God’s before Him.  Remember and Keep the sabbath holy, honour your mother and your father, you shall not worship graven images or statue.\n(Exodus 20:1-17)\n\nYou shall not look with Lust it is adultery in the heart\n(Matthew 5:27-30)\n\nThese moral law proves that we have violated God’s moral law. \n\nYou and I broke God’s moral law and the Lord Jesus Christ paid our punishments in full by His most precious blood.\n\nHe redeem, sanctify, and washed us by His most precious blood. \n\nOur Lord and saviour Jesus Christ died for your Sin for your salvation and He rose from the grave .\n\nThe question is would you receive His salvation for you\nToday ? \n\nAccept and receive Jesus Christ as your personal Lord and saviour from Sin and Hell. \n\nThe choice is yours. \n\nActs 20:21\nKing James Version\n21 Testifying both to the Jews, and also to the Greeks, repentance toward God, and faith toward our Lord Jesus Christ.", "likes": 0}}, {"topLevelComment": {"author": "Selyt Official", "text": "Code pen is de best 👍👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "Thriveark", "text": "Great introduction Chis, amazing, very useful application.", "likes": 0}}, {"topLevelComment": {"author": "Hashlee", "text": "Tnx mahn i couldnt figure some shits up", "likes": 0}}, {"topLevelComment": {"author": "samodpoonia", "text": "Javascript", "likes": 0}}, {"topLevelComment": {"author": "Navdeep Kaur", "text": "thanks for explanation  very nice", "likes": 0}}, {"topLevelComment": {"author": "stardust", "text": "can i copy the works from the codepens and use them????", "likes": 0}}, {"topLevelComment": {"author": "Driss MAREOUDI", "text": "Thank you for the nice video. I’m supposed to build the attribute page project with pencode, but I am not able to use it with my screen reader. By the way, I am blind. Thanks", "likes": 1}}, {"topLevelComment": {"author": "Sourav Ganguly", "text": "I can't find the dropdown option in codepen although it is showing \"not right file name\". Please help", "likes": 0}}, {"topLevelComment": {"author": "Best Recipes", "text": "wanker!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Nando Pookey", "text": "thank you sir", "likes": 0}}, {"topLevelComment": {"author": "Genesis Cardozo", "text": "I think I just fell in love with codepen.\n\nthank you for this video.", "likes": 2}}, {"topLevelComment": {"author": "silenthunder", "text": "I'm currently in coding class and I didn't even want it...", "likes": 0}}, {"topLevelComment": {"author": "chococandy", "text": "Interesting! My friend is currently using it and it sounds interesting, so why not give it a try:) Thank you sir for this informative video.", "likes": 1}}, {"topLevelComment": {"author": "Every day online shopping", "text": "I love the video the way you can of explain everything was amazing and it would be really nice if you can make another video how to used it but this time more JS and other programs ...BTW I  Love your channel...You are awesome.", "likes": 1}}, {"topLevelComment": {"author": "simple😎", "text": "M not using any editor everything m doing on code pen it is just extra amazing , huge thanks to the founder of the code pen", "likes": 0}}, {"topLevelComment": {"author": "fly by", "text": "Found this before some weeks. I'm relativily new to JS, CSS, HTML development. Was more into Win32 (Borland Delphi VCL), Winforms and WPF UI design before. Codepen ist really cool stuff!", "likes": 1}}, {"topLevelComment": {"author": "VRuno", "text": "Question: \nWhy when I use to try the \"autofill\" option with the <tab> key, doesn't work? 🧐\n- or is this option only for a premium account?", "likes": 0}}, {"topLevelComment": {"author": "Ian Williams", "text": "Thanks for this.\nI have been working through freecodecamp all good and then they suggest using codepen and its extremely daunting, as it is when you are to complete your first assignment ! You get to your first assignment and then you get a new application as well! Us noobs may panic.\n\nYour enthusiastic and interesting presentation has taken away some of the fear, off to have a play now, thanks again.", "likes": 4}}, {"topLevelComment": {"author": "Sheila R.", "text": "Hi, how can I make an animation using codepen? animation: hand 5s infinite; won’t work. Thank you! Btw I am trying to move  the hand of my robot", "likes": 0}}, {"topLevelComment": {"author": "Zeusafoos", "text": "Yes coding is fun but \n\n\n\n\n\n\n\n\n\n\nI hate java", "likes": 0}}, {"topLevelComment": {"author": "skeeterburke", "text": "for a moment there i thought you were gonna call us all freaks! oh, \"free code camp people\" ...... i'd be fine with freak anyway, cuz you can't hide from the truth", "likes": 1}}, {"topLevelComment": {"author": "EMPOWER", "text": "Why aren't you showing us how to create the pop up sales notification?.....I NEED HELP!!!", "likes": 0}}, {"topLevelComment": {"author": "AAnnoo khan", "text": "great work,great wbsite", "likes": 0}}, {"topLevelComment": {"author": "Honestly Marie", "text": "This tutorial was very informative and hilarious. Thanks a bunch!", "likes": 1}, "replies": [{"author": "BACKPACKTOPIA", "text": "thank you for watching :)", "likes": 0}]}, {"topLevelComment": {"author": "Mohammed Abdul Sohail", "text": "Can we use the code which are labelled as \"pro\" in our Projects?", "likes": 0}}, {"topLevelComment": {"author": "大野原信", "text": "元気いっぱいで最高です！Thank you!", "likes": 3}}, {"topLevelComment": {"author": "Natalie Hui", "text": "I don’t understand the JavaScript", "likes": 6}}, {"topLevelComment": {"author": "Sergio Arroyo", "text": "nice one . Thank you so much for creating this! I heart unlimited :)", "likes": 1}}, {"topLevelComment": {"author": "Nguyễn Sỹ Hùng", "text": "ai người việt nam dậy em với :(", "likes": 0}}, {"topLevelComment": {"author": "Deacon Blues", "text": "Don't understand why you would make privacy a paid feature? Privacy on the internet is crucial in these times!", "likes": 6}, "replies": [{"author": "Deacon Blues", "text": "@The Real Witty Huton Thanks...it's my favourite song of all time by my fafourite group of all time!\nIt kinda describes my life as I know it...!", "likes": 0}, {"author": "The Real Witty Huton", "text": "Off topic. Your name is my favorite Steely Dan song.", "likes": 0}, {"author": "Deacon Blues", "text": "@Rider K I understand that... but privacy is a right that eveyone should have on the internet. \nIt should not be something you pay for, especially these days...the nternet is becomming more dangerous and hacks are happening all the time.\nCompanies are exposing more and more of our information without consequences.\nThey idemnify themselves from everything that they may be resposible for.", "likes": 0}, {"author": "Rider K", "text": "That’s exactly why they would make it a paid feature. They gotta make money, so they charge for things that people want. If they charged for something no one wanted, then no one would by it! Lol", "likes": 3}]}, {"topLevelComment": {"author": "Jawwad Rehan", "text": "It is a very informative video and CodePen is really cool thing.", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Rafay", "text": "Can i write code from C or Python or any other languages except HTML, CSS or JS?? Or is it limited to that", "likes": 0}}, {"topLevelComment": {"author": "NatKing1u1z", "text": "I keep getting a 404 error when creating a new file and I'm not able to save and run", "likes": 0}}, {"topLevelComment": {"author": "Allen Amusin", "text": "how did you make the and symbol in the css at time 14:59? When I do shift 7 I get & but the one in the video looks different. My code still works.", "likes": 0}, "replies": [{"author": "Jess Tucker", "text": "I believe it’s just the font of the symbol.", "likes": 0}]}, {"topLevelComment": {"author": "John krawczyk", "text": "Very nice but I'm not approaching it from CodeCamp.  I'd like to see more on the functionality of CodePen rather than a \"Try to get a JavaScript fcn working\" tutorial.  The reason I got a Pro CodePen account is actually to post help requests on StackOverflow.  This way I can just say \"Help, X isn't working: here's my Code\" and people could just fork suggestions to it.", "likes": 1}}, {"topLevelComment": {"author": "LIZXP", "text": "Just wondering how he does that 3:13 type a h2 line then whole code showing up thanks for the reply in advance", "likes": 0}, "replies": [{"author": "Brandon Perreault", "text": "@Chukwuedozie Nwokoye I have autocomplete enabled. But it still isn't working for me!", "likes": 0}, {"author": "Chukwuedozie Nwokoye", "text": "LIZXP Hit the tab button on your keyboard.", "likes": 0}]}, {"topLevelComment": {"author": "Supreme", "text": "Gonna have to start using this thanks for the info !", "likes": 1}}, {"topLevelComment": {"author": "diana odintsov", "text": "Thank you :)", "likes": 0}}, {"topLevelComment": {"author": "chinmay c", "text": "Good introduction and tutorial!", "likes": 0}}, {"topLevelComment": {"author": "Escape Tarkov", "text": "Newbie codepen user, love it!", "likes": 0}}, {"topLevelComment": {"author": "Charl Labuschagné", "text": "Thank you for making this video! It makes a great tool even better!", "likes": 3}}, {"topLevelComment": {"author": "Ty Olopai", "text": "Hi Chris. I'm trying to download ReactJs but when I click on 'settings', I get 'save & close'. It doesn't show the 'add-on' display. I would appreciate your help and time.", "likes": 2}}, {"topLevelComment": {"author": "Dionny Sierra", "text": "Incredible tool! Lots of useful tips! Thanks for posting this video.", "likes": 2}}, {"topLevelComment": {"author": "Budhachandra Yumkhaibam", "text": "your tutorial is 🔥🔥🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "bmansk8", "text": "Great video! and I use codepen all the time and still learned something XD", "likes": 1}}, {"topLevelComment": {"author": "Coding Commanders", "text": "CodePen is awesome 💖", "likes": 2}}, {"topLevelComment": {"author": "Nico Abapo", "text": "Thank you Chris from Philippines :)", "likes": 0}}, {"topLevelComment": {"author": "brian van vlymen", "text": "I glad met you Chris Coyier and their co-workers in Austin, Texas by Meetup.com in 2014 at the same time FCC start-up. :)", "likes": 0}}, {"topLevelComment": {"author": "Kawa Entertainment", "text": "Thank you Chris and freecodecamp", "likes": 0}}, {"topLevelComment": {"author": "Facundo Corradini", "text": "CodePen is one of the best things that ever happened to web development. Only thing missing to me is a little more community interaction, it just feels weird to see pens with 450.000 views, some hundred hearts, dozens of forks... and just 3 or 4 comments.\nI believe a simpler way to post comments will greatly strengthen the community. Maybe all it needs is a comment button right besides the heart one, that would open a modal for a quick comment.", "likes": 85}}, {"topLevelComment": {"author": "Machine", "text": "nice one, love the webapp", "likes": 0}}, {"topLevelComment": {"author": "WhiskeyEchoBravo", "text": "Hello there and greetings from Poland! :)", "likes": 4}}]}