{"video": {"id": "VK-iv4WuXeE", "title": "Becoming a Better Programmer, Without Actually Programming", "description": "One thing important to becoming a better programmer is immersion. Ryan Johnson explains that it is the invisible step to becoming a great developer.\n\nTalk by Ryan Johnson at the OKC# meetup. Thanks to Ryan and Techlahoma for giving us permission to share.\n\nFollow Techlahoma's YouTube channel at: https://www.youtube.com/channel/UCnLf0pfqIpSfKuPZ0e9iiNQ\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT12M11S", "likes": "459", "views": "15293"}, "comments": [{"topLevelComment": {"author": "Unrealist", "text": "Another totally-safe-to-skip video, save yourself 12:10 of your life.", "likes": 1}}, {"topLevelComment": {"author": "Sababa Tamanna", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Siddharth M", "text": "Hats off man!! Giving a talk on something which you're still new to, is a big dare. You have my utmost respect for that. Keep rocking and keep learning. :)", "likes": 1}}, {"topLevelComment": {"author": "Madars Bišs", "text": "1. Exercise, Eat healthy and Sleep well, so you feel energized and your mind is revitalized. \n2. Read, Play Chess, Solve Riddles (Sudoku, Rubik's cube, etc) to train your logic and problem solving skills.", "likes": 8}}, {"topLevelComment": {"author": "Felix C", "text": "This is so inspiring:\n\n\n\n\n\n\nAlexa, play Despacito.", "likes": 1}}, {"topLevelComment": {"author": "E Hayrapetyan", "text": "want to be programmer like CEO freeCodeCamp )", "likes": 1}}, {"topLevelComment": {"author": "Novak", "text": "You are not a programmer if you only do front end. End od story", "likes": 5}, "replies": [{"author": "Wojtek", "text": "@Justin Baugh HTML and CSS are nowadays only a small part of the front end. Not even half of the work. And this drops drastically to about 1/10 of work when you have lot of requirements for the frontend connected with additional logic and you are also writing unit tests for your frontend. You can spend many weeks on front end project not touching css. For example when you are responsible for api and store part of React app or you are tasked to write unit tests for previously untested app or just extend test coverage for existing big app. It once happened to me to work on Typescript OOP application which was using canvas to render things. No HTML and CSS for quite long, but lot of OOP :).", "likes": 0}, {"author": "Diomari M", "text": "Stop drinking your own pee.", "likes": 4}, {"author": "Game_Over", "text": "JavaScript is considered as a front end language and you can do sooooo much with it", "likes": 6}, {"author": "Matheus Felipe", "text": "You need to review your definitions about it. wake up..", "likes": 2}, {"author": "1godlessmonkey", "text": "There's no other statement that will make you look more like an amateur than the one you just typed.", "likes": 19}]}, {"topLevelComment": {"author": "Bruh", "text": "Skinny jeans....oh god i would look like a chicken in them", "likes": 1}}, {"topLevelComment": {"author": "Gabriel Arazas", "text": "I very much agree on learning by immersion. I've heard about this on one of the episode of Syntax podcast and this is what I'm doing right now as an aspiring programmer. Follow some good figures on the industry on Twitter, join some Discord chat groups on programming, and it inspires you to do some more side projects. So yeah, a good refresher.", "likes": 2}}, {"topLevelComment": {"author": "Ryan Hoang", "text": "I want to be a poogrammer", "likes": 4}}, {"topLevelComment": {"author": "Omonota Hustle", "text": "*I want to be a Programmer :-(*", "likes": 9}, "replies": [{"author": "Programmer Wannabe", "text": "That's my name.. :)", "likes": 0}, {"author": "zebnat", "text": "The best traits to be a programmer: Patience, perseverance, self-motivation, humility.\nI tought it was Inteligence, but this is a secondary one, maybe primary if you develop low level stuff with C.", "likes": 1}, {"author": "Sewak Singh", "text": "Come and make team", "likes": 0}, {"author": "The Baylis Code", "text": "Codingphase.com or traversymedia.com", "likes": 1}, {"author": "Darheman Darial", "text": "Be programmer means willing to solve problem, have an attitude of solving problem you can be a programmer.", "likes": 5}]}]}