{"video": {"id": "vmmtFnLt_2Q", "publishedAt": "2018-06-12T16:30:00Z", "title": "Day in the life of a freelance web developer and dad (w/ freelancing tips)", "description": "A freelance web developer and dad shares a day in his life and says that every day is different. He also gives some great freelancing tips.\n\nVideo by Joel Rivera. Joel has his own YouTube channel with developer tips and software tutorials. Check it out: http://youtube.com/PixemWeb\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT11M16S", "likes": "856", "views": "23473"}, "comments": [{"topLevelComment": {"id": "UgyXjkTr1kKDWcha1PN4AaABAg", "publishedAt": "2022-09-06T10:00:12Z", "author": "Raphael Ayorinde", "text": "😊🫠🥰", "likes": 0}}, {"topLevelComment": {"id": "UgzGBEBzHXxhEDKIMbx4AaABAg", "publishedAt": "2020-11-23T07:21:00Z", "author": "D S", "text": "The most important thing which is missing in this video is taking about the money", "likes": 0}}, {"topLevelComment": {"id": "Ugx-3GSOpzq6mPXKiB14AaABAg", "publishedAt": "2020-11-12T17:49:51Z", "author": "David LeDoux", "text": "Great tips, Joel.  Thank you for creating this video.  It is very inspiring.", "likes": 1}}, {"topLevelComment": {"id": "UgzYeqDyWgMT5A6d5EB4AaABAg", "publishedAt": "2020-10-21T18:46:08Z", "author": "BigGoose", "text": "I'm glad the kid was in the video. Gives a better idea of how it really is, haha", "likes": 1}}, {"topLevelComment": {"id": "Ugx8mFx8rstW1nFaxCJ4AaABAg", "publishedAt": "2020-07-14T18:06:56Z", "author": "dreamingfool2", "text": "I wish I could freelance. But California screwed that up this year 😭😡.", "likes": 0}}, {"topLevelComment": {"id": "Ugw8p-O169Ichkdwg4F4AaABAg", "publishedAt": "2020-06-01T02:58:05Z", "author": "J Roshael", "text": "Love this video.  Newly subscribed to your channel Joel.", "likes": 0}}, {"topLevelComment": {"id": "UgwVEHazMobI7milw8Z4AaABAg", "publishedAt": "2020-04-21T08:59:03Z", "author": "Relax and sleep", "text": "Hello Jeol,\nI'm 24 year's old. I'm trying to make a change in my career too. I'm into customer service now but learning HTML and CSS initially. I don't know if I am doing the right thing. I trying my best to learn how to code. I have completed html course from udemy and did a few projects on only HTML. How much time will it take to learn coding and start working. Please answer.🙏", "likes": 1}}, {"topLevelComment": {"id": "Ugxv7QwNmA-P02D93lB4AaABAg", "publishedAt": "2019-12-14T14:39:06Z", "author": "Njajal Game", "text": "very inspiring, hopefully i would catch up with yours in the near future.", "likes": 0}}, {"topLevelComment": {"id": "UgxMahod9bT8W-1g1Ll4AaABAg", "publishedAt": "2019-11-16T06:04:38Z", "author": "ABC dawg", "text": "cute kid :)", "likes": 0}}, {"topLevelComment": {"id": "UgyRQtrnaaXzxn-APV14AaABAg", "publishedAt": "2019-09-23T01:19:19Z", "author": "Ste Ffen", "text": "A real person! On YouTube! My life is complete.\n\nps. we made the right decision. Being there as a dad is important. When we are old, we'll probably not be happy with \"I never saw my children or grandchildren, but hell that suit looked good on me!\" But we will be very happy thinking \"I drove the same old car for 20 years and all my jeans have holes in them, but I saw each and every single one of my children's plays, competitions, shows, fights, tears and laughs\"\n\nWhat do you want to be thinking when you're old?", "likes": 0}}, {"topLevelComment": {"id": "UgwLvOF_LXHPRPz5rlZ4AaABAg", "publishedAt": "2019-06-10T00:47:33Z", "author": "sigmiami", "text": "I’m single with 2 kids so I hear ya", "likes": 0}}, {"topLevelComment": {"id": "UgzCbP37ErSC67H_vL54AaABAg", "publishedAt": "2019-03-05T19:35:44Z", "author": "Hubaib Elahi", "text": "05:07 he is not assistant he is your boss :D", "likes": 0}}, {"topLevelComment": {"id": "UgyNTYXV45MZfOGg7bh4AaABAg", "publishedAt": "2019-02-25T13:16:03Z", "author": "Kamil Bełtowski", "text": "I like the energy this guy has. Thanks for the videos! Inspiring and motivational", "likes": 1}}, {"topLevelComment": {"id": "UgxAnaHZO3EHH6PU6RB4AaABAg", "publishedAt": "2019-02-13T16:53:23Z", "author": "J Powell", "text": "What advice would you give to a single full-time dad doing freelance work, feel like I'm overwhelmed and surviving client to client, between me and my son it's like I don't have enough time to get my brain straight, working but feel like not really moving forward. Watching this video has gave me some tips though thanks.", "likes": 0}}, {"topLevelComment": {"id": "UgzVIIfDYCXSjC-BZ9Z4AaABAg", "publishedAt": "2019-02-07T16:51:26Z", "author": "Cathleen Vadala", "text": "thank you love this it's inspiring I have an IT background and some coding experience and have been studying web dev for 3 months looking forward to freelance web dev now ty ty ty glad to see this positive representation of a day in the life!!!", "likes": 0}, "replies": [{"id": "UgzVIIfDYCXSjC-BZ9Z4AaABAg.8r37zT2fS1D95z0HrI_3sG", "publishedAt": "2020-03-09T09:30:16Z", "author": "Professor Posh", "text": "Are you now a freelancer?", "likes": 0}]}, {"topLevelComment": {"id": "UgyDlQ7bijG5sLKxLEN4AaABAg", "publishedAt": "2019-01-25T21:44:55Z", "author": "Asif Imtiaz Ahmed", "text": "Thank you for this video! it is inspirational!", "likes": 1}}, {"topLevelComment": {"id": "Ugyh8igvvkfPF16-0B14AaABAg", "publishedAt": "2019-01-22T12:16:56Z", "author": "Oppa Paul", "text": "Luv the video. Thanks for sharing! :)", "likes": 0}}, {"topLevelComment": {"id": "UgwH3iI8aIiCDWgtmSB4AaABAg", "publishedAt": "2019-01-21T22:45:52Z", "author": "Alejandro Gonzalez", "text": "Sick", "likes": 0}}, {"topLevelComment": {"id": "Ugxpfm_agOzT-Fbz3up4AaABAg", "publishedAt": "2019-01-18T13:09:05Z", "author": "Fritti Tailchaser", "text": "lol nice video...that little guy is interning at a young age", "likes": 7}}, {"topLevelComment": {"id": "Ugw-8kof29IlGfMPPBJ4AaABAg", "publishedAt": "2018-11-15T20:14:18Z", "author": "Cthuloo X", "text": "Have you tried WP Rig?  If so, what are your thoughts on it.  I use Underscores, but I think I'm going to switch to Wp Rig, because it has a nice basic starter theme, and has what looks like a great build process to go along with it.  It also uses css grids and flexbox out of the box, which I love.", "likes": 0}}, {"topLevelComment": {"id": "UgxVP2vWKGPrHizOqqh4AaABAg", "publishedAt": "2018-10-10T21:22:10Z", "author": "Raider Mack", "text": "At what point did you feel confident to take on your first client/contract", "likes": 0}}, {"topLevelComment": {"id": "UgzlxuV5ZTxM8W0DB8l4AaABAg", "publishedAt": "2018-10-05T16:40:05Z", "author": "Erik Q", "text": "Much respect Joel! A video of your setup would be great for those that want to get some ideas (i.e. me)", "likes": 1}}, {"topLevelComment": {"id": "Ugywg7P6_VaFIe9p6i54AaABAg", "publishedAt": "2018-09-02T08:26:02Z", "author": "runningonthestreets", "text": "This is great. Practical advice. And I like your book collection.", "likes": 0}}, {"topLevelComment": {"id": "UgzSgMc_fJ7fOKFS4jF4AaABAg", "publishedAt": "2018-08-05T11:38:27Z", "author": "DeadMan Experience", "text": "Best dad ever.", "likes": 5}}, {"topLevelComment": {"id": "UgzGOlNr83UxanLRRjt4AaABAg", "publishedAt": "2018-07-31T00:22:25Z", "author": "KingCrashPlays", "text": "It’s probably more common to be a front end developer as a freelancer, but is it possible for a backend programmer to get into freelancing?", "likes": 0}, "replies": [{"id": "UgzGOlNr83UxanLRRjt4AaABAg.8jLYy_beWw_8qaccVp2h4c", "publishedAt": "2019-01-27T05:50:42Z", "author": "thanh vinh nguyen", "text": "KingCrashPLAYZ yep, but I think you have to be really good at it", "likes": 0}]}, {"topLevelComment": {"id": "UgyHqfMf4jwnP9HT6h14AaABAg", "publishedAt": "2018-07-15T00:16:25Z", "author": "Joseph raj", "text": "Awesome video, Thanks for sharing.... Your son is very cute....", "likes": 0}}, {"topLevelComment": {"id": "Ugw5x8J0jr328Fh5Vjx4AaABAg", "publishedAt": "2018-07-03T14:01:58Z", "author": "Harriet Shearsmith", "text": "Loved watching this, thanks for the fab video lovely x", "likes": 0}}, {"topLevelComment": {"id": "UgxRl_qNc6W9WbCxw6t4AaABAg", "publishedAt": "2018-06-29T23:55:22Z", "author": "Soul Scribbler", "text": "I absolutely love this video! Thank you for sharing @PixemWeb! I'm a freelancer, but mostly just starting out, so I'm still getting used to the freelance life, but one thing that really struck me was towards the beginning of this where the work gets done anywhere (and everywhere!). I've worked on the beach, in the car, in the Bellagio in Las Vegas, and so many other places. \n\nAlso, something else that I related to very closely was that schedule. Like I said, I'm still trying to get used to the freelancer life and am still packing way too much into my days. Gotta find balance, especially with the flexibility freelancing brings!\n\nI am wondering, looks like you use visual studio code. Why do you use this one over others? I've recently tried both Atom and Sublime and I love Atom, but I hear a lot of people say there are much better choices out there.\n\nI'm definitely looking forward to checking out your channel! Thanks again.\n\nAlso, adorable kids!", "likes": 1}}, {"topLevelComment": {"id": "UgxF_0I3BDOfX2Hlned4AaABAg", "publishedAt": "2018-06-27T00:02:30Z", "author": "Caleb Hernandez", "text": "Awesome Video", "likes": 0}}, {"topLevelComment": {"id": "UgxKDDojdpBfbgxqaid4AaABAg", "publishedAt": "2018-06-22T08:30:18Z", "author": "Arya N", "text": "You have a great family! Keep up the great work!", "likes": 0}}, {"topLevelComment": {"id": "Ugzj4-gHDmVxsrX4Jqh4AaABAg", "publishedAt": "2018-06-20T14:38:51Z", "author": "Yewande O", "text": "Thanks for sharing!!! Gave me alot of encouragement... Your children are sooo cute especially Gavin!!", "likes": 0}}, {"topLevelComment": {"id": "UgyUtULwbyNHIguqyEp4AaABAg", "publishedAt": "2018-06-13T19:06:35Z", "author": "Sylwester", "text": "best of video \"\"try to give yourself a goal insted of schedule \" nice for you", "likes": 3}, "replies": [{"id": "UgyUtULwbyNHIguqyEp4AaABAg.8hRyTHW3ONr8hqcZvEUTRv", "publishedAt": "2018-06-23T18:15:30Z", "author": "PixemWeb", "text": "Glad it helped.", "likes": 0}, {"id": "UgyUtULwbyNHIguqyEp4AaABAg.8hRyTHW3ONr8hqT-30HEWX", "publishedAt": "2018-06-23T16:43:05Z", "author": "Sylwester", "text": "PixemWeb Hi , i just wanna say thanku you  , i do it to my self and that week was so great becouse that works much better , much eseier", "likes": 1}, {"id": "UgyUtULwbyNHIguqyEp4AaABAg.8hRyTHW3ONr8hSafOVRkEv", "publishedAt": "2018-06-14T00:57:54Z", "author": "PixemWeb", "text": "Thanks, schedules change daily, so instead, I keep goals and try to knock them all out by the end of the day unless it's time specific and needs to get done earlier. The strategy is really about being adaptive and flexible. Being to rigid can cause issues. I do believe in trying to be structured but like Bruce Lee says' \"Be Like Water\" lol.", "likes": 1}]}, {"topLevelComment": {"id": "UgwFkSFPUuqhETrY8hR4AaABAg", "publishedAt": "2018-06-13T12:02:39Z", "author": "Kyle", "text": "What’s the background song?", "likes": 2}, "replies": [{"id": "UgwFkSFPUuqhETrY8hR4AaABAg.8hRCxDMCZDf8hRIBS5ej3R", "publishedAt": "2018-06-13T12:48:24Z", "author": "Kyle", "text": "PixemWeb Thanks mate :)", "likes": 1}, {"id": "UgwFkSFPUuqhETrY8hR4AaABAg.8hRCxDMCZDf8hRHjJweo5L", "publishedAt": "2018-06-13T12:44:26Z", "author": "PixemWeb", "text": "Kyle the song is called Really Really Doe. It’s free on the YouTube Audio Library. Music from the Audio library can be used on YouTube videos.", "likes": 2}]}, {"topLevelComment": {"id": "Ugzvr3iJlLBC52DrWkx4AaABAg", "publishedAt": "2018-06-13T07:41:17Z", "author": "Lampros Chatzinikolaou", "text": "Thanks for sharing this video. It's great to have a look at the life of a freelance web developer working from home. I can really relate, since this is my end goal. To be a freelance web developer working from home. I am in sales, currently, but i study web development with the help of books and the FCC. At 4.22 there is a pic of a pile of books, obviously books you have used in your learning to code journey, couple of them i have myself. I noticed a Network+ book. May i ask. Do you have networks/IT related knowledge? If yes, in what way is it useful in a web developer career generally or in your situation specifically?", "likes": 1}, "replies": [{"id": "Ugzvr3iJlLBC52DrWkx4AaABAg.8hQk2-xV5k_8hRVnr_SunV", "publishedAt": "2018-06-13T14:47:23Z", "author": "PixemWeb", "text": "No problem", "likes": 0}, {"id": "Ugzvr3iJlLBC52DrWkx4AaABAg.8hQk2-xV5k_8hRUM53KGd7", "publishedAt": "2018-06-13T14:34:43Z", "author": "Lampros Chatzinikolaou", "text": "Thanks for the answer.", "likes": 1}, {"id": "Ugzvr3iJlLBC52DrWkx4AaABAg.8hQk2-xV5k_8hRHU0-EC5Z", "publishedAt": "2018-06-13T12:42:12Z", "author": "PixemWeb", "text": "Lampros Chatzinikolaou thanks for watching the video. The Network+ book I ended up getting because I was developing a website for a nonprofit organization and they were having issues with their office network. They asked if I could take a look at what could be the issue. I already had some basic network knowledge from the almighty Google, but since this was larger than my home network, I wanted to fine tune my knowledge. I told them it wasn’t my area of expertise but I’d take a look at it. First I took a physical look at their setup. Lots of computers with wires all over. So I mapped it all out, did some research and over the course of a couple of weeks, got their office network properly wired, updated, secured and running smoothly. A trained technician could have done it in 2 days lol. \n\nSo is this helpful for a web developer? Maybe not, but as a freelancer, you’ll find that you end up picking up a bunch of affinity/related skills. \n\nI’m also the type who tries to learn as much as possible. It’s my curse. Lol. Thanks for watching.", "likes": 3}]}, {"topLevelComment": {"id": "UgybHm8woOqMB4jj2bx4AaABAg", "publishedAt": "2018-06-13T04:36:22Z", "author": "Bucur Ion", "text": "That moment says everything (5:05). I congratulate you on this decision, this change. Greetings from Romania.", "likes": 4}, "replies": [{"id": "UgybHm8woOqMB4jj2bx4AaABAg.8hQPsaQ1qU58hRHy4k4Ppm", "publishedAt": "2018-06-13T12:46:27Z", "author": "PixemWeb", "text": "Bucur Ion Niculae thanks. My family is very important to me. Thanks for watching the video.", "likes": 1}]}, {"topLevelComment": {"id": "UgzZv27Qo9D1LdXjIZh4AaABAg", "publishedAt": "2018-06-12T23:09:07Z", "author": "Nrg", "text": "I want to get into freelancing. I'm currently enrolled in a bootcamp and learning with freecodecamp. I'm enjoying my learning journey.", "likes": 1}, "replies": [{"id": "UgzZv27Qo9D1LdXjIZh4AaABAg.8hPpQl5-rPA8hQ-NfwWwBq", "publishedAt": "2018-06-13T00:44:49Z", "author": "PixemWeb", "text": "Hi Nisarg, That's awesome. Learn as much as you can from both the bootcamp and freeCodeCamp. In your spare time, if you have any, study other people's code and read the documentation pages of the coding language you're learning. The freedom I have to spend time with my family is priceless. Just remember, at first it's tough, don't get discouraged. Just keep on learning and one day, it'll get easier.", "likes": 4}]}, {"topLevelComment": {"id": "Ugwd2MNRA7Y18MhVt814AaABAg", "publishedAt": "2018-06-12T22:50:08Z", "author": "Ragavan Rajan", "text": "How do you feel when you switch your field? I mean a full-time programmer.", "likes": 3}, "replies": [{"id": "Ugwd2MNRA7Y18MhVt814AaABAg.8hPnFiujnvM8hQ4VW6flSM", "publishedAt": "2018-06-13T01:29:34Z", "author": "Ragavan Rajan", "text": "Woww really good to know the tips and the journey you have crossed. Great milestone!! Thank you for sharing", "likes": 3}, {"id": "Ugwd2MNRA7Y18MhVt814AaABAg.8hPnFiujnvM8hPzb5fhXQy", "publishedAt": "2018-06-13T00:38:03Z", "author": "PixemWeb", "text": "The transition was gradual because I was learning and coding while still working in another/completely unrelated field. But I was at a cross roads that required me to decide which path I wanted to go in. I could have continued in the career that would have been my comfort zone where I was making 6 figure money, but that meant I would have to be away from my growing family for large portions of the year which is why I then chose to dabble in local real estate and ultimately decided to go full-time as a freelance web developer. It was a weird time since I was in a transition phase but looking back over the years, I know in my gut that I made the right decision. Granted, it took time to start making real money but I had saved up and went ALL-IN. My biggest recommendation is to make sure to diversify your revenue stream, save up as much as you can, live below your means for a while and never give up.", "likes": 5}]}, {"topLevelComment": {"id": "UgwQhoDL2Jsk2N6-YR14AaABAg", "publishedAt": "2018-06-12T21:54:51Z", "author": "MarcoCoffeeFirst!", "text": "Very nice. Thanks for sharing...", "likes": 1}, "replies": [{"id": "UgwQhoDL2Jsk2N6-YR14AaABAg.8hPgvmD7BXn8hPn8yMo3Vf", "publishedAt": "2018-06-12T22:49:13Z", "author": "PixemWeb", "text": "Thanks. Every freelancer has a different routine. I'm glad I was able to share mine on this channel.", "likes": 0}]}, {"topLevelComment": {"id": "UgxM_P9PuLLgh2kzWnx4AaABAg", "publishedAt": "2018-06-12T17:30:41Z", "author": "Ernest Chan", "text": "Just wonder how you learn web development. Did you take any online courses? Thanks.", "likes": 1}, "replies": [{"id": "UgxM_P9PuLLgh2kzWnx4AaABAg.8hPDh1oTkD68i5fUxika7A", "publishedAt": "2018-06-29T23:48:53Z", "author": "Soul Scribbler", "text": "I think what PixemWeb said is all great advice, but I will add find a high rated, high student count course in what you want to learn on Udemy and buy it during a sale ($10-$15) then go all in on it. Go through the course, do all the work, go through the parts multiple times you don't understand, google your questions, find other free tutorials and go through them, and just immerse yourself into learning. If you have an idea, make it happen. The crazy thing about programming is if it doesn't exist, you can probably make it (with enough knowledge/guidance).\n\nNow, with that said, web development has two main paths. Programming the websites and creating them.  Creating them is much easier to learn as you rely on other peoples code. Usually, something like Wordpress is your base, then you augment that with themes and plugins. On the other hand, programming the websites requires specialize knowledge (there's different languages, you could go with PHP and still use Wordpress as a base and create your own themes/plugins, or you could go Python/Django, or javascript or many others, each with their own pros and cons).\n\nMy advice, if this is something you're interested in, is to start with learning web design with wordpress, along with some basic understanding of HTML, CSS, and Javascript. Then, if you like it enough, go from there.\n\nNo matter what you want to do, just do it and go all in. Honestly, immersion the only way.", "likes": 3}, {"id": "UgxM_P9PuLLgh2kzWnx4AaABAg.8hPDh1oTkD68hPEVM9F23P", "publishedAt": "2018-06-12T17:37:42Z", "author": "PixemWeb", "text": "I learned by reading books, the online documentation pages of the various coding languages, online tutorials from sites like Lynda, TeamTreeHouse, Pluralsight, YouTube. \nFreeCodeCamp wasn't around when I first started learning. They went live, I believe in 2014. But I've followed Quincy Larson for the past few years and think what he's doing is awesome. He's active on Quora where I'm also very active on.", "likes": 4}]}, {"topLevelComment": {"id": "Ugwno3UXf-kcpXkSBAh4AaABAg", "publishedAt": "2018-06-12T17:22:17Z", "author": "Ernest Chan", "text": "Thanks for your video and it is very inspirational to me. I am just like you: father of two kids and working as freelance developer. This path is not easy at all honestly.", "likes": 4}, "replies": [{"id": "Ugwno3UXf-kcpXkSBAh4AaABAg.8hPCjTChTzI8hPEjqBByRQ", "publishedAt": "2018-06-12T17:39:48Z", "author": "PixemWeb", "text": "It's definitely not easy at all. I've made so many mistakes along the way. Most people give up way to soon. But remember, most businesses take years to finally start making money. Freelancing is no different. You have to get really good at marketing.", "likes": 2}]}, {"topLevelComment": {"id": "UgwhAF6MYjVmLf_4x_F4AaABAg", "publishedAt": "2018-06-12T16:55:31Z", "author": "Sebastian Kumlin", "text": "I'd love to hear something about building up a customer base.", "likes": 3}, "replies": [{"id": "UgwhAF6MYjVmLf_4x_F4AaABAg.8hP9fOz4DLL8hQ-r_Ohusq", "publishedAt": "2018-06-13T00:49:02Z", "author": "PixemWeb", "text": "Thanks, I saw the video on this channel about a day in the life as a freelancer and mom and it inspired me to share what my days are like. Beau from freeCodeCamp said I could share the video here so I jumped on it. Thanks for watching it.", "likes": 2}, {"id": "UgwhAF6MYjVmLf_4x_F4AaABAg.8hP9fOz4DLL8hPzl8e4STY", "publishedAt": "2018-06-13T00:39:25Z", "author": "David", "text": "PixemWeb respect for sharing that info with us. You are a good dude.", "likes": 1}, {"id": "UgwhAF6MYjVmLf_4x_F4AaABAg.8hP9fOz4DLL8hPDF1MjWDt", "publishedAt": "2018-06-12T17:26:43Z", "author": "Sebastian Kumlin", "text": "Thank you!", "likes": 1}, {"id": "UgwhAF6MYjVmLf_4x_F4AaABAg.8hP9fOz4DLL8hPBBBw5i8p", "publishedAt": "2018-06-12T17:08:44Z", "author": "PixemWeb", "text": "Hi Sebastian, I'm working on another video that will go into detail on how I get clients, how I got my first clients and how I manage my freelance business. Thanks for watching.", "likes": 2}]}, {"topLevelComment": {"id": "Ugx-x6aZJ97THLQV9FR4AaABAg", "publishedAt": "2018-06-12T16:52:29Z", "author": "Vipul Rawat", "text": "Macbook air 😐", "likes": 2}, "replies": [{"id": "Ugx-x6aZJ97THLQV9FR4AaABAg.8hP9KAnEgi48hPMfOG-lvW", "publishedAt": "2018-06-12T18:49:06Z", "author": "PixemWeb", "text": "Yeah, my Macbook air (4GB's RAM) has no issues running MAMP or Local by Flywheel. I even sometimes edit photos in photoshop but nothing with lots of layers. Just simple edits. For larger projects and tasks, I use my custom built PC which is meant for more ram/cpu/gpu intensive projects.The Air is more of an on the go solution for me.", "likes": 2}, {"id": "Ugx-x6aZJ97THLQV9FR4AaABAg.8hP9KAnEgi48hPF4Q54_Hl", "publishedAt": "2018-06-12T17:42:45Z", "author": "PixemWeb", "text": "I use MAMP but lately I've been using Local By Flywheel. It has built in support for *ngrok* which makes it easy to temporarily share url's from your local server to a client. That way they can give you feedback while still in development.", "likes": 1}, {"id": "Ugx-x6aZJ97THLQV9FR4AaABAg.8hP9KAnEgi48hPERRqbawv", "publishedAt": "2018-06-12T17:37:10Z", "author": "Ernest Chan", "text": "Do you use XAMPP or any web server in your machine? can a machine with 4GB Ram handle it?", "likes": 0}, {"id": "Ugx-x6aZJ97THLQV9FR4AaABAg.8hP9KAnEgi48hPDbUat4bg", "publishedAt": "2018-06-12T17:29:56Z", "author": "PixemWeb", "text": "Yeah, I haven't had any issues coding on my Macbook Air. That's the good thing about web dev, you don't need powerful systems. I only have 4gb's of ram on the Air and it's fine.", "likes": 2}, {"id": "Ugx-x6aZJ97THLQV9FR4AaABAg.8hP9KAnEgi48hPDQDk_qIm", "publishedAt": "2018-06-12T17:28:15Z", "author": "Ernest Chan", "text": "It is not for everyone I think. Someone may prefer bigger screen for coding.", "likes": 0}]}, {"topLevelComment": {"id": "UgxxGPtEu4CrIJnm0614AaABAg", "publishedAt": "2018-06-12T16:35:46Z", "author": "PixemWeb", "text": "Thanks for sharing the video with your audience. Freelancers all have different routines and I'm glad to share mine in the video.", "likes": 52}, "replies": [{"id": "UgxxGPtEu4CrIJnm0614AaABAg.8hP7PkQWAzV92sx7ePyv-r", "publishedAt": "2019-12-23T11:24:18Z", "author": "Super Mario", "text": "Love the edit where you show you attending your childs event! Subbed just for that.", "likes": 0}, {"id": "UgxxGPtEu4CrIJnm0614AaABAg.8hP7PkQWAzV9-u_Gi1mGJP", "publishedAt": "2019-10-10T13:00:07Z", "author": "Ketan Ramteke", "text": "Yes, do you primarily work with PHP?", "likes": 0}, {"id": "UgxxGPtEu4CrIJnm0614AaABAg.8hP7PkQWAzV8qiwlTOKryz", "publishedAt": "2019-01-30T11:20:36Z", "author": "alex dogaru", "text": "Thank you! You gave me the courage to learn!", "likes": 1}]}]}