{"video": {"id": "VPvVD8t02U8", "title": "Flutter Course for Beginners – 37-hour Cross Platform App Development Tutorial", "description": "Learn how to use Flutter in this complete course for beginners. Flutter is an open-source UI software development kit used to create cross-platform applications for iOS, Android, Windows, Mac, and more. \n\n💻 GitHub repo: https://github.com/vandadnp/mynotes-course\n\n✏️ Course developed by Vandad Nahavandipoor. Check out his channel: https://www.youtube.com/channel/UC8NpGP0AOQ0kX9ZRcohiPeQ\n\n🔗 Discord study group (for questions and answers about this course): https://discord.gg/C8UpxJyU4n\n🔗 Setting up Firebase CLI and FlutterFire CLI on Windows: https://www.youtube.com/watch?v=nQ3AhFo2rKc\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00:00) Introduction\n⌨️ (00:02:57) Developer Accounts\n⌨️ (00:39:12) Setup\n⌨️ (01:14:42) Introduction to Dart\n⌨️ (02:01:26) Dart Control Statements and Collections\n⌨️ (02:46:44) Sound Null safety in Dart\n⌨️ (03:27:12) Dart Enumerations, Classes and Objects\n⌨️ (04:18:36) Advanced Dart\n⌨️ (05:00:41) Project Setup\n⌨️ (05:48:30) iOS App Setup\n⌨️ (06:59:32) Android App Setup\n⌨️ (07:31:31) Firebase Backend Setup\n⌨️ (08:01:20) Basic Registration Screen\n⌨️ (09:04:54) Login View\n⌨️ (09:53:10) Separating App Initialization from Login and Register Screens\n⌨️ (10:19:47) Setting up Git and GitHub\n⌨️ (11:10:34) Email Verification View\n⌨️ (11:44:45) Link Between Login and Register Views\n⌨️ (12:18:01) Logout View\n⌨️ (13:13:46) Go From Login to Notes View\n⌨️ (13:36:43) Cleaning Up our Routes\n⌨️ (13:51:17) Error Handling in Login View\n⌨️ (14:16:21) Error Handling in Register View, Next Screen After Registration\n⌨️ (14:44:45) Confirming Identity Before Going to Main UI\n⌨️ (14:52:21) Auth Service\n⌨️ (15:55:22) Migrating to Auth Service\n⌨️ (16:33:41) Unit Testing our AuthService\n⌨️ (17:43:42) CRUD Local Storage\n⌨️ (19:30:57) Working with Streams in Notes Service\n⌨️ (20:04:32) Preparing Notes View to Read All Notes\n⌨️ (20:39:21) Preparing to Create New Notes\n⌨️ (21:00:16) Creating New Notes\n⌨️ (21:35:42) Displaying Notes in Notes View\n⌨️ (21:56:04) Deleting Existing Notes in Notes View\n⌨️ (22:40:46) Updating Existing Notes\n⌨️ (23:14:12) Protecting NotesService with Current User\n⌨️ (23:40:44) Writing Notes to Cloud Firestore\n⌨️ (24:58:08) Migrating to our Firestore Service\n⌨️ (25:22:35) Sharing Notes\n⌨️ (25:37:43) Introduction to Bloc\n⌨️ (26:24:31) Converting our Auth Process to Bloc\n⌨️ (27:31:17) Handling Auth Bloc Exceptions During Login\n⌨️ (28:52:45) Moving to Bloc for Routing and Dialogs\n⌨️ (28:58:23) Loading Screens\n⌨️ (29:48:31) Final Touches Before App Release\n⌨️ (30:43:03) App Icons and App Name\n⌨️ (31:06:34) Splash Screen\n⌨️ (31:56:58) Sending our iOS app to App Store Connect\n⌨️ (32:55:44) Releasing our iOS App\n⌨️ (33:20:31) Fixing Firebase Security Rules and Resubmitting the iOS App\n⌨️ (33:50:07) Releasing our Android App\n⌨️ (34:55:19) Localization in Flutter\n⌨️ (36:33:57) Outro", "duration": "P1DT12H39M22S", "likes": "35135", "views": "1314938"}, "comments": [{"topLevelComment": {"author": "freeCodeCamp.org", "text": "If you enjoy this course, please make sure to give Vandad a follow on his YouTube ( https://www.youtube.com/c/vandadnp ), Twitter ( https://twitter.com/vandadnp ) and LinkedIn ( https://www.linkedin.com/in/vandadnp/ )", "likes": 93}, "replies": [{"author": "Ki Adel", "text": "Thank you very much for your time but, halfway through seems like you are just rambling on yourself.", "likes": 0}, {"author": "Hubert Romario", "text": "I am facing an exception called 'Flutter APPrequiredException'.Please help me to resolve it.", "likes": 0}, {"author": "Ronald Maffei de Lavor", "text": "Aqui estão 4 poderosas orações que você pode rezar pelas almas do purgatório, que precisam muito delas:\n\n1) Oração de Santa Gertrudes\nEterno Pai, Ofereço-Vos o Preciosíssimo Sangue de Vosso Divino Filho Jesus, em união com todas as Missas que hoje são celebradas em todo o mundo; por todas as Santas almas do purgatório, pelos pecadores de todos os lugares, pelos pecadores de toda a Igreja, pelos de minha casa e de meus vizinhos. Amém.\n\n2) Oração para ter um coração misericordioso para com os outros de Santa Faustina.\n\nÓ Jesus, compreendo que a Vossa misericórdia é inexprimível. Por isso Vos suplico: tornai o meu coração tão grande que possa conter as necessidades de todas as almas que vivem na face da terra. Ó Jesus, o meu amor vai além do mundo, estende-se até às almas que sofrem no purgatório; também por elas quero praticar misericórdia através de orações que possuem indulgências. A misericórdia de Deus é sempre insondável e\nInesgotável, como é insondável o próprio Deus. Ainda que eu me valesse das palavras mais veementes para expressar essa misericórdia de Deus, tudo isso nada seria em comparação com o que ela é na realidade. Ó Jesus, fazei o meu coração sensível a cada sofrimento do meu próximo, seja da alma ou do corpo. Ó meu\nJesus, sei que Vós procedeis conosco como nós procedemos com o próximo.\nMeu Jesus, fazei o meu coração semelhante ao Vosso misericordioso Coração. Jesus, ajudai-me a passar pela vida fazendo o\nBem a todos…\nAmém.\nFonte: Diário de Santa Faustina, II, #132\n\n3) Oração do Descanso eterno:\n\nDai-lhes Senhor o descanso eterno.\nE que a luz perpétua os ilumine. Descansem em paz.\nPai Misericordioso eu vos ofereço o sangue precioso de Nosso Senhor Jesus Cristo para alívio das almas sofredoras que ainda padecem no purgatório. Amém.\n\n4) Ladainha pelas almas do Purgatório:\n\nDeus onipotente, Pai de bondade e de misericórdia, tende piedade das benditas almas do purgatório e ajudai a meus queridos pais e antepassados.\n\nJesus meu, misericórdia! Ajudai a meus irmãos e parentes.\n\nJesus meu, misericórdia! Ajudai a todos meus benfeitores espirituais e temporais.\n\nJesus meu, misericórdia! Ajudai aos que tem sido meus amigos e empregados.\n\nJesus meu, misericórdia! Ajudai a quantos devo amar e orar.\n\nJesus meu, misericórdia! Ajudai a quantos tive prejudicado e ferido.\n\nJesus meu, misericórdia! Ajudai aos que tiveram faltado contra mim.\n\nJesus meu, misericórdia! Ajudai aqueles a quem professais predileção.\n\nJesus meu, misericórdia! Ajudai aos que estão mais próximos a união convosco.\n\nJesus meu, misericórdia! Ajudai aos que vos desejam mais ardentemente.\n\nJesus meu, misericórdia! Ajudai aos que sofrem mais.\n\nJesus meu, misericórdia! Ajudai aos que estão mais longe de sua liberação.\n\nJesus meu, misericórdia! Ajudai aos que menos auxílios recebem.\n\nJesus meu, misericórdia! Ajudai aos que mais méritos tem pela Igreja.\n\nJesus meu, misericórdia! Ajudai aos que foram ricos aqui, e ali são os mais pobres.\n\nJesus meu, misericórdia! Ajudai aos poderosos, que agora são como servos.\n\nJesus meu, misericórdia! Ajudai aos cegos que agora reconhecem sua cegueira.\n\nJesus meu, misericórdia! Ajudai aos vaidosos que desperdiçaram seu tempo.\n\nJesus meu, misericórdia! Ajudai aos pobres que não buscaram as riquezas divinas.\n\nJesus meu, misericórdia! Ajudai aos tíbios que muito pouca oração tem feito.\n\nJesus meu, misericórdia! Ajudai aos presunçosos que tem descuidado de tantas obras boas.\n\nJesus meu, misericórdia! Ajudai aos de pouca fé que descuidaram dos Santos Sacramentos.\n\nJesus meu, misericórdia! Ajudai aos reincidentes que apenas por um milagre da graça se tem salvado.\n\nJesus meu, misericórdia! Ajudai aos pais que não vigiaram bem a seus filhos.\n\nJesus meu, misericórdia! Ajudai aos superiores pouco atentos a salvação de seus súditos.\n\nJesus meu, misericórdia! Ajudai aos pobres homens, que quase apenas se preocuparam do dinheiro e do prazer.\n\nJesus meu, misericórdia! Ajudai aos de espírito mundano que não aproveitaram suas riquezas ou talentos para o céu.\n\nJesus meu, misericórdia! Ajudai aos néscios, que viram morrer a tantos não se lembrando de sua própria morte.\n\nJesus meu, misericórdia! Ajudai aos que não dispuseram a tempo de sua casa, estando completamente desprevenidos para a viagem mais importante.\n\nJesus meu, misericórdia! Ajudai aos que julgais mais severamente, quanto mais lhes foi confiado.\n\nJesus meu, misericórdia! Ajudai aos pontífices, reis e príncipes.\n\nJesus meu, misericórdia! Ajudai aos bispos e seus conselheiros.\n\nJesus meu, misericórdia! Ajudai a meus mestres e pastores de almas.\n\nJesus meu, misericórdia! Ajudai aos finados sacerdotes desta diocese.\n\nJesus meu, misericórdia! Ajudai aos sacerdotes e religiosos da Igreja católica.\n\nJesus meu, misericórdia! Ajudai aos defensores da santa fé.\n\nJesus meu, misericórdia! Ajudai aos caídos nos campos de batalha.\n\nJesus meu, misericórdia! Ajudai aos sepultados nos mares.\n\nJesus meu, misericórdia! Ajudai aos mortos repentinamente.\n\nJesus meu, misericórdia! Ajudai aos falecidos sem receber os Santos Sacramentos.\n\nJesus meu, misericórdia! Dai-lhes, Senhor, a todas as almas o descanso eterno.\n\nJesus meu, misericórdia! E fazei brilhar sobre elas vossa eterna luz.\n\nJesus meu, misericórdia! Que em paz descansem.\n\nJesus meu, misericórdia! Amém.", "likes": 0}, {"author": "Chirag", "text": "I cant see any device in flutter : select device ....", "likes": 0}, {"author": "Trishal Mandrik", "text": "@Andrew Martin Thank you 🙃", "likes": 1}]}, {"topLevelComment": {"author": "Mr.Bubble", "text": "Basically 5 hr tutorial streched to 36 hrs", "likes": 0}}, {"topLevelComment": {"author": "Aiden Kim", "text": "10:00:00", "likes": 0}}, {"topLevelComment": {"author": "Aiden Kim", "text": "9:23:50", "likes": 0}}, {"topLevelComment": {"author": "Ahmad Jz", "text": "I just finished this whole course, it took me a lot of time to watch it and I can't imagine how much it took Vandad to prepare this course, many thanks to him for this valuable course.\nI watched many Flutter courses before I started this one, but even though this course helped me a lot and I learned so many things, I don't think this course is for absolute beginners because it contains a lot of advanced topics but on the other hand its a great course for intermediate and advanced topics because the Flutter community lack courses like this.\nit might be a little hard to follow along with him as he make bugs, but it's a great thing to watch someone doing this because you're learning how to find bugs and fix them and this skill is very important to learn as a Programmer because you will make bugs so it's very helpful to watch a professional doing this in front of you and learn that skill along side with him\nThanks for FreeCodeCamp for hosting this course and thanks for Vandad for his great content", "likes": 3}}, {"topLevelComment": {"author": "فادي", "text": "There's a Question guys, Answer me please\n\nWhat is  the flutter version in this video? is version 3.0?\n\nBecause I will start with this course from zero, there's any problem?\nAnd do you have tips?", "likes": 0}, "replies": [{"author": "Sheraz Ali", "text": "It's Flutter 2.8.0 Stable.", "likes": 0}]}, {"topLevelComment": {"author": "A10-53_Akramah Faizi", "text": "https://www.youtube.com/playlist?list=PL6yRaaP0WPkVtoeNIGqILtRAgd3h2CNpT\nThis is the link to Vandad's full playlist which include the introduction he talks about at 8:50.", "likes": 1}}, {"topLevelComment": {"author": "Nazmus", "text": "4:46:01 Generators", "likes": 0}}, {"topLevelComment": {"author": "yap", "text": "FirebaseError: Callers must accept Terms of Service how to fix this??", "likes": 0}}, {"topLevelComment": {"author": "Tarsh Singh", "text": "50:14", "likes": 0}}, {"topLevelComment": {"author": "Legendary Chicken", "text": "Hey I noticed you used FirebaseAuthProvider() instead of AuthenticationService.firebase() in the main.dart file. I thought the reason we created the AuthenticationService class was to avoid direct interaction with Firebase? Otherwise, thanks for the great lecture. It was very easy to follow and understand.", "likes": 1}}, {"topLevelComment": {"author": "Robert Olsen", "text": "I'm on Linux and I wasn't able to get ScrCpy to work. The alternative I found is Vysor and it seems to be working just fine.", "likes": 0}}, {"topLevelComment": {"author": "Harshvardhan Trivedi", "text": "Really learned a lot! Thanks vandad.", "likes": 1}, "replies": [{"author": "Harshvardhan Trivedi", "text": "@Captain America yes, everything is working at the moment", "likes": 1}, {"author": "Captain America", "text": "Is everything working the same still? Or the code is deprecated?", "likes": 0}]}, {"topLevelComment": {"author": "Aiden Kim", "text": "8:48:42", "likes": 0}}, {"topLevelComment": {"author": "Avanti Mandal", "text": "Vandad, the documents in firestore are not in a proper order by timstamp.  I mean, documents are being displayed on the UI/firestore in random order, but they should be in descending order.  How to implement that functionality?", "likes": 0}}, {"topLevelComment": {"author": "Divyaansh Mehta", "text": "I have no idea how people are able to follow this course, watched and learned a lot from various creators including fcc, but this just doesn't work for me. Too many bugs, not Windows friendly, lack of conceptual clarity. ugh. Kudos for the effort though!", "likes": 0}}, {"topLevelComment": {"author": "Victor Emeka", "text": "10 and a half hours in. No, I'm not stopping any time soon.", "likes": 0}}, {"topLevelComment": {"author": "Sudarshan Mane", "text": "At 4 hour, I have never seen anyone explaining classes so clearly, all the concepts getting cleared, take a bow🙌 I took udemy cources for react js, javascript, react native from other famous tutors but no one could clear my doubts, but Vandad explained functions, methods, classes, objects, inheritance everything so perfectly, \nDon’t think twice just go for this course.❤❤❤", "likes": 2}}, {"topLevelComment": {"author": "Hisham Hussein", "text": "Hello there,\nThanks for your time & effort. I have a question please:\nI had VS Code installed but Flutter Doctor asked for VS to be installed instead, so I uninstalled VS Code & installed VS instead.\nBut you use VS Code and your Flutter Doctor never asked for Visual Studio!!! 1:07:52\nDo I need to have both, VS & VS Code, installed?", "likes": 0}}, {"topLevelComment": {"author": "Asad Mehmood", "text": "Good for setting flutter path on catalina\nhttps://www.youtube.com/watch?v=9GuzMsZQUYs", "likes": 0}}, {"topLevelComment": {"author": "Le Weed", "text": "nameTimes20 😂😂 2:20:15", "likes": 0}}, {"topLevelComment": {"author": "Thamsanqa Gumede", "text": "This course should have been  separated into two. One for ios and one for android", "likes": 0}}, {"topLevelComment": {"author": "Seth Moffat", "text": "\"I'll provide a link here\"\nMy brother in Christ, you are the link", "likes": 0}}, {"topLevelComment": {"author": "Amir Tavakoki", "text": "why this guy talks to much?", "likes": 0}}, {"topLevelComment": {"author": "Aiden Kim", "text": "6:56:10\n7:31:00\n7:44:00\n7:51:00\n8:20:00", "likes": 0}}, {"topLevelComment": {"author": "Felipe Vinícius", "text": "0:00", "likes": 0}}, {"topLevelComment": {"author": "Gautam Bedi", "text": "Very nice effort mate. Loved your content", "likes": 2}}, {"topLevelComment": {"author": "RB", "text": "He got me good at \"the goal of this curse\" 😂😂😂", "likes": 0}}, {"topLevelComment": {"author": "sqwrl", "text": "great course,  i have a problem ...\nOn Login email verification, i get the email, i click ok.\nBack to App. I reload, i get this message in terminal:\nW/DynamiteModule( 5018): Local module descriptor class for com.google.android.gms.providerinstaller.dynamite not found.\nI/DynamiteModule( 5018): Considering local module com.google.android.gms.providerinstaller.dynamite:0 and remote module com.google.android.gms.providerinstaller.dynamite:0\nW/ProviderInstaller( 5018): Failed to load providerinstaller module: No acceptable module com.google.android.gms.providerinstaller.dynamite found. Local version is 0 and remote version is 0.\nW/ConnectivityManager.CallbackHandler( 5018): callback not found for CALLBACK_AVAILABLE message\n\nHelp! Thanks", "likes": 0}}, {"topLevelComment": {"author": "Ahmad Taj", "text": "\"do not use buildcontext across async gaps\"   anyone else having this error", "likes": 0}}, {"topLevelComment": {"author": "Priyanshu Dutta", "text": "3:19:22", "likes": 0}}, {"topLevelComment": {"author": "Sukoon Elahi", "text": "7:38:50 updated path but how we can update on Windows is there any solution?", "likes": 0}}, {"topLevelComment": {"author": "Amar Wavare", "text": "Great efforts !!\n👏👏", "likes": 0}}, {"topLevelComment": {"author": "Kaz", "text": "English subs don't seem to work", "likes": 1}}, {"topLevelComment": {"author": "Abdullah Hani", "text": "14:52:22 Chapter 24 - Auth Service Saving for my refrence", "likes": 0}}, {"topLevelComment": {"author": "sakoge", "text": "can i do this without apple developer account?", "likes": 0}}, {"topLevelComment": {"author": "TheClassOf92", "text": "Can I apply for any jobs after learning this course? I have a degree in Computer Science", "likes": 0}}, {"topLevelComment": {"author": "GarZ", "text": "this is a really really rich course , useful and easiest to learn the flutter!", "likes": 2}}, {"topLevelComment": {"author": "mahmud الأسطورة", "text": "thank you\nاكرم عينك", "likes": 0}}, {"topLevelComment": {"author": "Devanshi Tyagi", "text": "Please someone help me out here! is the login and registration page connected or linked with the notes app?", "likes": 0}}, {"topLevelComment": {"author": "Oehmie Oehmie", "text": "We are looking for a Flutter developer who can make a few adjustments to our code. You can think of spelling mistakes, buttons and interfaces. If you are open to this, react to this message.", "likes": 0}}, {"topLevelComment": {"author": "BRSW ", "text": "Now this is a very valuable content!", "likes": 0}}, {"topLevelComment": {"author": "Dink Thifferently", "text": "I was a bit intimidated by the length of this course a few weeks ago, being a total Flutter noob. So instead I went through the Net Ninja courses which are a great intro to the basics. Then that gave me the confidence to read the official docs. Then after that gave me the confidence to build very simple stuff on my own. (VERY simple, haha). Now with some basic real world experience, and confidence, I'm going to tackle this behemoth of a course. 🔥", "likes": 6}}, {"topLevelComment": {"author": "Tadeusz Kurpiel", "text": "time 1:04:34:37 (102877sec) - shouldn't the else-if branch with 'InvalidEmailAuthException' be placed _before_ the branch with 'GenericAuthException' as more specific one?", "likes": 0}}, {"topLevelComment": {"author": "Philip Ihesiulo", "text": "Thank you so much for this course. I just completed it and it is the most comprehensive programming course I have taken on the internet.", "likes": 1}}, {"topLevelComment": {"author": "Evander Mursh", "text": "They only go over signing up as a developer as a company, but is signing up as an individual fine?", "likes": 0}}, {"topLevelComment": {"author": "Samuil Goranov", "text": "So... iOS development is a pain for our wallets and brains even with excellent tools like Flutter. Shame on you Apple.", "likes": 1}}, {"topLevelComment": {"author": "Bharani Kumar", "text": "when i install a another google technology my linux box get more dirty spyware and the main point of providing unique id to application and requirement of google id is to track users and developer too better use community based open source free software language like php python or java as backend web and mysql mariadb as database and front end with html and css is enough even if you need JavaScript avoid Facebook's Reactjs Google's Angular js use non big tech background JS framework like vuejs flutter and firebase is just a Google's spyware that's it", "likes": 0}}, {"topLevelComment": {"author": "Justin Kim", "text": "Beginning now!! Wonder if I will be able to actually finish this course, and if I will, how long it will take", "likes": 0}, "replies": [{"author": "KONDAPALLI KASIVISWANADH", "text": "How much have you completed", "likes": 0}]}, {"topLevelComment": {"author": "rusli Abdul gani", "text": "ios apps development using swift or objective-c please....", "likes": 0}}, {"topLevelComment": {"author": "Alberto Cafueri", "text": "Grazie.", "likes": 0}}, {"topLevelComment": {"author": "Priyanshu Dutta", "text": "2:46:45", "likes": 0}}, {"topLevelComment": {"author": "Joel P.", "text": "Currently at 20hrs. To anyone wondering, it's a very good tutorial. If you are serious about becoming a developer in any respect this can be an extremely helpful video as it teaches alot of concepts from the dead basics to things that are sort of hard to find on your own when learning SDev through tutorials. For beginners: don't worry if you don't get everything the first time around, you aren't meant to. Revisit parts of this tutorial as many times as you need until the concepts are second nature to you. Practice and it'll come to you", "likes": 54}, "replies": [{"author": "El Nino", "text": "Thank you❤", "likes": 0}]}, {"topLevelComment": {"author": "Bismoy Das", "text": "Do we need the Android studio to be installed?", "likes": 0}, "replies": [{"author": "Dink Thifferently", "text": "It's required if you want to use the Android emulator. But for learning, you could skip that and just run your app in a web browser. (assuming the app doesn't need any phone-specific APIs.) The browser will open in landscape orientation, but you can just resize it do it looks more like a phone size.", "likes": 0}, {"author": "byteZorro", "text": "Hello! No, you can use flutter with other IDE, for instance, VSCode. Nevertheless, on their official site, they explain how to configure it. I've also published on my channel a video building an app with flutter and vscode under 30min. Happy coding!", "likes": 0}]}, {"topLevelComment": {"author": "KhayyamAurelius", "text": "I chuckled when he enabled wi-fi and got a billion notifications.", "likes": 0}}, {"topLevelComment": {"author": "Shanen Smith", "text": "I'm happy to see the course, but I need him to get to the point. I'm 26 mins in and all he's said is \"register your dev accounts\", essentially. He's not familiar with the Dun's and tax processes, yet he wants to keep talking about it. No wonder this course is 37 hours long. He talks too much!", "likes": 0}}, {"topLevelComment": {"author": "Rehan Poude", "text": "20:5", "likes": 0}}, {"topLevelComment": {"author": "Grey Techie", "text": "doing this in oct 2022... In a year, I'd be a pro. (maybe)", "likes": 0}}, {"topLevelComment": {"author": "기현근", "text": "한국말로 해주세요", "likes": 0}}, {"topLevelComment": {"author": "Pj", "text": "Where I left off: 10:50:54 git hub ssg keys", "likes": 0}}, {"topLevelComment": {"author": "Matheus Gabriel", "text": "marcador de tempo:", "likes": 0}}, {"topLevelComment": {"author": "Muneeb Shoukat", "text": "01:14:43 Chapter 3 - Introduction to Dart\n01:18:00 Creating a Project", "likes": 2}}, {"topLevelComment": {"author": "spkinguy spkinguy", "text": "can send job request by this course ??", "likes": 0}}, {"topLevelComment": {"author": "Henry Boateng Apenteng", "text": "can i use virtual mac ios apps", "likes": 0}}, {"topLevelComment": {"author": "Biruk Worku", "text": "1:26:32", "likes": 0}}, {"topLevelComment": {"author": "Morse", "text": "To anyone getting the \"type 'Null' is not a subtype of type 'DatabaseNote' error, around 21:29:00\n\nChange \n_note = snapshot.data as DatabaseNote;\n\nto\n_note = snapshot.data as DatabaseNote?;\n\nThe nullable question mark operator is important", "likes": 1}, "replies": [{"author": "Muhammad Harith", "text": "nice no error but the next problem is the inout i out its not showing up, its blank white", "likes": 0}]}, {"topLevelComment": {"author": "Binit Gupta", "text": "2:14:00 BM", "likes": 0}}, {"topLevelComment": {"author": "Suguzz", "text": "7:26:14 - what if this is all just a dream lol", "likes": 0}}, {"topLevelComment": {"author": "Anmol Dixit", "text": "Hello sir, thank you for your superb course. I had couple of questions. 1. Can I develop desktop applications using android studio & flutter ? 2. (I know it's a silly question ) What is the difference between flutter and android studio and vs code ?", "likes": 0}, "replies": [{"author": "Andrew Tobias", "text": "@AnmolDixit 1> Yes very well 2> Flutter is an SDK or software development kit that is useful for creating applications.But Android Studio and VSCode are editors that help use SDK to achieve tasks.", "likes": 0}]}, {"topLevelComment": {"author": "Maan Academy - ফ্রি ফ্রিল্যান্সিং শিখুন", "text": "Very nice explanation", "likes": 0}}, {"topLevelComment": {"author": "Vivek Thazhathattil", "text": "An easy way of remembering null aware assignment operator is to think of it like any other operator. In some languages we can write a = a + b as a+= b, a = a * b as a  *= b and so on. Similarly we're writing a = a ?? b as a ??= b. If a is null, pick b.That's all there is to it.", "likes": 0}}, {"topLevelComment": {"author": "Steff Dimitrov", "text": "Why this guy is testing the mock class? He must test the service with passing mock object instead of real provider.", "likes": 0}}, {"topLevelComment": {"author": "Yunus Emre Hançer", "text": "if someone has an error at https://youtu.be/VPvVD8t02U8?t=40829 - 11.20.29, i fixed that with these:\nIn main.dart, starting from 38 line, use this for now\n\nFuture.delayed(Duration.zero, (() {\r\n                  Navigator.push(\r\n                      context,\r\n                      MaterialPageRoute(\r\n                        builder: (context) => const VerifyEmailView(),\r\n                      ));\r\n                }));.", "likes": 2}}, {"topLevelComment": {"author": "Parselmouth 🐍", "text": "What the hell is he doing in the star 1 hour and 30 mints i use window OS what should i do now", "likes": 0}}, {"topLevelComment": {"author": "Joel P.", "text": "Amazing tutorial. Very helpful and information filled and is approached in one of the best presentations I have seen . That being that errors and different levels of development is displayed and then compared to show beginners best practices. This should be how all lecturers or tutorial creator should approach teaching dev in general", "likes": 1}, "replies": [{"author": "Joel P.", "text": "25:18:00", "likes": 0}]}, {"topLevelComment": {"author": "M.Bashar", "text": "Plz make channel in urdu", "likes": 0}}, {"topLevelComment": {"author": "Johh Lu", "text": "Some of the topics are vague. Don't dive to deep.", "likes": 0}}, {"topLevelComment": {"author": "Afriedi Hasan Morad", "text": "He looks like Canadian president", "likes": 0}}, {"topLevelComment": {"author": "OneShotOneKill", "text": "How are we supposed to handle optional data inside auth_user model inside auth service?", "likes": 0}}, {"topLevelComment": {"author": "Marco Caraballo", "text": "1:14 17", "likes": 0}}, {"topLevelComment": {"author": "Prajwal Maharjan", "text": "Is this course too messy or its going out of my head?", "likes": 0}, "replies": [{"author": "Tấn Thọ Huỳnh", "text": "IMO it's not suitable for pure and total beginners, especially if you have no or minimal programming background", "likes": 0}]}, {"topLevelComment": {"author": "Dominik", "text": "If you're not receiving your email verification, try checking your Spam folder.", "likes": 1}}, {"topLevelComment": {"author": "The Grit", "text": "This must have taken you SO much time to put together.  Thank you.  It's a very helpful introduction indeed.  Greatly appreciated.", "likes": 18}}, {"topLevelComment": {"author": "Matt Booth", "text": "\"I just hit myself with my own finger.\"", "likes": 1}}, {"topLevelComment": {"author": "grinwa", "text": "Damn man this channel is an absolute gold mine\nThank you so much", "likes": 0}}, {"topLevelComment": {"author": "Micaela Scanlon", "text": "what is the application..? is there a section where they say what the application actually is before going into all the complicated stuff?", "likes": 0}, "replies": [{"author": "Joel P.", "text": "There is a github repo attached in the comments where you can see everything", "likes": 0}]}, {"topLevelComment": {"author": "Tadeusz Kurpiel", "text": "In the \"Developer Accounts\" section you didn't mention one important issue:  Google wants you to pay $25  to activate your dev account\n(I presume Apple wants you to pay them some money either, but I haven't checked that on my own)", "likes": 0}}, {"topLevelComment": {"author": "LOUAY", "text": "2:30:02", "likes": 0}}, {"topLevelComment": {"author": "mEtAlMaNiAc787", "text": "18:33 im getting an error when trying to add text and is synced with cloud says variables must be declared.", "likes": 0}}, {"topLevelComment": {"author": "Youramon", "text": "Some important bookmarks for me: \n02:22:00 lists\n9:30:00 try/catch\n10:47:06 cryptt-cryptograp-crypt\n11:00:30 important github commands\n11:50:00 Navigator.of explained\n13:25:00 pushNamedAndRemoveUntil explained", "likes": 6}}, {"topLevelComment": {"author": "Lokendra Parihar", "text": "Flutter docter cmd prompting to install visual studio to me in windows environment. but, i just wanna develop for android. should I need to install visual studio, I hope flutter should work without it.", "likes": 1}, "replies": [{"author": "Lokendra Parihar", "text": "thanks Mahesh, but i am asking about visual studio.", "likes": 0}, {"author": "Diganta Datta", "text": "yes you can even in VS CODE there is a flutter and dart plugin so no need to install android studio too or git", "likes": 0}]}, {"topLevelComment": {"author": "Olakeyz", "text": "Good", "likes": 0}}, {"topLevelComment": {"author": "SoWhyMongolia", "text": "20:40:09 Vandad, you're the man. I'm learning so much. Pretty much going in blind and not knowing a lot. I've tried coding at different times but never really had an in-depth study like this. Learning so much! Thank you, Vandad and FCC!", "likes": 0}}, {"topLevelComment": {"author": "Towhid Islam", "text": "Thanks Vandad….you r awesome mate 👍😀", "likes": 0}}, {"topLevelComment": {"author": "Towhid Islam", "text": "Thanks Vandad….you r awesome mate 👍😀", "likes": 0}}, {"topLevelComment": {"author": "مُنى القَحطاني", "text": "the downloading speed 😟!", "likes": 0}}, {"topLevelComment": {"author": "ho disperatilor", "text": "2:10:20", "likes": 0}}, {"topLevelComment": {"author": "Hussain Khuzema", "text": "Flutter course completed truly awesome course about flutter + backend development also love Vandad. will surely watch his channel for more flutter stuff", "likes": 1}}, {"topLevelComment": {"author": "Abdul Rafey", "text": "How your vsCode is giving suggestions right in front of each line in your code? This feature  doesn't  work on my vsCode.", "likes": 0}}, {"topLevelComment": {"author": "sathish R", "text": "lot of analyses and searches this is best for ever at the end of searching i choose this to learn from start hats off those who put effort for this ....", "likes": 0}}, {"topLevelComment": {"author": "Apoorav Khanduri", "text": "thanks for course", "likes": 0}}, {"topLevelComment": {"author": "تعّلم كل شيء", "text": "If you are not a SOFTWARE DEVELOPER.\nok don't rub it in.\n\nThank you.", "likes": 0}}, {"topLevelComment": {"author": "Abhay Patil", "text": "i am thinking of following this course in my next semester. Please do drop some reviews/opinions about it as I want my career in android development field.", "likes": 0}, "replies": [{"author": "⁺①③①⑧③⓪③⑥⑦①⑧ whatsap", "text": "Helpline📲📥⬆️\nQuestions can come in⬆️", "likes": 0}]}, {"topLevelComment": {"author": "jokesit", "text": "Thank you FreeCodeCamp and Vandad so much for amazing course , this course is very helpful and is the one of best course for me.", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "1:11:00", "likes": 0}, "replies": [{"author": "Austin Holotik", "text": "1:22:00", "likes": 0}, {"author": "Austin Holotik", "text": "1:23:00", "likes": 0}, {"author": "Austin Holotik", "text": "1:20:00", "likes": 0}, {"author": "Austin Holotik", "text": "1:19:00", "likes": 0}, {"author": "Austin Holotik", "text": "1:18:00", "likes": 0}]}, {"topLevelComment": {"author": "Austin Holotik", "text": "1:03:00", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "53:00", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "51:00", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "50:00", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "1:00:00", "likes": 0}}, {"topLevelComment": {"author": "Austin Holotik", "text": "59:00", "likes": 1}}, {"topLevelComment": {"author": "Austin Holotik", "text": "55:24", "likes": 0}, "replies": [{"author": "Austin Holotik", "text": "1:20:00", "likes": 0}]}, {"topLevelComment": {"author": "DEATH GOD", "text": "Is this the complete course?", "likes": 0}}, {"topLevelComment": {"author": "ACHV PEAK", "text": "When testing the auth changes around the 16:29:10 mark my terminal shows the auth exceptions but the emulator still processes the information. For instance I enter an invalid email in the register view and when I press register the app go to the verifyEmailView, the auth exception is shown in the terminal, and forbade tries to create a user. No error dialog is shown either. What am I missing here?", "likes": 0}}, {"topLevelComment": {"author": "VladOnYoutube", "text": "What if I don't have IOS Emulator available in VS Code? Not finding solution so far on google.", "likes": 0}}, {"topLevelComment": {"author": "KoBruh", "text": "Dont waste your time for theese just learn it by reading, Try tı understand papers and documents.", "likes": 0}, "replies": [{"author": "Tristan Stier", "text": "no", "likes": 1}]}, {"topLevelComment": {"author": "harish Harish", "text": "Does this tutorial teaches us on how to develop an app in windows?", "likes": 1}}, {"topLevelComment": {"author": "Tojitosegypt Tojitosegypt", "text": "heheh i spent almost 30 hours in the first 10 hours,  made around 18 mistakes and i am just copying off your screen xD \ni am basically learning patience not programming", "likes": 0}, "replies": [{"author": "Joel P.", "text": "That's a large part of programming lol", "likes": 0}]}, {"topLevelComment": {"author": "Nir Upadhyay", "text": "1:43:10 const is variable which value is not gonna be change like pi value 3.14, while Final variable value can change at run time. \nIn const variable we've to define value, while for Final variable we don't have to define value on compile time. \nIn sort const variable value is unchangeable and Final variable value is changeable at runtime. #fluttercommunity #loveflutter", "likes": 0}}, {"topLevelComment": {"author": "אמויה סטודיו - בקרה", "text": "Amazing, great thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Ilyas Mukatdisov", "text": "19:22:40 why we need Database not in parameters? I think note's id is better to use than grabbing all class", "likes": 0}}, {"topLevelComment": {"author": "Elan", "text": "I'm a complete beginner and i'm going to start this course today. Goodluck to myself.", "likes": 1}}, {"topLevelComment": {"author": "Jacob Wagner", "text": "Circa 6:41:00 you discuss manually signing the certs and profiles in Xcode instead of allowing it to do the automatic signing. What is the benefit to this? Or the drawback to using the automatic signing? Thank you in advance to anyone who can shed some light for me.", "likes": 0}}, {"topLevelComment": {"author": "Rengkat Alexander", "text": "FreeCodeCamp is supposed to be called Free Code University. The knowledge I've gain here is more than what I gain in my four years in the university", "likes": 1}}, {"topLevelComment": {"author": "Diogo Semedo", "text": "Hi ! I have have a question, at 19:57:06 why do you update cache at updateNote() method ? The method getNote() already updates the cache, so I think that is unnecessary logic.", "likes": 0}}, {"topLevelComment": {"author": "Assassin Gamer", "text": "can anyone tell the extensions he is using? forexample error lens does not show inline errors similar to him when using vscode.", "likes": 0}, "replies": [{"author": "Joel P.", "text": "It's error lens if it still doesn't work for you, try using errorLens.toggle in to your settings", "likes": 0}]}, {"topLevelComment": {"author": "Wizardly Woosh", "text": "i didnt enjoy it", "likes": 0}}, {"topLevelComment": {"author": "Samuel Ferrer", "text": "Suibclassing refers to the postulate that if B is a subclass of A, then all the instances of B are also instances of A, but not all the instances of A can be considered instances of B. \"Sub\" is meant in the sense of set theory.", "likes": 1}}, {"topLevelComment": {"author": "Road To Free Life", "text": "3:00:00", "likes": 0}}, {"topLevelComment": {"author": "MD Habibullah", "text": "Today Complete from 9:53:00 to 11:30:00", "likes": 1}}, {"topLevelComment": {"author": "Aleksandar Vasic", "text": "Im at 0:0:40 - so right at the beginning of this course - and I have a question: So why do I exactly need a mac to release an app for iOS? I mean an app, made on flutter, works on iOS and Android. Cant i just use an iOS Emulator, which would show me my app in an iOS environment? So I would only work on windows and then run my apps on Android and iOS emulators to see how they work... am I missing something?", "likes": 1}, "replies": [{"author": "Joel P.", "text": "@MrFujinko way unneeded", "likes": 0}, {"author": "Aleksandar Vasic", "text": "@MrFujinko calm down kid", "likes": 1}, {"author": "MrFujinko", "text": "yes, you are missing a mac computer. now shut up and pay up, it's apple not the soviet union", "likes": 0}]}, {"topLevelComment": {"author": "عبدالرحمن بن محمد", "text": "Hi vandad, i am a fan of your brother vandam send my regards for your family.", "likes": 0}}, {"topLevelComment": {"author": "RUSS", "text": "Omg 😲,  look at the video length,  almost two continues days long.", "likes": 0}}, {"topLevelComment": {"author": "Akshay Gupta", "text": "completed in 1:37 min", "likes": 0}}, {"topLevelComment": {"author": "Youssef DEV", "text": "error: Ignoring header X-Firebase-Locale because its value was null", "likes": 0}}, {"topLevelComment": {"author": "Mustafa Emir PEKER", "text": "Can't add any user or note to my local database. can someone help ? my code is same with vandad's.", "likes": 0}}, {"topLevelComment": {"author": "Aman Kumar Shukla", "text": "There is a small correction at 21:29:23 in line number 89\nThe code should be\n_note = snapshot. data as Database?;\nPS:- So basically only change is the '?' that is added after the Database", "likes": 2}, "replies": [{"author": "Morse", "text": "Thank you so much for this. I was at my wit's end, seeing the \"type 'null' is not a subtype of type 'DatabaseNote' error. Thanks for pointing this out", "likes": 0}]}, {"topLevelComment": {"author": "KAVOSHGAR", "text": "Great instructor and great video", "likes": 0}}, {"topLevelComment": {"author": "Brothers Technical", "text": "did anyone completed this full course?", "likes": 0}}, {"topLevelComment": {"author": "Elias Avelino", "text": "When I saw the video length I did a double take, thumbs up if you agree!", "likes": 0}}, {"topLevelComment": {"author": "Diraj Naik", "text": "2:29:06", "likes": 0}}, {"topLevelComment": {"author": "Soundbuds™", "text": "Its unbelievable how many times I got stuck in installation. I'm now ripping my hair out because my code . thing wont work and I cant see the option to install it when I open up ctrl+shft+p. It's literally taken me 4 hours to get here. And I'm stuck before I can even create a project file? Is this normal??", "likes": 1}, "replies": [{"author": "Joel P.", "text": "Totally normal. Took me about 6 to finally get everything running and i had already made some emulators before", "likes": 0}]}, {"topLevelComment": {"author": "BillenMedia", "text": "Can I start with personal account and upgrade it to company or organization later?", "likes": 0}}, {"topLevelComment": {"author": "BoGhost", "text": "does someone may send the link to the introduction please", "likes": 0}}, {"topLevelComment": {"author": "MusicCity XO", "text": "Amazing Tutorial", "likes": 0}}, {"topLevelComment": {"author": "Fernando Padilla", "text": "bruh please edit this video, half of it are pure \"eeemmm\"s", "likes": 0}}, {"topLevelComment": {"author": "Vishwas IT Professional", "text": "Awesome thanks 😊", "likes": 0}}, {"topLevelComment": {"author": "Moche Llalle", "text": "It does not have subtitles in Spanish, :(", "likes": 0}}, {"topLevelComment": {"author": "Sajal", "text": "does not work on m1 Mac, quitting course after fighting the cocoa pods for 10 hours", "likes": 0}}, {"topLevelComment": {"author": "Beren G", "text": "53.07", "likes": 0}}, {"topLevelComment": {"author": "KAVOSHGAR", "text": "Great video! Thanks freeCodeCamp and Vandad", "likes": 0}}, {"topLevelComment": {"author": "Neu Zen", "text": "The only problem with this course is that it is too short.", "likes": 1}}, {"topLevelComment": {"author": "Yo_Abdou", "text": "i liked this course but from hour 8:30 that is not a beginners stage", "likes": 0}}, {"topLevelComment": {"author": "Hubert Romario", "text": "I am facing an exception called 'Flutter APPrequiredException'.Please help me to resolve it.", "likes": 0}}, {"topLevelComment": {"author": "Coding Town", "text": "Hey Guys  If Anyone interested to Learn Flutter & Dart Basics and want to build Solid foundation on Fundamentals of Programming watch this Course that i have Created Specifically for Beginners! & Please support the channel\n\n[https://www.youtube.com/watch?v=u4jJt4zM7cA](https://www.youtube.com/watch?v=u4jJt4zM7cA&fbclid=IwAR1iZqtJHA4lri-zi5mRzhzXcEcFw9eo_MdXrg5lX5yNexaZxit2shqyRaA)", "likes": 0}}, {"topLevelComment": {"author": "app dev", "text": "please can someone answear my question : is it the same thing if i create a project with CDM or with vscode by ctrl+shift+P ? if yeah why many devs use CDM when it take so much time then cntrl+shift+p", "likes": 0}, "replies": [{"author": "Joel P.", "text": "VScode has an integrated terminal. It's used for a lot more than just starting up apps so a lot of devs usually use that because it's usually already open or will be needed for more later.", "likes": 0}]}, {"topLevelComment": {"author": "Denish AD", "text": "Shssssssssss!!!! Sound is so boring 🤮🤮🤮", "likes": 0}}, {"topLevelComment": {"author": "Real Islamic tube", "text": "that is osm also i learna lot from this one .I am very thankful to you", "likes": 0}}, {"topLevelComment": {"author": "Prathap Karumanchi", "text": "The label on the left hand corner is very distracting", "likes": 0}}, {"topLevelComment": {"author": "Safa Safari", "text": "7:56:40\nI'm an android reverse engineer\nextracting the firebase API key and appid is so easy\nand I think it's no problem to share that\nbecause it does not have any admin rights to that application\njust using it for sending logs, receiving notifications, etc.", "likes": 0}}, {"topLevelComment": {"author": "shareCodeCamp", "text": "What an amazing content! We appreciate about your efforts! ❤❤🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "Coding", "text": "ctrl + shift + p\n1:37:50", "likes": 0}}, {"topLevelComment": {"author": "Nikunj Jayas", "text": "Career and future", "likes": 0}}, {"topLevelComment": {"author": "Harry Dadson", "text": "FreeCodeCamp is a channel sent from heaven. Vandad literally taught SWE, WebApp, and Mobile Dev all in one 36hr video and I'm very appreciative. God Bless", "likes": 3}}, {"topLevelComment": {"author": "Ayush Muley", "text": "World's best flutter course", "likes": 0}}, {"topLevelComment": {"author": "Jens Tofte", "text": "Cool video and very educational. I made a tutorial series about one of these solutions and Flutter if you guys wanna learn how it works. https://youtu.be/mi5m2MwyhBA", "likes": 0}}, {"topLevelComment": {"author": "hubert romario", "text": "Is scrcpy is needed or we can use android studio as an alternative?", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Basher", "text": "Sheeesh this video is longer than my whole life", "likes": 0}}, {"topLevelComment": {"author": "Amit Prakash", "text": "Your teaching speed is really nice for a beginner. I am enjoying it.", "likes": 0}}, {"topLevelComment": {"author": "Collin Tan", "text": "Sir, while I appreciate your noble effort to teach the world something valuable, at least for the first 30mins, you can cut 99% of whatever you said which are irrelevant to Hybrid App Dev.", "likes": 3}}, {"topLevelComment": {"author": "Курманжан Мухтарова", "text": "I have finished frontend bootcamp (js, react) but css part is so boring for me. Who works with flutter?", "likes": 0}}, {"topLevelComment": {"author": "Niels-Christian Nygaard", "text": "So a friend and I have this business idea, which we have worked on for some time now and the only step left is to develop the app, but we have no experience what so ever in coding and developing it. We have decided to spent a week on getting to learn bits of it and then decide on if we do it ourselves or outsource it. This course seems promising!", "likes": 0}, "replies": [{"author": "AverageAtheist", "text": "Was it helpful?", "likes": 0}]}, {"topLevelComment": {"author": "fruit loops", "text": "", "likes": 0}}, {"topLevelComment": {"author": "mEtAlMaNiAc787", "text": "had no idea what brew and vim and alll that other stuff was :( now im stuck on adding flutter fire i don't know how to add the path thing.", "likes": 0}}, {"topLevelComment": {"author": "frankinthewoods", "text": "I am getting the following error when trying add the firebase_core dependency :\n\"Because firebase_core >=0.1.0 requires Flutter SDK version >=0.1.4 and firebase_core <0.1.0 requires SDK version >=1.8.0 <2.0.0, firebase_core is forbidden.\"\nNot sure about next steps, any help is appreciated.", "likes": 0}, "replies": [{"author": "frankinthewoods", "text": "Update: Re-installing the flutter SDK resolved the issue, in case anyone runs into this.", "likes": 0}]}, {"topLevelComment": {"author": "胡天蘭", "text": "8:59:39\nlearning log:\n\n由一個字詞以上組成變數名稱時，建議可用「Camel Case駝峰式命名規則」，每個單字第一個字大寫，讓變數名高低起伏增加可讀性。\n其中，每個單字第一字母都大寫，稱為「大駝峰upper camel case」，FirstName；或第一單字小寫其餘大小，稱為「小駝峰lower camel case」，firstName\n\nhot reload : flutter存檔時，只針對有改動的部分執行一次", "likes": 2}}, {"topLevelComment": {"author": "Orrin Anderson", "text": "Is there a way to get past the age restrictions for developer accounts? I am not yet 18, which means that I cannot set up a developer account for either Apple or Google.", "likes": 0}}, {"topLevelComment": {"author": "Jarek Lin", "text": "hey guys, how to prompt the problems after the error code instead of problems window below", "likes": 0}}, {"topLevelComment": {"author": "Pr Ammar", "text": "I promise that once I start working I will donate for you guys, it's unbelievable how  much I learned from your YouTube channel and from your website, thank you.", "likes": 14}}, {"topLevelComment": {"author": "Nogard", "text": "06:00 yeah, this is very interesting.", "likes": 0}}, {"topLevelComment": {"author": "HeartCoder", "text": "It's both a gift from heaven, and a hell to complete as for a beginner", "likes": 0}, "replies": [{"author": "lleenna", "text": "@HeartCoder thank you! I really appreciate your advice", "likes": 1}, {"author": "HeartCoder", "text": "​@lleenna If you ask me, I wouldn't recommend this course for beginners, as it may be discouraging. I finished the 17 first hours for the authentication screen, and in the end, its doesn't even look good. It depends what skill you want to acquire, but I would suggest to follow some speed coding UI challenge. Follow the instructions and in the end you'll have beautiful screens. Once it becomes second nature, you can come back here and learn about Firebase, local storage, publishing Apps on Apple/Google stores... Good luck because all in all it's very demanding.", "likes": 0}, {"author": "lleenna", "text": "Hi! May I ask u if the course is beneficial for the beginners (who have the only basics of programming) ?", "likes": 0}]}, {"topLevelComment": {"author": "Shehan Bartholomeusz", "text": "Can you share the notes which you've been writing through out the course??", "likes": 0}}, {"topLevelComment": {"author": "Haruta Dorin", "text": "What in god's name ?????😂😂😂😂", "likes": 0}}, {"topLevelComment": {"author": "mobin aghashahi", "text": "من سی و هفت ساعت واسه بابام حرف نزدم که شما زدی. دمت خیلی گرمه بزرگوار", "likes": 0}}, {"topLevelComment": {"author": "Hasan Sib", "text": "May I please know the name of the extensions that guides you in red color while you're writing your code ??", "likes": 0}}, {"topLevelComment": {"author": "Qwerty Qwerty", "text": "Hello, I have been following this course and everything was going great. Until I encountered an error which is as follows:\nafter completing login and register view when we click the button to send verification email to the user, I'm not receiving the verification email, instead I'm getting the following error...\n\n/flutter ( 9646): <asynchronous suspension>\n/flutter ( 9646):\n/System  ( 9646): Ignoring header X-Firebase-Locale because its value was null.\n\nI have searched the internet but can't seem to find a solution for this. If somebody has encountered the same issue and has resolve it, please reply to this comment and guide me through. Thankyou in advance.", "likes": 1}}, {"topLevelComment": {"author": "Laid To Rest", "text": "Guys im on linux (ubuntu 22.04 LTS) and the Ctrl + dot in Vscode is not working for me. I will appreciate your help very much.", "likes": 0}, "replies": [{"author": "Pranjal Kumar", "text": "Try reinstalling VS Code, there will be a option to check for that feature, & make sure environment variables are set", "likes": 0}]}, {"topLevelComment": {"author": "GADGETS GUIDE", "text": "We want 40 hours full advance kotlin course", "likes": 0}}, {"topLevelComment": {"author": "Isxaaq Academy", "text": "Am I the only one who is stuck in the installation for two months?!\nFlutter doctor command does not work for me, my connection is good, I deleted the cache file in the bin folder, but it stucks at the pub updating, I tried many solutions, but unfortunately they didn't work.", "likes": 1}, "replies": [{"author": "Mo Invest", "text": "use linux", "likes": 0}]}, {"topLevelComment": {"author": "payaah", "text": "chapter 28: isn't it redundant to refresh the stream in updateNote when its going got happen again in getNote? lib/services/crud/notes_service.dart", "likes": 0}}, {"topLevelComment": {"author": "Gnen", "text": "Legend!! Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Ayush Khandelwal", "text": "Amazing Course, Day 2 - I am at chapter 7 rn i.e 4:18:38", "likes": 0}}, {"topLevelComment": {"author": "Kamal Prasad", "text": "1:12:39:21", "likes": 0}}, {"topLevelComment": {"author": "sina estiak", "text": "This, sit back and have more like a conversation than a rigid tutorial type thingy about the matter in hand which is called FLUTTER , \nI LIKE IT ... I'M Loving IT...", "likes": 0}}, {"topLevelComment": {"author": "kenan 238", "text": "Includes sleep deprivation", "likes": 1}}, {"topLevelComment": {"author": "michh", "text": "What an effort! Thank you.", "likes": 0}}, {"topLevelComment": {"author": "jordan o'donoghue", "text": "cough again", "likes": 0}}, {"topLevelComment": {"author": "Syed Sohail", "text": "i found this channel he is explaining about the concepts of coding in unique way \nhttps://www.youtube.com/watch?v=7Rqm8jiiZVc", "likes": 0}}, {"topLevelComment": {"author": "Abhijeet Singh Chauhan", "text": "Thanks dad", "likes": 0}}, {"topLevelComment": {"author": "So Sovanrotha", "text": "Firebase did not send me a verification email, even though `sendEmailVerification` method is completed without any exceptions.", "likes": 1}, "replies": [{"author": "Faizan Ahmad", "text": "@Qwerty Qwerty did you check spam", "likes": 0}, {"author": "Qwerty Qwerty", "text": "I'm getting this error at this step and not getting any email. Please help me\n\nflutter ( 9646): <asynchronous suspension>\r\n/flutter ( 9646):\r\n/System  ( 9646): Ignoring header X-Firebase-Locale because its value was null.", "likes": 0}, {"author": "So Sovanrotha", "text": "@Faizan Ahmad holy cow, it's actually there, thanks!", "likes": 2}, {"author": "Faizan Ahmad", "text": "check your spam folder in Gmail", "likes": 1}]}, {"topLevelComment": {"author": "wearesergei", "text": "4:13:07", "likes": 0}}, {"topLevelComment": {"author": "Arti Patil", "text": "How can we added colour gradient for status bar in flutter", "likes": 0}}, {"topLevelComment": {"author": "Manraj Mann", "text": "great details 😇", "likes": 0}}, {"topLevelComment": {"author": "Me And GF", "text": "Nice work thank you", "likes": 0}}, {"topLevelComment": {"author": "wearesergei", "text": "3:22:08", "likes": 0}}, {"topLevelComment": {"author": "sarvagya rastogi", "text": "1:03:19", "likes": 0}}, {"topLevelComment": {"author": "WORKSPACE", "text": "I love this course. Thanks for the value menn", "likes": 1}}, {"topLevelComment": {"author": "So Sovanrotha", "text": "Man explained the entire Software Engineering field in one video.", "likes": 24}}, {"topLevelComment": {"author": "欧阳楚", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Attaf R", "text": "Scrcpy actually stand for screen copy", "likes": 0}}, {"topLevelComment": {"author": "max_ishere", "text": "Dude, your chapters cover up the commands you're typing", "likes": 0}}, {"topLevelComment": {"author": "Zleep", "text": "Simply subarashii ☺️☺️☺️", "likes": 0}}, {"topLevelComment": {"author": "max_ishere", "text": "OH MY GOD I THINK IM GONNA DIE OF BOREDOM RN. Wait I think I'm in tutorial hell rn lol.", "likes": 0}}, {"topLevelComment": {"author": "max_ishere", "text": "Already I can see that this can be like 90% faster", "likes": 0}}, {"topLevelComment": {"author": "Kaito", "text": "the content is good, but his smacking drives me crazy, please stop doin that <3", "likes": 0}}, {"topLevelComment": {"author": "Abhishek Sumod", "text": "8:44:39 \nNo firebase option?\nWhy", "likes": 0}}, {"topLevelComment": {"author": "Puzzles4All", "text": "Apart from exceptional teaching we are witnessing here, I have one advise. If you are already familiar with Dart basics but still wanna follow along with the tutor then do so at 1.5X Speed and you will be good to go. Apart from that for the rest of the project watch it at 1.25X Speed. Cheers!", "likes": 1}}, {"topLevelComment": {"author": "Franklinfgamer2", "text": "fcc in 2035 be like lets program a nukelear bomb all you need for this is nile red and a backyard", "likes": 1}}, {"topLevelComment": {"author": "payaah", "text": "Great course so far but the video title and subtitle are taking up too much space, often hiding the parts being discussed", "likes": 0}}, {"topLevelComment": {"author": "Samson Ayalew", "text": "you reignited my love for coding with bloc architecture wow what a beautiful code.\nI am grateful for this tutorial, thank you", "likes": 0}}, {"topLevelComment": {"author": "Joel D'Souza", "text": "If any of you have a Windows device and want to install Flutter, VS Code, Android Studio and SDK in a step by step including how to save the program files then please watch this video. It really helped me and I guarantee it will help you as well. \n\nhttps://www.youtube.com/watch?v=tun0HUHaDuE&t=566s", "likes": 0}}, {"topLevelComment": {"author": "shahida Abdulla", "text": "Hi  can I get the D-U-N-S number after developing an app? Or is does it have to be before?", "likes": 0}}, {"topLevelComment": {"author": "a person", "text": "ایول\nایرانی جماعت همه جا هست😂", "likes": 0}, "replies": [{"author": "mhdyar", "text": "😂💪", "likes": 0}]}, {"topLevelComment": {"author": "Rémy Berguerand", "text": "The timestamps between chapter 41-42 are broken", "likes": 0}}, {"topLevelComment": {"author": "MAXIBI ICT", "text": "You can actually develop iOS and release to apple store using a PC hackintosh! I did it.", "likes": 0}}, {"topLevelComment": {"author": "Comedy Show", "text": "video subtitle not working what happens can you fix it?", "likes": 0}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "12:42:28", "likes": 0}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "can anyone help verify email isnt sending a email i am at that part of the course", "likes": 0}, "replies": [{"author": "Rémy Berguerand", "text": "I had this problem and it was just that it was going directly to spam... maybe that is the case for you too", "likes": 0}]}, {"topLevelComment": {"author": "GigaChad", "text": "❤❤❤❤", "likes": 1}}, {"topLevelComment": {"author": "Anmol Sharma", "text": "ofc why not.. we need to pay 70$ for the apple app store", "likes": 0}}, {"topLevelComment": {"author": "flavioscorpions", "text": "Thank you :)", "likes": 0}}, {"topLevelComment": {"author": "Brady Palfrey", "text": "npcs in these comments", "likes": 0}}, {"topLevelComment": {"author": "REEL Z", "text": "nice", "likes": 1}}, {"topLevelComment": {"author": "ADARSH BHARDWAJ", "text": "11:43:58 FirebaseAuth.instance.currentUser?.reload(); use this to reload user before checking😀", "likes": 2}}, {"topLevelComment": {"author": "HelloChannel", "text": "After 37 hours will it still beginners?", "likes": 0}}, {"topLevelComment": {"author": "Siddharth Misra", "text": "I could'nt follow it. The curve with which the complexity rose for firebase, was just incredibly intimidating.", "likes": 0}}, {"topLevelComment": {"author": "Jasurbek Ergashev", "text": "Half of the course is about checking the notes whether the teacher talked about it or not :)", "likes": 1}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "8:56:00", "likes": 0}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "8:57:00", "likes": 0}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "8:57", "likes": 0}}, {"topLevelComment": {"author": "Anil", "text": "right arrow key was handy throughout the video😁", "likes": 0}}, {"topLevelComment": {"author": "Trupti Maharana", "text": "This is absolutely fire. Can't thank you enough for the content you are providing", "likes": 5}}, {"topLevelComment": {"author": "Mallick", "text": "Aagha, Shoma irani hasteen? nah?", "likes": 0}}, {"topLevelComment": {"author": "Victor Zwaga", "text": "4:13:08", "likes": 0}}, {"topLevelComment": {"author": "Flutter", "text": "Perfect 👍", "likes": 0}}, {"topLevelComment": {"author": "Ismail Ahmad", "text": "I'm just finishing this tutorial on the side by watching it bit by bit. All the errors that are coming up around 7:20:00 as such I feel are really helpful. I feel it helps seeing things get explained and walked through to fix the errors. These are the kind of little things that usually mess with people who are just starting to learn something for fun.", "likes": 2}, "replies": [{"author": "Ismail Ahmad", "text": "@Roy Zevisionneur Unfortunately, I'm just watching this every now and then on the side for fun. What I'm really learning at the moment is backend through Codecademy. I've tried to dabble with flutter in the past, I'm hoping this video gives me enough foundation to explore it again in the future. So far so good I think", "likes": 0}, {"author": "Roy Zevisionneur", "text": "Do you have the same error message as he does? becuse I get something else and when I do ctrl F I only get one result for defaultConfig { ...", "likes": 0}]}, {"topLevelComment": {"author": "Anwit Mondal", "text": "Why didn't you segment this video ?", "likes": 0}}, {"topLevelComment": {"author": "U1der", "text": "Awesome content. Would be greay if you can add timeline markers per topic.", "likes": 0}, "replies": [{"author": "Arun", "text": "Check discription", "likes": 0}]}, {"topLevelComment": {"author": "Abhilash Behera", "text": "too much talking. damn slow", "likes": 1}}, {"topLevelComment": {"author": "Roshen Nair", "text": "Bookmark: 9:19", "likes": 0}}, {"topLevelComment": {"author": "Shadow Slayer224", "text": "Oh ma Gawd wow the video is so long wow!!", "likes": 0}}, {"topLevelComment": {"author": "a", "text": "In 37 jours 🤯🤯 (1 day and 13 hours 🤯🤯🤯)", "likes": 1}}, {"topLevelComment": {"author": "Arshaan Iqbal", "text": "Can we Connect C Backend with Flutter Frontend?", "likes": 0}}, {"topLevelComment": {"author": "Coding Unleashed", "text": "4:12:49 / 1:12:39:21", "likes": 0}}, {"topLevelComment": {"author": "Shashank Reddy", "text": "Cannot create a project within the Flutter SDK. Target directory\n'/Users/shashankreddy/development/flutter/learningdart' is within the Flutter\nSDK at '/Users/shashankreddy/development/flutter'.", "likes": 0}}, {"topLevelComment": {"author": "Xantianis", "text": "In my case (Android) I needed to add  to the \"build.gradle\" file (inside \"defaultConfig {}\") lines:\n\nminSdkVersion 19\r\nmultiDexEnabled true\n\nI hope I helped someone.", "likes": 0}}, {"topLevelComment": {"author": "Attribute -", "text": "Be careful if you make a Google Developer account. If you do not publish an app within a certain amount of time, Google will permanently suspend your developer account with no point of contact or refund.", "likes": 2}}, {"topLevelComment": {"author": "Attribute -", "text": "I had a Google Developer account, but Google closed it for inactivity without a refund.", "likes": 0}, "replies": [{"author": "Crazymonkey5550", "text": "How long did you have the account for?", "likes": 0}]}, {"topLevelComment": {"author": "Enes Çamlıca", "text": "hi how to watch this videos but very very long how to use this course  I am waiting your advice and comment.", "likes": 0}}, {"topLevelComment": {"author": "Jason O.", "text": "Too much rambling...", "likes": 0}}, {"topLevelComment": {"author": "Mr. Right", "text": "Whats flutter", "likes": 0}}, {"topLevelComment": {"author": "Ivaylo Ivanov", "text": "Great tutorial!", "likes": 0}}, {"topLevelComment": {"author": "VCARP", "text": "The Course is Awsome", "likes": 0}}, {"topLevelComment": {"author": "Handsome_Hero", "text": "37 hours - omfg 🤣", "likes": 0}}, {"topLevelComment": {"author": "Galaxy Anime", "text": "Which flutter version used here?", "likes": 0}}, {"topLevelComment": {"author": "Aloho Mora", "text": "I started rejecting offers from Google after watching this", "likes": 1}, "replies": [{"author": "Faizan Ahmad", "text": "which offers", "likes": 0}]}, {"topLevelComment": {"author": "Web Software Developer Ijtihad", "text": "Such a lengthy tutorial had never been seen on youtube. Thanks, #freeCodeCamp team for making this video.", "likes": 0}}, {"topLevelComment": {"author": "Trishal Mandrik", "text": "Please give time stamps", "likes": 0}}, {"topLevelComment": {"author": "code vader", "text": "4:50:00", "likes": 0}}, {"topLevelComment": {"author": "SnowappixTV", "text": "More Details About The Course Content\n\n(00:00:00) Chapter 0 - Introduction\n-------------------------------------------------------\n(00:00:00) freeCodeCamp.org - Introduction\n(00:00:12) Free Flutter Course - Hi. I'm Vandad, Google Developer Expert for Flutter & Dart\n(00:00:20) Who is this course for? - Absolute beginners!\n(00:01:07) Designed to be followed chronologically - Will be kept updated as things change\n(00:01:37) What we will learn? - Dart, Flutter and we will release our apps as well\n(00:02:27) Please follow me on social media - Twitter: @vandadnp, and LinkedIn as Vandad Nahavandipoor\n(00:02:43) Want to support my work? - https://www.buymeacoffee.com/vandad\n(00:02:56) Let's get started! \n\n(00:02:58) Chapter 1 - Developer Accounts\n--------------------------------------------------------------------\n(00:09:36) iOS – What is a dev account? - What is a developer account and why we need it?\n(00:10:05) iOS – Different dev accounts - Individual/company (liability)\n(00:14:11) iOS – Register for dev account - How to register ( https://developer.apple.com/programs/enroll/ )\n(00:15:57) iOS – D.U.N.S Number for Organizations - https://developer.apple.com/support/D-U-N-S/\n(00:24:47) iOS - Long Process and not free - This process sometimes can take weeks for organizations\n(00:29:12) Android - similar to App Store Connect for releasing Android apps\n(00:30:00) Android - Sign up for dev account - https://play.google.com/console/u/O/signup\n\n(00:39:12) Chapter 2 - Setup\n---------------------------------------------\n(00:40:32) What is Flutter? - Flutter is a rich UI framework developed by Google\n(00:45:33) What is Dart? - Dart is the language that powers Flutter\n(00:46:20) What is DartPad? - DartPad allows you to test your Dart code right in the browser\n(00:49:26) Let's install Flutter - For Mac, Windows and Linux\n(01:00:14) Flutter Doctor - Let's you find issues with your Flutter installation\n(01:02:30) Installing Xcode - We need Xcode to develop apps for iOS, iPadOS and macOS\n(01:04:22) Installing Android Studio and Android SDK - We use Android Studio for its Android SDK Manager\n(01:08:51) Visual Studio Code - Free and open source code editor from Microsoft\n(01:10:01) Error Lens - A great extension for Visual Studio Code for showing errors in line\n(01:11:28) Bracket Pair Colorizer - A built-in setting in Visual Studio Code\n(01:12:00) Flutter + Dart - Both are official extensions for Visual Studio Code\n(01:12:30) Bloc - An extension for Visual Studio Code that we will use later in the course\n(01:13:09) Tokyo Night - A free theme for Visual Studio Code\n(01:14:02) Learning Dart... - We need to learn Dart in order to write Flutter apps\n\n(01:14:43) Chapter 3 - Introduction to Dart\n-------------------------------------------------------------------\n(01:15:58) Getting started - Creating a sample Flutter project where we can test our dart code\n(01:26:58) Keywords - https://dart.dev/guides/language/language-tour#keywords\n(01:29:52) DataTypes - https://api.dart.dev/stable/2.17.3/dart-core/dart-core-library.html\n(01:33:37) Constants - Compile-time vs Run-time\n(01:40:30) Variables - To hold data\n(01:43:25) Functions - They hold your logic\n\n(02:01:26) Chapter 4 - Dart control statements and collections\n---------------------------------------------------------------------------------------------------\n(02:02:10) If & Else - Conditionals in Dart\n(02:14:00) Operators - Simple operators such as + - * and /\n(02:21:55) Lists in Dart - List of homogenous \"things\"\n(02:29:52) Sets in Dart - List of unique \"things\"\n(02:38:23) Maps in Dart - Maps are used to hold key-value pairs of information\n(02:45:41) What's coming in next chapter - We will talk about null-safety next and what that means\n\n(02:46:45) Chapter 5 - Sound null-safety in Dart\n---------------------------------------------------------------------------\n(02:49:28) What are null values? - https://dart.dev/null-safety\n(02:52:19) Making any type nullable - Use the question mark after the data type such as \"String?\"\n(03:00:07) Cherry-picking non-null values - Use the ?? operator\n(03:07:56) Null-aware assigment operator - Use ??= in this case\n(03:13:38) Conditional invocation - Use the ?. syntax to conditionally invoke a method or property\n(03:22:14) Make sure to check out the official documentation - https://dart.dev/null-safety/understanding-null-safety\n(03:24:41) What's coming in the next chapter? - More Dart of course!\n\n(03:27:12) Chapter 6 - Dart enumerations, classes and objects\n---------------------------------------------------------------------------------------------------\n(03:28:00) Enumerations - Named list of related items\n(03:32:10) Switch Statement - To avoid if else over enumerations\n(03:39:00) Classes - What are classes in Dart and why do we use them?\n(03:44:43) Objects - They are instances of classes\n(03:46:09) Constructors - Allow you to create an instance of a class with optional parameters\n(03:50:14) Methods - What are methods on a class and why are they useful?\n(03:53:23) Inheritance and Subclassing - Classes can do a lot for us including inheritance and allowing us to subclass them\n(03:59:07) Abstract Classes - They can contain logic too! ( https://dart.dev/guides/language/language-tour#abstract-classes )\n(04:01:34) Factory Constructors - Can return instances that are not of the same class! ( https://dart.dev/guides/language/language-tour#factory-constructors )\n(04:08:12) Custom Operators - You can define custom operators on your own classes in Dart\n\n(04:18:37) Chapter 7 - Advanced dart\n-----------------------------------------------------------\n(04:19:46) Extensions - Adding logic to existing classes\n(04:26:23) Future - Data to be returned in the future, as its name suggests\n(04:33:27) async / await - Mechanism for controlling asynchronous flow of data\n(04:37:26) Streams - An asynchronous \"pipe\" of data\n(04:41:36) Awaiting for Stream data - await for (...) syntax similar to await on Future\n(04:46:26) Generators - For generating \"iterables\", marked with sync* and async*\n(04:54:05) Generics - To avoid re-writing similar code\n(04:59:27) What's coming in the next chapter? - We need to set up our project structure in the next chapter...\n\n(05:00:41) Chapter 8 - Project setup\n---------------------------------------------------------\n(05:02:33) Set project up from Terminal - Using \"flutter create --org xxx.domain appname\"\n(05:12:12) Quick look around - Let's check out the project structure\n(05:21:52) Dependencies and more - pubspec.yaml includes it all ( https://pub.dev )\n(05:40:22) Adding our dependencies - We need firebase_core, firebase_auth, cloud_firestore and firebase_analytics\n\n(05:48:30) Chapter 9 - iOS App Setup (App Identifier, Certificates and Profiles)\n---------------------------------------------------------------------------------------------------------------------------\n(05:50:42) Developer account - In order to release the app for iOS and iPadOS you need a developer account\n(05:52:50) Certificates and Profiles - What they are and why we need them\n(06:04:53) Account Walkthrough - https://developer.apple.com/account\n(06:07:35) The missing pieces - We need certificates, profiles and app ID plus device identifiers\n(06:09:25) Certificates in Keychain - We will delete all certificates in our local keychain now\n(06:15:02) Delete existing certificates and profiles - We will now delete all existing certificates and profiles from developer.apple.com/account\n(06:16:35) Development certificate - Let's create a dev certificate\n(06:21:18) Production certificate - We need to create a production certificate as well\n(06:23:52) App ID - We need an App ID as well\n(06:27:06) Device UUID - In order to debug on a real device we need a UUID to register for our profile\n(06:30:45) Development profile and download - We should now create a new dev profile and download and install it on our computer\n(06:33:16) Production profile and download - We also need a production profile and need to download and install it\n(06:36:11) Set up profiles in Xcode project - We need to tell Xcode about our profiles and certificates now\n(06:48:26) Mirror iPhone screen - Use QuickTime Player to mirror iPhone screen on Mac\n(06:57:35) We are good to go on iOS - We installed our Flutter app on a real iOS device. Next stop is Android!\n\n(06:59:33) Chapter 10 - Android app Setup\n--------------------------------------------------------------------\n(07:04:18) Scrcpy ( https://github.com/Genymobile/scrcpy ) - We will be using \"scrcpy\" to mirror a real Android device on the screen\n(07:06:15) ADB (Android Debug Bridge) - brew install --cask android-platform-tools\n(07:10:25) USB Debugging - You will need to enable USB debugging to mirror your screen\n(07:14:15) Select Android device in VSCode - We can switch between devices easily\n(07:15:45) Android mirroring - Let's see if it all works!\n(07:27:12) Disable screen sleeping - You can disable this feature so you don't have to turn the screen on all the time\n(07:30:55) We are good to go on Android as well - We need to set up our backend now on Firebase\n\n(07:31:32) Chapter 11 - Firebase Backend Setup\n----------------------------------------------------------------------------\n(07:34:38) FlutterFire initialization - flutter fire initialization https://firebase.flutter.dev/docs/overview\n(07:36:56) Install FlutterFire CLI - dart pub global activate flutterfire_cli\n(07:37:39) Make sure path is updated - vim ~/.zshrc => export PATH=\"$PATH\":\"$HOME/.pub-cache/bin\"\n(07:39:32) You might need to reload your paths - source ~/.zshrc\n(07:40:05) What is Firebase CLI? - A CLI to help us interact with Firebase right from our terminal\n(07:41:06) Install or update Firebase CLI - https://firebase.google.com/docs/cli#install-cli-mac-linux or curl -sL firebase.tools | upgrade=true bash\n(07:42:40) Login/Logout - firebase login or firebase logout", "likes": 11}, "replies": [{"author": "Dev Prasad", "text": "Thank you", "likes": 0}, {"author": "Gardrop Fuat", "text": "Thank you for your effort", "likes": 0}]}, {"topLevelComment": {"author": "Faiz Shaikh", "text": "How do he knows everything about dart/flutter???", "likes": 0}}, {"topLevelComment": {"author": "Biira", "text": "Watched this in one sit 😎", "likes": 2}, "replies": [{"author": "dot_slash", "text": "😎", "likes": 1}]}, {"topLevelComment": {"author": "ser brad", "text": "0", "likes": 0}}, {"topLevelComment": {"author": "FallenWorldStudios", "text": "Who else thought they code finish the video in two days?", "likes": 0}}, {"topLevelComment": {"author": "You can", "text": "Please follow the next one Flutter Advance Project Base Course", "likes": 1}, "replies": [{"author": "Kittisak Phatchaiphongsa", "text": "+++", "likes": 0}]}, {"topLevelComment": {"author": "Clayton Wingfield", "text": "Imagine the upload time for this video 🤣", "likes": 0}}, {"topLevelComment": {"author": "Bill Milligan", "text": "You need developer accounts.  Skip to 15:00 because he just rambles on and on and on about why you need them -- just believe that you do and get to work.  And if you can figure out how to sign up for apple and google developer accounts without an incredible amount of long winded explanation and hand-holding, simply skip to chapter 2 at 39:12.", "likes": 3}, "replies": [{"author": "Kittisak Phatchaiphongsa", "text": "Yah 🥶", "likes": 0}]}, {"topLevelComment": {"author": "Martin Blaščák", "text": "just WOW. i like it 🙂", "likes": 0}}, {"topLevelComment": {"author": "Harish Kumar", "text": "Can any one help me with this question:\n\nWhy do we always declare variables using final keyword ( even though it’s a variable ) ?", "likes": 1}, "replies": [{"author": "Harish Kumar", "text": "@OLATUNJI FELIX  Thank you very much 👍🏼", "likes": 0}, {"author": "OLATUNJI FELIX", "text": "Final keyword is used whenever you are sure you won't change/modify the value later in the implementation. \nA \"final\" variable is like a constant. So, whenever a final variable is initialized, an error will occurs if there is any attempt to change the value later.  In other word, a variable cannot be modified after it is declared as final.", "likes": 2}]}, {"topLevelComment": {"author": "WerrutkyUpNext", "text": "i am 1 :30 minutes in and this guy really hasnt talked about much", "likes": 0}, "replies": [{"author": "WerrutkyUpNext", "text": "1 hour 30 minutes I mean", "likes": 1}]}, {"topLevelComment": {"author": "WerrutkyUpNext", "text": "you are very bad at getting to the point", "likes": 1}}, {"topLevelComment": {"author": "WerrutkyUpNext", "text": "why is flutter so hard to download?", "likes": 0}}, {"topLevelComment": {"author": "ABCDE", "text": "Please add english sub", "likes": 0}}, {"topLevelComment": {"author": "CHAOTIC SAGERS", "text": "Learning all the concepts again for the 8th time because i dont want to make app using java or kotlin 💕❤️🤠", "likes": 1}, "replies": [{"author": "Faizan Ahmad", "text": "did you understand factory and abstract class", "likes": 0}]}, {"topLevelComment": {"author": "code vader", "text": "1:30:00", "likes": 0}}, {"topLevelComment": {"author": "samson pepe egahi", "text": "I'm really enjoying this course but am not seeing the shell command and the select device in the search space for selection I think something is wrong and I really need help and even so how do I create  a windows terminal? sorry am a newbie who's just tryna cope in all thanks.", "likes": 0}}, {"topLevelComment": {"author": "Pollo siuuuuu", "text": "bro 💀", "likes": 0}}, {"topLevelComment": {"author": "Gillu Tv", "text": "We demand nobel prize for the idea to provide free education .", "likes": 0}}, {"topLevelComment": {"author": "code vader", "text": "44:11", "likes": 1}}, {"topLevelComment": {"author": "ashwith chandra", "text": "Thanks a lot sir it is very very very very gooood lecture..", "likes": 0}}, {"topLevelComment": {"author": "Nikolaj Milev", "text": "did u sleep bro", "likes": 0}}, {"topLevelComment": {"author": "Hamza Ghraoui", "text": "you should create a new dart file to write the basics not in the demo flutter lib.dart file . because it's confusing \nand the way you talk you are not qualified to make a course like this....\nif u have knowledge that doesn't mean u can deliver it in the simple and right way", "likes": 0}}, {"topLevelComment": {"author": "Melva Hielckert", "text": "A+++++++", "likes": 0}}, {"topLevelComment": {"author": "2-RE Art", "text": "The argument type 'Iterable<CloudNote>' can't be assigned to the parameter type 'List<CloudNote>'. \nhow to fix this ?\n1:01:16:18", "likes": 0}}, {"topLevelComment": {"author": "Zane Hudson", "text": "I’m listening to this at work and I don’t even know why", "likes": 0}}, {"topLevelComment": {"author": "Lahiru Prasangika", "text": "🏁 Cᴀʀ Rᴀᴄɪɴɢ Gᴀᴍᴇ Cʜᴀʟʟᴇɴɢᴇ 🚘🔥💻\n💚 ᴅᴏɴ'ᴛ ᴍɪss ᴡᴀᴛᴄʜ ᴛʜᴇ ᴠɪᴅᴇᴏ , sᴜʙsᴄʀɪʙᴇ & sʜᴀʀᴇ👍\n\nᴄᴀʀ ʀᴀᴄɪɴɢ ɢᴀᴍᴇ 📲❤️💻| ᴄᴏᴅᴇsʜᴏᴡ ʟᴀᴘᴢ | 2022 |\nhttps://youtu.be/lale4fLXPqo", "likes": 0}}, {"topLevelComment": {"author": "ser brad", "text": "92528", "likes": 0}}, {"topLevelComment": {"author": "ET Tranning Online", "text": "https://youtu.be/c1rkRjURPrk thk", "likes": 0}}, {"topLevelComment": {"author": "Michael Jones", "text": "In case anyone else runs into this, I'm on Linux and building for Linux stopped working around 8:55:0, a MissingPluginException with the Firebase.initializeApp function. I believe it's a versioning/dependency problem and I haven't been able to resolve it yet. However, I was able to switch to running on an Android emulator and that is working.", "likes": 0}}, {"topLevelComment": {"author": "Christian", "text": "Do you have a course for people who already have a few years of programming experience? This course seems to be really really basic. I can probably pick up dart on the go. I just need explanations about the Flutter stuff. :)", "likes": 0}}, {"topLevelComment": {"author": "AIHANUNWA FESTUS", "text": "Just finished the course... It took me 9 days and this is my first flutter course, vandadnp was great and I felt really emotional in the last chapter (outro) of this course like i've known the tutor all my life...Lol.", "likes": 11}, "replies": [{"author": "AIHANUNWA FESTUS", "text": "@Amit Giri Not really, the course was recorded between December last year till January this year (2022) so it's still very current and can help give you a good foundation as to how flutter works basically. Then from there you can improve on yourself like I'm actually doing now....", "likes": 3}, {"author": "Amit Giri", "text": "is it helpfull for flutter 3 also?", "likes": 1}]}, {"topLevelComment": {"author": "Yannik", "text": "Guys I just can't thank you enough. You are doing such a great work. Thank you so much!", "likes": 1}}, {"topLevelComment": {"author": "Rishabh Gupta", "text": "Today's generation won't realize how blessed they are to have cheap internet and unlimited access to the things they always wanted to learn", "likes": 4}}, {"topLevelComment": {"author": "monish shetty", "text": "Thank You so much for this course !!", "likes": 0}}, {"topLevelComment": {"author": "FRIDAY", "text": "mystamp 1:52:00", "likes": 0}}, {"topLevelComment": {"author": "Carmelyne Thompson", "text": "Thank you , sir.  Nice phase. Easy to follow and very comprehensive! Best one I found on YouTube. Just in case, I hope this will get updated for any Flutter 3 changes. Thanks again!!!", "likes": 2}, "replies": [{"author": "Arun", "text": "How are u verified?", "likes": 0}]}, {"topLevelComment": {"author": "Tan", "text": "Wow. I stayed up for 37 hours. Thank you so much.", "likes": 2}}, {"topLevelComment": {"author": "Imran Ocean", "text": "I began to study flutter today with your course. I believe I can make it to leave Russia and travel to Singapoure", "likes": 0}, "replies": [{"author": "python samurai", "text": "Ну что получилось?)", "likes": 0}]}, {"topLevelComment": {"author": "Panshul Garg", "text": "6:24:00 apple certification", "likes": 0}}, {"topLevelComment": {"author": "TEMITOPE ADENIRAN", "text": "nice well put together", "likes": 0}}, {"topLevelComment": {"author": "파노이", "text": "if i'm not going to upload my app to the appstore, does that mean that i don't need a duns number?", "likes": 0}}, {"topLevelComment": {"author": "ser brad", "text": "82715", "likes": 0}}, {"topLevelComment": {"author": "ser brad", "text": "dude ur only helping for macOS! Worst tutor ever, tutor ??? nooob!", "likes": 0}}, {"topLevelComment": {"author": "ser brad", "text": "this guy is no developer at all, missing the crucial parts. Disliked!", "likes": 0}}, {"topLevelComment": {"author": "Hassan A Jaber", "text": "Thank you so much man! You are awesome", "likes": 0}}, {"topLevelComment": {"author": "Mario Russo", "text": "Anyone having problems after the installation of plugins such as firebase_auth, firebase_core etc? Before this step everything was working fine but after I had so many errors about version compatibility with cocoa pods, minsdk and many others.", "likes": 1}}, {"topLevelComment": {"author": "Joaquin Phoenix", "text": "Does this include Desktop Application dev?", "likes": 0}}, {"topLevelComment": {"author": "PunyA PunyA", "text": "2:46:49", "likes": 0}}, {"topLevelComment": {"author": "ser brad", "text": "33829", "likes": 0}}, {"topLevelComment": {"author": "Bucket of Internet", "text": "I have the same photo as Vanadad's background as wallpaper.", "likes": 0}}, {"topLevelComment": {"author": "Martin McIntyre", "text": "Thanks for efforts for this, i've been developing in flutter for a few years and you taught me some good practices and only half way through. Shame video isn't chopped into smaller videos as it is hard to go backwards and forwards by seconds.", "likes": 0}}, {"topLevelComment": {"author": "Sangam Giri", "text": "If someone else was stuck too, try:\n\nexport PATH=$PATH:\"$HOME/.pub-cache/bin\"", "likes": 0}}, {"topLevelComment": {"author": "Ibrahim Osman", "text": "the pacing in the beging is very slow and the discussions was unnecessary could ba discussed when the app is in the deployment stage", "likes": 0}, "replies": [{"author": "Ibrahim Osman", "text": "would be even better if you had powerpoint so that you could be more structured", "likes": 0}]}, {"topLevelComment": {"author": "SAMANTHA BYRNES", "text": "Cool", "likes": 0}}, {"topLevelComment": {"author": "Andrey Burmagin", "text": "Yet another video before going to sleep.", "likes": 0}}, {"topLevelComment": {"author": "berighteous", "text": "What is flutter?", "likes": 0}}, {"topLevelComment": {"author": "Veysel AYDIN", "text": "i bet this is amazing tutorial. i watch this until chapter 4, then my misophonia kicked in because of that candy sucking voice...", "likes": 0}}, {"topLevelComment": {"author": "Gvko", "text": "finally got into and as always - Murphy's Law arrived at place..\nVS servers down, cant  update (state for 11.05.2k22 CET +1) :D love my life tho :D", "likes": 0}}, {"topLevelComment": {"author": "Ajay Shah", "text": "God bless uh sir, may god fulfill ur every desire 😊😊❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Ajay Shah", "text": "Thanks for this course sir, plz always teach us new new technology nd courses, bcoz we r belongs to poor family nd can't purchase high level fee to learn..plz help us by new new high level basic to advanced level courses to our bright future😊😊", "likes": 0}}, {"topLevelComment": {"author": "joao victor", "text": "08:17:36 START CODE already inside some new fire configured app", "likes": 0}}, {"topLevelComment": {"author": "hussein saad", "text": "I have been looking for an updated flutter course all over the internet, I was willing to pay money for it knowing that i can watch an updated version for free on YouTube is something really amazing which most people won't take it into consideration amazing what you guys are delivering :)", "likes": 17}}, {"topLevelComment": {"author": "Hacker Baba", "text": "⭐️ Course Contents ⭐️\n⌨️ (00:00:00) Introduction\n⌨️ (00:02:57) Developer Accounts\n⌨️ (00:39:12) Setup\n⌨️ (01:14:42) Introduction to Dart\n⌨️ (02:01:26) Dart Control Statements and Collections\n⌨️ (02:46:44) Sound Null safety in Dart\n⌨️ (03:27:12) Dart Enumerations, Classes and Objects\n⌨️ (04:18:36) Advanced Dart\n⌨️ (05:00:41) Project Setup\n⌨️ (05:48:30) iOS App Setup\n⌨️ (06:59:32) Android App Setup\n⌨️ (07:31:31) Firebase Backend Setup\n⌨️ (08:01:20) Basic Registration Screen\n⌨️ (09:04:54) Login View\n⌨️ (09:53:10) Separating App Initialization from Login and Register Screens\n⌨️ (10:19:47) Setting up Git and GitHub\n⌨️ (11:10:34) Email Verification View\n⌨️ (11:44:45) Link Between Login and Register Views\n⌨️ (12:18:01) Logout View\n⌨️ (13:13:46) Go From Login to Notes View\n⌨️ (13:36:43) Cleaning Up our Routes\n⌨️ (13:51:17) Error Handling in Login View\n⌨️ (14:16:21) Error Handling in Register View, Next Screen After Registration\n⌨️ (14:44:45) Confirming Identity Before Going to Main UI\n⌨️ (14:52:21) Auth Service\n⌨️ (15:55:22) Migrating to Auth Service\n⌨️ (16:33:41) Unit Testing our AuthService\n⌨️ (17:43:42) CRUD Local Storage\n⌨️ (19:30:57) Working with Streams in Notes Service\n⌨️ (20:04:32) Preparing Notes View to Read All Notes\n⌨️ (20:39:21) Preparing to Create New Notes\n⌨️ (21:00:16) Creating New Notes\n⌨️ (21:35:42) Displaying Notes in Notes View\n⌨️ (21:56:04) Deleting Existing Notes in Notes View\n⌨️ (22:40:46) Updating Existing Notes\n⌨️ (23:14:12) Protecting NotesService with Current User\n⌨️ (23:40:44) Writing Notes to Cloud Firestore\n⌨️ (24:58:08) Migrating to our Firestore Service\n⌨️ (25:22:35) Sharing Notes\n⌨️ (25:37:43) Introduction to Bloc\n⌨️ (26:24:31) Converting our Auth Process to Bloc\n⌨️ (27:31:17) Handling Auth Bloc Exceptions During Login\n⌨️ (28:52:45) Moving to Bloc for Routing and Dialogs\n⌨️ (28:58:23) Loading Screens\n⌨️ (29:48:31) Final Touches Before App Release\n⌨️ (30:43:03) App Icons and App Name\n⌨️ (31:06:34) Splash Screen\n⌨️ (31:56:58) Sending our iOS app to App Store Connect\n⌨️ (32:55:44) Releasing our iOS App\n⌨️ (33:20:31) Fixing Firebase Security Rules and Resubmitting the iOS App\n⌨️ (33:50:07) Releasing our Android App\n⌨️ (34:55:19) Localization in Flutter\n⌨️ (36:33:57) Outro", "likes": 4}}, {"topLevelComment": {"author": "Amandeep Singh", "text": "please upload your notes", "likes": 0}}, {"topLevelComment": {"author": "wokrice", "text": "8:46:47", "likes": 0}}, {"topLevelComment": {"author": "Gefallenes Obst", "text": "Thank you very very much for this great tutorial!!", "likes": 0}}, {"topLevelComment": {"author": "Farhan Chaudhary", "text": "12:51:18", "likes": 0}}, {"topLevelComment": {"author": "Kayıp Ruh", "text": "whaaaaatt", "likes": 0}}, {"topLevelComment": {"author": "H3w4", "text": "wow this is great, thanks", "likes": 0}}, {"topLevelComment": {"author": "KEVIN RAMOS", "text": "Thank you very much 😁It was just what I was looking for.", "likes": 0}}, {"topLevelComment": {"author": "Immersive VR 360°", "text": "How did you post a video longer than 12 hrs??!!", "likes": 0}, "replies": [{"author": "B8BandLCat5", "text": "I know! I was going to ask that, but I saw this first.", "likes": 0}]}, {"topLevelComment": {"author": "Pinoy", "text": "It's 1 day course! First time I've seen a Youtube video this long.", "likes": 0}}, {"topLevelComment": {"author": "Tushar Basak", "text": "1:17:57 course started from here!", "likes": 1}}, {"topLevelComment": {"author": "ThisTiem!", "text": "when he said massive\nhe means it \nalright nevermind", "likes": 0}}, {"topLevelComment": {"author": "TechRisemedia", "text": "amazing video guys!!! 😍", "likes": 0}}, {"topLevelComment": {"author": "Mohammed Mebarek Mecheter", "text": "1:45:30", "likes": 0}}, {"topLevelComment": {"author": "Arnel Enero", "text": "A lot of hard work has been put into this. Kudos! Now let’s see a 37 days course on anything, any takers? 😀", "likes": 6}}, {"topLevelComment": {"author": "The Dogman", "text": "Can anyone help Appy the Cat, build and app?  https://youtu.be/sAQiZI4RMD4", "likes": 0}}, {"topLevelComment": {"author": "owala wilson", "text": "I appreciate the effort you have put, the patience to put together such a detailed tutorial, and the clarity with which you cover each topic. One of the best there is.", "likes": 19}}, {"topLevelComment": {"author": "Michael Chiz", "text": "Wow!", "likes": 0}}, {"topLevelComment": {"author": "Rebecca Biddle", "text": "This is supposedly for complete beginners but this guy just keeps using commands at the terminal and I'm completely lost before even starting!", "likes": 0}, "replies": [{"author": "Ayman", "text": "Forget all Complements in the Comments , it is shi*tty", "likes": 0}]}, {"topLevelComment": {"author": "henry tomesino", "text": "First 15 hours is good, but next 20 hours is  so confusing that only he knows what his doing.", "likes": 0}}, {"topLevelComment": {"author": "ADITYA PANGTEY", "text": "i am in window not in linux can u help me with firebase backend setup", "likes": 0}}, {"topLevelComment": {"author": "Amin Ansar", "text": "Hi, where is the link to introduction video of this course?", "likes": 0}}, {"topLevelComment": {"author": "Gefallenes Obst", "text": "Here is a hint regarding the command FLUTTERFIRE CONFIGURE in the terminal.\nIf you get this error: \nFirebaseCommandException: An error occured on the Firebase CLI when attempting to run a command.\r\nCOMMAND: firebase projects:create NAMEOFYOURAPP --json\n\nFor me the log file said, that the terms of conditions where not accepted. I just simpy opened a the firebase console in the web browser and created a new project in here, where i could accept the the terms.\nNOW the command in the terminal worked for me!", "likes": 0}}, {"topLevelComment": {"author": "Dries", "text": "Can you continue without a developer account and only buy it when you're about to publish your app to the stores?", "likes": 0}, "replies": [{"author": "Ritik Jain", "text": "Yes ofcourse ... You don't need that to build apps , install flutter and start right away", "likes": 0}]}, {"topLevelComment": {"author": "Musa Sudad", "text": "what is framework?", "likes": 0}}, {"topLevelComment": {"author": "Mr. K", "text": "I believe that if y’all remove the parenthesis around the timestamps in the video description, the timestamp viewer / scrubber will properly appear on this video, which would be EXTREMELY helpful to us viewers. Could be done in about 30 seconds 😁", "likes": 0}}, {"topLevelComment": {"author": "Jobin Daniel", "text": "Too much blah blah!", "likes": 2}}, {"topLevelComment": {"author": "master code", "text": "1:52:00\n4:12:00\n5:41:40\n8:30:00\n9:04:55\n11:44:50\n13:01:20\n13:19:00\n14:19:20\n15:27:00\n16:30:50\n16:37:00\n17:06:00\n17:50:00\n18:40:00\n20:04:33", "likes": 2}, "replies": [{"author": "Steevens Delices", "text": "Oh ok", "likes": 0}, {"author": "master code", "text": "@Steevens Delices this my timeline i comment where i left", "likes": 0}, {"author": "Steevens Delices", "text": "Can you label them please", "likes": 1}]}, {"topLevelComment": {"author": "Anand Shirole", "text": "after implementing cloud firestore\n i didnt get notes on notes page its showing blank wha this is happen", "likes": 0}}, {"topLevelComment": {"author": "Akshay Bhandari", "text": "Do you think this is the format we should follow for any software development project? For example deploying on local database first then move to cloud storage and other such examples?", "likes": 1}}, {"topLevelComment": {"author": "ibrahim sawa", "text": "is this tutorial is up to date (april 2022) ?\nas a lot of dart and flutter is outdated due to the updates .", "likes": 1}, "replies": [{"author": "Cody Snell", "text": "he recorded this in december 2021 if you look at the date on his desktop in some of the videos, most up to date video i can find has been this one, hes on 2.8, current is 2.10", "likes": 0}]}, {"topLevelComment": {"author": "Jennifer", "text": "I am having the hardest time finding the English words package, and I also am not sure how to load it.  Can you please help?", "likes": 0}}, {"topLevelComment": {"author": "Adrian Seidel", "text": "The Video is very good.\n\nEverything is going on too slow.\nAfter 1.5h he didnt even start coding yet.\n\nBut apart from that the Video is really good", "likes": 1}}, {"topLevelComment": {"author": "Yağmuş Diye birisi", "text": "Keşke İngilizceyi çok iyi bilseydim", "likes": 0}}, {"topLevelComment": {"author": "Relax, Listen & Meditate", "text": "*** PLEASE READ ***\n\nJust imagine how much work went into this incredible tutorial. I've worked with many languages & frameworks. Never have I seen a tutorial like this.\n\nGuys LIKE the video, follow Vandad's social media & make sure you buy him a coffee if you can afford to.", "likes": 3}}, {"topLevelComment": {"author": "Akshay Bhandari", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "murat can karacabey", "text": "As an experienced developer, if you know where to skip, this is a very effective course.\nPS: iOS app setup part was gold!", "likes": 6}, "replies": [{"author": "Alexandra", "text": "@M Oliver Skip the iOS app setup if you don't own a Mac and don't plan to get one any time soon. :)", "likes": 0}, {"author": "M Oliver", "text": "Where do you think we should skip?", "likes": 1}]}, {"topLevelComment": {"author": "Ellie Owen", "text": "Cool", "likes": 0}}, {"topLevelComment": {"author": "Sharv M", "text": "7:08:03, Mr. @Vandad Nahavandipoor , if we dont have a mac, and have windows, HomeBrew tools are not available, so what is an alternative to use in Windows. Would Chocolatey work? Please let me know. Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Peter Sands", "text": "Does anyone write flutter code using “if platform is iOS/android” to change layouts of menus to suit the OS layout guidelines better? Ie. if iOS use bottom tab bar, else if android use top bar and hamburger menus? Or is there a better way or a standard that covers both? All platform specific content seems to cover features like sensor access etc rather than ui. Thanks", "likes": 0}}, {"topLevelComment": {"author": "George Ocean", "text": "dude, WHAT THE FACT?!!!! are you crazy? i'm watching you 22 min and i forgot that i'm watching flutter course.... are you lawyer?  I can imagine next 12 hours... how long video you made.... better I'll buy real course on udemy", "likes": 0}}, {"topLevelComment": {"author": "George Ocean", "text": "dude, WHAT THE FACT?!!!! are you crazy? i'm watching you 22 min and i forgot that i'm watching flutter course.... are you lawyer?  I can imagine next 12 hours... how long video you made.... better I'll buy real course on udemy", "likes": 0}}, {"topLevelComment": {"author": "Sankar", "text": "me working hard to make 4 minutes content in YouTube. This man made 37 hours of content. (Note: These are combination of videos but it is still amazing)", "likes": 0}}, {"topLevelComment": {"author": "burak yörük", "text": "Thank you for your compherensive contents.", "likes": 9}}, {"topLevelComment": {"author": "Anand Shirole", "text": "which system architecture we have used in this app\ncan anyone tell", "likes": 0}}, {"topLevelComment": {"author": "ssSFrankSss", "text": "What architecture pattern is being used for this app?", "likes": 0}}, {"topLevelComment": {"author": "Gurkirat Singh", "text": "Is there any prerequisite for this Vedio", "likes": 0}}, {"topLevelComment": {"author": "Ryszard Laskowski", "text": "Love this man for doing this. Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Bhadraksh Bhargava", "text": "after running flutterfire configure, and creating my project successfully, it automatically makes a file named firebase_options.dart, which shows me the error that, appID, messagingSenderId and projectId aren't defined in FirebaseOptions. Please help me with what to do", "likes": 0}}, {"topLevelComment": {"author": "PelikuLAGOM", "text": "7:49:00 Anyone experiencing this error? How did you fix it.\n\nFirebaseCommandException: An error occured on the Firebase CLI when attempting to run a command.", "likes": 0}}, {"topLevelComment": {"author": "SeanK_0118", "text": "Way too long explanations that can be resumed in a few minutes. I get he wants to be thorough but the needlessly long explanations and slow talking makes the course lose coherence. He would have more viewers if he summarized better the important points of the course and it would be more useful.", "likes": 2}}, {"topLevelComment": {"author": "Muhammad Adil Naeem", "text": "very long course \nplz make a short course 8 to 10 hours", "likes": 0}}, {"topLevelComment": {"author": "fon barnabas", "text": "Just the course I need for me. Thanks Vandad", "likes": 0}}, {"topLevelComment": {"author": "TSAKIRIS LICKS DB", "text": "what happened to your voice at chapter 5?  2 octaves lower", "likes": 0}}, {"topLevelComment": {"author": "Binh Huynh", "text": "I love it, great tutorial. Thank you :)", "likes": 1}}, {"topLevelComment": {"author": "bistique", "text": "Null Safety --> https://dart.dev/null-safety/understanding-null-safety", "likes": 0}}, {"topLevelComment": {"author": "Syahmi Hanis", "text": "Hi, i encounter a problem when i run \"flutterfire configure\".\nIt says = \nUnhandled exception:\r\nFormatException: Unexpected character (at character 1)\n\ncan you please help me?", "likes": 0}}, {"topLevelComment": {"author": "dixit n parmar", "text": "Can you please upload full stack development course", "likes": 0}}, {"topLevelComment": {"author": "bistique", "text": "The best mentor..... Love It", "likes": 0}}, {"topLevelComment": {"author": "Danny Agniawan", "text": "this is epic, this video should be the longest video i'v ever seen,,thanks for the effort you give a big help for everyone", "likes": 1}}, {"topLevelComment": {"author": "Michael Johnson", "text": "how do you enable dart formatter, or dartfmt? It wasn't enabled by default for me", "likes": 0}}, {"topLevelComment": {"author": "Sergio", "text": "Don't work. Youtube block this video, I don't see nothing. It's sad(((", "likes": 0}}, {"topLevelComment": {"author": "Zamolxis", "text": "And that tsch sound he does every minute is too annoying. Waste of time. Go learn form source documentation.", "likes": 0}}, {"topLevelComment": {"author": "Zamolxis", "text": "audio sucks. Crackling noise. Kinda useless if I can't focus", "likes": 0}}, {"topLevelComment": {"author": "Pierre Falentin", "text": "After 16 days I finished the course, it was really good! My favorite part is at 01:02:04:25 when he scared himself with his fingers 😁", "likes": 1}, "replies": [{"author": "Shashwat Shagun Pandey", "text": "would you please provide the github link for source code ??", "likes": 0}]}, {"topLevelComment": {"author": "Victor Leshe", "text": "Thank you for this... This is really on another level... 37 hours course for free... Wow!!!", "likes": 3}}, {"topLevelComment": {"author": "kasee Nadh Reddy", "text": "To be honest with you.\nI really love this course. 😍😜", "likes": 0}}, {"topLevelComment": {"author": "Guy Junior", "text": "Thanks very for this course. It is really awesome.", "likes": 2}}, {"topLevelComment": {"author": "jimson", "text": "Too much talk dude keep it simple", "likes": 0}}, {"topLevelComment": {"author": "Light Knight", "text": "I know it's not Important to most, but can someone please tell me what vscode theme this gentleman is using. I will be eternally grateful", "likes": 0}, "replies": [{"author": "Pierre Falentin", "text": "It’s Tokio Night", "likes": 0}]}, {"topLevelComment": {"author": "lajt boży", "text": "it's so hard to follow this course. i feel like i can't keep up with what Vandad is doing and i always need to rewind by couple of seconds.", "likes": 0}}, {"topLevelComment": {"author": "Sampath Kumar", "text": "please subtitles sir subttiles not playing", "likes": 0}}, {"topLevelComment": {"author": "Kwami Kudawoo", "text": "Hi Vandad, i am trying to setup setup the backend but i am getting this error (ERROR: Failed to add Firebase to Google Cloud Platform project. See firebase-debug.log for more info) can you please assist thanks", "likes": 0}, "replies": [{"author": "meem laal", "text": "You might need to go in the console in your browser and setup the project because you need to agree to the Google TOS.", "likes": 0}]}, {"topLevelComment": {"author": "Nick D'Esposito", "text": "hey when i run the flutterfire configure i get an error message and opening up the debug log it is an error 400 and was wondering if anyone could help", "likes": 0}}, {"topLevelComment": {"author": "MV N", "text": "Those Udemy courses on Flutter are a waste of money. By the time you finish one of those 30 to 60 hours courses there is a new Flutter version with a million deprecated function and then no code from the course ever works again. Is this the latest course with latest changes?", "likes": 1}}, {"topLevelComment": {"author": "Abu Malik Mohammad Abou-Basha", "text": "What is the link to the introduction mentioned here 09:25?", "likes": 0}}, {"topLevelComment": {"author": "Jo-Anne Tan", "text": "At 7:52:00 , if you are unable to create your first firebase project, go to the firebase-debug.log in your base project folder. If it says \"FirebaseError: Callers must accept Terms of Service\", read on.\n\nYou'll need to go to the firebase console, click  \"Add Project\", create a random project and accept the terms of service here. Then you can return to your terminal and create your mynotes firebase project.\n\nTook me a little while to get here so I hope it helps someone!", "likes": 1}, "replies": [{"author": "Arun", "text": "Did you complete this course?", "likes": 0}]}, {"topLevelComment": {"author": "EgoPlayer", "text": "he just randomly mentioned it's 0:50 in the morning when explaining Streams, thank you so much for putting the energy! You didn't look tired on the screen at all", "likes": 2}}, {"topLevelComment": {"author": "Viraj Singh", "text": "Does this course cover gesture arena, i wanna learn how to give one gesture priority over another.", "likes": 0}}, {"topLevelComment": {"author": "Taishibi kiqe'", "text": "1st dude talks slower than paint drys ...dear lord", "likes": 0}, "replies": [{"author": "PelikuLAGOM", "text": "you have the option to customize the speed.", "likes": 1}]}, {"topLevelComment": {"author": "Arlin", "text": "discord invite expired", "likes": 0}}, {"topLevelComment": {"author": "Ahmad Habib", "text": "4:54:00", "likes": 0}}, {"topLevelComment": {"author": "Devin Osborne", "text": "Explaining developer accounts....completely underrated. I've been trying to understand this stuff for so long!", "likes": 2}}, {"topLevelComment": {"author": "BeeDee FPV", "text": "je bent kanker hinderlijk elke keer dat gesmak als je klaar bent met je zin", "likes": 0}}, {"topLevelComment": {"author": "Blackjackkkkkkkkkkk", "text": "Hi developers! Can you advise me if I can go through this course as I use Windows machine ?", "likes": 0}}, {"topLevelComment": {"author": "braa faisal", "text": "Please do a tutorial on  \nWe learned how to program the entry of a group of images or texts\nto the screen in order\none after one\nwith move\nThe time interval between entering each element and the other\nSuppose I am programming a photo album divided into several screens\nScreen displaying bird images\nA screen that displays animal images\nHow do I program the entry of pictures one by one?\nAs we see in the animation programs that depend on the timeline and the frame", "likes": 0}}, {"topLevelComment": {"author": "MonLes", "text": "This is INCREDIBLE", "likes": 0}}, {"topLevelComment": {"author": "Hydro", "text": "I hate apple 🍏 that is only for rich not for poor 😞😞😞 fucking apple.", "likes": 1}}, {"topLevelComment": {"author": "ldtk", "text": "We would like something similar on react native 🤗", "likes": 0}}, {"topLevelComment": {"author": "yashwant rana", "text": "Guys is there anyone who have completed this course plz give me feedback i mean is it good for behinner and can master it by just watchung this vide0?????", "likes": 0}}, {"topLevelComment": {"author": "Wisdom Ugochukwu", "text": "Thank you very much, for this course", "likes": 1}}, {"topLevelComment": {"author": "Kenneth Smith", "text": "chapter: Android app setup. There is a way to globally resolve the SDK version conflict here https://www.youtube.com/watch?v=501rLKAW3k4", "likes": 0}}, {"topLevelComment": {"author": "pankaj kumar", "text": "Vs code extension:\nerror lens\nFlutter\nDart\nBlock\nTheme:\nTokio night", "likes": 0}}, {"topLevelComment": {"author": "SATiVA Inc.", "text": "Love the course, this is a very real course, dealing with errors lively.", "likes": 4}}, {"topLevelComment": {"author": "Joe Goldberg5254", "text": "amazing course <3", "likes": 0}}, {"topLevelComment": {"author": "mhmd mreh", "text": "kos amk mtwl alvideo", "likes": 0}}, {"topLevelComment": {"author": "Kapil", "text": "1:35:21 --When he says \"I hope everyone becomes Software Developer\"", "likes": 4}}, {"topLevelComment": {"author": "Shreyan Nag Computer Classes", "text": "Legendary channel 👍", "likes": 0}}, {"topLevelComment": {"author": "MICHAEL ALO", "text": "Is this better than the Angela Yu's Flutter course on Udemy?", "likes": 0}}, {"topLevelComment": {"author": "Dhruv Parekh 20_53", "text": "6:36:36", "likes": 1}}, {"topLevelComment": {"author": "I'm same as you, But Better", "text": "How do you stay 37 hours doing this?", "likes": 0}}, {"topLevelComment": {"author": "Antonio Storcke", "text": "The naming for the app identifier is part of the opendesktop standard. Flatpak has adopted this standard and Apple has as well.", "likes": 1}}, {"topLevelComment": {"author": "জ্ঞান বিজ্ঞান( কি? কেন ?কিভাবে?)", "text": "great video", "likes": 0}}, {"topLevelComment": {"author": "SATiVA Inc.", "text": "Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Shahmeer Nasir", "text": "...\n39:10\n...", "likes": 1}}, {"topLevelComment": {"author": "ToFu", "text": "I watched roughly the first 30 minutes of this video and it doesn't convince me. It reminds me on (C++) programming books where you have to read 400 pages before you learn what a function is, and 1000 pages to hear about classes. I also don't know about what introduction video he is talking about, I can't find any links so I didn't see how the final application looks and works like. Generally, it seems as if there wasn't that much functionality implemented. I can only imagine that a lot of time was spent on implementing (time consuming) things that I, as a layman, don't understand/realise, but how many people want to know about all these specific (time consuming) things when they just want get going and develop their first basic app?\n\nI don't mean to bash, but considering that this video is 37 hours long (!), I can only assume half the time is spend (or harshly formulated, wasted) on slow talking, \"umm\"-sounds and repeating  information. If I'm not mistaken, it takes him like 90 minutes to get to the point of programming the first line of code and I don't want to know how many hours to get further stuff done. I mean, 5+ hours of this video are spent on setting various \"stuff\" up. Why does setting up Git and GitHub take 50 minutes? That sounds like something that can be explained in like 10-15 minutes. Isn't a splash screen a very simple thing? Then I wonder why it takes 50 minutes to implement it (I'm referring to the chapter timestamps). These are all aspects that make me wonder if this course is worth watching and who it was actually designed for. Definitely not for people who already have any kind of programming experience (in any language). For them the course takes way too much time and things are explained too slowly. If the video was designed for absolute beginners, then why does it take 90 minutes to program the first line of code. I feel like it shouldn't take much more than 20 minutes to get to the point of programming your first line of code, otherwise people get just bored and demotivated? For example, who cares about developer accounts in the beginning anyway? People want to get stuff done! Maybe I would have a different opinion if I actually did the course, but I feel like it would have been better if parts of this video were restructured and everything was condensed so it only took 15 hours.\n\nEither way, I hope I'm not being to harsh. Thanks for making the course (for free!) and I hope it helps many people. Unfortunately, it didn't help me (so far). Cheers!", "likes": 4}, "replies": [{"author": "Dominik", "text": "I completely disagree with everything you said. The course is slow-to-normal paced. If that is too slow for ya, you have something called a skip button, and also a speed button to which you can put speed up to 2x, let alone enhancer for youtube which gives you more than 2x speed. Programming is mostly patience, there is no such thing as install and configure Git in 15 minutes. To me that sounds like you don't understand nothing about operating systems and their configuration. Your comment is simply invalid.", "likes": 0}]}, {"topLevelComment": {"author": "CROW", "text": "I am only interested in developing for Windows, Linux and Android. is this course useful for me?", "likes": 0}}, {"topLevelComment": {"author": "PelikuLAGOM", "text": "One day. Wow.", "likes": 0}}, {"topLevelComment": {"author": "Aadarsh Mani", "text": "android dev account costs $25 too...", "likes": 0}}, {"topLevelComment": {"author": "Hamza Ali", "text": "im stuck on the path setting. kindly assist.\" Vim Can't Save File (E212)\"", "likes": 0}}, {"topLevelComment": {"author": "Hirdey Mittal", "text": "Thanks Vandad For this beautiful course but changes in the youtube made the timestamps to invisible please make changes to it again thank you for the course", "likes": 1}}, {"topLevelComment": {"author": "Black Moonlight", "text": "sir you are doing a very good job ❤️", "likes": 0}}, {"topLevelComment": {"author": "Kasia P.", "text": "I am so amazed and thankful for this channel. I am not able to afford even the cheapest course (I am just gathering money for my surgery, so first thigns first). This place and your website help me to learn what I always wanted. I have never been more motivated and happy in my etire life. Thank you.", "likes": 19}, "replies": [{"author": "Peter Etenung", "text": "Hope you feel better now?", "likes": 1}, {"author": "samson pepe egahi", "text": "A heart for you even in your current situation and pain, I pray God see you through and more wins for you, Amen.", "likes": 1}]}, {"topLevelComment": {"author": "N UvA", "text": "Great. Do you have the course in chapters and not 37 hour single video? Thanks a lot!", "likes": 2}}, {"topLevelComment": {"author": "Joseph Odhiambo", "text": "IS there a playlist for this please", "likes": 2}}, {"topLevelComment": {"author": "EVERYTHING TV", "text": "I think this youtube channel is unique", "likes": 0}}, {"topLevelComment": {"author": "Dahamya", "text": "I was waiting for this course.. Thank you freeCodeCamp 😍", "likes": 1}}, {"topLevelComment": {"author": "Krishna Kumar", "text": "Did anyone understand factory constructor? Can anyone explain?", "likes": 0}}, {"topLevelComment": {"author": "Tablet VV", "text": "As of now, I have continuously watched for 4hrs 30m and i wish to continue too even at 2.30AM here. What a great course! , the entire content, your flow of thoughts without any clutter / confusion, the way you explain slowly is awesome. I would recommend everyone to watch the course who wants to learn OOPs, not just to learn flutter ..", "likes": 42}, "replies": [{"author": "T-Raj Edits", "text": "how was the experience?", "likes": 1}, {"author": "PKMKB", "text": "in which chapter you are right know?", "likes": 3}]}, {"topLevelComment": {"author": "CHITUS💖⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻⸻", "text": "This is the course that I've been waiting in all of youtube. I've been watching flutter tutorials for about two years. I'm gonna be hooked on this for days. Thank you so much for this!", "likes": 0}}, {"topLevelComment": {"author": "Sathya Subrahmanyam", "text": "can anyone help my ctrl+s is not helping me to trigger hot reload", "likes": 0}}, {"topLevelComment": {"author": "OG", "text": "hi everyone, i am a react developer and i have no previous knowledge about both flutter and dart. is this course for me or not? do i need previous knowledge? thanks in advance.", "likes": 0}, "replies": [{"author": "OG", "text": "@Earth Planet thanks a lot! i really appreciate.", "likes": 0}, {"author": "Earth Planet", "text": "@OG no he teaches dart in it", "likes": 1}, {"author": "OG", "text": "@Earth Planet oh, i see. so i can watch this tutorial but on the other hand do i need a dart tutorial before i watch this? thank you!", "likes": 0}, {"author": "Earth Planet", "text": "no, no previous knowledge needed, its for beginner programmers so you can watch through most of the basics at 1.5x speed since you already know react", "likes": 0}]}, {"topLevelComment": {"author": "Saqib 39", "text": "Much appreciated .", "likes": 0}}, {"topLevelComment": {"author": "Shirley", "text": "I can't find the link to the introduction video. Can someone please post it here?", "likes": 1}}, {"topLevelComment": {"author": "Anand Shirole", "text": "at 16.29.33 i have done evrything as stepwise then also i am not getting like before because this i have register with samil email then also i got verify email and same with login where i gone wrong", "likes": 0}}, {"topLevelComment": {"author": "Ramiz Qazi", "text": "Man Way you calling mobile telephone are you living in 70's", "likes": 0}}, {"topLevelComment": {"author": "Ramiz Qazi", "text": "Mf your to slowwww", "likes": 0}}, {"topLevelComment": {"author": "smark X", "text": "Harsh beniwal explaining Flutter.😆", "likes": 0}}, {"topLevelComment": {"author": "Ömer Yayla", "text": "5:48:32", "likes": 0}}, {"topLevelComment": {"author": "basalkun07", "text": "hate to be your pc", "likes": 0}}, {"topLevelComment": {"author": "Jasbin karki", "text": "The error highlighter used here is Error Lens and you can install this extension by searching it on extension or\nLaunch VS Code Quick Open (Ctrl+P), paste the following command, and press enter.\next install usernamehw.errorlens", "likes": 0}}, {"topLevelComment": {"author": "Alexander Donner", "text": "is it also working for web??", "likes": 0}}, {"topLevelComment": {"author": "Kiss Gergő", "text": "I wonder, has anyone watched this video through start to finish? (not in one sitting of course)", "likes": 1}}, {"topLevelComment": {"author": "Manar Ahmed", "text": "Caption doesn't work, so is there any way to work in order to watch this Video please? 🥺", "likes": 0}}, {"topLevelComment": {"author": "Sami Ul Qadoos", "text": "I cannot find the introduction video on your channel. can someone please share the link of that video ?", "likes": 0}}, {"topLevelComment": {"author": "TheBlackClockOfTime", "text": "7 minutes in and we're still trying to convince the absolute beginner on why we need to register for dev acc to get the app identifier. I hope we're over it by 14 min and actually just getting it done. Because we really don't care about the reasons. For us beginners it's enough that you, the *expert* tell us that it's needed - \"don't ask why\". *UPDATE* - Scrolled to 14 min and we're still on the topic.", "likes": 3}}, {"topLevelComment": {"author": "Yaniv Avraham", "text": "Can you please make a time table of the chapters? Thank you very much", "likes": 1}}, {"topLevelComment": {"author": "forgivegod", "text": "What happened to setup for linux or windows? What if I'm not on osx and dont have an iOS simulator to start up? i\nImagination time.", "likes": 0}}, {"topLevelComment": {"author": "cassidy", "text": "You are a monument!! Great job", "likes": 1}}, {"topLevelComment": {"author": "Horacio Ariel Coronel", "text": "I just finished the Free flutter Course. I really enjoyed it and I'm looking forward to your upcoming videos. In the meantime here is a list of all the Chapters for whoever might need it:\n00:00:11 Chapter 0 - Presentation\n00:02:58 Chapter 1 - Developer Accounts\n00:39:12 Chapter 2 - Setup\n01:14:43 Chapter 3 - Introduction to Dart\n02:01:26 Chapter 4 - Dart control statements and collections\n02:46:45 Chapter 5 - Sound Null-safety in Dart\n03:27:12 Chapter 6 - Dart enumerations, classes and objects\n04:18:37 Chapter 7 - Advanced Dart\n05:00:40 Chapter 8 - Project setup\n05:48:30 Chapter 9 - iOS App Setup (App Identifier, Certificates and Profiles)\n06:59:33 Chapter 10 - Android app Setup\n07:31:32 Chapter 11 - Firebase Backend Setup\n08:01:21 Chapter 12 - Basic register-user screen\n09:04:54 Chapter 13 - Login view\n09:53:10 Chapter 14 - Separating app initialization from login/register\n10:19:48 Chapter 15 - Git and Github\n11:10:34 Chapter 16 - Email Verification View\n11:44:45 Chapter 17 - Link Between login and register views\n12:18:01 Chapter 18 - Logout view\n13:13:47 Chapter 19 - Go From Login to Notes View\n13:36:44 Chapter 20 - Cleaning Up our Routes\n13:51:17 Chapter 21 - Error Handling in Login View\n14:16:21 Chapter 22 - Error Handling in Register View and Going to Next Screen After Registration\n14:44:45 Chapter 23 - Confirming Identity Before Going to Main UI\n14:52:22 Chapter 24 - Auth Service\n15:55:22 Chapter 25 - Migrating to Auth Service\n16:33:41 Chapter 26 -  Unit Testing our Auth Service\n17:43:43 Chapter 27 - CRUD Local Storage\n19:30:57 Chapter 28 - Working with Streams in Notes Service\n20:04:32 Chapter 29 - Preparing Notes View to Read All Notes\n20:39:22 Chapter 30 - Preparing to Create New Notes\n21:00:16 Chapter 31 - Creating New Notes\n21:35:43 Chapter 32 - Displaying Notes in Notes View\n21:56:04 Chapter 33 - Deleting Existing Notes in Notes View\n22:40:46 Chapter 34 - Updating Existing Notes\n23:14:12 Chapter 35 - Protecting NotesService with Current User\n23:40:44 Chapter 36 - Writing Notes to Cloud Firestore\n24:58:08 Chapter 37 - Migrating to our Firestore Service\n25:22:36 Chapter 38 - Sharing Notes\n25:37:44 Chapter 39 - Introduction to Bloc\n26:24:31 Chapter 40 - Converting our Auth Process to Bloc\n27:31:17 Chapter 41 - Handling Auth Bloc Exceptions During Login\n27:52:45 Chapter 42 - Moving to Bloc for Routing and Dialogs\n29:58:23 Chapter 43 - Loading Screens\n29:48:31 Chapter 44 - Final Touches Before App Release\n30:43:03 Chapter 45 - App Icons and app Name\n31:06:34 Chapter 46 - Splash Screen\n31:56:59 Chapter 47 - Sending our iOS app to App Store Connect\n32:55:44 Chapter 48 - Releasing our iOS App\n33:20:32 Chapter 49 - Fixing Firebase Security Rules and Resubmitting the iOS App\n34:50:07 Chapter 50 - Releasing our Android App\n34:55:19 Chapter 51 - Localization in Flutter\n36:33:57 Outro - Final thoughts\n\nThanks Vandad amd freeCodeCamp!", "likes": 1790}, "replies": [{"author": "胡天蘭", "text": "@The BØS$ So do I. I thought it was only my problem. Not sure what made this issue happen, but I guessed it would be a bug of youtube.", "likes": 0}, {"author": "Aiden Kim", "text": "Im stuck at 6:14:20 my computer doesn't have the mobile devices or provisioning profiles file. What do I do??", "likes": 0}, {"author": "PepeLa", "text": "Absolute legend!", "likes": 0}, {"author": "YmRizal", "text": "you have our respects sir", "likes": 0}, {"author": "dante dt", "text": "Much appreciated.", "likes": 0}]}, {"topLevelComment": {"author": "Jiren", "text": "25:37:43", "likes": 0}, "replies": [{"author": "Tahmid Rafi", "text": "Have you completed the course?", "likes": 0}]}, {"topLevelComment": {"author": "samatoTR", "text": "Nice tutorial. Sorry but the noise u makin with your mouth is annnoying", "likes": 0}}, {"topLevelComment": {"author": "Alex Ushkov", "text": "I LOVE THIS GUY! Going through every problem when setting up android debugging in chapter 10 is an awesome idea. It helped me a lot. Thank you very much!))", "likes": 7}}, {"topLevelComment": {"author": "Sharon", "text": "Anyone completed full course?", "likes": 0}}, {"topLevelComment": {"author": "Le Tuan Son", "text": "hey guy i got this error Error: Not found: 'dart:ui' and i don't know how to solve it can you guy help me please", "likes": 0}}, {"topLevelComment": {"author": "Wazy", "text": "If only my laptop can run flutter 😭", "likes": 0}}, {"topLevelComment": {"author": "Fatih Biçgi", "text": "1:24:33", "likes": 0}}, {"topLevelComment": {"author": "AaronGarnier", "text": "To be honest this is an amazing course. I love the pace of the course and how well you explain things. A-lot of gold nuggets!", "likes": 20}}, {"topLevelComment": {"author": "Dhwaj Sharma", "text": "Vscode theme?", "likes": 1}}, {"topLevelComment": {"author": "Malick Cisse", "text": "Thank you very much for this tutorial. Please I would like the link to the 30 minutes introduction you suggested we should watch first.", "likes": 0}}, {"topLevelComment": {"author": "Oscar", "text": "shout out to those who watched this entire video without stoppin", "likes": 0}}, {"topLevelComment": {"author": "TJ Marx", "text": "I'm 14:43 in and so far all I've seen has been non-specific babbling (around 25% of which has been \"umm\") and no actual or implied tutorial. \n\nIn relation to a video that lasts 37 hours, 14 minutes isn't all that long. But introductions do matter, so if you give me almost 15 minutes of babbling then tell me you can't actually walk through the steps of something you say is the first critical step then it makes wanting to invest time by continuing to watch far less appealing.\n\nEdit: At 46 minutes in, it's still just undirected babbling. There's a passing attempt at explanation but it's too poor for people who aren't technologically minded, and too slow/basic for people who are. It's at this point that I must stop the video. There is no real structure here, barely a framework, nothing is concise, ideas often contradict without explanation. This is not a well built/delivered course.", "likes": 2}, "replies": [{"author": "Hisham Hussein", "text": "I watched almost an hour now and man he's the worst instructor. I'm sure he knows what he's talking about but he has no idea how tutorials are supposed to be done. He was supposed to review and edit his videos before uploading them but why didn't he do that? Probably too lazy. He sucks.", "likes": 1}]}, {"topLevelComment": {"author": "Reinis Sproģis", "text": "how much hair did you lose trying to get firebase working?", "likes": 0}, "replies": [{"author": "Reinis Sproģis", "text": "I had to mess around with paths. Ended up following some Indian tutorials on YT on how to add paths and what paths need to be added. Not sure why they dissepeared. But oh boy it gave me a headache.", "likes": 0}, {"author": "Reinis Sproģis", "text": "OMG, now it's totally messed up. my flutter commands don't work anymore", "likes": 0}]}, {"topLevelComment": {"author": "Uddalak Seal", "text": "faced some issues while installing firebase..couldnt access firebase cmd line from vscode. To do that you have to first install node js  (windows user)", "likes": 1}}, {"topLevelComment": {"author": "Uncle Roger wqftyzfs2y6", "text": "i love this channel", "likes": 0}}, {"topLevelComment": {"author": "Christopher Walters", "text": "I wish this was a full free code camp course, instead of just a video, but we can make do with this.", "likes": 0}}, {"topLevelComment": {"author": "Sabir Semerkant", "text": "Please remove the parenthesis from the video timestanps and the seconds portion. The chapters does not work on tv apps for YouTube. Thank you in advance.", "likes": 1}}, {"topLevelComment": {"author": "Мурат Сембеков", "text": "Капец 36 часа", "likes": 0}}, {"topLevelComment": {"author": "Kaleem Ullah", "text": "How much time it will take to complete this course for absolute beginners???", "likes": 0}}, {"topLevelComment": {"author": "Puneet Arora", "text": "please link some documentation for class clusters as well", "likes": 0}}, {"topLevelComment": {"author": "Sidney Richards", "text": "This is the most helpful flutter course I have seen ever..Thank you, thank you", "likes": 1}}, {"topLevelComment": {"author": "R Krish", "text": "37 hrs !! 👏", "likes": 0}}, {"topLevelComment": {"author": "Salib Haldar", "text": "FlutterAppRequiredException: The current directory does not appear to be a Flutter application project.\n\nI am getting this error during firebase setup when I run flutterfire configure", "likes": 0}}, {"topLevelComment": {"author": "Ismail Hossain", "text": "It is a huge course, is it worthy or time consuming?", "likes": 0}}, {"topLevelComment": {"author": "Miloš Drašković", "text": "Finally a course from a professional developer(not from a CS student, like lots of courses on FCC lately), but it is a to-do app, and it is 36 hours :/", "likes": 0}}, {"topLevelComment": {"author": "The soaring guy", "text": "36 hours?!?!?!?!?", "likes": 0}}, {"topLevelComment": {"author": "أحمد الزبيدي Ahmed Alzubaidi", "text": "Thanks ❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Madson Caminha", "text": "Dude 37 hour. THIRTY SEVEN HOURS, ??????\nI cannot say anything else than THANK YOU!", "likes": 0}}, {"topLevelComment": {"author": "Lotfi O.Rouis", "text": "Thank you very much for this content. Unfortunately 37hours is too long for such a simple App :(", "likes": 0}}, {"topLevelComment": {"author": "macs0544", "text": "This is asking a lot for a 36 hour content but I wish there were timestamps.", "likes": 0}}, {"topLevelComment": {"author": "Nabajyoti Borah", "text": "This much long course for Django , fastapi 👍 needed please", "likes": 0}}, {"topLevelComment": {"author": "Ranses Canelôn", "text": "great, when react native????", "likes": 0}}, {"topLevelComment": {"author": "Craulback", "text": "At 7:51:51 if you still get an error saying \"FirebaseCommandException: An error occured on the Firebase CLI when attempting to run a command.\"\nYou likely have to create your accounts first project at https://console.firebase.google.com in order to accept the terms and conditions", "likes": 10}, "replies": [{"author": "Pastelin", "text": "omg you save me!! Thanks", "likes": 1}, {"author": "Nk", "text": "My guy! Thank you brother sir", "likes": 1}]}, {"topLevelComment": {"author": "abdulmalik ganijonov", "text": "OMG", "likes": 0}}, {"topLevelComment": {"author": "MiraXcode", "text": "This flutter course is simply the best I've seen online. Teaches dart concepts in simple terms. \nI can't thank you enough for this course and several other courses here on freecodecamp. 37 hours of tutorials on youTube, is simply amazing", "likes": 2}}, {"topLevelComment": {"author": "Nithin Sai", "text": "it's probably very difficult to do, but the video could be split up into smaller parts with time stamps or chapters", "likes": 1}, "replies": [{"author": "Đức Duy", "text": "its on his youtube channel, check it out", "likes": 0}]}, {"topLevelComment": {"author": "Filip Vabroušek", "text": "Amazing!", "likes": 0}}, {"topLevelComment": {"author": "Yᴇᴀsᴇᴇɴ Rᴀғι", "text": "How you guys upload this video?", "likes": 0}}, {"topLevelComment": {"author": "Wissem Aljazairi", "text": "Really 😂.. 36 hours for free", "likes": 0}}, {"topLevelComment": {"author": "D W", "text": "谢谢！", "likes": 1}}, {"topLevelComment": {"author": "Kushh", "text": "THANKSSS!!!", "likes": 0}}, {"topLevelComment": {"author": "Abhineswar King", "text": "I have been witnessing the flutter release upgraded versions eventually... Does this course is up to date in 2022 which will save me time with future upgrades", "likes": 0}}, {"topLevelComment": {"author": "Test 55", "text": "If you want to encrypt your files, like not only text files or stuff like that, but images, videos, and audios(and freely passing them over the internet without fearing someone viewing the main content or something), then check out this free windows application - https://ryuninyuri.itch.io/zshift", "likes": 0}}, {"topLevelComment": {"author": "Kode Terbuka", "text": "Yeay", "likes": 0}}, {"topLevelComment": {"author": "Faizal Heesyam", "text": "(why are we whispering....?)", "likes": 2}}, {"topLevelComment": {"author": "Amaan Mohammed", "text": "Great video and all \nbut I just have one question How long did it take to upload this omg!", "likes": 0}}, {"topLevelComment": {"author": "Marcox385", "text": "Aight, one last video before bed", "likes": 2}}, {"topLevelComment": {"author": "Israel Robinson", "text": "This channel is one of the reasons why most people learn programming on YouTube. 👌😎.", "likes": 1}}, {"topLevelComment": {"author": "user ct", "text": "this could be done in 3 HOURS with react native", "likes": 0}}, {"topLevelComment": {"author": "Pablo Artero", "text": "Automatic subtitles are not working. and playback on Android stops abruptly. even the application closes and I have to restart it. probably a 36 hour video was too much", "likes": 0}}, {"topLevelComment": {"author": "fazly qa", "text": "I started yesterday by 22 pm and going on, now Im almost 12 hours completed. My experience is still amazing, and convinced to complete the entire video. A very good informative tech guide and thank you for sharing. For sure I will help you out. Thanks. Let me share my complete experience once completed.  👍😀", "likes": 9}, "replies": [{"author": "Trendy Witch", "text": "@Carlos Santamaria Take up this course, start and see for yourself", "likes": 0}, {"author": "Carlos Santamaria", "text": "Is this free course totally worth it?\nBecause there are some on udemy that i see they are good but are not free, what should i do??", "likes": 0}, {"author": "Abid Abdullah", "text": "Have you completed?", "likes": 0}, {"author": "Dhruv Parekh 20_53", "text": "you done?? how much left???", "likes": 0}]}, {"topLevelComment": {"author": "Teddy", "text": "r u crazy bro", "likes": 0}}, {"topLevelComment": {"author": "dipanjan das", "text": "Thank you. \nPlease make a complete tutorial about React Native for App development.\n🙏🙏🙏", "likes": 0}, "replies": [{"author": "Glen McInnis", "text": "At 2:03:38 Control S no longer prints to console in Windows 10. I made sure the code is exactly as you have it and calling test as test(); the first line in Widget build. The function void test is word for word and syntaxes exact placed between void main function and before class MyApp. Anybody else have this problem?", "likes": 0}]}, {"topLevelComment": {"author": "Hyrulia", "text": "I'm watching this in one go", "likes": 0}}, {"topLevelComment": {"author": "Joséph Zoghdidi", "text": "thank you so much for your flutter tutorials bro                                                                                                 watch this debate to find the truth of many questions... https://youtu.be/qgYMuRqXPr0", "likes": 1}}, {"topLevelComment": {"author": "Ananta Shrestha", "text": "I was a kid 37 hours ago. I am a man now.", "likes": 8}, "replies": [{"author": "PunditG", "text": "Nepali dekhda khusi lagxa", "likes": 0}]}, {"topLevelComment": {"author": "Arham Sarwar", "text": "Osm", "likes": 2}}, {"topLevelComment": {"author": "Omkar Keni", "text": "Chapter 2   39:14", "likes": 1}}, {"topLevelComment": {"author": "Aznood", "text": "i need a fluteer training buddy", "likes": 1}}, {"topLevelComment": {"author": "Petrus Muara", "text": "Amazing Effort. this is no doubt a course that should not be free, but made free by you guys. Hats off to Vandad Nahavandipoor to make the course. and guys from freecodecamp to make it happen. Brilliant", "likes": 2}}, {"topLevelComment": {"author": "SEHAN RAKESH", "text": "the course is really pretty but sometimes i feel some laggy to tell something any thankyou  for such a great effort", "likes": 2}}, {"topLevelComment": {"author": "Muhand Alghoraiyr", "text": "39:13 (chapter 2)", "likes": 1}}, {"topLevelComment": {"author": "Amit Mohapatra", "text": "why can't i view this?", "likes": 1}}, {"topLevelComment": {"author": "daniilrozyev", "text": "37 hours!", "likes": 1}}, {"topLevelComment": {"author": "Akash Amin", "text": "Please make a video on Java-like this", "likes": 1}}, {"topLevelComment": {"author": "Elvire Prod", "text": "Hello, thank you for this great job.\r\nIs it possible to have a French translation or French subtitles? Thank you", "likes": 1}}, {"topLevelComment": {"author": "polash Banik", "text": "Just waiting for this", "likes": 1}}, {"topLevelComment": {"author": "Tubular Animator", "text": "🤣 A course that's over a day long. I love it.", "likes": 1}}, {"topLevelComment": {"author": "Gustavo Fenilli", "text": "This is amazing, but as flutter is also comming for desktop and web, a good followup could be a Flutter web/desktop course too!", "likes": 17}}, {"topLevelComment": {"author": "NossaAmorTo Based", "text": "Up", "likes": 1}}, {"topLevelComment": {"author": "Aswin Kumar", "text": "You guys are legend 🤩", "likes": 1}}, {"topLevelComment": {"author": "Junaid", "text": "Please also make same course for React Native as well 😇", "likes": 1}}, {"topLevelComment": {"author": "Tubular Animator", "text": "Such a good course!", "likes": 0}}, {"topLevelComment": {"author": "PROGRESS", "text": "hes background was my wallpaper", "likes": 0}}, {"topLevelComment": {"author": "Akar J", "text": "Why caption not available 😢", "likes": 1}}, {"topLevelComment": {"author": "sama mukefor", "text": "thank you so much man...i have finally found the one", "likes": 0}}, {"topLevelComment": {"author": "هواتف", "text": "❤️❤️❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Ryan Murraye", "text": "nc", "likes": 0}}, {"topLevelComment": {"author": "suraj", "text": "This flutter course is better than Udemy paid course", "likes": 0}}, {"topLevelComment": {"author": "Dragon", "text": "it is one of the best free course", "likes": 1}}, {"topLevelComment": {"author": "Dragon", "text": "we want 50 hours of android development course.it was a great course.thank you so much", "likes": 1}}, {"topLevelComment": {"author": "kawhao", "text": "oh my…. in last week i’m begin learning flutter. LOL", "likes": 0}}, {"topLevelComment": {"author": "Blessed Child", "text": "So excited!! I just started going to school for software engineering and I’m a beginner on learning how to code!! Excited to try this out!!", "likes": 1}}, {"topLevelComment": {"author": "The WebShala", "text": "please explain programing   this game by flutter\nname  is     Word Connect-Brain Puzzle Game\nhttps://www.youtube.com/watch?v=fyJbyTY5EEA", "likes": 0}}, {"topLevelComment": {"author": "beRich", "text": "just started and i will complete it", "likes": 0}}, {"topLevelComment": {"author": "Manila Randoms", "text": "Wow, it even has timestamps. Thank you very much for your hard work! This will save people hundreds of dollars", "likes": 1}}, {"topLevelComment": {"author": "MuhammadAmmar Arshad", "text": "does this course cover the concepts like object-oriented programming?", "likes": 0}}, {"topLevelComment": {"author": "Kunal Pangare", "text": "Thank for this course 🔥", "likes": 0}}, {"topLevelComment": {"author": "Ashwin Raj", "text": "Does this course need any prerequisite?", "likes": 0}}, {"topLevelComment": {"author": "Jamel Edine Mrad", "text": "fk ... this guys knows everything ...\nseeing in almost every tutorial...", "likes": 0}}, {"topLevelComment": {"author": "The AMKz", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Rohit Kashyap", "text": "Just Like this please come up with 30+ hours Data Science course with Python .", "likes": 0}}, {"topLevelComment": {"author": "Rohit Kashyap", "text": "Just Like you have created 31 hours C++ and 37 hours Flutter. Please come up with 30+ hrs for React Redux Node  Express Mongo SQL AWS", "likes": 1}}, {"topLevelComment": {"author": "fahad jhon", "text": "thanks", "likes": 0}}, {"topLevelComment": {"author": "Equilibrium", "text": "Respect for this video ✌\nMaybe someday React Native 😇", "likes": 0}}, {"topLevelComment": {"author": "xyz zyx", "text": "Anybody already watched the whole thing? I want to jump to sqflite section  if available", "likes": 0}}, {"topLevelComment": {"author": "xyz zyx", "text": "Omg.", "likes": 0}}, {"topLevelComment": {"author": "Elmir Mahmudov", "text": "Omg", "likes": 0}}, {"topLevelComment": {"author": "Maurice Gilberth", "text": "Been waiting for this all my life", "likes": 0}}, {"topLevelComment": {"author": "Ayush Niroula", "text": "nOW ALL WE NEED IS THIS LONG GOLANG TOTURIAL AND production build full stack web app and we need no universityy", "likes": 1}, "replies": [{"author": "Shamith", "text": "read my mind", "likes": 0}]}, {"topLevelComment": {"author": "Jakhongir Akhmadjonov", "text": "THANK YOU GUYS", "likes": 0}}, {"topLevelComment": {"author": "Bharadwaj sai Bandaru", "text": "Thank you very much freecodecamp for the course . Need more like these for NodeJS and Django too.", "likes": 3}}, {"topLevelComment": {"author": "Michael Wong", "text": "tbh it's the first time I saw three : in the time bar!", "likes": 1}}, {"topLevelComment": {"author": "Adamu Fura Suleiman", "text": "Hey, thank you very much", "likes": 0}}, {"topLevelComment": {"author": "Michał Bąk", "text": "Wait, didn't youtube have like a 12 hour length limit?", "likes": 1}}, {"topLevelComment": {"author": "Brynold", "text": "Jesus Christ bless these guys 👍😁", "likes": 0}}, {"topLevelComment": {"author": "Asad Naeem", "text": "sorry canot give u the view...as I am downloading it....but still I love your content ....10000000 of likes from me", "likes": 0}}, {"topLevelComment": {"author": "Sunnat e Rasool", "text": "May be longest video on Youtube", "likes": 0}}, {"topLevelComment": {"author": "Umut Demir", "text": "Where is the timestamp?", "likes": 0}, "replies": [{"author": "pitlord", "text": "on description", "likes": 0}]}, {"topLevelComment": {"author": "Saksham Srivastava", "text": "I absolutely love your course, can you also add dividers for better navigation through chapters.", "likes": 2}}, {"topLevelComment": {"author": "Shariar R. Arif", "text": "😮", "likes": 0}}, {"topLevelComment": {"author": "Hendratara Pratama", "text": "It will be more better if add section on YouTube play", "likes": 1}}, {"topLevelComment": {"author": "Explore the World To Forget Yourself 🏞🏍", "text": "Omg Unbelievable thank you so much", "likes": 0}}, {"topLevelComment": {"author": "C. Michael Fisher", "text": "What was the cup of coffee link?", "likes": 0}}, {"topLevelComment": {"author": "ArC", "text": "Damn i thought c++ was the longest 🤣", "likes": 0}}, {"topLevelComment": {"author": "Deepak Harish", "text": "You got to be kidding me\n37 hours🤯\nThanks for the content", "likes": 0}}, {"topLevelComment": {"author": "Dan Musee", "text": "pumped up❤️", "likes": 1}}, {"topLevelComment": {"author": "vikas⚡ kumar ⚡ bihari", "text": "thanks, bro and I subscribe to your channel.\nhoping to see more", "likes": 0}}, {"topLevelComment": {"author": "Web Focus", "text": "respect !!!", "likes": 0}}, {"topLevelComment": {"author": "slashd", "text": "37 hours, omfg!", "likes": 0}}, {"topLevelComment": {"author": "Livingston", "text": "Can you provide timestamp with title, please cause it's easier to understand.", "likes": 0}}, {"topLevelComment": {"author": "bimal inc", "text": "This is mind blowing course that the vandad has created for 36 hours. Developer's are really pushing hard to their limits to teach on YouTubes. \nReally appreciate you guys.", "likes": 6}}, {"topLevelComment": {"author": "Prabhupad Swain", "text": "Hi Freecodecamp, do you have a React Native course similar to like this. A React Native CLI tutorial will be better.", "likes": 1}, "replies": [{"author": "rubickon", "text": "react native is history. you better lear flutter", "likes": 0}]}, {"topLevelComment": {"author": "Muhammad Adil Naeem", "text": "Project creation:\nCD desktop \nflutter create project name\ncode .", "likes": 0}}, {"topLevelComment": {"author": "praveen gopu", "text": "Confirm if I learn with this I absolutely different from 90% flutter developer", "likes": 0}}, {"topLevelComment": {"author": "Arinze Gerald", "text": "I really want to cry right now. I've been struggling with this course on Udemy for weeks. y'all made my day. thanks so much", "likes": 0}}, {"topLevelComment": {"author": "Shamith", "text": "Timestamps and sections would've been helpful still great Thanks for this :)", "likes": 0}}, {"topLevelComment": {"author": "Harsh Mirdhwal", "text": "I suspect you are the angels sent by God for this very stuff that you have uploaded!", "likes": 1}}, {"topLevelComment": {"author": "Muhammad Adil Naeem", "text": "plz make a course in hindi urdu", "likes": 0}}, {"topLevelComment": {"author": "Tech Boldy", "text": "Ohh no you are providing the paid content for free I can't believe 🤩 awesome 👌", "likes": 0}}, {"topLevelComment": {"author": "Nodirbek Nazarov", "text": "I am almost in tears because of what you did. Good people live everywhere. This is fantastic and mind-blowing. I can't express my gratitude with words. Much love and respect!", "likes": 4}}, {"topLevelComment": {"author": "Biowulf", "text": "Damn, I've been looking for a Flutter Tutorial. This is awesome! Will donate as soon as I can. Amazing value.", "likes": 2}}, {"topLevelComment": {"author": "incognito man 🥸", "text": "I M P R E S S I V E 💕", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Akram", "text": "WOW", "likes": 0}}, {"topLevelComment": {"author": "soki", "text": "Wait i thought 24 hours is the limit on YouTube 🤔😸", "likes": 0}}, {"topLevelComment": {"author": "The Average Teens | ATs 👾", "text": "37 Hours …HERE WE GOOOOO\n\nAny *mr./ms. Bookmark* yet", "likes": 0}}, {"topLevelComment": {"author": "KESHAV RAJ", "text": "Watch some shorts to pass time.\nOh I'm watching a 37hour course.", "likes": 0}}, {"topLevelComment": {"author": "Sahil Selfmade", "text": "please upload full course on FLutter GetX package", "likes": 1}}, {"topLevelComment": {"author": "Rob Waters", "text": "Wow 36 hours! So half an hour  72 days  1 hour each day that's 36 days. 2 hours each day 18 days. How much time do you recommend to watch these each day.", "likes": 1}}, {"topLevelComment": {"author": "Rob Waters", "text": "Has anyone completed this marathon course I've never seen a course this long.\nPlease let everyone know your thoughts.", "likes": 0}, "replies": [{"author": "Ruqaiya Sattar", "text": "Yes I have completed...it took me 1.5month.  😍 now on state management course...on chapter 9...💙", "likes": 0}]}, {"topLevelComment": {"author": "Hruaia ralte", "text": "Yeeeeessssss", "likes": 0}}, {"topLevelComment": {"author": "OnUrFace Gamming", "text": "Whom is watch full in first 21 hours plz like if you see this message", "likes": 0}}, {"topLevelComment": {"author": "SRJ 8D Music", "text": "Sir please make a Full course on Android App Development in KOTLIN", "likes": 1}}, {"topLevelComment": {"author": "Terlumun Joseph", "text": "maan i must say this is the master of all crash courses nice job", "likes": 1}}, {"topLevelComment": {"author": "oussama ayadi", "text": "Thanku", "likes": 0}}, {"topLevelComment": {"author": "Saddam Dalimunthe", "text": "Thanks bro. Still in progress. 30 hours left :)", "likes": 0}}, {"topLevelComment": {"author": "J3ns", "text": "Would you mind formatting the timestamps so that YouTube can recognize them and split the videos timeline into chapters?", "likes": 99}, "replies": [{"author": "20 02", "text": "@J3ns Why don't you be a chad and do it for others who want it? I mean they already made the 37 hour video and make many others \nMaybe they'll pin you for it 😏", "likes": 0}, {"author": "J3ns", "text": "@Arun I know that there are timestamps in the description, but they are wrongly formatted. Therefore YouTube cannot recognize them and split the video's timeline into chapters.", "likes": 6}, {"author": "Arun", "text": "Check discription", "likes": 0}]}, {"topLevelComment": {"author": "om velapure", "text": "Please make video on Blockchain Development", "likes": 0}}, {"topLevelComment": {"author": "Sankalp das", "text": "bring in java course of such length", "likes": 0}}, {"topLevelComment": {"author": "Nirvair Singh", "text": "Plz make react native video", "likes": 0}}, {"topLevelComment": {"author": "BlackStarKami", "text": "WOOOW this is the one!", "likes": 0}}, {"topLevelComment": {"author": "Hamba Allah", "text": "Wow.... Incredible for a free course.", "likes": 0}}, {"topLevelComment": {"author": "Mina Yuki", "text": "The reason for the app's name being \"com.yourname.yourappname\" is: it creates a unique namespace for your application. There might be so many apps out there called \"calculator\", so there needs to be a way to make it unique. It's kind of like packets in Java, which are also just there to create separate namespaces to avoid name collisions. Reversing the domain name has become a widely accepted standard as it ensures uniqueness.", "likes": 25}}, {"topLevelComment": {"author": "māngāi", "text": "I knew the word \"massive\" is coming!", "likes": 0}}, {"topLevelComment": {"author": "Yusuf", "text": "It would be better to have chapter wise timestamps for this video :)", "likes": 2}}, {"topLevelComment": {"author": "Repotrans tech", "text": "God bless this channel.so much good courses for free.", "likes": 0}}, {"topLevelComment": {"author": "Damilare Paul", "text": "This is great", "likes": 1}}, {"topLevelComment": {"author": "raj kumar", "text": "approx. 620gb content uploaded, \nman, no words.", "likes": 1}}, {"topLevelComment": {"author": "__________________________________________________", "text": "you are funny too", "likes": 1}}, {"topLevelComment": {"author": "Aru Srivastava", "text": "Can I still learn flutter without an apple developer account??", "likes": 1}}, {"topLevelComment": {"author": "CTILET", "text": "Are you serious?", "likes": 1}}, {"topLevelComment": {"author": "TheTruth Only", "text": "You people are legends", "likes": 1}}, {"topLevelComment": {"author": "angyeet", "text": "BRO i literally installed flutter two days ago too, you people are mind readers", "likes": 1}}, {"topLevelComment": {"author": "Akash Shelar", "text": "Why is it written android app development in the title? I was not going to check video cuz I thought it only for android developers. This might reduce the views. Maybe replace the word android with mobile. Also, whoaaa, impressive work guys thanks for it.", "likes": 0}}, {"topLevelComment": {"author": "Steven Witata", "text": "37 hours? sign me right up", "likes": 0}}, {"topLevelComment": {"author": "Mustafa Anas", "text": "holy. this is gold!", "likes": 0}}, {"topLevelComment": {"author": "Sir XtC", "text": "i read 37 minutes xd", "likes": 0}}, {"topLevelComment": {"author": "Benji Pif", "text": "I found Gold! thank you sir!", "likes": 0}}, {"topLevelComment": {"author": "A J Wright", "text": "Benefit of reversed domain naming is the same as ISO-8601 time - it means that if you natural sort every single app on a platform by name, all of a given developer's apps will be together, whereas if saved by sub.domain.tld there's no pattern without some additional prefix.", "likes": 10}}, {"topLevelComment": {"author": "Kasun Akalanka", "text": "Hey freeCodeCamp, you should be publishing more videos on react natve!", "likes": 0}}, {"topLevelComment": {"author": "StaticBlaster", "text": "I remember when YouTube started. you couldn't' upload videos more than 10 minutes. Now you can upload videos that are more than a day. That's insanity.", "likes": 2}}, {"topLevelComment": {"author": "Tomi Renaldi", "text": "Naiseeeee !", "likes": 0}}, {"topLevelComment": {"author": "Shaman Sharif", "text": "Seriously? 37 hour video?", "likes": 0}}, {"topLevelComment": {"author": "Supun Sandaruwan", "text": "Thanks :D", "likes": 0}}, {"topLevelComment": {"author": "JANA M", "text": "Thanks for course. By the way this is already in his channel", "likes": 0}}, {"topLevelComment": {"author": "Divyanshu Singh", "text": "Free code camp please make a complete advance python course for experts\nI really loved the effort", "likes": 2}, "replies": [{"author": "Divyanshu Singh", "text": "Ya sure", "likes": 0}]}, {"topLevelComment": {"author": "sappydev", "text": "1 hour down , 36 more to go! So far setup the environment and now jumping to learning Dart. Will update as I learn here", "likes": 0}, "replies": [{"author": "Kaz", "text": "Didn't finish the course?", "likes": 0}, {"author": "Ryan McKnight", "text": "@sappydev What happened? why did you stop? \nHope you got to finish the course and can you provide an update of what you have done after finishing it and how you have applied it?", "likes": 0}, {"author": "sappydev", "text": "9 hours down. Learning about the firebase authentication with the flutter along with the widgets. It is getting little difficult to wrap my head around it . I will still push through to learn.", "likes": 1}, {"author": "sappydev", "text": "8 Hours down. 29 more to go. This is little difficult trying to follow on windows machine as there are some subtle differences of running the code from the terminal vs cmd . But I was able to setup by firebase and everything needed to push forward. Discord server folks helped me! If you are on this path, keep pushing. More to learn ....", "likes": 0}, {"author": "sappydev", "text": "7 Hours down. Learned about the app setup for IOS and now heading to android . Hopefully can test my app as well. Great learning. If you are on this path, keep learning", "likes": 0}]}, {"topLevelComment": {"author": "Abhijeet Bora", "text": "it's helpful but I'll do it later", "likes": 0}}, {"topLevelComment": {"author": "Mamadou Doumbia", "text": "This chanel is going to make online paid course websites obsolete.", "likes": 0}}, {"topLevelComment": {"author": "Adam", "text": "You are amazing ,, WoW", "likes": 0}}, {"topLevelComment": {"author": "Sudip Adhikari", "text": "i saved this video gonna watch it later but honestly appreciate your efforts.", "likes": 0}}, {"topLevelComment": {"author": "Parsa", "text": "Legend and epic channel!", "likes": 0}}, {"topLevelComment": {"author": "Yoratoni", "text": "I started learning Dart & Flutter yesterday, and I was a bit disappointed by the lack of tutorials on Youtube, it's not the case anymore lol", "likes": 0}}, {"topLevelComment": {"author": "Joel Campos", "text": "Next: learn Angular in 29 days", "likes": 0}}, {"topLevelComment": {"author": "LukasBeck", "text": "1:11:22:20 my favourite part", "likes": 0}}, {"topLevelComment": {"author": "Faizan Tayyab", "text": "plz launch react native course  also", "likes": 1}}, {"topLevelComment": {"author": "Pauline H", "text": "Omg 37 hours who has the patience", "likes": 0}}, {"topLevelComment": {"author": "Infect 3ds", "text": "Wonderful, I appreciate the free knowledge you've given to me.", "likes": 2}}, {"topLevelComment": {"author": "Narcissistic Narcissus", "text": "Do not follow this!\nAround 30 hour mark he switches to React Native!\n\n\n\n\nJust Kidding!", "likes": 1}}, {"topLevelComment": {"author": "Summerhead", "text": "Is that Twaimz father?", "likes": 0}}, {"topLevelComment": {"author": "Tejas Pawar", "text": "This is epic man. Exactly what I was looking for. You are a saviour. ❤️", "likes": 2}}, {"topLevelComment": {"author": "Free-Techno Online - Coding and I. T. ", "text": "Wonderful tutorials as always💖💖", "likes": 1}}, {"topLevelComment": {"author": "Wraith", "text": "This is what I was waiting for. Thank you so much ❤️🔥", "likes": 1}}, {"topLevelComment": {"author": "Harold Melvin Gordon", "text": "Nice content man", "likes": 25}, "replies": [{"author": "Christina Hudson R", "text": "He's really  amazing with an amazing skills he changed my 0.3btc to 2.1btc", "likes": 0}, {"author": "Christina Hudson R", "text": "@Russell Cardo I've worked with 4 traders in the past but none of them is as efficient as he is, his trading strategies are awesome !", "likes": 0}, {"author": "Russell Cardo", "text": "@ADMINExpert Joshau has been managing my trade for months and I keep making profits every week , made $9,130 last week", "likes": 0}, {"author": "ADMIN", "text": "I got Mr Joshau info how good is he ?", "likes": 0}, {"author": "♖ Pìnned_by P R Sundar", "text": "@ADMIN Trading without a professional like  Expert Joshau Greg is like gambling with your money", "likes": 0}]}, {"topLevelComment": {"author": "yumindev", "text": "Is this Flutter or Flutter 2 ?", "likes": 0}}, {"topLevelComment": {"author": "Daniel Rocha", "text": "I'm very thankful for this course", "likes": 0}}, {"topLevelComment": {"author": "kev gr", "text": "36h00 for a todo list 😑", "likes": 0}}, {"topLevelComment": {"author": "c j", "text": "You guys really spoil us with this stuff", "likes": 0}}, {"topLevelComment": {"author": "Timur Niyazov", "text": "That's something that i need, thank you for your work.", "likes": 1}}, {"topLevelComment": {"author": "Camera Coverage", "text": "Love the channel ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "Basile Talla", "text": "Whaoh whaoh whaoh, you guys are legend, you guys rock. Thank you freecodecamp for this course. Well done 👍", "likes": 0}}, {"topLevelComment": {"author": "HONEY MASSEY", "text": "Thanks, FreeCodeCamp 💝💝", "likes": 0}}, {"topLevelComment": {"author": "Mayank Vikash", "text": "Is there a competition in Free code camp for making the longest tutorial?", "likes": 1}}, {"topLevelComment": {"author": "abcd efg", "text": "Oh My God...", "likes": 1}}, {"topLevelComment": {"author": "MONARCH GAM3R -CODM-", "text": "Wow, this is massive", "likes": 0}}, {"topLevelComment": {"author": "Trollazord", "text": "just watched it all in 4 hours", "likes": 1}}, {"topLevelComment": {"author": "Nishant Nimish", "text": "Here after 4 hours since the video got released", "likes": 0}}, {"topLevelComment": {"author": "Web Master", "text": "This is incredible! What a great content!\nRespect ❤️", "likes": 3}}, {"topLevelComment": {"author": "Ayush Tiwari", "text": "Much awaited!", "likes": 0}}, {"topLevelComment": {"author": "Ludant", "text": "How can flutter video about learning it in single video to be 6 hours longer than C++ one. Are memes were lying?", "likes": 0}}, {"topLevelComment": {"author": "Dorkenoo Elvis", "text": "This guy put 36 HOURS of Flutter courses online for FREE… \nNot all heroes wear capes", "likes": 21}, "replies": [{"author": "A J Wright", "text": "I think we need to buy him one.", "likes": 2}]}, {"topLevelComment": {"author": "Rahul Saha", "text": "Wait ... What!!! 37hrs", "likes": 0}}, {"topLevelComment": {"author": "Kai Green", "text": "Incredible work !!. This happens when u love your profession so much and u want everyone to love it tooo . Thanku sooo much . ❤️", "likes": 2}}, {"topLevelComment": {"author": "Gremmy Uchia", "text": "Love you guys", "likes": 0}}, {"topLevelComment": {"author": "Yahya Abulhaj", "text": "Yo where is the introduction video that he is speaking about !", "likes": 0}}, {"topLevelComment": {"author": "Kushal Kumar", "text": "I will release apps on F-Droid instead.", "likes": 0}}, {"topLevelComment": {"author": "gyanAsh ekka", "text": "WoW !!", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Mushfiqur Rahman", "text": "We need a React Native tutorial. Please.....", "likes": 1}}, {"topLevelComment": {"author": "rutwik mekala", "text": "Absolutely Legendary! Right when I wanted an in depth Flutter course.", "likes": 4}, "replies": [{"author": "Yoratoni", "text": "Same ! I'm pretty sure that they're spying on us lol", "likes": 2}]}, {"topLevelComment": {"author": "Mahamudul Hasan", "text": "This YouTube channel deserve more and more subscriber ❤️ \n\nLove from Bangladesh 🇧🇩", "likes": 1}}, {"topLevelComment": {"author": "Soumik Banerjee", "text": "36 hours for free? Wow.", "likes": 0}}, {"topLevelComment": {"author": "Anon", "text": "Nearly 37 hours of video and a lot more in making and editing, all for free!!!\nThank you guys!", "likes": 35}, "replies": [{"author": "mart shop", "text": "Did it help u start ur carrer ?", "likes": 1}]}, {"topLevelComment": {"author": "Joy Saha", "text": "I love you #freeCodeCamp❤️", "likes": 0}}, {"topLevelComment": {"author": "Super - eth", "text": "FCC in 2030 : Here is a 365 day long course on Programming a Mars Rover.", "likes": 1159}, "replies": [{"author": "Ashutosh Shelke", "text": "😂 Lollollol", "likes": 0}, {"author": "Prince Yadav", "text": "😂😂😂😂", "likes": 0}, {"author": "Elon Musk Fanclub", "text": "Ok", "likes": 0}, {"author": "Prachurya Ray", "text": "😂😂", "likes": 0}, {"author": "iliyas hussain", "text": "😂😂😂", "likes": 0}]}, {"topLevelComment": {"author": "Sub", "text": "I was just looking for this haha. Perfect timing", "likes": 0}}, {"topLevelComment": {"author": "TiaanCJ Els", "text": "Awesome thanks. Done and dusted", "likes": 0}, "replies": [{"author": "Tahmid Rafi", "text": "Have you completed this course?", "likes": 0}]}, {"topLevelComment": {"author": "Sharan Nagarajan", "text": "Beautiful!!", "likes": 0}}, {"topLevelComment": {"author": "Witherin -_-", "text": "\"this massive flutter course\" what do you mean massive this is bigger than your usual day.", "likes": 0}}, {"topLevelComment": {"author": "Anshul Tripathi", "text": "This is insane 🔥🔥🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "Pol", "text": "can you guys do one for manim?", "likes": 0}}, {"topLevelComment": {"author": "Mahmudov Asliddin", "text": "Wow! Thank you very much!!!", "likes": 0}}, {"topLevelComment": {"author": "Khan Zubair", "text": "Everything is fine but why today a sooo short video..\nBut ❤️", "likes": 0}}, {"topLevelComment": {"author": "Inhyuk Choi", "text": "Damn... 37 hours?! this is crazy", "likes": 0}}, {"topLevelComment": {"author": "FKN XIV", "text": "Wowwww... Thank you very much", "likes": 0}}, {"topLevelComment": {"author": "F3 fun fun fun", "text": "నానమ్మల కాలం నాటి కాల్చిన వంకాయ టమాటోలతో రుచికరమైన పచ్చడి/roasted brinjal tomato chutney||https://youtu.be/1bsVjzP7qfY", "likes": 1}}, {"topLevelComment": {"author": "e leach", "text": "Massive!", "likes": 0}}, {"topLevelComment": {"author": "Harshal S. Hirve", "text": "The way freeCodeCamp is publishing videos, a humble request, PLS do release such a in-depth video for NEST.JS + GRAPHQL FEDERATION + MICRO-SERVICES+ KAFKA +  USER AUTH + FILE UPLOAD + ALL THE DB RELATIONSHIPS (1:1, 1:M, M:1, M:M). I know i am asking for too many things, but this will help the humanity. Thank you 😌", "likes": 2}, "replies": [{"author": "Harshal S. Hirve", "text": "GRAPHQL FEDERATION i mean...", "likes": 0}]}, {"topLevelComment": {"author": "Salman Khan", "text": "Amazing Job You done Hats off To free code camp Really Love this channel", "likes": 2}}, {"topLevelComment": {"author": "Tonmoy", "text": "Thank you so much sir", "likes": 0}}, {"topLevelComment": {"author": "Nazrudeen Tech", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "Harshal S. Hirve", "text": "Wow just amazing. I am sure tons of people must have been waiting for this course. I am definitely go through this video in full. Thank you once again.", "likes": 5}, "replies": [{"author": "AverageAtheist", "text": "@Arun When someone asks, there is never an answer here. It almost seems like there are a LOT of \"thank you so much\" bots running around praising the course to the skies.\nIt seems to me that these are all Apple/Google bots, because it's all about paying big bucks for your developer account....", "likes": 0}, {"author": "Arun", "text": "Did you complete this?", "likes": 1}, {"author": "Harshal S. Hirve", "text": "@Andrew Brown Thank you", "likes": 0}, {"author": "Andrew Brown", "text": "YOU are amazing", "likes": 0}]}, {"topLevelComment": {"author": "Trung Nguyen", "text": "Mom: Time for bed.\nMe: Just one more video.", "likes": 1}}, {"topLevelComment": {"author": "suraj Taru", "text": "Waiting for this, for a long time", "likes": 0}}, {"topLevelComment": {"author": "Getusha HD", "text": "36 Hours For Free? REALLY??", "likes": 0}}, {"topLevelComment": {"author": "Rajan Shrestha", "text": "finally, the wait is over :)", "likes": 0}}, {"topLevelComment": {"author": "Simeon Aleksandrov", "text": "Don't know how much this man is getting paid, all I know is that it isn't enough", "likes": 0}}, {"topLevelComment": {"author": "Ganesh Ram", "text": "Woww! What a massive course! Hats off free code camp! Gratitude!", "likes": 1}}, {"topLevelComment": {"author": "Omar", "text": "thank you so much 40;hour omg", "likes": 0}}, {"topLevelComment": {"author": "BeeJay", "text": "37 hours?, wow!", "likes": 0}}, {"topLevelComment": {"author": "CodingTrap", "text": "I don't have mac.... Can I start this course with windows?? Will I face any problem??", "likes": 0}, "replies": [{"author": "Serik", "text": "Yes, you can start with windows. But you can't deploy AppStore, cause you need Macos", "likes": 0}]}, {"topLevelComment": {"author": "Akib Siddiki Apu", "text": "osthir!!!!!", "likes": 1}}, {"topLevelComment": {"author": "Gourav Nainwaya", "text": "plZZ make react native", "likes": 1}}, {"topLevelComment": {"author": "Okey Shourov Roy", "text": "Oh my god😀😀", "likes": 0}}, {"topLevelComment": {"author": "ChairilAli Art", "text": "This is will be legit🔥", "likes": 0}}, {"topLevelComment": {"author": "Umut", "text": "Yes sirrrrrrr lets fucking get it ! 😎", "likes": 0}}, {"topLevelComment": {"author": "Dhwaj Sharma", "text": "Vscode theme?", "likes": 1}}, {"topLevelComment": {"author": "Hamza Ben hmmou", "text": "Unbelievable !!!!!", "likes": 0}}, {"topLevelComment": {"author": "ChairilAli Art", "text": "Just WOW", "likes": 0}}, {"topLevelComment": {"author": "Pratyush", "text": "App development certification coming live shortly on Free code camp website ig.", "likes": 0}}, {"topLevelComment": {"author": "nahom desta", "text": "every time i come back here there is a new impressive course realeased thank you fcc great work", "likes": 1}}, {"topLevelComment": {"author": "José Freitas", "text": "Hi mom, I'm early this time!", "likes": 0}}, {"topLevelComment": {"author": "TESLA SpaceX Tech", "text": "Can you guys @freecodecamp team release a 37hr long java course?\nYou are a blessing to the human race.\nKudos!", "likes": 0}}, {"topLevelComment": {"author": "Futaa360", "text": "God bless you...", "likes": 0}}, {"topLevelComment": {"author": "Suman Mitra", "text": "Awesome", "likes": 0}}, {"topLevelComment": {"author": "Good Boi", "text": "37 hours long YT video?! Absolute madlads!\nLove y'all! Keep up the good work!", "likes": 5}}, {"topLevelComment": {"author": "Fahad Ali", "text": "Parents : just one vid before bed.\n Me: Salute.", "likes": 0}}, {"topLevelComment": {"author": "Phillip Frost", "text": "ok but, how long did this video upload take??", "likes": 0}}, {"topLevelComment": {"author": "Lasue", "text": "0:22 \"Designed this course for beginners\" bc god bnake ke xhodunga", "likes": 0}}, {"topLevelComment": {"author": "VideoZex", "text": "Great Job. Thanks for sharing it", "likes": 0}}, {"topLevelComment": {"author": "markizapoimeniliza", "text": "LEGENDS.", "likes": 0}}, {"topLevelComment": {"author": "Hass Asraf", "text": "What a big shot", "likes": 0}}, {"topLevelComment": {"author": "Ahmad", "text": "You the best ❤️❤️❤️", "likes": 0}}, {"topLevelComment": {"author": "kipkemboi kibet", "text": "Great!!!, this video came at the right time", "likes": 0}}, {"topLevelComment": {"author": "You", "text": "This is what I've been waiting for....Thank you so frickin much", "likes": 0}}, {"topLevelComment": {"author": "📣albart", "text": "Booom💥\n37 hours 😀😀😀😀😀", "likes": 0}}, {"topLevelComment": {"author": "Mahendra Nath", "text": "Thank you so much 👍🏼🎉⭐🙏❤️, subscribed to your channel as well 👍🏼", "likes": 0}}, {"topLevelComment": {"author": "Thomas", "text": "I have Android app development this semester, and freeCodeCamp is back to the rescue 🙏🏻💪🏻🔥", "likes": 2}}, {"topLevelComment": {"author": "Magic Caspian", "text": "When you teach us Qt creator ?", "likes": 0}}, {"topLevelComment": {"author": "Pink Crab Hands", "text": "I swear I was searching for Flutter guides right now, a few hours ago I finished setting it up in my laptop by myself, and I enter Youtube and I find this tutorial. Absolutely insane lol. Thanks a lot!!!!", "likes": 18}}, {"topLevelComment": {"author": "AbdUlrahman", "text": "LEGENDS", "likes": 0}}, {"topLevelComment": {"author": "Mikail Raja", "text": "Yooo I was looking for resources to learn flutter for a few days now. Lucky me!", "likes": 0}}, {"topLevelComment": {"author": "Phil Joseph", "text": "This video will go down in internet history as one of the greatest tutorials of all time", "likes": 6}}, {"topLevelComment": {"author": "Drimo Dramo", "text": "omg, thank you, this is amazing!", "likes": 0}}, {"topLevelComment": {"author": "othman alyusifey", "text": "unbelievable!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Thiago Serrão Braule Pinto", "text": "OMG WOW", "likes": 0}}, {"topLevelComment": {"author": "Amjad hossain", "text": "It's my pleasure to have you freecodecamp!!!!", "likes": 0}}, {"topLevelComment": {"author": "Israel Noah", "text": "FreeCodeCamp team,you guys are awesome 🙌🙌...", "likes": 0}}, {"topLevelComment": {"author": "raman shariati", "text": "please, please, please, please, please, please, please, please do a master  course on python 3 programming language", "likes": 0}}, {"topLevelComment": {"author": "Olivier Lüthy", "text": "When will a new Ionic Course come out?\nAnd to be honst: You just have to complete the courses and some videos from freecodecamp, and after that you can easily employ you for a job.", "likes": 0}}, {"topLevelComment": {"author": "Pusp Joc", "text": "Do anyone have flutter with Nodejs backend and MongoDb database.......", "likes": 0}}, {"topLevelComment": {"author": "Lal Rem Piang", "text": "OMG!!!!! What it is? It's Full Course", "likes": 0}}, {"topLevelComment": {"author": "xrtt356", "text": "37h whatttt ttt", "likes": 0}}, {"topLevelComment": {"author": "Artificial Intelligence", "text": "Today I just have 37 hours free, so you made my day 😊", "likes": 1}}, {"topLevelComment": {"author": "Shayan Memarzadeh", "text": "Wow, this channel never ceases to amaze me - I can't believe the amount of free knowledge you all share. AMAZING!", "likes": 5}}, {"topLevelComment": {"author": "Elanila Srinath", "text": "Thank you for being generous to upload this course for free.. Literally I have very less money( because I have incurred loss in my past two fashion business continuously) but have a passion to get into tech industry but doesn't have any prior tech knowledge in the age of 34 I'm starting from zero now and by this time I found your channel and it is literally lifeline for me and now you gave me the hope that I can get a job and to survive in my life  🙏 Thanks a lot for this ❤️", "likes": 89}, "replies": [{"author": "mohammed siddique", "text": "@hackerprincess Your comment gentle reminds me that life has immature as$holes no matter what, we just need to go through you as if you don't even exist,", "likes": 0}, {"author": "Gautam Bedi", "text": "@Soumaya Dahel no stress 👍", "likes": 0}, {"author": "Soumaya Dahel", "text": "@Gautam Bedi tysm🥰", "likes": 0}, {"author": "Gautam Bedi", "text": "@Soumaya Dahel He used vs code and for the mobile model he used android studio. \n coding will be done in vs code. \nI hope it clears your confusion", "likes": 1}, {"author": "Soumaya Dahel", "text": "could i ask what IDE he used ? vs code or android studio", "likes": 0}]}, {"topLevelComment": {"author": "Mubashir Shehzad", "text": "13 months too late, but thanks. Much appreciated.", "likes": 0}}, {"topLevelComment": {"author": "Giang learning", "text": "Amazing effort. Thank you so much.", "likes": 1}}, {"topLevelComment": {"author": "Rivaan Ranawat", "text": "Ofcourse seen this course on Vandad's channel previously but again saying, this is the best flutter course one can take! Keep Up the great work, Flutter Community loves you😄", "likes": 145}, "replies": [{"author": "Abinash Tiwari", "text": "after your amazom fullstack course. love you bro.", "likes": 0}, {"author": "Making The Web", "text": "Slow no wonder it's 36hrs. He's slow and not rated for me as a teacher.", "likes": 0}, {"author": "Rivaan Ranawat", "text": "@Adnan hashmi Thank you so much Adnan😄", "likes": 1}, {"author": "Adnan hashmi", "text": "@Rivaan Ranawat Hi Rivaan, you are also amazing in flutter 😊", "likes": 1}, {"author": "Ismail Hossain", "text": "@Rivaan Ranawat bro, I want to learn flutter from zero, is this course helpful for me? By the way in your channel you make some good project on flutter which was my list for practice session, thanks man.", "likes": 0}]}, {"topLevelComment": {"author": "Zor", "text": "i have nothing to do with this course but \nas a self taught novice ds who mostly learns from youtube videos i  do appreciate every educational youtubers who are contributing the younger gen of developers, may be we're all supposed to make \"international edu;  youtuber day\" to show our gratitude to these angles!!\n(i am serious)", "likes": 9}, "replies": [{"author": "Adémidé Àkìnşefūnmi", "text": "Any channel recs for ds?", "likes": 0}]}, {"topLevelComment": {"author": "Gin", "text": "Unbelievable 🔥🔥🔥🔥🔥🔥🔥🔥🔥", "likes": 0}}, {"topLevelComment": {"author": "C", "text": "This is awesome !", "likes": 0}}, {"topLevelComment": {"author": "compilejs", "text": "Thank you for providing this for free. It takes lot of effort to make such videos and big heart to provide it for free. Hats off!!!", "likes": 4}}, {"topLevelComment": {"author": "Arihant Jain [IIIT H]", "text": "Really appreciated I will definitely use this course to learn flutter in my break.", "likes": 4}}, {"topLevelComment": {"author": "Danny Michelle", "text": "Have to submit a project to university this year in flutter. I got to know about it just 2 weeks ago. And here I have a 37 hour long course.\n\nFreecodecamp is reading my mind! 😵.\nGoing to complete this", "likes": 1}}, {"topLevelComment": {"author": "Crazy Tv", "text": "wow, your efforts are really appreciable man, now we can learn easily flutter, thanks freeCodeCamp", "likes": 1}}, {"topLevelComment": {"author": "Safa Bin Salam Kushal", "text": "What a awesome era to be alive <3", "likes": 0}}, {"topLevelComment": {"author": "Maulana Adam Sahid", "text": "Yo. You guys dont enough with painful 31 hours C++? 😅", "likes": 0}}, {"topLevelComment": {"author": "Berkouk Lahcene", "text": "You guys are sick ❤️❤️🙏", "likes": 0}}, {"topLevelComment": {"author": "Le Huynh", "text": "1 days 12h ._. woah", "likes": 0}}, {"topLevelComment": {"author": "Onthalovesu", "text": "This course has  been out now 37minutes 8k people watching and they another 30+hours damn", "likes": 1}}, {"topLevelComment": {"author": "omar akki", "text": "Big thanks 💚 💚 💚", "likes": 0}}, {"topLevelComment": {"author": "Brijesh Morya", "text": "Jis course ko find Kar raha tha \nVo mil Gaya \nPahle laga 37 minutes ka course ha 😆 😀😀😀😀😀😀😀😀😀😀😀😀😀❤❤❤❤", "likes": 0}, "replies": [{"author": "Zami Amaan", "text": "U watched it?  , Is it good? , Just asking cause I am searching for some good flutter tutorial", "likes": 0}]}, {"topLevelComment": {"author": "Mohamed NDIAYE", "text": "Thank you so so so much !!!\nGuys please donate to free code camp\n$5 per month is nothing compared to the work they put in !!!", "likes": 0}}, {"topLevelComment": {"author": "Giang Pham", "text": "37 hours, Unbelievable!", "likes": 0}}, {"topLevelComment": {"author": "Mintesnot Tariku", "text": "Oh Lord! Get to the point nd don't repeat urself", "likes": 0}}, {"topLevelComment": {"author": "Kharisma Wardhana", "text": "thanks freeCodeCamp ❤", "likes": 0}}, {"topLevelComment": {"author": "Abdullah Al Mahmud", "text": "💙💙💙", "likes": 0}}, {"topLevelComment": {"author": "RIJU", "text": "udemy be like-------------------------------------------------------", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Ragab", "text": "I love you guys, this is exactly the material I want 👌", "likes": 1}}, {"topLevelComment": {"author": "PRANAY RAMTEKE", "text": "You guys read my mind 😅😅😅", "likes": 1}}, {"topLevelComment": {"author": "Ardhi Sasongko", "text": "36 jam, mantap, dari Bogor nih", "likes": 0}}, {"topLevelComment": {"author": "HackerJOURNEY", "text": "May God bless you for being a blessing to the world!", "likes": 1}}, {"topLevelComment": {"author": "__________________________________________________", "text": "Hou u guys upload more than 12h videos", "likes": 0}}, {"topLevelComment": {"author": "Abc Def", "text": "A 30+ hours course on C# please.. (including Forms, WPF)", "likes": 3}}, {"topLevelComment": {"author": "Startwithsatya", "text": "Wait whaaaaaaaaaaaat 38hrs free course", "likes": 0}}, {"topLevelComment": {"author": "Banx", "text": "My god I can’t thank you guys enough for the work you put in. 36 hours is amazing", "likes": 62}}, {"topLevelComment": {"author": "Jeremiah Atillano", "text": "This is the course that I've been waiting in all of youtube. I've been watching flutter tutorials for about two years. I'm gonna be hooked on this for days. Thank you so much for this!", "likes": 345}, "replies": [{"author": "Gautam Bedi", "text": "@Brijesh Morya Nothing, He is teaching from scratch.", "likes": 0}, {"author": "Jeremiah Atillano", "text": "@Maxfrischdev I always believe in the saying \"Dig deep before you build\" so I try to learn as much as I could. Even Senior Devs continue learning.", "likes": 0}, {"author": "Maxfrischdev", "text": "In two years you could have worked through the Flutter documentation back and forth, worked through a book and created your own successful blog and/or youtube channel about Flutter development, instead of \"waiting for a tutorial\" 😅😊🙏🏻", "likes": 1}, {"author": "Jeremiah Atillano", "text": "@Sadam Khan I already graduated in college more than a decade ago.", "likes": 1}, {"author": "Sadam Khan", "text": "nope. without college degree you might not have even understand the tutorial.", "likes": 0}]}, {"topLevelComment": {"author": "Jirayu Vijjakajohn", "text": "Damn I thought 31 hours is long enough this one is even longer I bet the next one is even longer", "likes": 0}}, {"topLevelComment": {"author": "omkarjere", "text": "37 hours eh ? A little too small for my liking. :P", "likes": 0}}, {"topLevelComment": {"author": "Saad Ali", "text": "Much needed sir. Now make a course on project of flutter.", "likes": 0}}, {"topLevelComment": {"author": "Pepsi MAN", "text": "Here goes my kick start of the 37 hours , thank you freecodecamp", "likes": 0}}, {"topLevelComment": {"author": "Shantanu Chakrawarty", "text": "Simply Amazed 🐡", "likes": 1}}, {"topLevelComment": {"author": "Akram Dahmani", "text": "Unbelievable, we really appreciate your efforts!!!\nThis channel is legendary.", "likes": 465}, "replies": [{"author": "Souvik Bose", "text": "@Nuwa H. Weil Flutter will be because widgets are already made for use.... But react you have to create every components custom.... in flutter if you want you can make custom widgets... flutter is highly optimized and is owned by Google... so no security issues although security of an app depends on your development", "likes": 0}, {"author": "Nuwa H. Weil", "text": "Is Flutter better than React Native?\nI come from a web background, I am confused whether to choose...", "likes": 0}]}, {"topLevelComment": {"author": "cute cat shorts✔️", "text": "at first I thought it's 37 min. then I looked again. now I'm scared", "likes": 0}, "replies": [{"author": "cute cat shorts✔️", "text": "@Nisha Singh 🙂", "likes": 0}, {"author": "Nisha Singh", "text": "@cute cat shorts Same 🙂", "likes": 1}]}, {"topLevelComment": {"author": "Ukesh Shrestha", "text": "That's insane...", "likes": 0}}, {"topLevelComment": {"author": "Nithin", "text": "Damn freecodecamp doing gods work here thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Jhonathan Martini", "text": "a 100$ course on udemy is for free on freeCodeCamp :)", "likes": 0}}, {"topLevelComment": {"author": "Mohammed K.H.F", "text": "Amazing 👏", "likes": 0}}, {"topLevelComment": {"author": "5 Minutes", "text": "Thank you so much for this lovely & helpful video. 37 Hours 😯😱 👍", "likes": 0}}, {"topLevelComment": {"author": "The Epic Stop", "text": "Really good course", "likes": 0}}, {"topLevelComment": {"author": "Mohamad Zakaria", "text": "اللهم صل وسلم وبارك على سيدنا و مولانا محمد وعلى آله وصحبه أجمعين.", "likes": 0}}, {"topLevelComment": {"author": "Tuấn Nguyễn Ngọc", "text": "first", "likes": 0}}, {"topLevelComment": {"author": "개발하는 정대리", "text": "🍯super amazing 37 hours …", "likes": 0}}, {"topLevelComment": {"author": "Anjaneekumar Singh", "text": "These courses are more useful than most of college degrees .. Thanks FreeCodeCamp ❤️", "likes": 444}, "replies": [{"author": "Gautam Bedi", "text": "True", "likes": 0}, {"author": "Fadhil Kiima", "text": "But college is still fundamental.", "likes": 0}, {"author": "Fadhil Kiima", "text": "Much more than very useful.", "likes": 0}, {"author": "Yamikani Kalinde", "text": "There's a lot you learn in college that can't be taught here. Appreciate both", "likes": 1}, {"author": "Galaxy Anime", "text": "Which flutter sdk version is used here please reply?", "likes": 2}]}, {"topLevelComment": {"author": "Burhan Aijaz", "text": "educational video of 37 hours 🤑🤑", "likes": 0}}, {"topLevelComment": {"author": "San", "text": "That's so cool, thank you guys so much <3", "likes": 1}}, {"topLevelComment": {"author": "RastyxD", "text": "Holy shi* 37 hours also thank you for bringing best tutorial for this universe", "likes": 1}}, {"topLevelComment": {"author": "Mobi Edit", "text": "Yesterday i was searching for flutter 😳 what i see today 37 hours just amazed ....", "likes": 0}}, {"topLevelComment": {"author": "Abdul Rehman", "text": "Love you...for doing flutter course❤️", "likes": 0}}, {"topLevelComment": {"author": "Rock Johnson", "text": "thanks to the course creator who are generous enough to put these courses for free \n:)", "likes": 11}}, {"topLevelComment": {"author": "Dileeka Dasanayake", "text": "Please do a 37 hours java tutorial too🙏🙏🙏🙏🙏🙏🙏", "likes": 3}}, {"topLevelComment": {"author": "AB J", "text": "Wow 🙏 thanks so much guys", "likes": 0}}, {"topLevelComment": {"author": "Scrap!", "text": "GET OUT OF MY HEAD", "likes": 2}}, {"topLevelComment": {"author": "Sanketh B. K", "text": "This is going to take my weekend to next level. Thank you guys!", "likes": 10}}, {"topLevelComment": {"author": "saurabhggc", "text": "I though it is 37 minutes", "likes": 0}}, {"topLevelComment": {"author": "meme herp", "text": "😳", "likes": 0}}, {"topLevelComment": {"author": "gaurav bhasme", "text": "Damn", "likes": 0}}, {"topLevelComment": {"author": "Goswami", "text": "Awesome, thank you!", "likes": 1}}, {"topLevelComment": {"author": "Masrur Saidulloev", "text": "Please create full kotlin course", "likes": 0}}, {"topLevelComment": {"author": "Alberto Hong", "text": "Thanks a lot  :) :)", "likes": 0}}, {"topLevelComment": {"author": "Mohamud Sharif", "text": "Wow you must be a mind reader I have a project of a mobile app due in 2 months and you drop this", "likes": 1}}, {"topLevelComment": {"author": "Jack sparrow", "text": "Wow thank you!!", "likes": 0}}, {"topLevelComment": {"author": "Jitendra Pandey", "text": "Oh my GOD 😱...such an awesome course 👏👏👏👏👏", "likes": 3}}, {"topLevelComment": {"author": "Jeremy Trpka", "text": "I don't think I ever seen a YT video being more than a day long! Not even sleeping sound videos are that long. o.o", "likes": 5}}, {"topLevelComment": {"author": "Yusuf", "text": "Missing mike 😓😓😭😭💔", "likes": 1}, "replies": [{"author": "Raheel Arshad Shorts", "text": "@Yusuf He has his personal channel on his name", "likes": 0}, {"author": "Yusuf", "text": "@Raheel Arshad Shorts nothing.. cz not to be seen in this channel for so long that's y", "likes": 0}, {"author": "Raheel Arshad Shorts", "text": "@Yusuf what happened to him", "likes": 0}, {"author": "Yusuf", "text": "@Raheel Arshad Shorts yes 😭", "likes": 0}, {"author": "Raheel Arshad Shorts", "text": "Mike dane?", "likes": 1}]}, {"topLevelComment": {"author": "Xpectrum ent", "text": "Thanks for sharing your knowledge", "likes": 2}}, {"topLevelComment": {"author": "Irfan Ishak", "text": "♥♥♥", "likes": 0}}, {"topLevelComment": {"author": "Worldhack.1", "text": "Woooooow awesome ❤\nPlease also create a full course on react native please", "likes": 2}}, {"topLevelComment": {"author": "Miftah Faridl", "text": "great course", "likes": 2}}, {"topLevelComment": {"author": "Sha Rif", "text": "I want to js data Structure and algorithms course like 30+ hourse...", "likes": 0}}, {"topLevelComment": {"author": "ulagaraja J", "text": "awesomeeeeeeeeeeee", "likes": 1}}, {"topLevelComment": {"author": "𝑫𝒊𝒏𝒆𝒔𝒉 𝑲𝒖𝒎𝒂𝒓", "text": "This guy never disappoint us 😂😂😂", "likes": 5}}, {"topLevelComment": {"author": "YourProgrammer", "text": "O my god!! This is god's gift!!", "likes": 0}}, {"topLevelComment": {"author": "Shuaib Muhammad", "text": "Please do React Native #freecodecamp", "likes": 2}}, {"topLevelComment": {"author": "Prithvi Patil", "text": "Second", "likes": 2}}, {"topLevelComment": {"author": "ann m", "text": "This guys are blowing my mind everyday", "likes": 4}}, {"topLevelComment": {"author": "Pastor Fred", "text": "I've being waiting for this for months. Thanks #freeCodeCamp", "likes": 2}}, {"topLevelComment": {"author": "sandeep", "text": "Best people on planet", "likes": 0}}, {"topLevelComment": {"author": "Eduardo Gamaliel Garcia Zavala", "text": "Please, could you do a tutorial to learn jetpack compose for android development? Please :D", "likes": 7}, "replies": [{"author": "Sukhdeep Singh", "text": "Yes, please jetpack compose or android development complete course", "likes": 0}]}, {"topLevelComment": {"author": "Edge Tech", "text": "Second", "likes": 1}}, {"topLevelComment": {"author": "ann m", "text": "Second to comment", "likes": 0}}, {"topLevelComment": {"author": "Badda Gaming", "text": "I'm from maroco", "likes": 0}}, {"topLevelComment": {"author": "Gaurav Rawat", "text": "I am gonna complete it now and will build projects using it , thanks", "likes": 1}}, {"topLevelComment": {"author": "Varun Naik", "text": "Second🙂", "likes": 0}}, {"topLevelComment": {"author": "Ramiz Bin Ibrayi", "text": "Mostly awaited one🤟", "likes": 2}}, {"topLevelComment": {"author": "Badda Gaming", "text": "Very good ☺️", "likes": 1}}, {"topLevelComment": {"author": "diego armando Rey", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "Jasurbek Ergashev", "text": "Best", "likes": 0}}, {"topLevelComment": {"author": "muhammad zain ul abadeen", "text": "Thanks sir", "likes": 0}}, {"topLevelComment": {"author": "Jayachandran PM", "text": "🙏", "likes": 0}}, {"topLevelComment": {"author": "Sudhir kumar singh", "text": "First", "likes": 5}}]}