{"video": {"id": "W5_PbWXQepw", "title": "From wireframe to website prototype - Webflow Tutorial", "description": "How to build a prototype in Webflow.\n\nWebflow is a responsive website design tool that let's you build websites in the browser. In this Webflow tutorial I show you a step by step process for taking a concept for a website or app and creating a responsive, interactive prototype in Webflow.\n\nTutorial from Robert Smith. Check out his YouTube channel: https://www.youtube.com/channel/UCpzWITCC0EjA9tiKeyO1i3A\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.com\n\nRead hundreds of articles on programming: https://medium.freecodecamp.com", "duration": "PT1H21M55S", "likes": "114", "views": "7001"}, "comments": [{"topLevelComment": {"id": "UgyMuvKwVQ6TuLz90fN4AaABAg", "publishedAt": "2022-05-11T20:01:59Z", "author": "NICK CORNETT", "text": "I have a wireframe, that I need to convert to a landing page, I have very little experience.  Is there a program that will convert it to a webpage for me, or is there somewhere I can go and get someone to do it for a reasonable price?  I want to use the landing page wireframe because it converts at almost 7%.  But I am very new to this sort of thing.  Thanks!", "likes": 0}}, {"topLevelComment": {"id": "UgwFYonnDtpx2M093cB4AaABAg", "publishedAt": "2019-09-21T00:42:34Z", "author": "John Leigh", "text": "The ready made webflow container has a max width of 940px which is a decent setup but to be more flexible you can create your own using a centered div that you set the max width yourself to a value that best suits your design - for example perhaps 1000px max width will be a better bet for the site you have in mind - gives a bit more width to play with but still provides that nice layout of a centered column", "likes": 0}}, {"topLevelComment": {"id": "Ugys5-3X5uSDlduJ8Kp4AaABAg", "publishedAt": "2019-02-17T08:46:37Z", "author": "Flip Back", "text": "okay so you dragged a Section first and then instead of dragging the Container module you dragged in a Div instead and named it the inner container? What is the difference between that and using the built-in Container module? Should we be avoiding it?", "likes": 0}}]}