{"video": {"id": "xV7S8BhIeBo", "title": "Portfolio Website Tutorial – Frontend Development with HTML, CSS, JavaScript", "description": "In this course, you will learn how to build a portfolio website using JavaScript, HTML, and CSS. This is a great project to improve you frontend development skills.\n\n✏️ MacLinz developed this course course. Check out his channel: https://www.youtube.com/c/MacLinzUniversalChannel\n\n💻 Code: https://github.com/Maclinz/JS_CSS_PortfolioProject\n\n⭐️ Course Contents ⭐️\n⌨️ (0:00:00) Introduction\n⌨️ (0:02:37) Switch Between Sections\n⌨️ (0:48:53) Header Content\n⌨️ (1:06:22) About Section\n⌨️ (1:42:34) Portfolios Section\n⌨️ (1:58:52) Blogs Section\n⌨️ (2:11:31) Contact Section\n⌨️ (2:44:09) Media Queries\n\n🎉 Thanks to our Champion and Sponsor supporters:\n👾 Raymond Odero\n👾 Agustín Kussrow\n👾 aldo ferretti\n👾 Otis Morgan\n👾 DeezMaster\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://freecodecamp.org/news", "duration": "PT3H25M56S", "likes": "18111", "views": "682118"}, "comments": [{"topLevelComment": {"author": "The Code Dealer", "text": "Thank you, FreeCodeCamp for hosting this video, It's like a dream coming true. Hope you enyoy the video everyone!😎", "likes": 374}, "replies": [{"author": "carter paul", "text": "Asante MacLinz", "likes": 0}, {"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}, {"author": "The Code Dealer", "text": "@David Alfredo García Paez Thank you for the feedback", "likes": 0}, {"author": "David Alfredo García Paez", "text": "Thank you very much, the truth is incredible... the video showed me a much simpler way to design a web page.\n\nThe video is impeccable.\n\nBest rewards from MAr del Plata Argentina", "likes": 1}, {"author": "Gen-1-9-8-7", "text": "What is this program you are using? Is it free?", "likes": 0}]}, {"topLevelComment": {"author": "pzg2008", "text": "The contact me page doesn't have a submit message button :)", "likes": 0}}, {"topLevelComment": {"author": "pzg2008", "text": "the spacing problem at 3:08:20 was wild!", "likes": 0}}, {"topLevelComment": {"author": "Chuka Onwuka", "text": "allsections.addEventListener('click', (e)  =>{\r\n        console.log(e.target);\r\n        const id = e.target.dataset.id;\r\n        if(id){\r\n            sectbtn.forEach((btn)=>{\r\n                btn.classList.remove('active')\r\n            })\r\n            e.target.classList.add('active')\r\n\r\n            sections.forEach((section)=>{\r\n                section.classList.remove('active')\r\n            })\r\n\r\n            const element = document.getElementById(id);\r\n            element.classList.add('active');\r\n        }\r\n    })\n\n\ni keep getting an error when doing this... how do i fix it please", "likes": 0}}, {"topLevelComment": {"author": "Jakki Nataraja Sesha Akhil", "text": "😃", "likes": 0}}, {"topLevelComment": {"author": "Marc Hebbo", "text": "bro first 5 minutes the guy talking is swallowing in the middle of my ear i left the video for this reason", "likes": 0}}, {"topLevelComment": {"author": "Armando Espinoza", "text": "For some reason the control class tag does not work for me at time 19:36. It is giving me a bunch of errors, saying that '}' is expected on '.controls'.", "likes": 0}}, {"topLevelComment": {"author": "Ed Bosisto", "text": "Great video, thanks! Really improved my CSS understanding a lot watching this.", "likes": 1}}, {"topLevelComment": {"author": "elitism", "text": "Stuck at displaying different colors for sections. On inspect display: none. active { display: block} not functioning. can someone help ??", "likes": 0}}, {"topLevelComment": {"author": "Aurelien Baraka", "text": "Thank you very much for this.\nI'd like to know the dimensions of the picture on first section please.", "likes": 0}}, {"topLevelComment": {"author": "De sparo", "text": "how can i get those images", "likes": 0}}, {"topLevelComment": {"author": "squash 101", "text": "Followed this tutorial well and images don't pop up at around, don't know how to fix waste of time", "likes": 0}}, {"topLevelComment": {"author": "Brianna Ford", "text": "1:08:58 if anyone is having problems with Seeing the about me main title like me here’s what you do. \n\nInstead of <h2>About <span>me</span><span class=\"bg-text\">my stats</span></h2> \n\non one line it should be broken up into 2 lines like this. \n\n <h2>About <span>me</span>\n<span class=\"bg-text\">my stats</span></h2>\n\nHope this helps someone having the same problem I had.", "likes": 1}, "replies": [{"author": "Yashaswini", "text": "Hey, I was watching this and tried coding along, I found out that my vsc is not running my html file, the icon isn't showing on the saved file nd when future   figuring out, it turns out that HTML5 the extension is deprecated. How do I make it read my html file ?", "likes": 0}]}, {"topLevelComment": {"author": "Chris SG", "text": "Hi this is really an awesome tutorial! :) However, i am having some trouble trying to upload it to github pages - Is there an additional step required to compile the SCSS files (especially the media queries?) thanks! @The Code Dealer", "likes": 1}}, {"topLevelComment": {"author": "Jason Brown", "text": "At about 23:50, when he starts the JS portion of the video, it seems like he's just pasting or auto-completing his code from nowhere... how does that work? Are there shortcuts he's using that I don't know about?", "likes": 0}}, {"topLevelComment": {"author": "Hoàng Thành", "text": "Người Việt Nam hướng dẫn à anh em, nghe giọng như mấy bạn bên mấy nước Ả Rập, Trung Đông ấy nhỉ.", "likes": 0}}, {"topLevelComment": {"author": "Nizam Ramazanov", "text": "Good", "likes": 0}}, {"topLevelComment": {"author": "CORKPARK-9289", "text": "Hello Kenyans We have  Raymond Odero here", "likes": 0}}, {"topLevelComment": {"author": "Kurt Thorsten", "text": "hello! very good video. I was just wondering if the \"download CV\" button raises any flags of potential employers. Are pdfs always safe? or is it maybe better to make your CV accessable via website so others don't have to download it. I am new to this, but maybe some recruiter or anyone who has experience with this can help me out here. ty", "likes": 0}}, {"topLevelComment": {"author": "Bobby Gupta", "text": "how to deploy this website and host on some domain?", "likes": 1}}, {"topLevelComment": {"author": "Owan Daisy", "text": "for some reason , the css properties i apply to the icons don't work", "likes": 0}}, {"topLevelComment": {"author": "Endrit Berani", "text": "I don't think that you didn't change anything, u changed to many think after we made (contact me) because now the @media isn't working at all, first of all I made this step by step as u learn us for example (< header class :section sec1 header active\" id=\"home\"> , this id=\"home\" in last video tutorial your \"id\" is id=\"header\". Soo we can not execute codes to make responsive our web portfolio.", "likes": 1}}, {"topLevelComment": {"author": "Shilpa Ramanaik", "text": "Anyone please help, am not able to understand switching between sections, no bugs but background color is not changing, if u see the console active class has been assigned to clicked sections.", "likes": 0}}, {"topLevelComment": {"author": "MrDuckie Man", "text": "My active button doesn't change when I click a diffrent icon. At 33:27", "likes": 1}, "replies": [{"author": "roykinn7", "text": "My problem was on line 11 I did not put a space before 'active-btn', when I added the space the line reads like this:\n\nthis.className += ' active-btn';\n\nThe problem was without that space it was adding active-btn right on the back of control-1 class in the html (or 2,3,4)... so it would end up messing up the class like this:\n\n<div class=\"control control-1active-btn\" data-id=\"header\">\ninstead of\n<div class=\"control control-1 active-btn\" data-id=\"header\">\n\n\nI did not see this as a solution in any of the comments.", "likes": 0}]}, {"topLevelComment": {"author": "melanie prevot", "text": "h-shap css style not working for me. h-shap will cut the profile photo , and z-index will make hover not working either. Anyone has the same issue with me ?", "likes": 0}, "replies": [{"author": "Sai Sridhar T", "text": "Yes", "likes": 0}]}, {"topLevelComment": {"author": "Jeremiah Haastrup", "text": "Having an issue at 46:00 to get the sections to display their background color. Anyone got any advice?", "likes": 0}, "replies": [{"author": "Jeremiah Haastrup", "text": "Fixed it. change to const allSections = document.querySelectorAll('.main-content')[0];", "likes": 0}]}, {"topLevelComment": {"author": "Yulissa Gil", "text": "The code .. html 50% css 60% javascript 30% 😅Sorry", "likes": 0}}, {"topLevelComment": {"author": "Shivam Prasad", "text": "my image is not changing color", "likes": 0}}, {"topLevelComment": {"author": "Shivam Prasad", "text": "my hover is not working on greyscale , it is working on other peoperties", "likes": 0}}, {"topLevelComment": {"author": "Prajwal Shetti", "text": "43:42", "likes": 0}, "replies": [{"author": "Jeremiah Haastrup", "text": "change to const allSections = document.querySelectorAll('.main-content')[0];", "likes": 0}]}, {"topLevelComment": {"author": "Juskaran Buted", "text": "45:47 I cannot go through with this output — the color of the background didn’t change upon clicking any button… Anyone could help me for that . Thanks", "likes": 1}, "replies": [{"author": "Jeremiah Haastrup", "text": "change to const allSections = document.querySelectorAll('.main-content')[0];", "likes": 0}, {"author": "Juskaran Buted", "text": "its say, I got an error on this code ====        sectBtn[i].addEventListener('click', function(){", "likes": 0}]}, {"topLevelComment": {"author": "Sean Patterson", "text": "Thank you very much Beau, Quincy and the developer who presented the tutorial! I learned a lot and got good practice in what I'm already familiar with! Very much appreciated", "likes": 0}}, {"topLevelComment": {"author": "Omar Asaad", "text": "For contact section all the elements show up for a bit and then disappear right after does anyone know why that is", "likes": 0}}, {"topLevelComment": {"author": "Krishna Vats", "text": "Can this be done with angular?", "likes": 0}}, {"topLevelComment": {"author": "Big Man", "text": "what do I do if the styles test is not working? I double check I had everything set up right but when I went to set up live server it was white. I've got it to work before with other tutorials but this was without other plugins so I'm not sure\n\nUPDATE: I had an itching feeling right after I left this comment that the one thing that was different was my folder organization since I have been doing many of these tutorials. It was in a greater folder called Portfolio. So when I liked it to Styles/styles.css it couldn't find  anything! haha. if anyone also runs into this issue, check your folders. Best to keep yourself organized.", "likes": 0}}, {"topLevelComment": {"author": "LIPERANQEY beatz", "text": "That's very cool, ur talented now I will try to make one myself", "likes": 0}}, {"topLevelComment": {"author": "ProgrammingTT", "text": "I make projects using HTML, CSS and JavaScript (with code, for beginners).", "likes": 1}}, {"topLevelComment": {"author": "Artūras Červinskas", "text": "Why do you use transition: all .4s ease-in-out inside body tag in scss. It seems that is not doing anything", "likes": 0}}, {"topLevelComment": {"author": "imad eddine fillali", "text": "it's really bad, also you don't even know what you are doing", "likes": 0}}, {"topLevelComment": {"author": "Sanaved7codes", "text": "My javascript code for active class is not running and suggestions?", "likes": 1}}, {"topLevelComment": {"author": "Geee", "text": "Teaching is a skill. This guy has great ideas. But he has a lot of problems with spelling and even making sense in the process. You only see something working and on screen it doesn't work. Compare with Kevin Powel. If I am stuck with this guy, I know Kevin had a talk about the same thing. Otherwise, his ideas are great. But sucks at sharing ideas. Fundamental flaws can be costly.", "likes": 0}}, {"topLevelComment": {"author": "Geee", "text": "it would have helped is a comment was made regarding this string: this.className += ' active-btn'; its uses the old scripting practice. Someone will be easily confused if the code is not working.", "likes": 0}}, {"topLevelComment": {"author": "Maryna Markova", "text": "Thank you so much! It's very helpful!", "likes": 0}}, {"topLevelComment": {"author": "Okafor Chisom", "text": "Which text editor is this? I can't install live sass compiler on my Atom text editor.", "likes": 0}}, {"topLevelComment": {"author": "Abdullah Alhariri", "text": "you stole my portfolio👀", "likes": 0}}, {"topLevelComment": {"author": "Bakare Afolabi", "text": "no source code??", "likes": 0}}, {"topLevelComment": {"author": "Ayush", "text": "Responsive please", "likes": 0}}, {"topLevelComment": {"author": "James Ambole", "text": "Thanks  MacLinz  and freeCodeCamp, I just managed to build this step by step, i got lost severally,but still came back again and again.Thank you", "likes": 0}}, {"topLevelComment": {"author": "BoggleWeb Design and Development", "text": "21:30 Why my background is still white and the icons are still at the left top?", "likes": 0}}, {"topLevelComment": {"author": "dan lake", "text": "any good ideas for adding text on hover to the navigation buttons?", "likes": 0}}, {"topLevelComment": {"author": "Moaz Abdelmonem", "text": "How do you make the blog section hover like the portfolio section. I want my portfolio to be a combination of the blog section and the portfolio section. For example, I want an explanation (under the portfolio item) and when I hover over the image, it will show the project sources.", "likes": 0}}, {"topLevelComment": {"author": "voaneves", "text": "There's a scroll bar on the home page. Where I can change the CSS so it's gone?", "likes": 0}}, {"topLevelComment": {"author": "Gojo Satoru", "text": "45:42 in css line 87 .active{display: block;} does not work, can somebody help?", "likes": 0}, "replies": [{"author": "Jeremiah Haastrup", "text": "change to const allSections = document.querySelectorAll('.main-content')[0];", "likes": 1}, {"author": "Jeremiah Haastrup", "text": "@Gits Junior same here. Still trying to solve it", "likes": 0}, {"author": "Juskaran Buted", "text": "same", "likes": 0}, {"author": "Gits Junior", "text": "Did you solve it", "likes": 0}]}, {"topLevelComment": {"author": "yerson oliver felix perez", "text": "thank you very much for the video, I enjoyed it very much, just an observation, for the fromulario of the contact me section there is no send button.", "likes": 0}}, {"topLevelComment": {"author": "Anay Baid", "text": "Be back here soon.", "likes": 0}}, {"topLevelComment": {"author": "Adesanya Ibukunoluwa", "text": "Although this course has a wonderful production, I think the teaching approach could be better.\n\nThe teacher focused too much on having fine results than imparting knowledge; he teaches in a manner that tells you what to type without explaining how or why it works. I don't think this is good for anyone, not even experts.\n\nI was happy he gave an overview of the website, touching each feature, but was thoroughly discouraged that he had to first pour down a ton of premeditated CSS. \n\nIf you are a beginner and want a smooth learning journey, I am discouraging you from taking this course at a beginner stage.", "likes": 0}}, {"topLevelComment": {"author": "Dclxvi Clan", "text": "I creating my roadmap for web knowledge, and thu$ tutorial be a favorite in list 👍, thks guys 💻🤟", "likes": 0}}, {"topLevelComment": {"author": "Terrence James", "text": "44:44 I keep getting an error cannot read property of  null (reading ‘classList’) at HTMLBodyElement….been on this for hours and I still can’t figure out what’s wrong", "likes": 0}, "replies": [{"author": "Jeremiah Haastrup", "text": "@Jennifer Fan change to const allSections = document.querySelectorAll('.main-content')[0];", "likes": 0}, {"author": "Jennifer Fan", "text": "same here. Did you manage to solve this ?", "likes": 0}]}, {"topLevelComment": {"author": "Cogs of Ra Studios", "text": "I will openly admit that this is a beginner problem but never the less this stumped me for a full 5hrs before I managed to figure it out. You never explained in the video how to utilize the live SASS compiler add-on and as such my about section refused to format correctly because the code in my styles.scss was never being complied down my styles.css file.\n\nFor those of you that are having formatting issues with regards to this project, may I humbly submit that you may be having issues because you have not hit ctrl+shift+p to open the command palette and typed \"live SASS: Watch SASS\". This will make sure that when you save your styles.scss is being complied down to the styles.css file without you manually having to compile after each change. This was an extremely frustrating problem to deal with and I wish it could have been addressed in the video.\n\nI have still managed to learn a lot of what is possible in html from the video and it is an excellent resource for reference code as many parts of the code can be used in other situations. However, this was not a very good tutorial because it did not go over the underlying thought process of 'why' things were ultimately structured the way they were. I understand this is largely because of just how much material is being covered but I would appreciate a change in the video's title to say \"Coding Demo\" rather than \"Tutorial\" as that is a better reflection of the video's content. I still really appreciate the content, I just wish I could be respected and better informed regarding what the video content is actually going to cover.", "likes": 2}, "replies": [{"author": "Cogs of Ra Studios", "text": "@Tortilla Haha, I got to that exact point  before I finally figured out what was going on, so I totally feel you! And I am glad I could help. :)", "likes": 0}, {"author": "Tortilla", "text": "thank you so much i was so stumped how his was being imported automatically to the point where i just kept copy pasting my .scss into .css.", "likes": 1}, {"author": "Cogs of Ra Studios", "text": "@Jonathan Dickinson You're most welcome! I'm glad I could help you out a little.", "likes": 0}, {"author": "Jonathan Dickinson", "text": "I was struggling with this for a little while. Thank you!", "likes": 1}]}, {"topLevelComment": {"author": "Legendary Investments", "text": "How do you make the \"Download CV\" button active and actually download files like a pdf? Anyone?", "likes": 0}}, {"topLevelComment": {"author": "Kimberly Stamets", "text": "Wow!! This is incredible. This will be my project for the next two weeks, you are awesome!", "likes": 0}}, {"topLevelComment": {"author": "Eduard", "text": "HELP please ! \n17:30 how did he autofill all those divs?\nSomebody ans. me pleaseee !", "likes": 1}, "replies": [{"author": "Cogs of Ra Studios", "text": "He did not auto fill, he copied his code from his main project and pasted it in.", "likes": 0}]}, {"topLevelComment": {"author": "Onlytherealeststays", "text": "I installed html snippets but its not working. any help on this", "likes": 0}}, {"topLevelComment": {"author": "Puck Sheet", "text": "damn i learned a lot", "likes": 0}}, {"topLevelComment": {"author": "Hassan TAJIRI", "text": "hello, thank you for the tutorial, \ni'm wondering how to include the blog articles and open it when we click on the blog thumbnail, i will appreciate any help", "likes": 1}}, {"topLevelComment": {"author": "lahiru shiran", "text": "i tried to understand that navbar js functionality but i couldn't so i did it like this\nconst navBtns = document.getElementsByClassName(\"li\");//control\nnst navbarFunction = (num,array) => {\r\n    for(let x of array){\r\n        if(navBtns[x].classList.contains(\"nav-links-green\")){\r\n            navBtns[x].classList.remove(\"nav-links-green\")\r\n        }\r\n    }\r\nnavBtns[num].classList.add(\"nav-links-green\");\r\n\r\n}\r\n\r\nnavBtns[0].addEventListener(\"click\", () => {\r\n    const items = [1,2,3]\r\n    navbarFunction(0,items)\r\n})\r\nnavBtns[1].addEventListener(\"click\", () => {\r\n    const items = [0,2,3]\r\n    navbarFunction(1,items)\r\n})\r\nnavBtns[2].addEventListener(\"click\", () => {\r\n    const items = [0,1,3]\r\n    navbarFunction(2,items)\r\n})\r\nnavBtns[3].addEventListener(\"click\", () => {\r\n    const items = [0,1,2]\r\n    navbarFunction(3,items)\r\n})", "likes": 0}}, {"topLevelComment": {"author": "Samuel Alayande", "text": "can someone please explain... Thanks in advance", "likes": 0}}, {"topLevelComment": {"author": "Samuel Alayande", "text": "33:33 please how did you get the the code to work after removing the arrow function", "likes": 0}, "replies": [{"author": "Cogs of Ra Studios", "text": "He gives the explanation but it is super quick and hard to pick up on, it took me a minute to get as well, but what it comes down to is that on line 10 he put the following bit of code:\n\n        sectBtn[i].addEventListener('click', function() =>{\n\nThis doesn't work because, according to him, this bit at the end \"function() =>{\" does not support the \"this.className += ' active-btn\" on line 13.\nSo you need to change line 10 to be this instead and you can keep the rest of the function the same:\n\n        sectBtn[i].addEventListener('click', function(){", "likes": 0}]}, {"topLevelComment": {"author": "Stefanos Ntouvlis", "text": "has anyone managed to make the contact form work?", "likes": 0}}, {"topLevelComment": {"author": "Walkastray", "text": "Suggestion: Make sure they show the final product at the very end of the video so we can see what it should look like at the end.", "likes": 0}}, {"topLevelComment": {"author": "hhy", "text": "better front end option here 👉👉https://youtu.be/LMagNcngvcU", "likes": 0}}, {"topLevelComment": {"author": "Alpha Phantom", "text": "para los nuevos como yo en este maravilloso mundo tratando de aprender\n\ngrid-gap no existe mas para los cuatro ejes en cuanto espacio ahora se utiliza para los cuatro ejes solo gap... lo dejo como apunte nada mas 😅", "likes": 1}}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "I thought this was a basic learning tutorial....bt it's actually not. Can you please explain the steps next time and not pasting data from nowhere.? Thank you", "likes": 0}}, {"topLevelComment": {"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}}, {"topLevelComment": {"author": "seizurelife donation", "text": "<!DOCTYPE HTML>\r\n\r\n<html>\r\n\r\n<head> \r\n<title></title>\r\n</head>\r\n\r\n\r\n<body>\r\n\r\n<!-- page content goes here -->\r\n\r\n</body>\r\n\r\n</html>", "likes": 0}}, {"topLevelComment": {"author": "Eligrand Nezerwa", "text": "i got mistake on sections\ncan i get some help??", "likes": 0}, "replies": [{"author": "Cogs of Ra Studios", "text": "What was the specific issue?", "likes": 0}]}, {"topLevelComment": {"author": "Nguyễn Phụ Thành Đạt", "text": "Like liền like liền", "likes": 0}}, {"topLevelComment": {"author": "Nguyễn Phụ Thành Đạt", "text": "Uầy người việt nam dạy", "likes": 0}}, {"topLevelComment": {"author": "Nguyễn Phụ Thành Đạt", "text": "Người việt nam", "likes": 0}}, {"topLevelComment": {"author": "Julius Adebowale", "text": "Even making the SCSS work and the site test for red background was hard for the beginner I introduced this video to. This is a very robotic approach to teaching. This is not good for beginners. And I'm not sure intermediate or advanced developers would have time for tutorials. Makes me wonder who exactly this website is meant for", "likes": 0}}, {"topLevelComment": {"author": "Stefanos Ntouvlis", "text": "\"Uncaught TypeError: allSections.addEventListener is not a function\" That appeared to me and thankfully one guy in the comments saved me. Could you explain a bit about it and especially its solution. I found some info but couldn't quite understand it.", "likes": 0}, "replies": [{"author": "Brianna Ford", "text": "@Jeremiah Haastrup  same it’s In the comments above I tried it and it still didn’t work for me. Sadly I’m trying again. My buttons don’t work tried the place the zero there and still having issues", "likes": 0}, {"author": "Jeremiah Haastrup", "text": "Having an issue with this myself. What was the solution?", "likes": 1}, {"author": "Ellon Musket Wannabe", "text": "could you share the solution pls", "likes": 0}]}, {"topLevelComment": {"author": "MindThunder", "text": "One day I will be able to sit down for more than 2 minutes and actually learn something\n :)", "likes": 0}}, {"topLevelComment": {"author": "tejas ukalkar", "text": "how come your icons are visible at top left and min at bottom left corner?", "likes": 0}}, {"topLevelComment": {"author": "Q", "text": "HOW ARE HIS ICONS CLICKABLE BUT MINE ARENT", "likes": 0}}, {"topLevelComment": {"author": "Q", "text": "class 'active' is not being added to sectBtns.forEach ONLY WHEN I CLICK ON THE ICON but when i click on the button itself, it adds !!  HELP SOS", "likes": 0}}, {"topLevelComment": {"author": "Ab man Kendrick", "text": "Thank you for the video help share me the image link so i can download the images", "likes": 0}}, {"topLevelComment": {"author": "Gerry", "text": "how did you target the icon?", "likes": 0}}, {"topLevelComment": {"author": "Jose Espinosa", "text": "Thanks for this great tutorial!  Is it OK to use this tutorial to create and host my own portfolio site (with my own custom edits of course)?  I do not yet know how intellectual property works for something like this.  Thank you!", "likes": 4}}, {"topLevelComment": {"author": "Thomas Joseph", "text": "Can I use this source code for my website to better development", "likes": 0}}, {"topLevelComment": {"author": "Thomas Joseph", "text": "Nice video sir", "likes": 0}}, {"topLevelComment": {"author": "Avijit Sharma", "text": "is there a way to make light theme the default one.", "likes": 0}, "replies": [{"author": "Hrithik B", "text": "Switch the colours between the root class and light-mode class in style.scss...", "likes": 0}]}, {"topLevelComment": {"author": "Amay", "text": "I am gonna be honest with everyone, the project is awesome, no doubt about that. But it was kind of a pain to go through it.", "likes": 0}, "replies": [{"author": "Amay", "text": "My ears are actually bleeding now. Damn.", "likes": 0}]}, {"topLevelComment": {"author": "Matt Willis", "text": "Learned A LOT from this video.  Thank you so much!\n\nGenuine question from someone new to web development - should we not take a mobile-first to designing webpages? It seems as though we created a beautiful portfolio for large screens, but the layout of the smaller screen sizes came as an afterthought... (it wasn't quite as smooth)\n\nAlso, and I think a few people have mentioned this in the comments, the duplication of class/id names and the use of '!important' doesn't quite feel like best practice.\n\nThat said, it was a super useful tutorial, with lots of work put in by the instructor.  There is no way I could have created something like this on my own.  Great work!", "likes": 11}, "replies": [{"author": "Mr. Reese", "text": "A page should be responsive and thus adjust to screen width, but mobile first seems to be the wrong approach in my book.", "likes": 0}]}, {"topLevelComment": {"author": "Molly Finch", "text": "enyoy the video everyone!😎", "likes": 0}}, {"topLevelComment": {"author": "BC Brando", "text": "In the contact section, what is the button supposed to do? In my mind, a user would fill out the form and hit submit to send to my email or something. How would I do this?", "likes": 0}}, {"topLevelComment": {"author": "Sajid Hasan", "text": "whenever i click watch sass my css code being deleted", "likes": 0}}, {"topLevelComment": {"author": "Sajid Hasan", "text": "anyone how to host this kind of website?", "likes": 0}}, {"topLevelComment": {"author": "Farhan Ali", "text": "Amazing tutorial this is. Just outstanding ☺️", "likes": 1}}, {"topLevelComment": {"author": "Josiah S Carr Music", "text": "You can see that he actually provides cover fire for the other guy to retreat, this also distracted the Russian soldiers, allowing the other Ukrainian soldier to safely escape, it is more than likely that the soldier who dies orders the other soldier to retreat, as the soldier begins to retreat simultaneously to when the other soldier provides cover fire before being hit, you can also see it looks like they briefly exchange communication less than 5 seconds prior. 3:10", "likes": 1}}, {"topLevelComment": {"author": "Edwin Torres", "text": "Thank you I loved this video :)", "likes": 0}}, {"topLevelComment": {"author": "Shreyas Malla", "text": "need to explain more and tell why he is doing the things he is doing to be more useful for beginners like me.", "likes": 0}}, {"topLevelComment": {"author": "Patrick Pereira Vieira", "text": "How do you make the contact from functional? I've added action=\"mailto:myemail\" but it doesn't seem to be enough...", "likes": 0}}, {"topLevelComment": {"author": "GC-Tech", "text": "I really like this. Congratulations on a job well done.", "likes": 0}}, {"topLevelComment": {"author": "Asilbek Vaisboev", "text": "it the video no \"main-content \"", "likes": 0}}, {"topLevelComment": {"author": "Johnny Melino", "text": "I am having difficulties with 54:18, it seem's that i can only get the image to show with no h-shape background appearing.", "likes": 0}}, {"topLevelComment": {"author": "Cristian Adejola", "text": "i have some problem in scss. everything working fine. until  .\r\n.control{\r\n        padding: 1 rem};\r\ni wrote all the code. but no reaction. can someone help me out. where is my mistakes.", "likes": 0}}, {"topLevelComment": {"author": "sktmd rmn", "text": "suggestion: i think the buttons should have a text so visitors dont have to click them and find out what they're for. plus i also want it to scroll through the different sections, meaning the different sections should be directly one after the other while scrolling  AND if the user wants to quickly navigate to a section then he can use the buttons", "likes": 2}, "replies": [{"author": "Carlos Eduardo", "text": "Do the changes yourself, you'll learn a lot!", "likes": 8}]}, {"topLevelComment": {"author": "Prithvi Singh", "text": "SCSS effects are not taking place. Can anyone help?", "likes": 1}, "replies": [{"author": "code master", "text": "Below there is watch sass. Click on it", "likes": 0}]}, {"topLevelComment": {"author": "Kadambari Mahender Pal Shanti devi", "text": "What is the back end and front end here", "likes": 0}}, {"topLevelComment": {"author": "ToniMacak 518", "text": "Nice work!", "likes": 0}}, {"topLevelComment": {"author": "Bayu Anggoro.d", "text": "1:31:35 do not forget adding \"position: absolute\"  into &::before element .stat-title", "likes": 2}}, {"topLevelComment": {"author": "Balaji Melagiri", "text": "Heyy, I am getting this error, 'ReferenceError: document is not defined', please help", "likes": 0}}, {"topLevelComment": {"author": "Gen-1-9-8-7", "text": "What is this software you are using? Is it free?", "likes": 0}}, {"topLevelComment": {"author": "Quat Tran Dang", "text": "hello! are you vietnamese ?", "likes": 0}}, {"topLevelComment": {"author": "Harsh Singh ( 🇮🇳 )", "text": "hey at 45:00 on my console, it saying  can not read properties of undefined ( 'remove' ) when I'm clicking different buttons, please help me solve the problem", "likes": 2}, "replies": [{"author": "Jeremiah Haastrup", "text": "change sections to querySelectorAll", "likes": 0}]}, {"topLevelComment": {"author": "Abraham", "text": "app.js:17 Uncaught TypeError: allSections.addEventListener is not a function errorplease help", "likes": 0}, "replies": [{"author": "Vasher", "text": "@Abraham how do u fixed it? can i see the code?", "likes": 0}, {"author": "Abraham", "text": "fixed lets go. had to remove all from queryselector", "likes": 0}]}, {"topLevelComment": {"author": "Agnieszka Drabczyk", "text": "Hey! It's an amazing resource! Thanks so much. I can't make media part work at all. Any ideas?", "likes": 1}}, {"topLevelComment": {"author": "Subhajit Das", "text": "i want to add another function, when I scroll the page the section will be change like if I scroll down the next section will be about.... how to do that", "likes": 0}}, {"topLevelComment": {"author": "Patrick Pereira Vieira", "text": "Is there a simple way to have different transitions for each section? I've been messing around with the code a little but can't find a solution.\n\nEdit: I found a solution. Example:\n\n#contact.active {\r\n    display: block;\r\n    animation: contactAnim 1s ease-in-out;\r\n    @keyframes contactAnim {\r\n        0% {\r\n            transform: scale(0);\r\n        }\r\n\r\n        100% {\r\n            transform: scale(1); \r\n        }\r\n    }\r\n}", "likes": 2}}, {"topLevelComment": {"author": "rlmn 94", "text": "--color-primary: #191d2b;\r\n    --color-secondary: #27AE60;\r\n    --color-white: #FFFFFF;\r\n    --color-black: #000;\r\n    --color-grey0: #f8f8f8;\r\n    --color-grey-1: #dbe1e8;\r\n    --color-grey-2: #b2becd;\r\n    --color-grey-3: #6c7983;\r\n    --color-grey-4: #454e56;\r\n    --color-grey-5: #2a2e35;\r\n    --color-grey-6: #12181b;\r\n    --br-sm-2: 14px;\r\n    --box-shadow-1: 0 3px 15px rgba(0,0,0,.3);", "likes": 0}}, {"topLevelComment": {"author": "Curby-lee Williams", "text": "Compared to other tutorials, this is quite bad. Yes, he is doing it right, yes there are less mistakes but he has not explained the logic, how to do this yourself etc. \n\nAnd sudden blocks of code just show up with no explanation each time. With this tutorial, I had to pause and find out what things were for, and what their uses are and I already know CSS and HTML. So the explanations of why certain choices were made would help tremendously.", "likes": 0}}, {"topLevelComment": {"author": "Dusan Chmelko", "text": "I can't believe he is using SCSS and declaring variables the old school CSS way", "likes": 1}, "replies": [{"author": "Q", "text": "what is the SCSS way? im a beginner and didnt realize there was a difference", "likes": 0}, {"author": "Proffesional Virgin919", "text": "I'm fairly new but I noticed that. why declare them using CSS when your using SCSS", "likes": 0}]}, {"topLevelComment": {"author": "Bullfrog Beats", "text": "Whenever we're switching the active class between sections, it only sometimes switches for me for some reason. Like I have to click a few times or click another button. I checked my code several times and it seems to be identical. Can anybody help?\n\nEdit: I found out it was because I was clicking on the ICONS of the buttons. My fix was just to add the \"data-id\" tags with the corresponding id's, and it worked fine.", "likes": 1}}, {"topLevelComment": {"author": "Meso", "text": "Adding and removing active-btn class, here is another way you can implement the process:\nfunction sectionTransition() {\r\n  for (let i = 0; i < secBtn.length; i++) {\r\n    secBtn[i].addEventListener(\"click\", function () {\r\n      let activeBtn = document.querySelector(\".active-btn\");\r\n      if (activeBtn !== null) {\r\n        activeBtn.classList.remove(\"active-btn\");\r\n      }\r\n      this.classList += \" active-btn\";\r\n    });\r\n  }\r\n}\n👍👍", "likes": 7}, "replies": [{"author": "Andrii Chekanovskyi", "text": "@VICTOR NWANOCHI to prevent collapsing class names, e.g. \"control-1 active-btn\" without that space will be \"control-1active-btn\" what it is not valide class name", "likes": 0}, {"author": "VICTOR NWANOCHI", "text": "this.classList += \"  active -btn\"\nWhy is there a space after the opening quotation mark?", "likes": 0}]}, {"topLevelComment": {"author": "MB - TECH MEDIA", "text": "I have just created this beautiful website . Thank you for the details explanation and letting me know how to debug some code", "likes": 1}, "replies": [{"author": "Cristian Adejola", "text": "i have some problem in scss. everything working fine. until i .\n.control{\n        padding: 1 rem};\ni wrote all the code. but no reaction. can you help me out. where is my mistakes.", "likes": 0}]}, {"topLevelComment": {"author": "Patrick Pereira Vieira", "text": "Did anyone find a fix for how to add an effect to the \"Download CV\" button when the hover event finishes? 1:05:00", "likes": 0}, "replies": [{"author": "Patrick Pereira Vieira", "text": "@Martin B nice solution!! Also, was fiddling with your code and found that if you change:\n\ntransform: scaleX(0); ------> transform: translateX(100%);\n\nYou get the effect wanted from the video!", "likes": 1}, {"author": "Martin B", "text": "Yes i have found this, which is more smooth when removing the mouse on the button.    \n.btn-icon {\n      display: flex;\n      align-items: center;\n      justify-content: center;\n      background-color: var(--color-secondary);\n      border-radius: 50%;\n      padding: 1rem;\n    }\n    &::before {\n      content: \"\";\n      position: absolute;\n      top: 0;\n      bottom: 0;\n      left: 0;\n      right: 0;\n      background-color: var(--color-secondary);\n      z-index: -1;\n      transition: transform 0.3s ease-in-out;\n      transform: scaleX(0);\n      transform-origin: right;\n    }\n    &:hover::before,\n    &:focus::before {\n      transform: scaleX(1);\n    }\n  }", "likes": 1}]}, {"topLevelComment": {"author": "Zeni", "text": "for some reason my active button does not work. I  am relatively new to html and css but im following along with some refrence research to sort of understand. anyone who is great at this could take a look at my code and find out whats wrong and why the active button wont respond as well as change when i click other sections.\n\nIf you can help please comment so I can post my github link", "likes": 0}, "replies": [{"author": "Just Coding and What Not", "text": "if your talking about the part where you have to type,,,, allSections.addEventListener('click', (e)=>{......code}) I found that changing it to allSections[0].addEventListener('click', (e)=>{......code}) fix that problem not sure exactly why but I kept getting a error saying not a function until I change that bit of the code.", "likes": 0}]}, {"topLevelComment": {"author": "Asad Mujumder", "text": "At minute 30 the this keyword is giving error because this keyword in arrow function always represents the object that defined the arrow function.  In regular functions the this keyword represented the object that called the function, which could be the window, the document, a button or whatever. You said this keyword in arrow function doesn't exist. That's not true. Just with arrow functions there are no binding of this .", "likes": 0}}, {"topLevelComment": {"author": "Christian Kingeta", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Ralph Wilsone", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Anahis Salas Alejo", "text": "muchas gracias por el tutorial me encanto y lo pude adaptar a las especificaciones de mi versión que se manejaba de forma distinta las anidaciones.", "likes": 2}}, {"topLevelComment": {"author": "Victor Mbonu", "text": "anytime i try to run it with live server. I'm told to install the browser or create a json direct path. I don't understand how to do it", "likes": 0}}, {"topLevelComment": {"author": "Akinwekomi Temitope", "text": "there is a cube function you said what was that", "likes": 0}}, {"topLevelComment": {"author": "Oken K.", "text": "if anyone is having an error for the part: at 37:32-\n\"const allSections = document.querySelectorAll('.main-content');\"\njust add an [0] before the semicolon, resulting to\nconst allSections = document.querySelectorAll('.main-content')[0];", "likes": 35}, "replies": [{"author": "Brianna Ford", "text": "I did that and it not working for me. Help please", "likes": 1}, {"author": "noy nu", "text": "thank u sir", "likes": 0}, {"author": "Tortilla", "text": "so helpful, tysm!", "likes": 0}, {"author": "Gojo Satoru", "text": "the line code is const allSections = document.querySelector('.main-content');   not querySelectorAll", "likes": 3}, {"author": "Oken K.", "text": "Guys, I literally don't understand nor know why this works lmao 🤣\nAll I read was it has to do with indexing. Don't know why it worked for him and not to us. Nor why this works for most of us. JavaScript is messy 🤷", "likes": 0}]}, {"topLevelComment": {"author": "Anderson Sunny", "text": "Why do I keep getting this error message on line 18? Uncaught TypeError: allSections.addEventListener is not a function\n    at PageTransitions (app.js:17:17)\n    at app.js:38:1\nPageTransitions @ app.js:17\n(anonymous) @ app.js:38\n\nSomebody help please", "likes": 1}, "replies": [{"author": "Ispy", "text": "Facing the same problem, please let me know incase you solve the issue", "likes": 1}]}, {"topLevelComment": {"author": "Vineet Sakargayen", "text": "i'm having this error allSections.addEventListener is not a function. What should i do?", "likes": 0}, "replies": [{"author": "Gits Junior", "text": "Same here", "likes": 0}]}, {"topLevelComment": {"author": "Mohit", "text": "Below is my code upto  45:46 , But my code doesn't work when i click on icon it doesn't changing any color why?\nCan someone help me out from this?\napp.js :-\n```\nconst sections = document.querySelectorAll('.section');\r\nconst sectBtns = document.querySelectorAll('.controlls');\r\nconst sectBtn = document.querySelectorAll('.control');\r\nconst allSections = document.querySelectorAll('.main-content');\r\n\r\n\r\nfunction PageTransitions(){\r\n    // Button click active class\r\n    for(let i=0;i<sectBtn.length; i++){\r\n        sectBtn[i].addEventListener('click',function(){\r\n            let currentBtn = document.querySelectorAll('.active-btn');\r\n            currentBtn[0].className = currentBtn[0].className.replace('active-btn','');\r\n            this.className += ' active-btn';\r\n        })\r\n    }\r\n    // Section Active \r\n    allSections[0].addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n        const id = e.target.dataset.id;\r\n        console.log(id);\r\n        if(id){\r\n            // remove selected from the other btns\r\n            sectBtns.forEach((btn) =>{\r\n                btn.classList.remove('active');\r\n            });\r\n            e.target.classList.add('active');       \r\n     \r\n            // hide other section\r\n            sections.forEach((section) =>{\r\n                section.classList.remove('active');\r\n            });\r\n            const element = document.getElementById(id);\r\n            element.classList.add('active');\r\n        }\r\n    })\r\n}\r\n\r\nPageTransitions();\n```\n\nindex.html:-\n```\n<!DOCTYPE html>\r\n<html lang=\"en\">\r\n<head>\r\n    <meta charset=\"UTF-8\">\r\n    <meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\">\r\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\r\n    <title>Portfolio</title>\r\n    <link rel=\"stylesheet\" href=\"styles/styles.css\">\r\n    <link rel=\"preconnect\" href=\"https://fonts.googleapis.com\">\r\n    <link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin>\r\n    <link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/all.min.css\">\r\n    <link href=\"https://fonts.googleapis.com/css2?family=Poppins:ital,wght@1,400;1,500;1,800&display=swap\" rel=\"stylesheet\">\r\n</head>\r\n<body class=\"main-content\">\r\n    <header class=\"section sec1 header active\" id=\"home\">\r\n    </header>\r\n    <main>\r\n        <section class=\"section sec2 about\"  id=\"about\"></section>\r\n        <section class=\"section sec3 portfolio\"  id=\"portfolio\"></section>\r\n        <section class=\"section sec4 blogs\" id=\"blogs\"></section>\r\n        <section class=\"section sec5 contact\" id=\"contact\"></section>\r\n    </main>\r\n    <div class=\"controlls\">\r\n        <div class=\"control control-1 active-btn\" data-id=\"home\">\r\n            <i class=\"fas fa-house-user\"></i>\r\n        </div>\r\n        <div class=\"control control-2\" data-id=\"about\">\r\n            <i class=\"fas fa-user\"></i>\r\n        </div>\r\n        <div class=\"control control-3\" data-id=\"portfolio\">\r\n            <i class=\"fas fa-briefcase\"></i>\r\n        </div>\r\n        <div class=\"control control-4\" data-id=\"blogs\">\r\n            <i class=\"fas fa-newspaper\"></i>\r\n        </div>\r\n        <div class=\"control control-5\" data-id=\"contact\">\r\n            <i class=\"fas fa-envelope-open\"></i>\r\n        </div>\r\n    </div>\r\n    <script src=\"app.js\"></script>\r\n</body>\r\n</html>\n```\n\nstyles.scss\n```\n*{\r\n    margin:0;\r\n    padding:0;\r\n    box-sizing:border-box;\r\n    list-style:none;\r\n}   \r\n\r\n\r\n:root{\r\n    --color-primary: #191d2b;\r\n    --color-secondary: #27AE60;\r\n    --color-white: #FFFFFF;\r\n    --color-black: #000;\r\n    --color-grey0: #f8f8f8;\r\n    --color-grey-1: #dbe1e8;\r\n    --color-grey-2: #b2becd;\r\n    --color-grey-3: #6c7983;\r\n    --color-grey-4: #454e56;\r\n    --color-grey-5: #2a2e35;\r\n    --color-grey-6: #12181b;\r\n    --br-sm-2: 14px;\r\n    --box-shadow-1: 0 3px 15px rgba(0,0,0,.3);\r\n}\r\n\r\nbody{\r\n    background-color: var(--color-primary);\r\n    font-family: 'Poppins', sans-serif;\r\n    font-size: 1.1rem;\r\n    color: var(--color-white);\r\n    transition: all .4s ease-in-out;\r\n}\r\n\r\n\r\n\r\na{\r\n    display: inline-block;\r\n    text-decoration: none;\r\n    color: inherit;\r\n    font-family: inherit;\r\n}\r\n\r\n\r\nheader{\r\n    height: 100vh;\r\n    color: var(--color-white);\r\n    overflow: hidden;\r\n}\r\n\r\nsection{\r\n    min-height: 100vh;\r\n    width: 100%;\r\n    position: absolute;\r\n    left: 0;\r\n    top:0;\r\n    padding: 3rem 18rem;\r\n}\r\nsection{\r\n    transform: translateY(-100%) scale(0);\r\n    transition: all .4s ease-in-out;\r\n    background-color: var(--color-primary);\r\n\r\n}\r\n\r\n\r\n.sec1{\r\n    display: none;\r\n    transform: translateY(0) scale(1);\r\n    background-color: rgb(161,228,38,0.849);\r\n}\r\n.sec2{\r\n    display: none;\r\n    transform: translateY(0) scale(1);\r\n    background-color: slateblue;\r\n}\r\n.sec3{\r\n    display: none;\r\n    transform: translateY(0) scale(1);\r\n    background-color: rgb(192, 49, 109);\r\n}\r\n.sec4{\r\n    display: none;\r\n    transform: translateY(0) scale(1);\r\n    background-color: rgb(79, 172, 53);\r\n}\r\n.sec5{\r\n    display: none;\r\n    transform: translateY(0) scale(1);\r\n    background-color: rgb(223, 216, 23);\r\n}\r\n\r\n.active{\r\n    display: block;\r\n}\r\n// controlls\r\n\r\n.controlls{\r\n    position: fixed;\r\n    z-index: 10;\r\n    top:50%;\r\n    right: 3%;\r\n    display: flex;\r\n    flex-direction: column;\r\n    align-items: center;\r\n    justify-content: center;\r\n    transform: translateY(-50%);\r\n    .active-btn{\r\n        background-color: var(--color-secondary) !important;\r\n        transition: all .4s ease-in-out;\r\n        i{\r\n            color: var(--color-white) !important;\r\n        }\r\n    }\r\n\r\n    .control{\r\n        padding: 1rem;\r\n        cursor: pointer;\r\n        background-color: var(--color-grey-4);\r\n        width: 55px;\r\n        height: 55px;\r\n        border-radius: 50%;\r\n        display: flex;\r\n        justify-content: center;\r\n        align-items: center;\r\n        margin: .7rem 0;\r\n        box-shadow: var(--box-shadow-1);\r\n        i{\r\n            font-size: 1.2rem;\r\n            color: var(--color-grey-2);\r\n            pointer-events: none;\r\n        }\r\n    }\r\n\r\n}\n```", "likes": 0}}, {"topLevelComment": {"author": "Mohit", "text": "45:46 Why color not shown  sectionwise if i wrote the same code . Can anyone help Please?", "likes": 0}}, {"topLevelComment": {"author": "SuprGamer", "text": "good video but not in sync with the actual code on github. There isn't any kind of direction in the actual github code. Code seems different than of the actual code and the video. Its just a personal opinion and it is very hard to catch up with the video for the viewers like me who don't have any experience in programming.", "likes": 3}}, {"topLevelComment": {"author": "Mandy", "text": "My Kenyan bro I see you", "likes": 0}, "replies": [{"author": "Mandy", "text": "you should have at least intermediate css knowledge to fully understand this tutorial  well", "likes": 0}, {"author": "Mandy", "text": "@Gits Junior  check on the code you wrote earlier", "likes": 0}, {"author": "Gits Junior", "text": "@Mandy minute 45:34 that's where am having issue the code is just the same", "likes": 0}, {"author": "Mandy", "text": "@Gits Junior let me go and check my code\n or share yours", "likes": 0}, {"author": "Gits Junior", "text": "@Mandy am stuck hapo kwa .active{ \n              display:block;\n}", "likes": 1}]}, {"topLevelComment": {"author": "Shubham S Pawar", "text": "4:00 font awesome", "likes": 0}}, {"topLevelComment": {"author": "Break&Learn", "text": "Is it possible to share the relevant files for this project?", "likes": 0}}, {"topLevelComment": {"author": "Keyana Clark", "text": "Can someone help me?  I wanted to replace the 4 quadrants in the 'About Me' section with an image. In my recent attempt, I  put a tag in the the HTML file  like this : <img src=\"hp.jpg\" alt=\"\" width=\"200\" height=\"200\" id=\"hp\"/>  and formatted this code into the 'styles.css' file: \n#hp  {\nfloat: right;    \n margin: 0 0 0 15px; }\n\nThe result is my picture is on the left side next to the download button. I don't know how to go about it, any advice will be well appreciated!", "likes": 0}}, {"topLevelComment": {"author": "Martha White", "text": "I appreciate your effort but it is very poorly explained. I have also inspected the actual website. The code (css for example) is much more polished and correct. Following this lesson, visual studio showed me a lot of correction suggestions. When lessons are free but lack quality I prefer to pay and and get a decent one.", "likes": 0}}, {"topLevelComment": {"author": "Shinamare ", "text": "well it was good but peace of advice(from 12 year old boy lol): i was forced to use like stackoverflow, w3school and thing like that to udnerstnad everything so please make everything vlera for another tutorials okay? anyweays it was really good. i was gonna make my merch but i coyuld but your tutorial helped me!!!", "likes": 0}}, {"topLevelComment": {"author": "CODE TANK", "text": "Backend of the Portfolio with Laravel-Admin\nhttps://youtu.be/VMurRopJ8GY", "likes": 0}}, {"topLevelComment": {"author": "Jason Bsng", "text": "const allSections = document.querySelector('main-content');\r\n\r\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n\r\nI try to console out but it gives me error.\r\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\r\n\r\nDo you know why? I followed correctly until 39.06 and got stuck at here.", "likes": 1}, "replies": [{"author": "Q", "text": "for me, i accidentally had 'main-container' in my HTML and then was calling main-content in javascript", "likes": 0}, {"author": "Michael Tetteh", "text": "allSections return NodeList which has no event listener, i replace it with allSections[0].addEventListener('click, (e)=>{\nconsole.log(e.target.getAttribute(\"data-id\")\n}", "likes": 0}]}, {"topLevelComment": {"author": "Jason Bsng", "text": "const allSections = document.querySelector('main-content');\r\n\r\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n\r\nI try to console out but it gives me error.\r\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\r\n\r\nDo you know why? I followed correctly until 39.06 and got stuck at here.", "likes": 0}, "replies": [{"author": "Michael Tetteh", "text": "llSections return NodeList which has no event listener, i replace it with allSections[0].addEventListener('click, (e)=>{\r\nconsole.log(e.target.getAttribute(\"data-id\")\r\n}", "likes": 0}, {"author": "Vineet Sakargayen", "text": "Kindly check if you are calling the method querySelector() and not querySelectorAll().", "likes": 1}]}, {"topLevelComment": {"author": "Jason Bsng", "text": "const allSections = document.querySelector('main-content');\r\n\r\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n\r\nI try to console out but it gives me error.\r\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\r\n\r\nDo you know why? I followed correctly until 39.06 and got stuck at here.", "likes": 0}, "replies": [{"author": "Michael Tetteh", "text": "llSections return NodeList which has no event listener, i replace it with allSections[0].addEventListener('click, (e)=>{\r\nconsole.log(e.target.getAttribute(\"data-id\")\r\n}", "likes": 0}]}, {"topLevelComment": {"author": "Jason Bsng", "text": "const allSections = document.querySelector('main-content');\r\n\r\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n\r\nI try to console out but it gives me error.\r\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\r\n\r\nDo you know why? I followed correctly until 39.06 and got stuck at here.", "likes": 0}, "replies": [{"author": "Michael Tetteh", "text": "allSections return NodeList which has no event listener, i replace it with allSections[0].addEventListener('click, (e)=>{\r\nconsole.log(e.target.getAttribute(\"data-id\")\r\n}", "likes": 0}]}, {"topLevelComment": {"author": "Jason Bsng", "text": "const allSections = document.querySelector('main-content');\r\n\r\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\r\n\r\nI try to console out but it gives me error.\r\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\r\n\r\nI followed correctly until 39.06 and got stuck at here.", "likes": 0}}, {"topLevelComment": {"author": "Jason Bsng", "text": "Please help!!!\n39.06 I stuck at here where it says null for the const allSections.", "likes": 0}}, {"topLevelComment": {"author": "vanessa belardo", "text": "Good video overall. Suggestion: a bit more detailed explanations would go a long way, especially for relatively new developers :-)", "likes": 2}}, {"topLevelComment": {"author": "Ojoawo Joshua", "text": "Thanks for the Tutorial, pls where can I get those Images, I would like to redesign this project", "likes": 0}, "replies": [{"author": "Ojoawo Joshua", "text": "Seen, thanks", "likes": 0}]}, {"topLevelComment": {"author": "Heizou", "text": "I cant switch between sections even if i followed as he said ;-;", "likes": 0}}, {"topLevelComment": {"author": "Abhay shukla", "text": "What theme are u using", "likes": 1}}, {"topLevelComment": {"author": "Yazeed Daher", "text": "even though I edited them in the SASS files  I went to the style.css file and found out that the background settings were unchanged this happend couple of times and rewriting the code from the beginning and can't fix the issue, can someone help me please", "likes": 0}}, {"topLevelComment": {"author": "Steven Oketch", "text": "GREAT CREATIVITY, Though the active-btn isnt working. am getting the error that the DOMtoken list cannot be empty when i click the nav buttons. i tried fixing it but that demo was way off. this wont work well for begginers. but i cloned your repo today and i saw you fixed it, add a description to help others fix it.\n\nif anyone finds trouble in the nav bar just use his recently updated js code", "likes": 1}, "replies": [{"author": "亗-FLASH  SNiPES", "text": "thnk u bro", "likes": 0}]}, {"topLevelComment": {"author": "giorgos kokotinis", "text": "Sorry in advance, im not trying to judge anyone or make fun, im new in web development and i am try to learn. Can someone with more experience explain to me what is the reason to have a submit-btn and contact section with textarea and name input? did I miss something because from what I've seen he just copy-paste the \"download cv\" button from the header section and add it to submit-btn, there is nowhere in the video a way to link the contact info section with an email.", "likes": 0}}, {"topLevelComment": {"author": "Stepqen Live", "text": "I'm not getting an active button when clicking on a different button. Everything is the correct it just doesn't change from \"control control-3 \" to \"control control-3 active-class\"", "likes": 0}, "replies": [{"author": "Juskaran Buted", "text": "@Stepqen Live same issue on mine", "likes": 0}, {"author": "Stepqen Live", "text": "Different issue, my button isn't turning green. Everything is the exact same", "likes": 0}]}, {"topLevelComment": {"author": "Juhee Hong", "text": "at 29:31, why do we need \"this.className  += ' active-btn'\" ? what exactly does it do?", "likes": 0}}, {"topLevelComment": {"author": "noon", "text": "Can someone please help me at 39:25? I keep getting \"allSections.addEventListener is not a function at PageTransitions\"", "likes": 1}, "replies": [{"author": "Sami Khairy", "text": "me to", "likes": 0}]}, {"topLevelComment": {"author": "Str8 Fax", "text": "'hmmm, i wonder why its doing that' - Every developer ever, great quote!", "likes": 1}}, {"topLevelComment": {"author": "Mukhtor", "text": "Thank you", "likes": 0}}, {"topLevelComment": {"author": "WATSON", "text": "hi guys im self  taught progremmer. Have no idea where to place my portfolio. pls who knows give answer", "likes": 0}}, {"topLevelComment": {"author": "Hossain Shakib ", "text": "Code Editor name?", "likes": 1}, "replies": [{"author": "Hossain Shakib ", "text": "thanks", "likes": 1}, {"author": "noon", "text": "Visual Studio Code", "likes": 0}]}, {"topLevelComment": {"author": "سارہ علی", "text": "Beginner course available Sir?", "likes": 0}}, {"topLevelComment": {"author": "Seth Ansah Tetteh", "text": "my fontawesome is not working can anyone help", "likes": 0}}, {"topLevelComment": {"author": "The Blue Studio", "text": "This is great! Could you make a video of how you prepare the design etc for the website?", "likes": 1}}, {"topLevelComment": {"author": "Narendra Koya", "text": "How to convert this total code into React JS??..\nPlease Make a Video on this!! Or Any give Suggestion??", "likes": 0}}, {"topLevelComment": {"author": "Priyesh Vikram Singh", "text": "Initially my BG is not red until i change the extension of the style.scss to style.css I have already downloaded th extension of scss. But not working i though.", "likes": 0}}, {"topLevelComment": {"author": "Dylan J. Gerrits", "text": "You could simplify your JS like that:\n(function () {\r\n    [...document.querySelectorAll(\".control\")].forEach(button => {\r\n        button.addEventListener(\"click\", function() {\r\n            document.querySelector(\".active-button\").classList.remove(\"active-button\");\r\n            this.classList.add(\"active-button\");\r\n            document.querySelector(\".active\").classList.remove(\"active\");\r\n            document.getElementById(button.dataset.id).classList.add(\"active\");\r\n        })\r\n    });\r\n    document.querySelector(\"#switch-mode\").addEventListener(\"click\", () => {\r\n        document.body.classList.toggle(\"light-theme\");\r\n    })\r\n})();\nIt litteraly does the same as your 45 lines of JS.", "likes": 0}, "replies": [{"author": "Dylan J. Gerrits", "text": "Also, all the class with numbers are quite useless.", "likes": 0}]}, {"topLevelComment": {"author": "Dylan J. Gerrits", "text": "It's a nice video but there is a lot of bad semantics.", "likes": 0}}, {"topLevelComment": {"author": "Zunurain Ojuolape", "text": "Hi FreeCodeCamp, thanks! for this. It really is helpful and thanks to the developer too.", "likes": 1}}, {"topLevelComment": {"author": "Ilya Sinyugin", "text": "Stuck at 1:09:00, \"About me\" and \"My Stats\" are not on top of each other. About me is in between My and Stats", "likes": 0}, "replies": [{"author": "Abhishek Mauriya", "text": "Did u rectify the error?", "likes": 0}]}, {"topLevelComment": {"author": "Dan E.", "text": "Video is tough to follow and to learn from. I got stuck on checking JavaScript code to make sure active button was switching and got frustrated. This was the second time I attempted following this video. I was ready to give up on it and finally realized that my JavaScript file was under my styles folder🤣. Realized my mistake and moved it. Everything clicked after that.😬", "likes": 4}, "replies": [{"author": "Liene Vito", "text": "I made same :)))", "likes": 0}]}, {"topLevelComment": {"author": "Raphaël", "text": "The video is actually great and I like the portfolio, but there's no much explananation for beginners especially on the javascript part", "likes": 0}}, {"topLevelComment": {"author": "Angela Farnell", "text": "When I click the buttons the section colors are not changing. Am getting this error: Uncaught TypeError: Cannot read properties of null (reading 'addEventListener') at PageTransition   \nAnd I typed everything as he did.", "likes": 0}, "replies": [{"author": "Gits Junior", "text": "Change line 4 to const all sections=document.querySelector('.maincontent');", "likes": 0}, {"author": "noon", "text": "same for me though it says addEvent Listener is not a function at Page Transition", "likes": 1}]}, {"topLevelComment": {"author": "Sir Francis", "text": "Stuck at displaying different colors for sections. On inspect display: none. active { display: block} not functioning. please help", "likes": 4}, "replies": [{"author": "Juskaran Buted", "text": "Yes— same issue", "likes": 0}, {"author": "Emuemhonjie Onosereme", "text": "@Sir Francis thanks", "likes": 0}, {"author": "Sir Francis", "text": "@Emuemhonjie Onosereme i gave up on this project", "likes": 0}, {"author": "Emuemhonjie Onosereme", "text": "I have same issue. Please how did you solve it", "likes": 0}]}, {"topLevelComment": {"author": "ALTHEPAL78", "text": "vicrosoft is a foam mattress company lmao I thought it might of been a different tech company like microsoft but just other things besides the OS lol", "likes": 0}}, {"topLevelComment": {"author": "hertderg12", "text": "When I  attempt inputting an i element into CSS like at 21:40 it breaks my code. When I Close off the preceding .control {} and type a new i{} it works then, so I'm assuming my SASS isn't plugged in properly, is that accurate? If so, how do I fix? I'd like to nest these elements if thats the way you should do it.", "likes": 0}, "replies": [{"author": "hertderg12", "text": "And now that it is .scss white overrules the blue background and also pushes my controls to the top left hand corner of page. lol. Anyone have a tip?", "likes": 0}, {"author": "hertderg12", "text": "Solved it myself, my Styles File was saved as .css not .scss. Felt nice recognizing that and making the change on my own. Nested elements working now.", "likes": 0}]}, {"topLevelComment": {"author": "S D", "text": "My code looks just exactly like the tutorial, I even verified the github, but I am not able to get the section background colors to appear after adding the .active{display: block;} piece to the styles doc. On the backend, everything seems to be going fine too. Anyone else having this problem???", "likes": 1}, "replies": [{"author": "Sebastian Urrea", "text": "@Juskaran Buted  i was having the same problem, but did what Cogs of Ra Studios suggested  and it worked, press ctrl+shift+p to open the command palette and type \"live SASS: Watch SASS\" this fixed the problem, hope it works for you too", "likes": 0}, {"author": "Juskaran Buted", "text": "same problem", "likes": 0}, {"author": "noon", "text": "same here", "likes": 0}, {"author": "Sir Francis", "text": "me too looking for the solution.", "likes": 0}]}, {"topLevelComment": {"author": "S D", "text": "I'm having a bunch of issues with my code just in the first section. Anyone on here would like to get a group to talk over the issues we are seeing?? We can set up a Discord or something like that", "likes": 0}, "replies": [{"author": "Wafula Lukorito", "text": "How did the tutorial work out?", "likes": 0}]}, {"topLevelComment": {"author": "Holy Sandwich", "text": "I am a newbie at CSS and JS. This video is very educational!!! One problem I am facing is that the size problem. (maybe because I am opening in Chrome and Firefox.) The size is too wide or long. The items in left grid box is too close to the left and so do the right grid box items are too close to the right at 1:17:20 How can I fix that problem?\n\nedit: I change some padding in boxes and it worked now. :)\nedit2: It takes me about 3 days.", "likes": 2}, "replies": [{"author": "Omar Mohammd", "text": "maybe change the padding", "likes": 0}, {"author": "Zarnab Khan", "text": "@Holy Sandwich thank you for the help all I needed to change was remove the padding property from the section in css", "likes": 1}, {"author": "Holy Sandwich", "text": "@Zarnab Khan in almost every container (main content container, portfolio container, blog container etc) do a padding on left and right with some value like 5rem.  This problem occurs because our pc don't match the resolution, with this utuber's.\n\n\nedit: (this problem can also be solved by changing in settings. try 100% in screen size with recommended pixels. I'm using window 11. But I don't want to change my settings so I add paddings)", "likes": 0}, {"author": "Zarnab Khan", "text": "I am facing the same problem where did you make the edits?", "likes": 0}]}, {"topLevelComment": {"author": "marginIsZero", "text": "This is an awesome tutorial", "likes": 0}}, {"topLevelComment": {"author": "JADID IG", "text": "Whoever has an old computer, I want to learn programming strongly, send a reply, and thank you very much", "likes": 0}}, {"topLevelComment": {"author": "pavan gogineni", "text": "Hello the link for my code is not working. When I was searching in net it does not coming.can you please help me", "likes": 0}}, {"topLevelComment": {"author": "Abram Wuliger", "text": "at 33:00 in the function PageTransistions() the replace method doesn't seem to be working. In the console it keeps printing an additional active-btn instead of removing and replacing it with an empty string. So now the active color fills each button I click and instead of only one being selected. I have the code writing out to the tee... any suggestions? here is the following code:                                                                                                                                                  \n\nconst sections = document.querySelectorAll('.section');\nconst sectBtns = document.querySelectorAll('.controls');\nconst sectBtn = document.querySelectorAll('.control');\nconst allSections = document.querySelector('.main-content');\n\n\nfunction pageSwitch() {\n  // btn click active class\n    for(let i = 0; i < sectBtn.length; i++) {\n        sectBtn[i].addEventListener('click', function() {\n            let currentBtn = document.querySelectorAll('.active-btn');\n            currentBtn[0].className = currentBtn[0].className.replace('.active-btn', '');\n            this.className += ' active-btn';\n        })\n    }\n}\n\npageSwitch();", "likes": 1}, "replies": [{"author": "Abram Wuliger", "text": "figured it out! it should be: replace(' active-btn', '');", "likes": 2}]}, {"topLevelComment": {"author": "Mary Usaji", "text": "I started building and stopped at 5.37", "likes": 0}}, {"topLevelComment": {"author": "pavan gogineni", "text": "I am getting const error in app.js file", "likes": 0}}, {"topLevelComment": {"author": "Discovery Unit", "text": "Thank you so much for this video. I learned a lot from it. More of this good stuff! :)", "likes": 2}}, {"topLevelComment": {"author": "Rudolph Lawson", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Rużal", "text": "25:55", "likes": 0}}, {"topLevelComment": {"author": "Neddier", "text": "4:38 If you cant run a live server, you should remake index.html file. It also fixed Emmet Abbreviations", "likes": 0}}, {"topLevelComment": {"author": "Luka Chemia", "text": "how to remove the active class from the not useable at that moment button?", "likes": 1}}, {"topLevelComment": {"author": "Szymon", "text": "41:05 Shouldn't it be \"sectBtn\" ?", "likes": 0}}, {"topLevelComment": {"author": "oluwapelumi azeez", "text": "why do we set the  \"color: var(--color-white);\" in the body and then repeat in the header and section ?", "likes": 0}}, {"topLevelComment": {"author": "Junior Bertrand", "text": "This is good, but i think you need to explain more your choices.", "likes": 1}}, {"topLevelComment": {"author": "codewithfarhad", "text": "sorry to say but while this theme/ portoflio is cool on the frontend, the instructor takes absolutely no pain in \"explaining\" why he is doing what he is doing.  most of the time, he is just typing stuff out with zero explanation. This is not very friendly for the beginners, and like other experience coders have stated, the code does not exactly follow \"best practices\" either.", "likes": 3}}, {"topLevelComment": {"author": "Noah Aghedo", "text": "Thank you very much.\nThis video improved my CSS a lot.", "likes": 1}}, {"topLevelComment": {"author": "kushagra upadhyay", "text": "Getting an error after 38:50 that allSections.addEventListener is not a function", "likes": 2}, "replies": [{"author": "Dorothy Muhonja", "text": "@Mohammad Ehsan Thank you so much for this", "likes": 0}, {"author": "kushagra upadhyay", "text": "@Mohammad Ehsan thx it wokred", "likes": 0}, {"author": "kushagra upadhyay", "text": "@Pixel Chaos thx for help will revert back with js", "likes": 0}, {"author": "kushagra upadhyay", "text": "@Mohammad Ehsan thx buddy for help I will try and do the same", "likes": 2}, {"author": "Mohammad Ehsan", "text": "Solved: \nin app.js,\n\nin line:4, change document.querySelectorAll to just document.querySelector\n\n\nso it will be const allSections = document.querySelector('.main-content');\n\nI know, I made this mistake too.", "likes": 1}]}, {"topLevelComment": {"author": "Nguyễn Thế Anh", "text": "I wonder why the name Vietnam? The video is great. Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "The Why Channel", "text": "PLEASE HELP: \nProblem: On browser console this error appears: \n//\"app.js:17 Uncaught TypeError: allSections.addEventListener is not a function\n    at PageTransitions (app.js:17:17)\n    at app.js:34:1\"\n\nError is at in code: allSections.addEventListener('click', (e) =>{\n\nThis error doesn't allow me to click on section  and go to other sections. Only the main/home section is active.\n\nCode:\nconst sections = document.querySelectorAll('.sectioin');\nconst sectBtns = document.querySelectorAll('.controls');\nconst sectBtn = document.querySelectorAll('.control');\nconst allSections = document.querySelectorAll('.main-content');\n\n\nfunction PageTransitions(){\n    //Button click active class\n    for (let i = 0; i < sectBtn.length; i++){\n        sectBtn[i].addEventListener('click', function(){\n            let currentBtn = document.querySelectorAll('.active-btn');\n            currentBtn[0].className = currentBtn[0].className.replace('active-btn', '');\n            this.className += 'active-btn';\n        })\n    }\n\n    allSections.addEventListener('click', (e) =>{\n        const id = e.target.dataset.id;\n        if(id){\n            sectBtns.forEach((btn) =>{\n                btn.classList.remove('active');\n            })\n            e.target.classList.add('active')\n            sections.forEach((section)=>{\n                section.classList.remove('active')\n            })\n            \n            const element = document.getElementById(id);\n            element.classList.add('active');\n        }\n    })\n}\n\nPageTransitions();\n\n\nThank you very much for your help!!! :) xx", "likes": 1}, "replies": [{"author": "noon", "text": "@Mohammad Ehsan i fixed it but i cant get the colors to change for each section", "likes": 0}, {"author": "Mohammad Ehsan", "text": "Solved: \r\nin app.js,\r\n\r\nin line:4, change document.querySelectorAll to just document.querySelector\r\n\r\nso it will be const allSections = document.querySelector('.main-content');\r\n\r\nI made this mistake too", "likes": 1}]}, {"topLevelComment": {"author": "Gonzalo Toscano", "text": "Muchas Gracias por este aporte!!\nen 1:34:05 para que funcione el ::before hay que agregar display: block; y position:  relative; \nexitos!!", "likes": 4}}, {"topLevelComment": {"author": "Sohaib awan", "text": "Plz upload html,css and Django.", "likes": 0}}, {"topLevelComment": {"author": "Christiano", "text": "Nice video 👏... Worth it 💯", "likes": 0}}, {"topLevelComment": {"author": "Brian Itumo", "text": "Good job . Absolutely fantastic. I love everything about it. Keep it up. I kinda wish it was made with Vue JS though.", "likes": 6}}, {"topLevelComment": {"author": "Boxsewanto Alkopsewa", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Kaysarul Alam", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Firoo", "text": "wow this great project 👍✅and if you have a project that related with e-commerce .....", "likes": 0}}, {"topLevelComment": {"author": "Yuri Soares", "text": "Fot the Media Query, again the problem could be solved by Specificit Calculator.\r\nInstead of: header .right-header {};\r\nUsing: .header-ccontent .right-header {}; would solve it. This would put them as same strength, but because this is at a \"later\" part of file, the CSS is gonna overwrite the previous one.", "likes": 1}}, {"topLevelComment": {"author": "sir plus", "text": "can anyone help me i'm currently on the 47:40 part, and basically, only the first page gets a display animation, while the other pages only recieve icon animations, but after doing the icon animation once, it doesnt do it again. No console error, tried line 13 fix from\n            this.className += 'active-btn';\n             to\r\n            this.className += ' active-btn';\r\n\nStill did not work\n\nAny help would be much appreciated", "likes": 0}, "replies": [{"author": "sir plus", "text": "@Satyam Saw nope, did not work, thanks for helping but i guess i'm gonna try doing something easier for me now, I guess this one is a bit too hard for me to understand", "likes": 0}]}, {"topLevelComment": {"author": "mykalimba", "text": "33:20 It's perfectly fine to use an arrow function as the second \"callback\" parameter to addEventListener(). The trick is to specify a parameter for the event that is passed to the listener, then instead of using \"this\" to reference the element associated with the event, use the \"target\" property of the passed in event. Like such:\n\nelement.addEventListener('click', (ev) => {\n     const btn = ev.target; // <--- \"btn\" is now the button element that was clicked\n});\n\nAlso, it's much simper to add & remove class names from an element using its \"classList\" property. Use element.classList.add('some-class') to add the class, and element.classList.remove('some-class') to remove it.", "likes": 52}, "replies": [{"author": "GamingJedi", "text": "@Sean Patterson oh, just made a fool of myself", "likes": 0}, {"author": "Sean Patterson", "text": "@GamingJedi @Dylan J. Gerrits is listed on the GitHub repository as one of the contributors to the project", "likes": 2}, {"author": "Geee", "text": "This is where I am failing to grasp the trick. It works on his side. Doesn't work on my side. Very strange. I might have some java restrictions. But why would that happen just on this file?", "likes": 0}, {"author": "Amay", "text": "@Dylan J. Gerrits Thankyou man, huge thankyou", "likes": 0}, {"author": "Аngelevski Blagoja", "text": "@Dylan J. Gerrits\n secBtns.forEach((btn) => {\r\n    btn.addEventListener('click', (e) => {\r\n        document.querySelector('.active-btn').classList.remove('active-btn')\r\n        document.querySelector('.active').classList.remove('active')\r\n        e.target.classList.add('active-btn')\n\r\n        let secElement = document.querySelector(`#${e.target.dataset.id}`)\r\n        secElement.classList.add('active')\r\n        \r\n    })\r\n})", "likes": 0}]}, {"topLevelComment": {"author": "Michael Oxborrow", "text": "Not using a mobile first approach?", "likes": 0}}, {"topLevelComment": {"author": "Pixel Chaos", "text": "Text doesn't split across the two columns after many attempts like at 53.31, can someone with more knowledge explain?", "likes": 0}, "replies": [{"author": "Pixel Chaos", "text": "@anik gupta Sorry that didn't work", "likes": 0}, {"author": "anik gupta", "text": "this issue can be solved by just click on watch sass and boom!!", "likes": 0}, {"author": "anik gupta", "text": "same issue", "likes": 0}]}, {"topLevelComment": {"author": "NachoNinja6", "text": "how do i get it to send emails to my email, how to link my socail and projects?", "likes": 0}}, {"topLevelComment": {"author": "lizikakizil", "text": "Goodness, this portfolio site tutorial is possibly my favorite I've seen. There are so many things I've been looking to implement on mine. Thank you always, FCC!", "likes": 9}}, {"topLevelComment": {"author": "Tribulations solo", "text": "It looks like the hovers don't work in the sections \"my blogs\" and \"my portfolio\". Is some else having this issue ?", "likes": 0}}, {"topLevelComment": {"author": "Captain Anunnaki", "text": "Should I code along or should I just watch it, how does it work best for you guys?", "likes": 1}, "replies": [{"author": "Adeel Khan", "text": "@Satyam Saw I've noticed that too! some of the classes he added weren't even used so i just decided to quit the video at the first half since it got very confusing. I was having an issue where i had to spam click the buttons to change the section.  There was this another issue where the transition between sections wasn't working very well. Sadly,  I'm gonna have to pass on this one.", "likes": 0}]}, {"topLevelComment": {"author": "unreal", "text": "thank you, good video !! perfect teacher 😁", "likes": 0}}, {"topLevelComment": {"author": "victor", "text": "I can't get my 'About Me' page to look like yours. Your's is well margined all around, and mine is stretched to fit the screen. The code matches, so I don't know what is wrong. Appreciate the content though..", "likes": 2}, "replies": [{"author": "zhanar utepbergenova", "text": "@Ilya Sinyugin same here! have you found a solution? thnx )", "likes": 0}, {"author": "zhanar utepbergenova", "text": "same here! have you found a solution? thnx )", "likes": 0}, {"author": "Ilya Sinyugin", "text": "Same error. Did you manage to find a solution>?", "likes": 0}]}, {"topLevelComment": {"author": "ABS Academy", "text": "Thank you, Its an informational video.", "likes": 0}}, {"topLevelComment": {"author": "Jaaay", "text": "Loving the tutorial so far. I have an issue early on with my buttons showing which is actually selected. Inside of the console and inspector everything updates and changes active classes, etc. checked all my code and it’s all the same up to the point I am at. Please help if you have any advise on what I might’ve missed.", "likes": 4}, "replies": [{"author": "MrYossell", "text": "If you're talking about the part at around 33' -- there's a difference between '.active-btn',  and ' active-btn' (the second has a hard-to-see space between the first quote and the 'active'. Without this space, it doesn't work). Setting this.className += ' active-btn'  (with space) made it finally work for me.", "likes": 2}]}, {"topLevelComment": {"author": "Jackson Walker", "text": "Hi,\nWhen I click the button at 45:00 the background color does not show up except for \"<div class=\"control  control-1 active-btn\" data-id=\"home\" >\"\nPlease someone help!\n\n\n\n\n\n\n\nHTML:\n        <div class=\"control  control-1 active-btn\" data-id=\"home\" >\n            <i class=\"fas fa-home\"></i>\n        </div>\n        <div class=\"control control-2 \" data-id=\"about\">\n            <i class=\"fas fa-user\"></i>\n        </div>\n        <div class=\"control control-3\" data-id=\"portfolio\">\n            <i class=\"fas fa-briefcase\"></i>\n        </div>\n        <div class=\"control control-4\" data-id=\"blogs\">\n            <i class=\"far fa-newspaper\"></i>\n        </div>\n        <div class=\"control control-5\" data-id=\"contact\">\n            <i class=\"fas fa-envelope-open\"></i>\n        </div>\n\nCSS:\n.section{\n    transform: translateY(-100%) scale(0);\n    transition: all .4s ease-in-out;\n    background-color: var(--color-primary);\n}\n\n.sec1{\n    display: none;\n    transform: translateY(0) scale(1);\n    padding: 0 !important;\n    background-color: greenyellow\n}\n\n.sec2{\n    display: none;\n    transform: translateY(0) scale(1);\n    background-color: coral;\n}\n\n.sec3{\n    display: none;\n    transform: translateY(0) scale(1);\n    background-color: red;\n}\n.sec4{\n    display: none;\n    transform: translateY(0) scale(1);\n}\n\n.sec5{\n    display: none;\n    transform: translateY(0) scale(1);\n}\n\n.active{\n    display: block;\n    animation: scaleAnim 1s ease-in-out;\n    @keyframes scaleAnim {\n        0%{\n            transform: translateY(-100%) scaleY(0)\n        }\n\n        100%{\n            transform: translateY(0) scaleY(1)\n        }\n    }\n}\n\n\n//controls\n.controlls{\n    position:fixed;\n    z-index: 10;\n    top:50%;\n    right:3%;\n    display:flex;\n    flex-direction: column;\n    transform: translateY(-50%);\n    align-items: center;\n    justify-content: center;\n    .active-btn{\n        background-color: var(--color-secondary) !important;\n        transition: all .4s ease-in-out;\n        i{\n            color: var(--color-white) !important;\n        }\n    }\n    .control{\n        padding:1rem;\n        cursor: pointer;\n        background-color: var(--color-grey-4);\n        width:55px;\n        height:55px;\n        border-radius: 50%;\n        display: flex;\n        justify-content: center;\n        align-items: center;\n        margin: .7rem 0;\n        box-shadow:var(--box-shadow-1);\n        i{\n            font-size: 1.2rem;\n            color: var(--color-grey-2);\n            pointer-events: none;\n        }\n    }\n}", "likes": 0}, "replies": [{"author": "Eric Antao", "text": "post the js code... Also something weird happened to my page....If i click on the icon part of the button the colors dont change....but if i move my mouse slight away from the button but still background part of the button the section colors change", "likes": 0}]}, {"topLevelComment": {"author": "Noam Turgeman", "text": "anyone knows why its not linking the css to the html? i did all exactly like him", "likes": 0}}, {"topLevelComment": {"author": "Johnathan Vargas", "text": "ok so for main-title the about me  show up fine but for my portfolio the words are spread out. can't seem to fix it", "likes": 0}, "replies": [{"author": "Ilya Sinyugin", "text": "@Johnathan Vargas What are the portfolio items? Still can't fix this bug", "likes": 0}, {"author": "Johnathan Vargas", "text": "having more then 3 porfolio items is whats affecting this", "likes": 0}]}, {"topLevelComment": {"author": "DP", "text": "I found this video not very helpful for me as a beginner.", "likes": 0}}, {"topLevelComment": {"author": "DP", "text": "Controlls?", "likes": 0}}, {"topLevelComment": {"author": "Archit Garg", "text": "Please make an Part-2 of this, Its really impressive\nThanks MacLinz & freeCodeCamp for this video 👍", "likes": 6}}, {"topLevelComment": {"author": "Narendra", "text": "Content  is Very Good .But, As a Entry Level Developer  Point of View ,this way of teaching is not correct manner.. Detailed explanation is not much here!!", "likes": 2}, "replies": [{"author": "Brian", "text": "As an entry level developer I agree with you. Its easy to follow along but I cant say I really learned much as it's sort of just read off as a list with no depth or explanations.", "likes": 0}]}, {"topLevelComment": {"author": "codingIsLove", "text": "freeCodeCamp, you are absolutely awesome. Thanks for providing so much top content. Just something I would really be stoked about to see here:\nA Complex ReactJS TypeScript project, not just a smaller one for 1.5 hours, but a big one, where you learn almost everything :) Such complexe reactjs TypeScript tutorials are pretty damn rare every :( Thanks a lot <3", "likes": 6}, "replies": [{"author": "Bethany Ann", "text": "check out these tutorials. freecodecamp has featured him in the past, and he's got some great-looking typescript/react tutorials that are easy to follow along with. \nhttps://www.youtube.com/c/weibenfalk", "likes": 0}]}, {"topLevelComment": {"author": "CTILET", "text": "when i read a Js function to active-btn  it dosent work! i even copy the code from Github, but still", "likes": 0}, "replies": [{"author": "Jose Sirias", "text": "I got stuck at the same spot too keeps saying currentBtn[0] is undefined and cant get understand why", "likes": 1}]}, {"topLevelComment": {"author": "squash 101", "text": "I followed along with the code but the the index.html and the style.css didn't link up for me can someone help?", "likes": 0}, "replies": [{"author": "Pixel Chaos", "text": "@Corazón De Papel  Copy this into your sass live format settings(above the current settings there), and point it to the folder you want the files to generate in i.e 'styles' and then link it like he did in the video\n {\r\n    \"liveSassCompile.settings.formats\": [\r\n    \r\n\r\n        {\r\n         \"format\": \"expanded\",\r\n         \"extensionName\": \".css\",\r\n         \"savePath\": \"/styles\"\r\n        }\r\n       ],", "likes": 0}, {"author": "Corazón De Papel", "text": "Same, and for me it seems like it's related to SASS because I don't have the extra files that appear when you create the scss file, and it links fine with an actual css file.", "likes": 0}]}, {"topLevelComment": {"author": "squash 101", "text": "The images from fontawesome don't pop up any advice. Stuck at 17:15", "likes": 0}, "replies": [{"author": "squash 101", "text": "Ricardo Hdz I couldn’t get it to work the css wasn’t working when I tried the downloading cass but it turns out this one isn’t really working either. Were you able to make the css work?", "likes": 0}, {"author": "Ricardo Hdz", "text": "@squash 101 You can link it with <link rel=\"stylesheet\" href=\"styles/styles.css> but I recommend following the tutorial step by step", "likes": 0}, {"author": "squash 101", "text": "@Ricardo Hdz Thank you! Also one more thing turns out my style.css folder isn't linked to the index one how would I go about doing it. I'm not using SASS like the user is it okay for me to just use styles.css", "likes": 0}, {"author": "Ricardo Hdz", "text": "You have to create a fontawesome account, then they'll give you a \"kit\" which is a piece of code that you have to paste in the html file.\n\nAfter that, every icon should appear without problem.", "likes": 1}]}, {"topLevelComment": {"author": "05_JAYANT CHALAKE", "text": "Plz upload tutorial on Java Full stack development course", "likes": 0}}, {"topLevelComment": {"author": "Aiman Fariz", "text": "My header doesn't remove the active class when switching to other sections. I have cross-checked the code but everything seems fine. Active only changes on the controls but not on the sections.", "likes": 1}, "replies": [{"author": "wail samjouni", "text": "const bodyElement = document.querySelector('.body');\r\nconst iconsContainer = document.querySelectorAll('.container');\r\nconst icons = document.querySelectorAll('.icons');\r\nconst sections = document.querySelectorAll('.section');\r\n\r\nfunction handleBodyClick() {\r\n    bodyElement.addEventListener('click', (event) => {\r\n        const clickedElement = event.target.dataset.id;\r\n        if (clickedElement) {\r\n            // iconsContainer.forEach(icon => {\r\n            //     icon.classList.remove('activeSection');\r\n            // });\r\n            event.target.classList.add('activeSection');\r\n            sections.forEach(section => {\r\n                section.classList.remove('activeSection');\r\n            })\r\n            document.getElementById(clickedElement).classList.add('activeSection');\r\n        }\r\n    })\r\n}\r\n\r\nhandleBodyClick();", "likes": 0}, {"author": "Illyria J2b2", "text": "@Francisco Javier de la Garza Escamilla Still other errors that show up such as the element.classList.add('active') gives an error as does the toggle.", "likes": 0}, {"author": "Francisco Javier de la Garza Escamilla", "text": "Change the last const from querySelectorAll to just querySelector, like this: const allSections = document.querySelector('.main-content'); it's a mistake in the video but it will make it work.", "likes": 1}, {"author": "Aiman Fariz", "text": "@Minh Tuấn as of now, not yet. If anyone knows how to, please help", "likes": 0}, {"author": "Minh Tuấn", "text": "me too, any solution", "likes": 0}]}, {"topLevelComment": {"author": "Johnathan Vargas", "text": "stuck at 1:09. the about me and my stats are not on top of each other", "likes": 0}, "replies": [{"author": "Ilya Sinyugin", "text": "@Johnathan Vargas minus next to translate?", "likes": 0}, {"author": "Johnathan Vargas", "text": "@Ricardo Hdz I forgot to put a minus next to one of the 50’s lol. Simple typo lol", "likes": 0}, {"author": "Ricardo Hdz", "text": "@Johnathan Vargas How? Can you explain your solution please?", "likes": 0}, {"author": "Johnathan Vargas", "text": "nevermind i got it to work", "likes": 0}]}, {"topLevelComment": {"author": "Jaime pardo", "text": "*Crypto currency and NFTs will outsmart the banking system in the nearest future serving as a global fiat. Already making over 85% profit from my current investment*", "likes": 3}, "replies": [{"author": "Melissa Hehl", "text": "Obviously, I've earned roughly about $520,000 trading under Mrs Christine Norine Martin her strategies is second to none and highlyCrypto currency and NFTs will outsmart the banking system in the nearest future serving as a global fiat. Already making over 85% profit from my current investment  profitable.", "likes": 0}]}, {"topLevelComment": {"author": "AlpNix Tech", "text": "This tutorial is great! I was just thinking about making a portfolio website for myself. Thanks a lot freeCodeCamp!", "likes": 4}}, {"topLevelComment": {"author": "Thee Placids", "text": "My header doesn't remove the active class when switching to other sections. I have cross checked the code but everything seems fine. Active only changes on  the controls but not on the sections.", "likes": 7}, "replies": [{"author": "Jerrell Jackson", "text": "any idea on why i cant select the icons?", "likes": 0}, {"author": "Jason Bsng", "text": "@Francisco Javier de la Garza Escamilla \nconst allSections = document.querySelector('main-content');\n\nallSections.addEventListener('click', (e) =>{\r\n        console.log(e.target);\n\nI try to console out but it gives me error.\nSCRIPT5007: Unable to get property 'addEventListener' of undefined or null reference\n\nDo you know why? I followed correctly until 39.06 and got stuck at here.", "likes": 1}, {"author": "Vlogs_________", "text": "thank you somuch i was struggling at this stage", "likes": 2}, {"author": "Sir Francis", "text": "@Francisco Javier de la Garza Escamilla Thanks Man You are a life saver", "likes": 3}, {"author": "Jesse Jason", "text": "@Francisco Javier de la Garza Escamilla Really appreciate, it worked after making this change, thanks a lot", "likes": 3}]}, {"topLevelComment": {"author": "Asif Dawood", "text": "Beautifully designed portfolio site . Thank you for the video.", "likes": 4}}, {"topLevelComment": {"author": "RoxaneArtc", "text": "I will come back to this video once I learn Javascript", "likes": 0}}, {"topLevelComment": {"author": "SuprGamer", "text": "Getting an error after 38:50 that allSections.addEventListener is not a function", "likes": 4}, "replies": [{"author": "Mohit Jaiswal", "text": "@Mohammad Ehsan but also having problem when clicked  on items color not changing .", "likes": 0}, {"author": "Mohammad Ehsan", "text": "Solved: \r\nin app.js,\r\n\r\nin line:4, change document.querySelectorAll to just document.querySelector\r\n\r\nso it will be const allSections = document.querySelector('.main-content');\r\n\r\nYou can see that he actually made this change but he didn't show it in the video.", "likes": 1}, {"author": "Illyria J2b2", "text": "Same here. I even tried to copy paste the entire JavaScript from github and same error but when I removed the ''all'' from querySelector for const allSections it worked but there's anther error for the element.classList.add('active') now  app.js:33 Uncaught TypeError: Cannot read properties of null (reading 'classList')\n    at HTMLBodyElement.<anonymous> . Then I also got an error for the whole toggle thing too. the last two sections wont work.", "likes": 2}]}, {"topLevelComment": {"author": "Prajwal Chaudhary", "text": "i m getting an error in the for loop in the app.js part, it says that a (for-of) loop should be used instead . what's the fix for that ?", "likes": 0}}, {"topLevelComment": {"author": "Aurelian Stanica", "text": "Will not respond when I click the buttons(only change the green color on the buttons itself, but not getting the response of the sections with different background colors... In console log trow me this error: \napp.js:20 Uncaught TypeError: allSections.addEventListener is not a function\n    at PageTreansition (app.js:20:15)\n    at app.js:37:1\n\n\n  //Sections Active class\r\n  allSections.addEventListener(\"click\", (e) => {   //As far as know, or what console log is telling me, the issue is on this line, but could not find a solution...\r\n    const id = e.target.dataset.id;\r\n    if (id) {\r\n      //remove selected from the other sectBtns\r\n      sectBtns.forEach((btn) => {\r\n        btn.classList.remove(\"active\");\r\n      });\r\n      e.target.classList.add(\"active\");\r\n      //hide other sections\r\n      sections.forEach((section) => {\r\n        section.classList.remove(\"active\");\r\n      });\r\n      const element = document.getElementById(id);\r\n      element.classList.add(\"active\");\r\n    }\r\n  });\r\n}", "likes": 1}, "replies": [{"author": "Aurelian Stanica", "text": "@Francisco Javier de la Garza Escamilla Thank you so much, is working! Now I just saw..MacLinz had it like that too... querySelector, and not querySelectorAll... but you know when you are a beginner...and the visual studio code do autocomplete for you... Anyway thank you again, I can crack on now, until next problem... :)))", "likes": 1}, {"author": "mco", "text": "@Francisco Javier de la Garza Escamilla Nice !!  Thanks!", "likes": 1}, {"author": "Francisco Javier de la Garza Escamilla", "text": "Change the last const from querySelectorAll to just querySelector, like this: const allSections = document.querySelector('.main-content'); it's a mistake in the video but it will make it work.", "likes": 8}, {"author": "SuprGamer", "text": "same issue", "likes": 1}]}, {"topLevelComment": {"author": "alejandro hensel", "text": "Next time swalow and then do the vídeo, please", "likes": 0}}, {"topLevelComment": {"author": "متجر المميز", "text": "cooooool chanell hello iam abdallah from egypt i love this chanell", "likes": 0}}, {"topLevelComment": {"author": "Narendra Koya", "text": "Is this tutorial  useful for Beginners or Not??", "likes": 0}, "replies": [{"author": "Cyrus G", "text": "I feel like this is meant for those who already have existing knowledge in terms of html css and javascript. Beginners will only ever be confused if they follow along with this tutorial.", "likes": 1}, {"author": "squash 101", "text": "Not really I couldn't even get past the 10:30 mark. I wasn't able to get the instagram image to show up on my portfolio", "likes": 0}]}, {"topLevelComment": {"author": "Sikka", "text": "please upload Blander 3D design course", "likes": 1}}, {"topLevelComment": {"author": "Charlie Bellow", "text": "what is the name of this extension that makes the indentation colored?", "likes": 0}, "replies": [{"author": "Charlie Bellow", "text": "@Zolger Webdesign \nthat's true. this extension worked. thanks", "likes": 1}, {"author": "Zolger Webdesign", "text": "That's the indent-rainbow extension in VS code", "likes": 2}, {"author": "Jay S", "text": "@Charlie Bellow  maybe you need to do some updates. or... idk, do you have all the other extensions?", "likes": 0}, {"author": "Charlie Bellow", "text": "@Jay S \nthis is weird, it didn't work here..", "likes": 0}, {"author": "Jay S", "text": "@Charlie Bellow I didn’t have to do any configuration. Just installed it and it worked from there…", "likes": 0}]}, {"topLevelComment": {"author": "Arbaz maldar", "text": "How can I get source code of any website to clone/copy the project and can do some change in it. plz help me out", "likes": 0}}, {"topLevelComment": {"author": "Vaibhav Sharma", "text": "I don't know why that all the css u apply and how ur screen looks mine doesn't look the same \nReally facing problem maybe it's due to differences in laptop screen size", "likes": 0}}, {"topLevelComment": {"author": "Marcos Dominguez", "text": "Good video overall. Suggestion: a bit more detailed explanations would go a long way, especially for relatively new developers :-)", "likes": 106}, "replies": [{"author": "Ahmet Yasir", "text": "yes it is very hard to catch the points. He passed very fast", "likes": 0}, {"author": "Universe Code", "text": "Watch video on YouTube and ... Create projects 🔥", "likes": 4}]}, {"topLevelComment": {"author": "Ben Aikins", "text": "This is good but he moved just too fast", "likes": 0}}, {"topLevelComment": {"author": "Benjamin", "text": "One advice as a react developer, explain more the reasons of your choices because the more people understand your vision the more they will ramp up... Here we feel like you just follow steps like a bot. \nExamples : why this type of html structure with 2 specific css classes (secX and sectionName) for each section ? why selecting an old versions of fontawesomes, you don't show enough each specific css property impact on the FE, which is very hard to understand for a beginner.", "likes": 124}, "replies": [{"author": "Blake XYZ", "text": "@Willy Just discovered \"100Devs by Leon Noel\". I just ran thru the first lecture, and I highly recommend. He's an amazing teacher!", "likes": 0}, {"author": "Willy", "text": "@Blake XYZ https://youtu.be/yQimoqo0-7g", "likes": 0}, {"author": "Willy", "text": "@Blake XYZ seconded, pls quote me wen u get it", "likes": 0}, {"author": "Blake XYZ", "text": "@Benjamin Do you have alternative suggestions for similar tutorials with explanations/reasoning for noobies? \n\nAny help is appreciated, cheers!", "likes": 0}, {"author": "Willy", "text": "@Enrico thank you so much 😊", "likes": 1}]}, {"topLevelComment": {"author": "Patrick niyibizi", "text": "why my browser is not displaying the styles from scss file? any one can help It looks like sccs is causing the issues in browser?", "likes": 1}, "replies": [{"author": "Hassan TAJIRI", "text": "press F5 button to clear your browser's cache, if it doesn't worrk, check your css link", "likes": 0}]}, {"topLevelComment": {"author": "Thiyagarajan Palaniappa", "text": "Guys i need help. I am trying to build this website but i got an error which I couldn’t solve for more than 2 hours. I would be pleased if anyone give a solution. In the app.js it says allSections.addEventListener is not a function. But i follow the same code written by the guy .", "likes": 0}, "replies": [{"author": "Sinsu", "text": "@Thiyagarajan Palaniappa I've exactly typed everything as the video, even what you mention and still doesn't work. It says: <Uncaught TypeError: Cannot read properties of undefined (reading 'className')\n    at HTMLDivElement.<anonymous> (app.js:11:44)>.  Any idea?", "likes": 0}, {"author": "Vipness", "text": "@Thiyagarajan Palaniappa Thank you, works perfectly now.", "likes": 1}, {"author": "Thiyagarajan Palaniappa", "text": "@Vipness its my mistake bro. check ur const allsections in app.js. it should be written as queryselector not queryselectorall. that is the problem. For ex: const allSections = document.querySelector('.main-content');", "likes": 1}, {"author": "Hassan TAJIRI", "text": "@Vipness mybe you forget a semicolone", "likes": 0}, {"author": "Vipness", "text": "I have the same issue at the moment.", "likes": 0}]}, {"topLevelComment": {"author": "Quân Bùi Thanh", "text": "OMG! the author is Vietnamese people, this is the first time I watched it, you are so good!", "likes": 0}}, {"topLevelComment": {"author": "James Vereker", "text": "I've noticed a lot of experienced CSS devs saying that there's a few mistakes in this video. If you could post ANY MISTAKES FOUND under this comment that would be very useful for me and other beginners. Also like the comment so others can see it :)", "likes": 74}, "replies": [{"author": "Soliu Abdulrahmon", "text": "@Bullfrog Beats Hope you've figured it out now.", "likes": 0}, {"author": "Tracy Yan", "text": "I got a same issue. Have you resolve it?@Pixel Chaos", "likes": 0}, {"author": "Gits Junior", "text": "@Jho Mendoza am also stuck here did you resolve it", "likes": 0}, {"author": "Tommi Lääperi", "text": "just learn to use CSS, and make your own master file instead of using bootstrap or any other framework. Also, there is no reason EVER to put percentage stats on your skills because no one is ever 100% complete at anything unless its like a video game. I mean 75% skills in reference to what exactly? Compared to your neighbour? it just seems like filling out unnecessary content for no reason.", "likes": 0}, {"author": "Bullfrog Beats", "text": "I'm at the part where we're making some of the sections active when we click on the corresponding button, but it's only working some of the time I click it? I checked my javascript and html like three times but can't find what's wrong. can anyone help?", "likes": 0}]}, {"topLevelComment": {"author": "Mạnh Hà Phùng", "text": "Thank you, but \"Nguyễn Văn Tài\", who 😂😂😁", "likes": 0}}, {"topLevelComment": {"author": "Tomas Burian", "text": "Absolute bomb, thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "Rumby praise", "text": "@1:14:08", "likes": 0}}, {"topLevelComment": {"author": "Loxsewan Alkopsewantio", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Kent Morado", "text": "Can i get a job and after doing this?", "likes": 1}}, {"topLevelComment": {"author": "Danik Erkinov", "text": "I can't switch between sections. I've checked all the code, it doesn't show my any errors. When the section is active, it doesn't change colors, text", "likes": 2}, "replies": [{"author": "Jay S", "text": "@Danik Erkinov damn 🚶🏽‍♀️ I was slightly off there", "likes": 0}, {"author": "Gits Junior", "text": "@Jay S wow great 😂😂", "likes": 0}, {"author": "Danik Erkinov", "text": "@Jay S Bro, I've spent more that half an hour to solve this problem. It was so stupid. My compiler has stopped working, and that's why my styles didn't apply", "likes": 0}, {"author": "Jay S", "text": "I had the same issue, and the fix was very irritating. This -- this.className += ' active-btn';  -- is in line 13 of the app.js code. I got error after error until I changed my code from 'active-btn' to ' active-btn'. A very small change, but it fixed my section-switching issue", "likes": 1}]}, {"topLevelComment": {"author": "Vladislav Derbenev", "text": "Personal notes of going through the course as returning angular dev\n\n6:30 - 21:34 Tutorial feels like sass typing exercise. With no indication of what exactly lines do or how teacher came up with it, it feels like that he's just re-typing the code from another monitor and I do the same after him. It doesn't change through the rest of tutorial.\n28:55 Here's key moment for the next part with the error: arrow functions are keeping the scope of closure, while \"function\" creates a new own. \"this\" references current scope. console.log(this) can be used as a tool to understand the difference\r\n29:50 This is interesting. I advice everyone to stop before 30:35 and try to solve or at least understand the problem yourself. Teacher first solves another error, not the logged one\r\n32:35 how to find what's undefined there: In chrome you can put a breakpoint on the line with the error and check variables. You'll see that currentBtn.length == 0, so currentBtn[0] is undefined on the second button click (but not first), due to removing 'active-btn' but not actually adding a new one\r\n33:20 you don't have to use function instead of arrow function. you can use event passed as first argument to access scope variables.  Example of how to use event argument of callback instead of rewriting the arrow function https://github.com/Paragonid/Portfolio_Website_2022/commit/889a38f26777a714ecebc509ff82f7d3a13d2c1b (typescript)\r\n\r\nI fast viewed through as continuation of typing exercise. There are rare moments with insights of how problems appear and get solved, but imo it's not suitable for learning and not worth watching\n\nsass notes:\n1. The Sass team discourages the continued use of the @import rule\r\n2. The project has no splitting of scss into sub-files.\r\n3. The use of 0rem 0em is redundant, should be just 0\r\n4. !important should be avoided in most of the used cases\r\n5. A lot of repetition and overlaying rules. Duplication of .left-header rule in the _media.scss", "likes": 15}, "replies": [{"author": "Vladislav Derbenev", "text": "@Diego Berastain nice, I rewrote the loop as .forEach in my case, but having access to i as workaround is probably why the teacher went with for loop instead of forEach in first place.", "likes": 1}, {"author": "Diego Berastain", "text": "@Vladislav Derbenev Without the event as an argument you can use secBtn[i].className += \" active-btn\";", "likes": 0}, {"author": "Vladislav Derbenev", "text": "28:55 Here's key moment for the next part with the error: arrow functions are keeping the scope of closure, while \"function\" creates a new own. \"this\" references current scope. console.log(this) can be used as a tool to understand the difference\n29:50 This is interesting. I advice everyone to stop before 30:35 and try to solve or at least understand the problem yourself. Teacher first solves another error, not the logged one\n32:35 how to find what's undefined there: In chrome you can put a breakpoint on the line with the error and check variables. You'll see that currentBtn.length == 0, so currentBtn[0] is undefined on the second button click (but not first), due to removing 'active-btn' but not actually adding a new one\n33:20 you don't have to use function instead of arrow function. you can use event passed as first argument to access scope variables.  Example of how to use event argument of callback instead of rewriting the arrow function https://github.com/Paragonid/Portfolio_Website_2022/commit/889a38f26777a714ecebc509ff82f7d3a13d2c1b (typescript)\n\n- 2:44:09 I fast viewed through as continuation of typing exercise. There are rare moments with insights of how problems appear and get solved, but imo it's not suitable for learning and not worth watching", "likes": 3}, {"author": "Anand Shukla", "text": "I felt the same. \nsorry to say", "likes": 3}]}, {"topLevelComment": {"author": "Jhon Natarios", "text": "Yesssss... I love this video :)", "likes": 0}}, {"topLevelComment": {"author": "Saqibuddin Siddique", "text": "Hello Sir, Please make a video on \"Database Synchronization\" with PHP", "likes": 1}}, {"topLevelComment": {"author": "Se Ku", "text": "Hi, this is really a great portfolio website. Thanks for the efforts.\r\n\r\nI noticed a small mistake. The buttons always remain active as soon as you click on them.\n\nOriginal code from the JS file:\n\n            //resmove selected from the other btns\r\n            sectBtns.forEach((btn) =>{\r\n                btn.classList.remove('active')\r\n            })\n\nmy suggestion is:\n\n            //remove selected from the other btns\r\n            const btns = sectBtns[0].children;\r\n            for (let btn of btns){\r\n                btn.classList.remove('active')\r\n            }", "likes": 23}, "replies": [{"author": "Bogdan", "text": "@Yuri Soares this worked for me as well, thank you for advice", "likes": 0}, {"author": "亗-FLASH  SNiPES", "text": "the active-btn background colour styling is not working idk y, can u please help me 22:56", "likes": 2}, {"author": "Yuri Soares", "text": "For me just removing the 's' at the final of sectBtns solved, though I don know if this is because I declared the class differently.", "likes": 1}, {"author": "Dina Fine", "text": "Thanks, Se Ku. 😁", "likes": 0}]}, {"topLevelComment": {"author": "CaQ", "text": "I am looking for a good front end tutorial which properly teaches how to structure the page, it's layout, the intended elements and then write code to achieve it.\nAll these videos on YouTube just start writing css/html code without explaining why it is being done. This is not good for learning to just watch and copy paste.\nis there any resource which teaches in proper sequence why we are writing the code to achieve what ?", "likes": 5}, "replies": [{"author": "Donn Jazy", "text": "I love your observation. Most YT web development tutorials just jump into coding without the sequence flow and how to achieve it by coding. In the end, you end up just copy and pasting codes. No ability to analyze and break down problems before coding it.", "likes": 0}, {"author": "Abdul Rehman", "text": "@Jacey Rebeka Leong You mean the blog ones", "likes": 0}, {"author": "MrPC Tech", "text": "Try frontend masters.", "likes": 0}, {"author": "Jacey Rebeka Leong", "text": "Actually if you wanna learn from scratch u can head to freecodecamp! They have easier tutorials than compared to their yt channel", "likes": 1}, {"author": "Abdul Rehman", "text": "I am also looking for it but still i can sometimes figure out why it is being done", "likes": 0}]}, {"topLevelComment": {"author": "江英This blogger is a scammer, received advertising ", "text": "🔹Registration bonus: 6000Trx This is our promotion website;\r\nhttps://www.createtrc.com/#/pages/user/register?r_code=10000003", "likes": 0}}, {"topLevelComment": {"author": "Telegram:@coo58 ", "text": "⬆Free money making website, get $100 when you sign up⬆", "likes": 0}}, {"topLevelComment": {"author": "Drone Acharya", "text": "just in time. i was thinking of making one yesterday night.", "likes": 0}}, {"topLevelComment": {"author": "Boxsewatio Doxsewstio", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "ME", "text": "haha Nguyễn Văn Tài :))", "likes": 0}}, {"topLevelComment": {"author": "S H", "text": "2:21:25", "likes": 0}}, {"topLevelComment": {"author": "tauseef ansari", "text": "Burp suite , wireshark full tutorial pls", "likes": 0}}, {"topLevelComment": {"author": "Viraj Sabhaya", "text": "Can't perform the switching the sections!!! doesn't show any error!", "likes": 1}}, {"topLevelComment": {"author": "Vaelin Al Sorna", "text": "Not a fan of the skill levels. It might give interviewers false expectations. \n\nImagine puting 100% on React and your interviewer is an expert at React but doesn't consider his/her skill level to be at 100% mastery. You're gonna be in a world of pain when you can't answer his/her \"advanced\" level questions about React. They're gonna be really disappointed and think, \"Thought you were an expert in React? How can you not know more than me but proclaim to be an expert?\"\n\nSo definitely don't put those skill percentages. You're doing yourself a disservice.", "likes": 7}, "replies": [{"author": "Adi", "text": "Agree", "likes": 0}]}, {"topLevelComment": {"author": "RODRIGO ACEVEDO", "text": "Thanks,  you rule!", "likes": 0}}, {"topLevelComment": {"author": "Ogar Joseph Odama", "text": "Nice work bro 😍", "likes": 0}}, {"topLevelComment": {"author": "Yuri Soares", "text": "I have been told to avoid using flag !important in CSS, seen like the problem was specificity. While I'm still in 23:33, seems like just putting: Code {.active-btn{...} and .controls .active-btn i {...} } under  Code {.controlls .control {...}  and .controlls .control i {...}} would solve it.\n\nI searched if YouTube had support for markdown code formatting, but it seems after so many years, still haven't.", "likes": 10}, "replies": [{"author": "Cyrus G", "text": "@Yuri Soares Yeah, I am a bit familiar with dev tools and I use it more often than I use my editor since i dont want to mess with my actual codes and have snowball effect. but yeah i am still exploring dev tools.\n\nabout !important, I am prolly doing this wrong but. I am looking for ways how it will mess with my output and trying to look for solutions to fix it, and tried putting bootstrap in my code and use !important in mediaquery. Now I am looking for a way to solve the solution by trying different things when in that kind of situation. \n\nSince I heard that sometimes you are put in a situation where it is said to be impossible to fix but you need to do it anyways since the lead says it needs to be this way.", "likes": 0}, {"author": "Yuri Soares", "text": "@Cyrus G I can't say where is it, but if you are having problems with overwrite, open Dev Mode in browser, and inspect the container/element you wish, there is a place in css field which shows the specificity. \nThen google it Specificity Calculator, actually with this tool you can just put yours selectors and see how you should select an element to overwrite.", "likes": 1}, {"author": "Cyrus G", "text": "I was experimenting with media queries and tried using !important. It can make your web look an absolute mess. I am beginner and I am already seeing problems with using !important. Hopefully I am not learning the wrong thing with what the !imporant messes up with.", "likes": 1}]}, {"topLevelComment": {"author": "Shubham Snehil", "text": "🙌🏻", "likes": 1}}, {"topLevelComment": {"author": "Pavan kumar", "text": "Make on angular", "likes": 0}}, {"topLevelComment": {"author": "Nikos R", "text": "chad  portofolio pic", "likes": 0}}, {"topLevelComment": {"author": "dthanhf", "text": "oh, Nguyễn Văn Tài 😂", "likes": 1}}, {"topLevelComment": {"author": "Paul Newton", "text": "After 2 decades maybe this will be what finally gets me to sitdown and make a portfolio website for myself.", "likes": 8}}, {"topLevelComment": {"author": "V A", "text": "Nooooiiiiiiiiice", "likes": 0}}, {"topLevelComment": {"author": "anik gupta", "text": "Good initiate for those who are early at this area.", "likes": 0}}, {"topLevelComment": {"author": "Kirolls Sabri", "text": "I really appreciate this work and thanks so much for helping me learn new stuff ❤️❤️❤️", "likes": 5}}, {"topLevelComment": {"author": "Mohith Gupta Korangi", "text": "Why does this look exactly like mine? :)))\nWas this inspored from an existing portfolio?", "likes": 0}}, {"topLevelComment": {"author": "Rajat Goel", "text": "Please make tutorial s on Android and also guide how to become worlds best bkendorful coder", "likes": 0}}, {"topLevelComment": {"author": "Tanmoy Mazumder", "text": "awesome.\nnow i just need stuff to actually put on the portfolio", "likes": 7}}, {"topLevelComment": {"author": "Saif Ur Rehman", "text": "kindly paste the pictures of the project here in the comment section so that we can code along.", "likes": 0}, "replies": [{"author": "Brian", "text": "theyre on github if you still need them", "likes": 0}]}, {"topLevelComment": {"author": "Lê Tuấn", "text": "Người Việt Nam luôn", "likes": 2}}, {"topLevelComment": {"author": "Walter L.Morton", "text": "If only you know what the future says, you'll know that indeed cryptocurrency is the future, investing in it now will be the wisest thing to do. Hold!!! And you\"'ll thank yourself", "likes": 8}, "replies": [{"author": "Ο Paul Kelly", "text": "Just bought $10k Ethereum and $30k bitcoin with the recent dump in crypto I was told it's the right time to buy and get ready for a skyrocket.", "likes": 0}, {"author": "Ο Paul Kelly", "text": "How does this whole bitcoin thing works, I'm interested in it and willing and ready to invest heavily but I need an assistant to properly guide me through on how to make a good startup and be successful in it without making mistakes.", "likes": 0}, {"author": "Angelina zee", "text": "Many of us don't know where to invest our money so we\ninvest it in wrong places and to the wrong people", "likes": 0}, {"author": "Фрея", "text": "Crypto trading is very profitable when you trade well.", "likes": 0}, {"author": "TerAus", "text": "Exactly, at the moment bitcoin is the best and profitable coin to buy and invest in.", "likes": 0}]}, {"topLevelComment": {"author": "LUCKY KUMAR", "text": "Thank you so much", "likes": 0}}, {"topLevelComment": {"author": "MAN", "text": "thanks for your team", "likes": 0}}, {"topLevelComment": {"author": "Yanceq", "text": "Yes!", "likes": 0}}, {"topLevelComment": {"author": "the tipstech", "text": "How to get the images he's using in the video ?", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "https://github.com/Maclinz/JS_CSS_PortfolioProject", "likes": 1}]}, {"topLevelComment": {"author": "Navendra Agrawal", "text": "Great", "likes": 0}}, {"topLevelComment": {"author": "Programmer", "text": "amazing", "likes": 0}}, {"topLevelComment": {"author": "The Dapper Foxtrot", "text": "We just started making portfolio websites. Curious to see how much overlap I find between this tutorial and my boot camp learnings.", "likes": 30}, "replies": [{"author": "The Dapper Foxtrot", "text": "@Donaven Bruce Sorry, just saw this! Indeed, I'm at Juno. \n\nYou'll have to do your research in your respective area to find who might have the best reputation, but I've heard great things about other boot camps in general. \n\nIt's been a great experience thus far. I'll be vlogging my journey through it! https://www.youtube.com/watch?v=hGGPh3vwO-Y&list=PLRYSMYTrErZh5UFc7dV_i_kTqn6T6dPJq&index=1", "likes": 2}, {"author": "Naija songs", "text": "Same here, please what is the name of your bootcamp", "likes": 0}, {"author": "Donaven Bruce", "text": "Whats your boot camp if you dont mind? i want to take a bootcamp one day", "likes": 1}]}, {"topLevelComment": {"author": "Swetha V", "text": "Could you please mention the link for source code?", "likes": 3}, "replies": [{"author": "Swetha V", "text": "@Me'utube Thanks", "likes": 0}, {"author": "Me'utube", "text": "Check the github link in the video description.", "likes": 0}]}, {"topLevelComment": {"author": "Omor Faruk", "text": "Please give all the images", "likes": 0}}, {"topLevelComment": {"author": "Vijay Navale", "text": "Where is source code?", "likes": 0}}, {"topLevelComment": {"author": "Mayank Vikash", "text": "FCC is spying on me, I just searched for Portfolio for developers. Police!!!", "likes": 1}}, {"topLevelComment": {"author": "Elvedin Wayne", "text": "Source code with images?", "likes": 1}, "replies": [{"author": "Me'utube", "text": "Check the github link in the video description.", "likes": 2}]}, {"topLevelComment": {"author": "Beth Budgets", "text": "Just figured out what I'm doing today...\n\nThanks!!", "likes": 0}}, {"topLevelComment": {"author": "Veeresh Biradar", "text": "Amazing really waiting for this ❤️ video thanks for uploading", "likes": 1}}, {"topLevelComment": {"author": "dambujo paulo", "text": "Nice tutorial", "likes": 0}}, {"topLevelComment": {"author": "Ayush", "text": "Just a personal suggestion that never add those stats like python 70% html 80% etc etc to your portfolio", "likes": 288}, "replies": [{"author": "Arseni Bulat", "text": "@Israel Robinson i think you can fill this page in with your experience in programming languages you know", "likes": 0}, {"author": "Israel Robinson", "text": "So what do we put there instead", "likes": 0}, {"author": "Arseni Bulat", "text": "Only in case it's 100%, btw good advice", "likes": 0}, {"author": "Adesanya Ibukunoluwa", "text": "I absolutely agree with this. The moment I saw the stats, I said to myself, if I would be building this, I will have something else or nothing there", "likes": 0}, {"author": "Codamination Channel", "text": "@gaming site you can get a job if you know about it", "likes": 0}]}, {"topLevelComment": {"author": "Abdulrahman Musa Mohammed", "text": "Nice build up…I’m fascinated!", "likes": 0}}, {"topLevelComment": {"author": "Ross Chan", "text": "thank", "likes": 0}}, {"topLevelComment": {"author": "Aziz Shifulla", "text": "......", "likes": 0}}, {"topLevelComment": {"author": "Diego Bittencourt", "text": "Awesome video! Already watching! \nI wonder if it is better to put your skills in percentage or leave it without that estimation.\nThank you a lot for the great content!", "likes": 7}, "replies": [{"author": "Jaden N", "text": "Personally, I'm against putting in a percent, because its too subjective", "likes": 5}]}, {"topLevelComment": {"author": "Edgars Bukovskis", "text": "Thanks!👍🏼", "likes": 0}}, {"topLevelComment": {"author": "Salman Nazir", "text": "can you make a video on some templates making using html and css\nthank you", "likes": 2}}, {"topLevelComment": {"author": "NK Arena Tamil", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "Sthefano Carvalho", "text": "Another great one!", "likes": 1}}, {"topLevelComment": {"author": "Abuzar Ansari", "text": "Thanks I need this kind of video as a struggling freelancer!", "likes": 14}, "replies": [{"author": "pro coder", "text": "Best of luck👍👍", "likes": 3}]}, {"topLevelComment": {"author": "Shardhay Vatshyayan", "text": "Best <3", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Raza Shibli", "text": "Today i was making a portfolio website and then they uploaded this gem", "likes": 2}}, {"topLevelComment": {"author": "Anas Al-Muslim", "text": "Interesting this channel is very useful ngl", "likes": 0}}, {"topLevelComment": {"author": "lawless", "text": "Learning a lot from this channel ❤❤❤", "likes": 2}}, {"topLevelComment": {"author": "julián Vélez", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "Azam Makhamatmuratov", "text": "Thanks", "likes": 1}}]}