{"video": {"id": "ZGOaCxX8HIU", "title": "How to Build Tetris in React - GameDev Tutorial (with React Hooks!)", "description": "Learn to create a Tetris game with React Hooks in this tutorial course for beginners. You will learn how to build Tetris from scratch using hooks like useState, useEffect, useCallback and custom hooks. Styling is done with Styled Components.\n\n💻 Starter files: https://github.com/weibenfalk/react-tetris-starter-files\n\n🎥 Tutorial from Thomas Weibenfalk. Check out his YouTube channel: https://www.youtube.com/channel/UCnnnWy4UTYN258FfVGeXBbg\n\n🔗 Watch more courses from Thomas on his website: https://www.weibenfalk.com/\n\n⭐️ Course Contents ⭐️\n⌨️ (00:00) Introduction\n⌨️ (03:40) create-react-app and tooling\n⌨️ (06:57) Scaffolding Components\n⌨️ (15:49) Stage and Tetrominos\n⌨️ (32:05) Styling with Styled Components\n⌨️ (57:19) usePlayer and useStage\n⌨️ (1:12:51) Stage update and player movement\n⌨️ (1:37:02) Collision Detection\n⌨️ (1:50:46) Player RotationG\n⌨️ (2:04:12) Clear Rows\n⌨️ (2:11:37) drop with useInterval\n⌨️ (2:18:47) useGameStatus and React.memo\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://www.freecodecamp.org/news", "duration": "PT2H34M18S", "likes": "3188", "views": "140930"}, "comments": [{"topLevelComment": {"author": "Dmswls", "text": "I want to add space bar (keyCode === 32) skill ! How can I develop this skill??", "likes": 0}}, {"topLevelComment": {"author": "Reef Kenig", "text": "Anybody experiences the issue of functions being called twice? It is happening to me with the sweepRows and who knows where else...", "likes": 0}}, {"topLevelComment": {"author": "Michael Vaughan", "text": "Thanks for the great video!", "likes": 0}}, {"topLevelComment": {"author": "Jhimy Michel", "text": "great video!", "likes": 0}}, {"topLevelComment": {"author": "Cameron Avvampato", "text": "2:06:00 haha found it funny they use \"ack\" (swedish ackumulator, I'm assuming) for \"accumulator\". I'm gonna use that from now on\n\nnice tutorial, thanks - but beware future viewers that you need to turn off strict mode on react or this won't work\n(there's a few other trip-ups in the video, but read through the comments and there are solutions there)", "likes": 0}}, {"topLevelComment": {"author": "muhammad ahsan", "text": "Uncaught TypeError: Cannot read properties of undefined (reading 'shape')\r\n    at usePlayer (usePlayer.js:7:1)\r\n    at Tetris (Tetris.js:20:1)\r\n    at renderWithHooks (react-dom.development.js:16305:1)\r\n\r\ncan anyone help with that?", "likes": 0}}, {"topLevelComment": {"author": "Tidéh / Tee-day", "text": "For some reason my stage does not display fully, only the width appears and it looks messy. Does anyone know why?", "likes": 0}}, {"topLevelComment": {"author": "Tidéh / Tee-day", "text": "For some reason props.type does not exist in my props. Does anyone know any solution?", "likes": 0}}, {"topLevelComment": {"author": "Dixie Normis", "text": "The final code does not work at all. Nice work", "likes": 0}}, {"topLevelComment": {"author": "isbeb", "text": "it took a few days but I completed it! thanks a lot!", "likes": 2}}, {"topLevelComment": {"author": "Gagan srai", "text": "Just an FYI, there will be odd behaviour when running in strictmode (default now with Create React App), to avoid the odd behaviour you need to make sure you follow the rules of hooks, especially Don’t call Hooks inside loops, conditions, or nested functions! keep use state updater function pure (no side effects)", "likes": 7}, "replies": [{"author": "codeNULL", "text": "Hey, can you be more specific as to what changes I have to make, this is the first tutorial that i've been following to learn react, and its really bugging me.\nIt works with reactdom.render but that is deprecated in react 18, if you've been able to solve the problem can you share", "likes": 2}, {"author": "岩切芳真", "text": "わら", "likes": 0}]}, {"topLevelComment": {"author": "Tìm tình 1 đêm vào (tamsu69.com)", "text": "21:56 Người em có béo thì anh vẫn thương. Và dù hơi bướng thì anh vẫn theo", "likes": 0}}, {"topLevelComment": {"author": "Abhijit Manna", "text": "anybody facing resetPlayer is not a function error after completing collison detection part ?", "likes": 1}, "replies": [{"author": "nokkudimu", "text": "@Weronika Weronika in Tetris.js file you need to write const [stage, setStage] = useStage(player, resetPlayer) . He forgot to show that he added resetPlayer as a parameter", "likes": 1}, {"author": "Weronika Weronika", "text": "me! how you solved that?", "likes": 0}]}, {"topLevelComment": {"author": "Abdul Majid", "text": "Just came here to read comments, but ended up watching the whole video, Good work 👍", "likes": 0}}, {"topLevelComment": {"author": "Yiqi Zhang", "text": "I came across an interesting bug... when the tetrominos pieces hit the left wall they lose their \"shape\". However, after I removed the  <React.StrictMode> tag which contains <App /> inside `index.js`, the bug went away. \n\nAnyone know why React Strict Mode causes this bug?", "likes": 1}, "replies": [{"author": "Gagan srai", "text": "This is caused by Strict Mode calling your useState Functions twice, to detect unexpected side effects, https://reactjs.org/docs/strict-mode.html\n Also in this video the tutor doesn't follow the rules of react hooks which causes bugs in strict mode because we break rule 1: Don’t call Hooks inside loops, conditions, or nested functions. https://reactjs.org/docs/hooks-rules.html", "likes": 2}, {"author": "Reem Al Salti", "text": "this is happening with me too, except when it collides on the right side LOL", "likes": 0}, {"author": "Eddrich Janzzen Ang", "text": "I've also encountered the same issue with React Strict Mode, any ideas here?", "likes": 0}]}, {"topLevelComment": {"author": "Yang Chin Huan", "text": "My Collision just won't work like the video shows. The S and Z shape even fall out from the bottom of the stage.", "likes": 1}}, {"topLevelComment": {"author": "Krillin Baldhead", "text": "The useCallback function randomly returns a undefined tetromino. What could be the problem?", "likes": 0}, "replies": [{"author": "Krillin Baldhead", "text": "I just figured it out this problem. In the usePlayer.js file the resetPlayer callback function is \n\n  // const resetPlayer = useCallback(\n  //   () => {\n  //     setPlayer({\n  //       pos: { x: STAGE_WIDTH / 2 - 2, y: 0 },\n  //       tetromino: randomTetromino().shape,\n  //       collided: false,\n  //     });\n  //     console.log(player.tetromino);\n  //   },\n  //   [player, setPlayer],\n  // );\n\nSometimes this callback function does not setPlayer properly, and through console logging I was able to deduce that sometimes that his function doesn't properly work. I thought I could fix the problem by changing the resetPlayer into a async function,\n\n  const resetPlayer = async () => {\n    await setPlayer({\n      pos: { x: STAGE_WIDTH / 2 - 2, y: 0 },\n      tetromino: randomTetromino().shape,\n      collided: false,\n    });\n  };\n\nBut really the problem is that the setPlayer hook function, when it sets the shape with a random tetromino can sometimes give out a undefined shape. The async function did not fix this problem, nor did ensuring that the randomTetromino function, if(randtetro !== undef) then return definedRandTetro. I was able to alleviate the problem though by adding an if statement under the callback.\n\n if (resetPlayer && player.tetromino === undefined) {\n    resetPlayer();\n  }\n\nThis catches the undefined tetromino and calls it to run again. I wasn't to be fix the problem but I was able to catch undefined tetrominos this way.", "likes": 1}]}, {"topLevelComment": {"author": "Matthew Tang", "text": "nice game, thank you!", "likes": 0}}, {"topLevelComment": {"author": "Algorhythmic", "text": "Extremely helpful. I’ve been trying to learn react and this was perfect. Thanks for the tutorial.", "likes": 1}}, {"topLevelComment": {"author": "Supertyp", "text": "That's cool exercise. I am going to do this on weekend, you have some patterns I always wanted to internalize to make my apps less messy than they are right now.", "likes": 0}}, {"topLevelComment": {"author": "Alberto Ginel Salvador", "text": "I'm stuck at 0:40 as soon as I import from styled-components, It fails due to a duplicate React dependency: \nYou might have more than one copy of React in the same app\nSee https://reactjs.org/link/invalid-hook-call for tips about how to debug and fix this problem.", "likes": 1}, "replies": [{"author": "Thuấn Nguyễn Võ", "text": "Update: Fixed this problem. All you need to do is do not import the StyleCell from the styles. Instead, make the const StyledCell right inside Cell.js. There we go.", "likes": 0}, {"author": "Thuấn Nguyễn Võ", "text": "Did you figure out how to solve that.", "likes": 0}, {"author": "Thuấn Nguyễn Võ", "text": "yes, I got the same problem.", "likes": 0}]}, {"topLevelComment": {"author": "Vikas JAISWAL", "text": "love this video", "likes": 0}}, {"topLevelComment": {"author": "Ryan West", "text": "Got up to 1:34, where the tetromino shows up, mine never shows up for some reason", "likes": 0}}, {"topLevelComment": {"author": "Rob-not-Bob", "text": "For the last section, I'm getting the error \"The 'linePoints' array makes the dependencies of useCallback Hook (at line 15) change on every render. Move it inside the useCallback callback. Alternatively, wrap the initialization of 'linePoints' in its own useMemo() Hook.\" in the useGameStatus.js file. It's making it so the score doesn't render when lines are cleared. I can't figure out why that's happening. I've tried using React.useMemo(), and putting both inside the callback function and on line 2 before the export.", "likes": 0}, "replies": [{"author": "Vanessa Correia", "text": "not sure if this will be helpful since it has been a while since your comments, but:\n\nremember when at the end of the tutorial there is the advice to use React.memo to prevent the Cell from constantly re-rendering and instead only do so when something changes? i think the point of this warning is more or less the same. it is not so much an error, as an improve performance warning, i think.\n\nif in your useGameStatus file you replace\n\nconst linePoints = [40, 100, 300, 1200]\n\nwith \n\nlet linePoints = useMemo(() => {}, []);\nlinePoints = [40, 100, 300, 1200];\n\n(and don't forget to import useMemo at the top of your other React imports as well)\n\nthe warning goes away and the scoring system seems to be working correctly still.\n\ni am not entirely sure this is 100% the way to do it and would still like to look into it in more detail, but there you have it. :)", "likes": 2}, {"author": "Kayla Newlon", "text": "Im getting the same error. Ever figure it out?", "likes": 0}]}, {"topLevelComment": {"author": "Niclas Eich", "text": "The fontsize for \"1fr\", as in 1 fragment is very nice, but the \"r\" loooks pretty much like a \"n\" to me.\n\nNice tutorial!", "likes": 2}, "replies": [{"author": "Matthew Tang", "text": "this solve my typo error, thanks much", "likes": 0}]}, {"topLevelComment": {"author": "Gonzalo Gómez", "text": "Excellent tutorial. I really enjoyed doing with React Hooks in my way learning more about frontend. Thank you a lot!", "likes": 0}}, {"topLevelComment": {"author": "lucid", "text": "whoops..!  \r\nStyled components ignore string spacing when retrieving values ​​from tetrominos color values. So you need to use backticks.", "likes": 0}}, {"topLevelComment": {"author": "Jonas C", "text": "OMG, this is so complicated!", "likes": 0}}, {"topLevelComment": {"author": "Simba", "text": "rafce", "likes": 0}}, {"topLevelComment": {"author": "Bongani Nkosi", "text": "Could you going to perhaps make a multiplayer version of this ?", "likes": 1}}, {"topLevelComment": {"author": "Chapel Studios", "text": "The | is called a pipe in English. :) Your accent is very good, don't worry about it.", "likes": 1}}, {"topLevelComment": {"author": "Vaughan Scott", "text": "My page has a scroll bar for vertical and horizontal.\nIt causes my screen to go down when I push the down arrow.\nAny suggestions where I may have made a mistake?", "likes": 0}, "replies": [{"author": "Vaughan Scott", "text": "I figured it out thanks I had messed around with the STAGE_HEIGHT at one point and forgot to return it to normal.", "likes": 0}]}, {"topLevelComment": {"author": "N1n741", "text": "Nice tutorial, thank you", "likes": 0}}, {"topLevelComment": {"author": "Ignacio Herrera", "text": "Man, this is just an amazing demo. I've been using React for a year now and I though it would be fun to try follow along this. I ended up learning a lot, amazing example usage of React hooks and optimizations. Thank you very much for this content!", "likes": 10}}, {"topLevelComment": {"author": "GD Sahil", "text": "great video but its very difficult to read what you are doing when you have the worst font for programming...", "likes": 1}}, {"topLevelComment": {"author": "Jul Vog", "text": "sry, but not working well. Tried your own code and its broken in some cases=(", "likes": 2}}, {"topLevelComment": {"author": "emir kovacevic", "text": "Can we use useEffect instead of useCallback and what is the difference ?", "likes": 0}}, {"topLevelComment": {"author": "Dremmerd X", "text": "I feel like I've looked over my code for a couple hours trying to figure this problem out so hopefully someone has some advice for me. for whatever reason something seems to be updating twice or even 4 times. When my code piece is dropping, the console.log of (re-render) in the tetris.js is running 4 times in my console. in addition, all my moves of left right or down, are going twice... Any help would be greatly appreciated.", "likes": 6}, "replies": [{"author": "Guillaume Belanger", "text": "@Dremmerd X This fixed all my weird behavior issues, thanks :)", "likes": 0}, {"author": "Vaughan Scott", "text": "I did this and it helped allot but when holding the down button my tetromino doesn't re-render till I release it and sometimes even more blocks have dropped.\nWhat could be wrong?", "likes": 0}, {"author": "Dalton McGee", "text": "@Dremmerd X Just did the same thing. If you look at the files provided to you by FCC, you can see that they're not using the React.StrictMode component.", "likes": 2}, {"author": "Dremmerd X", "text": "I'm not smart enough to know why this completely ruins everything, but Strict Mode wrecks this. as soon as I just put ReactDOM.render(<App />, document.getElementById(\"root\")); in my index file, it eliminated all the extra moves and rerenders.", "likes": 5}]}, {"topLevelComment": {"author": "Charllie Murphy", "text": "Feels like I'm coding a tutorial made by the Count from Sesame Street. Ahh Ahh Ahh. :D\n10/10", "likes": 4}, "replies": [{"author": "Юля Балашова", "text": "For me he sounds like a Moon from the MightyBoosh :D", "likes": 0}]}, {"topLevelComment": {"author": "Travelmate", "text": "Thank you! Awesome practice", "likes": 0}}, {"topLevelComment": {"author": "Darshan chudiwal", "text": "Hey man, loved the tutorial. Why did you create the 2d array like that though? Wouldn't running a nested for loop be more readable?", "likes": 0}}, {"topLevelComment": {"author": "James Yoo", "text": "I got to where you finished 'Stage update and player movement'. Everything seems identical , except my pieces are always moving by two spaces instead of one. Both for movePlayer() and drop(). Any idea why? Has anyone else encountered this?", "likes": 3}, "replies": [{"author": "Miles Griffiths", "text": "I had this problem too. I was able to resolve it by removing StrictMode in the index.js file:\n ReactDOM.render(\r\n  <React.StrictMode>\r\n    <App />\r\n  </React.StrictMode>,\r\n  document.getElementById('root')\r\n);\nTo this:\n\nReactDOM.render(<App />, document.getElementById('root'));", "likes": 2}, {"author": "A K", "text": "Remove strict mode in your index.js file. It will work then. A symptom is that it's re-rendering the app twice as often as it does in the video. I don't have any clue why it does this", "likes": 1}, {"author": "James Yoo", "text": "@Oliver Fu For now I got around it by moving 0.5 in the move() function and drop() function in Tetris.js. It's hacky, I know.", "likes": 1}, {"author": "Oliver Fu", "text": "Same issue", "likes": 0}]}, {"topLevelComment": {"author": "Anton Smolin", "text": "Thank you for this work", "likes": 0}}, {"topLevelComment": {"author": "Joshy Smarty", "text": "how is IntelliSense able to suggest CSS properties in ur vscode,  but it isn't suggesting properly in mine for .js files.", "likes": 0}, "replies": [{"author": "Joshy Smarty", "text": "@zc0rp10 thank you", "likes": 1}, {"author": "zc0rp10", "text": "A little late to the game here, but in case you've not solve it already. He's using an extension in VS code for it, there are a few different ones out there but this one will work, vscode-styled-components", "likes": 0}]}, {"topLevelComment": {"author": "Heriberto Roman", "text": "For those having that 'styled component issue' make sure to: npm install styled-components --save\nthis should fix your problem. It wasn't obvious for me at first.", "likes": 7}, "replies": [{"author": "stormmanio", "text": "helped me tho, thank you", "likes": 0}, {"author": "muhammad ahsan", "text": "i have installed the package but still it is not working", "likes": 0}, {"author": "Haley", "text": "I'm getting the error \n\n./src/components/styles/StyledTetris.js\n  Line 5:36:   'styled' is not defined  no-undef\n  Line 12:29:  'styled' is not defined  no-undef\n\nIs that the issue you mean?", "likes": 1}]}, {"topLevelComment": {"author": "Christer Nilsson", "text": "Du you have a link so I can try playing before downloading 500Mbyte of code?", "likes": 0}}, {"topLevelComment": {"author": "Rob Vitaro", "text": "This was really great! Thanks so much, I learned a lot!", "likes": 1}}, {"topLevelComment": {"author": "Natty H", "text": "Why is it when you make the createStage function in the gameHelper.js file you do not use curly braces? I used curly braces in mine and it \"broke\" but I was able to track down that that was the problem though I do not understand why", "likes": 0}}, {"topLevelComment": {"author": "Jay", "text": "Infinite re-render issue. After passing resetPlayer to the useStage, my version became stuck constantly re-rendering. The issue for me was caused by not passing an empty array to the resetPlayer callback.useCallback(()=>{...code here},[]) function.", "likes": 0}}, {"topLevelComment": {"author": "Jack Painter", "text": "This was really fun to follow and it taught me a tonne *goes to Weibenfalk and subscribes*", "likes": 0}}, {"topLevelComment": {"author": "Toosdai Otte", "text": "I feel as though I followed it to a t however about an hour and a half in, and keep getting 'STAGE_WIDTH' is not defined in './src/hooks/usePlayer.js'. is there something I missed? I didn't think we needed to import ../gameHelpers.js into the usePlayer.js", "likes": 0}, "replies": [{"author": "Weibenfalk", "text": "You should import STAGE_WIDTH into usePlayer. It is used in the resetPlayer function to calculate where to reset the new tetromino. I realize now that I somehow have cut that out from the video .. my mistake! But add the import at the top: \n\nimport { STAGE_WIDTH } from '../gameHelpers';", "likes": 0}]}, {"topLevelComment": {"author": "DarkThrongRising", "text": "This dude has the best accent.", "likes": 14}, "replies": [{"author": "adamromero", "text": "was about to say the same! :D", "likes": 0}]}, {"topLevelComment": {"author": "Mathew starr", "text": "Thanks a lot for this video, I truly learnt a lot by building this tetris game in React", "likes": 2}}, {"topLevelComment": {"author": "Gilney N. Mathias", "text": "Funny way to say 'object' kk' Ty for the video", "likes": 0}}, {"topLevelComment": {"author": "Dizzy", "text": "Hi, I''ve done the tutorial and now trying to build on top of it. I implemented the hard drop feature using a function hardDrop() that triggers on keydown spacebar\n\n\nconst hardDrop = () => {\n   let pot = 0;\n   while (!checkCollision(player, stage, { x: 0, y: pot })) {\n      setDropTime(5);\n      pot += 1;\n   }\n\n   updatePlayerPos({ x: 0, y: pot-1, collided: true });\n}\n\n\nIt's working so far, but is it the right way to do it? \nAlso, I understand that there are optimizations available, but can you give me an idea on what they are? I'm still very new to react and I'll try implementing the pocket tetromino next  (storing current tetromino for later use)", "likes": 3}, "replies": [{"author": "muhammad ahsan", "text": "​@Weibenfalk Uncaught TypeError: Cannot read properties of undefined (reading 'shape')\n    at usePlayer (usePlayer.js:7:1)\n    at Tetris (Tetris.js:20:1)\n    at renderWithHooks (react-dom.development.js:16305:1)\n\ncan anyone help with that?", "likes": 0}, {"author": "Weibenfalk", "text": "Hey ... as I state in the tutorial I'm not a game developer by default =) So .. to be honest ... really don't know what the best way is to implement it .. but if it works it is great and you can probably use it. =) Don't think you actually have to set the droptime on every iteration though. ... it should be enough to just set the final position of the tetromino when you have decided where it is going to \"land\" when you press space ... But ... that will make it instantly be positioned at that position. If you want to animate it down it won't work.", "likes": 1}]}, {"topLevelComment": {"author": "Great Health Agent", "text": "I really enjoyed this a lot. Thank you for making this.", "likes": 5}}, {"topLevelComment": {"author": "Mohammad Rasel", "text": "its really nice man", "likes": 1}}, {"topLevelComment": {"author": "Clara Sousa", "text": "Does anyone know how to make the font file work? When I copy the .woff folder to Visual Code it says \"The file is not displayed in the editor because it is either binary or uses an unsupported text encoding\"...\n I need some help please :)", "likes": 0}, "replies": [{"author": "Toosdai Otte", "text": "How did you copy/paste it? I just rightclicked on it from the tetris starter files, clicked copy, went over to the src folder in react-tetris and pasted it there and it worked fine", "likes": 0}]}, {"topLevelComment": {"author": "greenie62", "text": "Someone needs to check on Mr meth meth method, his channel could be a goldmine. As this one has become.", "likes": 1}}, {"topLevelComment": {"author": "愛爾蘭奶爸", "text": "the app crash after i added the useGameStatus... the error message as below:\n×\nTypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))\n_iterableToArrayLimit\nD:/kieffwong/Tetris/react-tetris/node_modules/@babel/runtime/helpers/esm/iterableToArrayLimit.js:8\n   5 | var _e = undefined;\n   6 | \n   7 | try {\n>  8 |   for (var _i = arr[Symbol.iterator](), _s; !(_n = (_s = _i.next()).done); _n = true) {\n\n     | ^\n   9 |     _arr.push(_s.value);\n  10 | \n  11 |     if (i && _arr.length === i) break;\nView compiled\n_slicedToArray\nD:/kieffwong/Tetris/react-tetris/node_modules/@babel/runtime/helpers/esm/slicedToArray.js:5\n  2 | import iterableToArrayLimit from \"./iterableToArrayLimit\";\n  3 | import nonIterableRest from \"./nonIterableRest\";\n  4 | export default function _slicedToArray(arr, i) {\n> 5 |   return arrayWithHoles(arr) || iterableToArrayLimit(arr, i) || nonIterableRest();\n  6 | }\nView compiled\nuseGameStatus\nD:/kieffwong/Tetris/react-tetris/src/hooks/useGameStatus.js:3\n  1 | import { useState, useEffect, useCallback } from 'react';\n  2 | \n> 3 | export const useGameStatus = rowsCleared =>{\n  4 |    const [ score, setScore] = useState[0];\n  5 |    const [ rows, setRows] = useState[0];\n  6 |    const [ level, setLevel] = useState[0];\nView compiled\nTetris\nD:/kieffwong/Tetris/react-tetris/src/components/Tetris.js:17\n  14 | import StartButoon from './StartButton'\n  15 | \n  16 | \n> 17 | const Tetris = () => {\n  18 |   const [dropTime, setDropTime] = useState(null);\n  19 |   const [gameOver, setGameOver] = useState(false);\n  20 | \nView compiled\n▶ 18 stack frames were collapsed.\nModule../src/index.js\nD:/kieffwong/Tetris/react-tetris/src/index.js:7\n   4 | import App from './App';\n   5 | //import * as serviceWorker from './serviceWorker';\n   6 | \n>  7 | ReactDOM.render(<App />, document.getElementById('root'));\n   8 | \n   9 | // If you want your app to work offline and load faster, you can change\n  10 | // unregister() to register() below. Note this comes with some pitfalls.\n\n\nI couldn't find the bug....", "likes": 0}, "replies": [{"author": "愛爾蘭奶爸", "text": "@Weibenfalk Thanks so much! the Video is lovely, i learnt a lots about how react work. really awesome! \ni found out the silly bug on the gameStatus hooks because i used [] for useState instead of () , silly me!!  i definitely will subscribe your channels!!  have a nice day!", "likes": 1}, {"author": "Weibenfalk", "text": "It's really hard knowing what is wrong without seeing the complete code. I suggest you check out the provided stepped solutions or the finished app in the starter files. There, you can compare your code to the working code.", "likes": 1}]}, {"topLevelComment": {"author": "Nick Rodriguez", "text": "Consistently getting an error of forEach being undefined in useStage.js file. Read into it a little and people are saying use .map() instead of forEach...any recommendations?", "likes": 1}, "replies": [{"author": "Weibenfalk", "text": "That's strange ... haven't had that error. Have you checked the provided stepped solutions in the starter files? Or the finished app? Compared your code. You should only use map if you are returning a new array that you transform in any way. forEach just loop through it and doesn't return a new array.", "likes": 0}]}, {"topLevelComment": {"author": "Dégi Nándor", "text": "Hey  @Weibenfalk i have an issue. I copied everything what you done and it gives me an error when i start the game with the button. It says: TypeError: Cannot read property 'color' of undefined in the Cell.js file here: \n\n\nimport React from 'react';\r\nimport { StyledCell } from './styled/StyledCell';\r\nimport { TETROMINOS } from '../helpers/tetrominos';\r\n\r\nconst Cell = ({ type }) => (\r\n  <StyledCell type={type} color={TETROMINOS[type].color}>{console.log(\"rerender\")}</StyledCell>\r\n)\r\n\r\nexport default React.memo(Cell);\n\n\nPlease help me i really appreciate that!", "likes": 0}, "replies": [{"author": "Dégi Nándor", "text": "@Weibenfalk Thanks for your fast response, i should deffinietly try it", "likes": 0}, {"author": "Weibenfalk", "text": "Hey ... I suggest looking at the stepped solutions that are provided with the starter files ... or the finished app that's also provided. Compare your code there. Somehow it seems like the color property isn't set right .. check your tetrominos array first. All of the tetrominos there and see that you don't have a typo or something.", "likes": 0}]}, {"topLevelComment": {"author": "Benny Brouwer", "text": "Hi, I'm not so into games and prefer Vanilla Javascript but with interest into React, watched your video - State of the art JavaScript and I learn a lot. Thanks and compliments !", "likes": 0}, "replies": [{"author": "Weibenfalk", "text": "Thank you! I like vanilla JS also ... but it was sure fun to use React to try this out. And it feels great that I can teach something in the process also. =)", "likes": 0}]}, {"topLevelComment": {"author": "Charles An", "text": "how do you implement the hard drop feature of tetris i.e. pressing spacebar and the piece drops all the way to the bottom. I tried using a loop to keep calling drop() until a collision is detected, but the app just crashes. Is this because our collision detection isn't fast enough?", "likes": 0}, "replies": [{"author": "Flew4k", "text": "@Dizzy hey but when i press space it first goes down and next it just toggles the startgame and it starts from the beggining with score and everything zerod", "likes": 0}, {"author": "Dizzy", "text": "heya,  this is how I implemented it, I created a function  hardDrop () that triggers one keydown spacebar. Leme knwow what you think, I'm a beginner in react and I'm sure there's a better solution out there.\n\n\n\nconst hardDrop = () => {\n   let pot = 0;\n   while (!checkCollision(player, stage, { x: 0, y: pot })) {\n setDropTime(5);\n pot += 1;\n   }\n\n   updatePlayerPos({ x: 0, y: pot-1, collided: true });\n}", "likes": 1}]}, {"topLevelComment": {"author": "Richard Robinson", "text": "Great!!  Lots of good tips in here.", "likes": 1}}, {"topLevelComment": {"author": "Samuel Okpe", "text": "<b> amazing tutorials thank you to free code camp </b>", "likes": 1}}, {"topLevelComment": {"author": "flynsarmy", "text": "What plugins are you using to get CSS in JS styled properly as well as the error notifications that functions don't exist yet?", "likes": 0}, "replies": [{"author": "Weibenfalk", "text": "If you mean linting rules in Visual Studio Code ... I actually use Wes Bos \"No sweat Linting Setup\" that you can find on github for this one. It is based on rbnb with some modifications. And also create-react-app has some rules and warnings built in that you get for free when you use create-react-app", "likes": 1}]}, {"topLevelComment": {"author": "Leo", "text": "I am getting the error \"InternalError: too much recursion\" for the createStage inside gameHelpers. Anyone had this error?", "likes": 0}, "replies": [{"author": "Jack Painter", "text": "​@Anh Tran you must be missing a cut off point for your stage builder so it's stuck in an infinite loop, send me a message with a screenshot and I'll try to spot the issue (will be tiny)", "likes": 0}, {"author": "Anh Tran", "text": "me too :( Any solution for this error?", "likes": 0}]}, {"topLevelComment": {"author": "Jacques Van Blokland", "text": "Amazing tutorial! It was both fun and packed with useful information.", "likes": 1}}, {"topLevelComment": {"author": "DJZG", "text": "At the end of fifth video, when changing back from color={TETROMINOS[\"I\"].color} to color={TETROMINOS[type].color} I get an error: Uncaught TypeError: Cannot read property 'color' of undefined\n\n    at Cell (Cell.js:6)\n\n\nNot sure how to solve it... It works with strings, but not when I replace it with type.", "likes": 1}, "replies": [{"author": "DJZG", "text": "@Weibenfalk \n\nI just had the craziest ride through the files. I figured the easiest way would be to backup my files and replace one by one with your versions. And I pinpointed that the mistake fixes itself when replacing the Stage.js file.\nThen I've copied both code and compare them with an online tool as I was not seeing the difference at first glance. \n\nYou know where the mistake was?\n\nThis part:\n  <StyledStage width={stage[0].length} height={stage.length}>\n    {stage.map(row => row.map((cell, x) => <Cell key={x} type={Cell[0]} />))}\n\n  </StyledStage>\n\n\n\nin the Cell tag, under type, I wrote Cell with a capital C. Your version isn't capitalized. Man I feel dumb but kinda smart at the same time...\n\n\n\nLeaving these comments for any future adventurers. I hope I save you some time.", "likes": 3}, {"author": "DJZG", "text": "@Weibenfalk Thanks for helping me out!\nI've already compared the two files, and found no differences. I've even copied your whole Cell.js and tetrominos.js code and it still didn't work.\n\n\n\nFinally, I've replaced the entire 'src' folder with your version and the thing works. Once I go back to my 'src' files, \"color\" not defined once again. I must've missed something... I'll probably go and compare all files cause it has been bugging me throughout the night.", "likes": 0}, {"author": "Weibenfalk", "text": "I suggest you look at the stepped solutions that I've provided in the starter files. If it's the end of the fifth video you should look in the folder \"react tetris - before video 6\" ... You can compare your code to the working one there.", "likes": 1}]}, {"topLevelComment": {"author": "maxime emixam", "text": "great tuto thanks a lot!", "likes": 1}}, {"topLevelComment": {"author": "Hasan Kiriş", "text": "Is there any way I can put my name somewhere in the game? I want to make my own Tetris game but have my name in it for Personal Project, because they need PROOF that I made the game myself, I will obviously show the journey of making the game :D", "likes": 0}, "replies": [{"author": "Hussain", "text": "Hasan Kiris make your own Wordpress site and put it on there as part of your other projects, then link the Wordpress in your resume", "likes": 0}]}, {"topLevelComment": {"author": "pradeep singh", "text": "@weibenfalk\nwhich theme/font you are using in you vs-code, looks cool :)", "likes": 1}, "replies": [{"author": "Weibenfalk", "text": "Theme is One Monokai 80s and font is Operator Mono =)", "likes": 0}]}, {"topLevelComment": {"author": "J krishna", "text": "Pls daily update one video", "likes": 0}}, {"topLevelComment": {"author": "Lokinoha", "text": "how much do I need to know to be able to follow this?", "likes": 0}, "replies": [{"author": "Weibenfalk", "text": "Would say that it's an intermediate course. But ... if you're like me ... you can always learn something if you're really interested in this just by following along. At least basic Javascript knowledge is a must though, i would say.", "likes": 0}]}, {"topLevelComment": {"author": "Iden", "text": "Awesome teacher!", "likes": 1}}, {"topLevelComment": {"author": "Ifrit", "text": "This channel is the best. Tenkius.", "likes": 1}}, {"topLevelComment": {"author": "Vaibhav Sharma", "text": "I get resetPlayer(); is not a function in the useStage.js file when i overshoot the bottom area boundary. Could you please help?", "likes": 7}, "replies": [{"author": "Weibenfalk", "text": "@Rusty Hoppins you probably have a typo somewhere. I have tried it and it works. Check the starter files stepped solutions or the finished version and compare all your code. I guess it can be somewhere in your resetPlayer function itself that's causing this. Or your collision detection function. But impossible to say.", "likes": 0}, {"author": "Rusty Hoppins", "text": "I tried this solution and while it doesn't produce an error, my tetrominos disappear when they hit the bottom instead of staying when the new piece is formed. If I press down when they are on the very bottom row they disappear when I know I have the same code as you so I really don't get it. I was getting the error described here and when I fixed it I tried making my pieces stack up to check if the Game Over was working and they disappear instead of staying visible and stacking up. What could be causing this.", "likes": 0}, {"author": "Weibenfalk", "text": "And also .. please tell me if there is more that I accidentally cut out when I edited the videos. =) ( You said you've changed a few more things )", "likes": 0}, {"author": "Weibenfalk", "text": "@Alena Nikolaeva Great to hear! I've contacted FreeCodeCamp and asked them to add a comment there in the video .. or else I will put in a comment and they can update the video ... =)", "likes": 0}, {"author": "Alena Nikolaeva", "text": "​@Weibenfalk for me sending resetPlayer as a parameter worked! I've compared it to the final solution as well and changed a few more things. Thanks for tutorial!!", "likes": 0}]}, {"topLevelComment": {"author": "moofymoo", "text": "but who is disliking this? jQuery 'programmers'?", "likes": 15}, "replies": [{"author": "Vu Dang Tran Le", "text": ": ))", "likes": 0}]}, {"topLevelComment": {"author": "Kaue César", "text": "AWESOME! THAT'S IS AMAZING! :D", "likes": 2}}, {"topLevelComment": {"author": "pixelmitar", "text": "Fucking Hilarious, I LOVE YOU THOMAS!!!", "likes": 0}}, {"topLevelComment": {"author": "pokerkaszy7", "text": "Hi,\nJust a side question:\nWhat theme/font are you using?\nI really like it.\nGreat video by the way!\nThanks", "likes": 0}, "replies": [{"author": "pokerkaszy7", "text": "@Weibenfalk Yeah, that's a bit pricey. Thanks anyway!", "likes": 0}, {"author": "Weibenfalk", "text": "Hi, it's Operator Mono ... An expensive font $199 ... so if you don't want to spend that there's probably great free alternatives =)", "likes": 2}]}, {"topLevelComment": {"author": "Dev XO", "text": "Amazing mate and thanks a lot to freeCodeCamp, amazing like always.", "likes": 3}}, {"topLevelComment": {"author": "Jonathan Randy", "text": "What a joke. How much JS code does this result in for such a simple game? React is overkill for almost every project it is considered for", "likes": 1}, "replies": [{"author": "moofymoo", "text": "@SteelCityEndurance for compromises, I assume that in 2019 JSX is not considered to be radical.", "likes": 0}, {"author": "SteelCityEndurance", "text": "What is react best suited for?", "likes": 0}, {"author": "Weibenfalk", "text": "Hey ... If you listen to the video I also say that React is probably not the way to go for building a Tetris Game. BUT ... I did it to explore the possibilities and how it could be done.  And also to practice using React Hooks ... So .. it's still a good source for practicing React concepts and especially hooks in this case. But you're right ... it will be much less code with vanilla JS. It's not meant to be used in production in any way ...", "likes": 17}]}, {"topLevelComment": {"author": "Plogapp", "text": "Great Video thanks to FreeCodeCamp", "likes": 1}}, {"topLevelComment": {"author": "NullPointer Exception", "text": "Great video, time stamps in the description are OP.", "likes": 5}}, {"topLevelComment": {"author": "knowledge", "text": "great, thanks for sharing it", "likes": 1}}, {"topLevelComment": {"author": "Beskel official", "text": "GOOD WORK \n\nPLEASE HELP THE KASHMIR", "likes": 3}, "replies": [{"author": "Omprakash Panigrahi", "text": "@Beskel official that's a very rigid attitude. I hope your mindset changes for the better.", "likes": 0}, {"author": "Omprakash Panigrahi", "text": "@Beskel official this is a channel dedicated to coding.\nKindly refrain from posting biased views pertaining to religion.", "likes": 0}, {"author": "Beskel official", "text": "@kootahaitoo tum log jo kashmir main kar reha ho wo kya hai tum logo ki wja sa yeh world gandi ho gai us k  kya?", "likes": 0}, {"author": "kootahaitoo", "text": "nalayak kam se kam ye jagah to gandi mat kar", "likes": 0}, {"author": "Beskel official", "text": "@Jansher Aquib for muslims every forum is right", "likes": 0}]}, {"topLevelComment": {"author": "Himanshu Pawar", "text": "I ma First Yay.gonna watch it later thanks.", "likes": 0}}, {"topLevelComment": {"author": "Charan Vengatesh", "text": "1st", "likes": 0}}, {"topLevelComment": {"author": "JAVAAID - Coding Interview Preparation", "text": "Nice video..!!", "likes": 1}}, {"topLevelComment": {"author": "Common Sense", "text": "It’s amazing how they have no adds in this 2 and a half hour tutorial\nAlso\nIf it’s any good\nFirst comment\nFirst comment", "likes": 12}}]}