{"video": {"id": "zMg3PO8MtyI", "title": "Chrome Dev Tools: Console Tab", "description": "Info and mini-lesson on the 'Console' tab of Chrome Dev Tools. Check out more in-depth documentation here: https://developers.google.com/web/tools/javascript/console/\n\nThe Console panel provides two primary functions: logging diagnostic information in the development process and\nproviding a shell prompt which can be used to interact with the document and DevTools.\n\nWhen using the console, you can view raw or structured data by using standard JS statements and console-specific commands.\n\nAn example of structured data would be the information returned from an API in JSON. I used this a lot when I was building my first ziplines for Free Code Camp.\n\nYou should know that messages stack up, and you can clear them by typing and entering 'clear()'. You can also save the log by selecting 'Preserve Log'. \n\nThere are different commands that will log differently, like console.log() for basic logging, console.error() & console.warn() for \"eye catching stuff\".\n\nThe console can track exceptions, which basically means when something goes wrong. It can even pause the code during those exceptions, a function that you might remember from the 'Source' tab.", "duration": "PT1M44S", "likes": "66", "views": "10241"}, "comments": [{"topLevelComment": {"id": "UgzRyw7Ke0hwj3ommfh4AaABAg", "publishedAt": "2019-12-19T12:01:52Z", "author": "Amir.h Akbari", "text": "Hey goog people, thanks for this video, can someone explaine me why when we typying something in console it returns undefined?", "likes": 0}}, {"topLevelComment": {"id": "Ugj7e9Dyb6-7pngCoAEC", "publishedAt": "2017-01-13T17:38:00Z", "author": "Techno Youtube", "text": "Madam Minister, can you tell me that right after logging in to Facebook by clicking on the console by clicking on the stop element is Inspect how to start I MEAN ex--(Stop!\n\nThis is a browser feature intended for developers. If someone told you to copy and paste something here to enable a Facebook feature or \"hack\" someone's account, it is a scam and will give them access to your Facebook account.\n\nSee https://www.facebook.com/selfxss for more information)", "likes": 0}}, {"topLevelComment": {"id": "UggLS3X8IbEKnXgCoAEC", "publishedAt": "2016-06-25T22:11:13Z", "author": "miniSasquatch23", "text": "Hi, Great video:) \nDo you know maybe there's some way to pause some executing function ? which starting throwing some exeptions? \nthere is smth like console.pause() ?:))", "likes": 0}}]}