{"video": {"id": "ztHopE5Wnpc", "title": "Database Design Course - Learn how to design and plan a database for beginners", "description": "This database design course will help you understand database concepts and give you a deeper grasp of database design. \n\nDatabase design is the organisation of data according to a database model. The designer determines what data must be stored and how the data elements interrelate. With this information, they can begin to fit the data to the database model.\n\nLearn more about this course on Caleb Curry's website: https://www.calebcurry.com/freecodecamp-database-design-full-course/\n\n⭐️ Contents ⭐\n⌨️ (0:00:00) Introduction\n⌨️ (0:03:12) What is a Database?\n⌨️ (0:11:04) What is a Relational Database?\n⌨️ (0:23:42) RDBMS\n⌨️ (0:37:32) Introduction to SQL\n⌨️ (0:44:01) Naming Conventions\n⌨️ (0:47:16) What is Database Design?\n⌨️ (1:00:26) Data Integrity\n⌨️ (1:13:28) Database Terms\n⌨️ (1:28:28) More Database Terms\n⌨️ (1:38:46) Atomic Values\n⌨️ (1:44:25) Relationships\n⌨️ (1:50:35) One-to-One Relationships\n⌨️ (1:53:45) One-to-Many Relationships\n⌨️ (1:57:50) Many-to-Many Relationships\n⌨️ (2:02:24) Designing One-to-One Relationships\n⌨️ (2:13:40) Designing One-to-Many Relationships\n⌨️ (2:23:50) Parent Tables and Child Tables\n⌨️ (2:30:42) Designing Many-to-Many Relationships\n⌨️ (2:46:23) Summary of Relationships\n⌨️ (2:54:42) Introduction to Keys\n⌨️ (3:07:24) Primary Key Index\n⌨️ (3:13:42) Look up Table\n⌨️ (3:30:19) Superkey and Candidate Key\n⌨️ (3:48:59) Primary Key and Alternate Key\n⌨️ (3:56:34) Surrogate Key and Natural Key\n⌨️ (4:03:43) Should I use Surrogate Keys or Natural Keys?\n⌨️ (4:13:07) Foreign Key\n⌨️ (4:25:15) NOT NULL Foreign Key\n⌨️ (4:38:17) Foreign Key Constraints\n⌨️ (4:49:50) Simple Key, Composite Key, Compound Key\n⌨️ (5:01:54) Review and Key Points....HA GET IT? KEY points!\n⌨️ (5:10:28) Introduction to Entity Relationship Modeling\n⌨️ (5:17:34) Cardinality\n⌨️ (5:24:41) Modality\n⌨️ (5:35:14) Introduction to Database Normalization\n⌨️ (5:39:48) 1NF (First Normal Form of Database Normalization)\n⌨️ (5:46:34) 2NF (Second Normal Form of Database Normalization)\n⌨️ (5:55:00) 3NF (Third Normal Form of Database Normalization)\n⌨️ (6:01:12) Indexes (Clustered, Nonclustered, Composite Index)\n⌨️ (6:14:36) Data Types\n⌨️ (6:25:55) Introduction to Joins\n⌨️ (6:39:23) Inner Join\n⌨️ (6:54:48) Inner Join on 3 Tables\n⌨️ (7:07:41) Inner Join on 3 Tables (Example)\n⌨️ (7:23:53) Introduction to Outer Joins\n⌨️ (7:29:46) Right Outer Join\n⌨️ (7:35:33) JOIN with NOT NULL Columns\n⌨️ (7:42:40) Outer Join Across 3 Tables\n⌨️ (7:48:24) Alias\n⌨️ (7:52:13) Self Join\n\n🎥Course developed by Caleb Curry. Check out his YouTube channel: https://www.youtube.com/user/CalebTheVideoMaker2\n\n🐦Follow Caleb on Twitter: https://twitter.com/calebcurry\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT8H7M20S", "likes": "53314", "views": "2200001"}, "comments": [{"topLevelComment": {"author": "Caleb Curry", "text": "I'm honored to be featured here 🙂\nIf anyone has questions or suggestions, let me know!", "likes": 2927}, "replies": [{"author": "Iqbal javaScript", "text": "caleb..do you have a doc for this course? or should I make one?", "likes": 0}, {"author": "Scheiß T", "text": "Hi great tutorial for strong foundation ! i have a question is 3NF not violated in the last example where you have an attribute (referred_by) with a dependency to another attribute( user_id ) ?", "likes": 0}, {"author": "Chinonye Olisedeme", "text": "Claire, what did she ever do?😷", "likes": 0}, {"author": "Ronald Maffei de Lavor", "text": "Aqui estão 4 poderosas orações que você pode rezar pelas almas do purgatório, que precisam muito delas:\n\n1) Oração de Santa Gertrudes\nEterno Pai, Ofereço-Vos o Preciosíssimo Sangue de Vosso Divino Filho Jesus, em união com todas as Missas que hoje são celebradas em todo o mundo; por todas as Santas almas do purgatório, pelos pecadores de todos os lugares, pelos pecadores de toda a Igreja, pelos de minha casa e de meus vizinhos. Amém.\n\n2) Oração para ter um coração misericordioso para com os outros de Santa Faustina.\n\nÓ Jesus, compreendo que a Vossa misericórdia é inexprimível. Por isso Vos suplico: tornai o meu coração tão grande que possa conter as necessidades de todas as almas que vivem na face da terra. Ó Jesus, o meu amor vai além do mundo, estende-se até às almas que sofrem no purgatório; também por elas quero praticar misericórdia através de orações que possuem indulgências. A misericórdia de Deus é sempre insondável e\nInesgotável, como é insondável o próprio Deus. Ainda que eu me valesse das palavras mais veementes para expressar essa misericórdia de Deus, tudo isso nada seria em comparação com o que ela é na realidade. Ó Jesus, fazei o meu coração sensível a cada sofrimento do meu próximo, seja da alma ou do corpo. Ó meu\nJesus, sei que Vós procedeis conosco como nós procedemos com o próximo.\nMeu Jesus, fazei o meu coração semelhante ao Vosso misericordioso Coração. Jesus, ajudai-me a passar pela vida fazendo o\nBem a todos…\nAmém.\nFonte: Diário de Santa Faustina, II, #132\n\n3) Oração do Descanso eterno:\n\nDai-lhes Senhor o descanso eterno.\nE que a luz perpétua os ilumine. Descansem em paz.\nPai Misericordioso eu vos ofereço o sangue precioso de Nosso Senhor Jesus Cristo para alívio das almas sofredoras que ainda padecem no purgatório. Amém.\n\n4) Ladainha pelas almas do Purgatório:\n\nDeus onipotente, Pai de bondade e de misericórdia, tende piedade das benditas almas do purgatório e ajudai a meus queridos pais e antepassados.\n\nJesus meu, misericórdia! Ajudai a meus irmãos e parentes.\n\nJesus meu, misericórdia! Ajudai a todos meus benfeitores espirituais e temporais.\n\nJesus meu, misericórdia! Ajudai aos que tem sido meus amigos e empregados.\n\nJesus meu, misericórdia! Ajudai a quantos devo amar e orar.\n\nJesus meu, misericórdia! Ajudai a quantos tive prejudicado e ferido.\n\nJesus meu, misericórdia! Ajudai aos que tiveram faltado contra mim.\n\nJesus meu, misericórdia! Ajudai aqueles a quem professais predileção.\n\nJesus meu, misericórdia! Ajudai aos que estão mais próximos a união convosco.\n\nJesus meu, misericórdia! Ajudai aos que vos desejam mais ardentemente.\n\nJesus meu, misericórdia! Ajudai aos que sofrem mais.\n\nJesus meu, misericórdia! Ajudai aos que estão mais longe de sua liberação.\n\nJesus meu, misericórdia! Ajudai aos que menos auxílios recebem.\n\nJesus meu, misericórdia! Ajudai aos que mais méritos tem pela Igreja.\n\nJesus meu, misericórdia! Ajudai aos que foram ricos aqui, e ali são os mais pobres.\n\nJesus meu, misericórdia! Ajudai aos poderosos, que agora são como servos.\n\nJesus meu, misericórdia! Ajudai aos cegos que agora reconhecem sua cegueira.\n\nJesus meu, misericórdia! Ajudai aos vaidosos que desperdiçaram seu tempo.\n\nJesus meu, misericórdia! Ajudai aos pobres que não buscaram as riquezas divinas.\n\nJesus meu, misericórdia! Ajudai aos tíbios que muito pouca oração tem feito.\n\nJesus meu, misericórdia! Ajudai aos presunçosos que tem descuidado de tantas obras boas.\n\nJesus meu, misericórdia! Ajudai aos de pouca fé que descuidaram dos Santos Sacramentos.\n\nJesus meu, misericórdia! Ajudai aos reincidentes que apenas por um milagre da graça se tem salvado.\n\nJesus meu, misericórdia! Ajudai aos pais que não vigiaram bem a seus filhos.\n\nJesus meu, misericórdia! Ajudai aos superiores pouco atentos a salvação de seus súditos.\n\nJesus meu, misericórdia! Ajudai aos pobres homens, que quase apenas se preocuparam do dinheiro e do prazer.\n\nJesus meu, misericórdia! Ajudai aos de espírito mundano que não aproveitaram suas riquezas ou talentos para o céu.\n\nJesus meu, misericórdia! Ajudai aos néscios, que viram morrer a tantos não se lembrando de sua própria morte.\n\nJesus meu, misericórdia! Ajudai aos que não dispuseram a tempo de sua casa, estando completamente desprevenidos para a viagem mais importante.\n\nJesus meu, misericórdia! Ajudai aos que julgais mais severamente, quanto mais lhes foi confiado.\n\nJesus meu, misericórdia! Ajudai aos pontífices, reis e príncipes.\n\nJesus meu, misericórdia! Ajudai aos bispos e seus conselheiros.\n\nJesus meu, misericórdia! Ajudai a meus mestres e pastores de almas.\n\nJesus meu, misericórdia! Ajudai aos finados sacerdotes desta diocese.\n\nJesus meu, misericórdia! Ajudai aos sacerdotes e religiosos da Igreja católica.\n\nJesus meu, misericórdia! Ajudai aos defensores da santa fé.\n\nJesus meu, misericórdia! Ajudai aos caídos nos campos de batalha.\n\nJesus meu, misericórdia! Ajudai aos sepultados nos mares.\n\nJesus meu, misericórdia! Ajudai aos mortos repentinamente.\n\nJesus meu, misericórdia! Ajudai aos falecidos sem receber os Santos Sacramentos.\n\nJesus meu, misericórdia! Dai-lhes, Senhor, a todas as almas o descanso eterno.\n\nJesus meu, misericórdia! E fazei brilhar sobre elas vossa eterna luz.\n\nJesus meu, misericórdia! Que em paz descansem.\n\nJesus meu, misericórdia! Amém.", "likes": 0}, {"author": "Diana Bretah", "text": "u cute", "likes": 0}]}, {"topLevelComment": {"author": "Gabry Os", "text": "Just finished to watch this, cannot imagine how much work you put into this. Well done!", "likes": 1}}, {"topLevelComment": {"author": "Joe Hibbler", "text": "finishing a BA computer science you have been a big help along the way ...THIS IS THE BEST CONSEPT DRIVEN ON DATABASE DESIGN ON YOUTUBE", "likes": 1}}, {"topLevelComment": {"author": "sheik mohd zaheem", "text": "Your dedication to work with chalk piece is just awesome! 😀", "likes": 0}}, {"topLevelComment": {"author": "Dana Fariq", "text": "Thanks you for this tutorial, good luck", "likes": 0}}, {"topLevelComment": {"author": "Amazing Vipul", "text": "It takes courage to start/teach something especially at this young age.  Good luck buddy.", "likes": 0}}, {"topLevelComment": {"author": "Mathias Ayivor", "text": "So in summary, you should design your database in an atomic manner?", "likes": 0}}, {"topLevelComment": {"author": "meghashyaam sagar", "text": "is transaction and concurrency control covered under this video?", "likes": 0}}, {"topLevelComment": {"author": "Shelley Brent-Charette", "text": "I took SQL years ago, that saying, you don't use it, you will lose it. Caleb, I love your teaching structure.  I'm in my 50's. You keep the course engaging.  The sky is the limit for you!", "likes": 0}}, {"topLevelComment": {"author": "Mobin Aghashahi", "text": "1:51:17\nMuslim men: \"we don't do that here.\" Lolll", "likes": 0}}, {"topLevelComment": {"author": "sanaz khosroshahi", "text": "beloved expert funny 100% perfect", "likes": 0}}, {"topLevelComment": {"author": "kumar910", "text": "Your folks must be proud of you.", "likes": 0}}, {"topLevelComment": {"author": "Ajay Bhati", "text": "Thank God it completed...😮‍💨", "likes": 0}}, {"topLevelComment": {"author": "B Navy", "text": "Super class!!!! This is exactly what I've always been in the lookout for. Thanks Caleb and freecodecamp for this. I'm eager to join you.", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Hamdi al-Janabi", "text": "Thanks Caleb!", "likes": 0}}, {"topLevelComment": {"author": "Akshay Kudale", "text": "This is the best database design tutorial I have came across. All the concepts have been throughly explained in very simple words. Thank you very much for posting this!!", "likes": 0}}, {"topLevelComment": {"author": "Ajay Bhati", "text": "Hey celeb...", "likes": 0}}, {"topLevelComment": {"author": "امین جمالی", "text": "this course is awesome", "likes": 0}}, {"topLevelComment": {"author": "Danny 0", "text": "killer! lets use an eraser board next time😂 my sensitivity to that chalk board was 🤮🤮 lol jk thanks caleb!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Juan Gan Ma", "text": "You are the best, learn a lot with this amazing video, good job Caleb!", "likes": 0}}, {"topLevelComment": {"author": "Alex Yakoveno", "text": "", "likes": 0}}, {"topLevelComment": {"author": "Azathoth Hastur", "text": "LOOKING AT SQL DATAABSES WHICH MAYBE BE A SCAM, I ALWAY WONDER HOW CAN YOU ABSTRACT OUT THE STUF THAT IS THE SAME IT SEEMS THEY HAVE SAME DATA OVER N OVER AND IT COULD BE ABSTRACTED OUT?", "likes": 0}}, {"topLevelComment": {"author": "Petter Bakken", "text": "Great stuff! thanks", "likes": 0}}, {"topLevelComment": {"author": "MrRynRules", "text": "Thank yopu so much for this buddy!\nI really appriciate this!", "likes": 0}}, {"topLevelComment": {"author": "Jordan Butler", "text": "I've always thought it was pronounced \"Sequel\" rather than \"S-Q-L\", is either fine in the industry or should it be pronounced one way or the other", "likes": 0}}, {"topLevelComment": {"author": "Prime Time", "text": "I don't know how to thank you!", "likes": 0}}, {"topLevelComment": {"author": "French Mike", "text": "4:17:40", "likes": 0}}, {"topLevelComment": {"author": "IMFletch2079", "text": "😊", "likes": 0}}, {"topLevelComment": {"author": "Contoh Aja", "text": "8hours x 2m views 🎉🎉🎉🎉", "likes": 0}}, {"topLevelComment": {"author": "12madorno34", "text": "Trial and error, leads to mastery. Continuous improvement, quality control and quality assurance.", "likes": 0}}, {"topLevelComment": {"author": "Web TC", "text": "Ok bro I'll be honest with you. It could be a UFO, but don't worry just use your relational database tables..", "likes": 0}}, {"topLevelComment": {"author": "Web TC", "text": "When!?", "likes": 0}}, {"topLevelComment": {"author": "French Mike", "text": "4:00:00", "likes": 0}}, {"topLevelComment": {"author": "abraham takyi", "text": "Good to share Mr. Caleb\nI LOVE THE PASSION YOU ARE USING", "likes": 0}}, {"topLevelComment": {"author": "Riya Dhatwalia", "text": "Thank you 🤗🤗", "likes": 0}}, {"topLevelComment": {"author": "SQL전문가 정미나", "text": "It's a great lecture. Thank you! 🥰", "likes": 1}}, {"topLevelComment": {"author": "Kelvin Kennedy", "text": "I wish you was using a white board with dry erase markers… that caulk on that board is hard to listen to during your  demonstration.", "likes": 0}}, {"topLevelComment": {"author": "Atthathiphap Intarach", "text": "#ฟาร์มน้อยร้อยล้าน", "likes": 0}}, {"topLevelComment": {"author": "America Token", "text": "I study this in College and I can tell you this 8hrs were a Full Semestre in College. If want to save thousands of dollars and learn at your own paste watch this video. Great Presentation.", "likes": 0}}, {"topLevelComment": {"author": "Dalim Kobahc", "text": "I love how he pronounces the noun attribute like the verb attribute 😂\nOverall great video with extensive coverage of database design from the ground up. Good job", "likes": 4}}, {"topLevelComment": {"author": "Harminder singh", "text": "Excellent work", "likes": 0}}, {"topLevelComment": {"author": "Nura Wario", "text": "Indebted Sir!", "likes": 0}}, {"topLevelComment": {"author": "Greg Gmax3", "text": "What is the best Stand Alone paid software for creating your DataBase?", "likes": 0}}, {"topLevelComment": {"author": "CreativeGiant", "text": "2:00:02 thats messed up", "likes": 0}}, {"topLevelComment": {"author": "Krishna Patel", "text": "nice and true explanation...really amazing job", "likes": 1}}, {"topLevelComment": {"author": "Naveen Kumar Dongre", "text": "legendary explanation because of Caleb I started loving DBMS subject thank u", "likes": 0}}, {"topLevelComment": {"author": "Osman Celik", "text": "i liked your lesson. may Allah protect you and guide you to his way.", "likes": 1}}, {"topLevelComment": {"author": "ASSA727", "text": "this course maybe suitable for absolut beginners but not for intermediate developers. The instructor has a lack of knowledge about mathematics and specially set theory. He tries zu explain Join with words like \"it looks pretty!\". This explains maybe the reason why a learning video has 940 dislikes", "likes": 2}}, {"topLevelComment": {"author": "Shreya Studies", "text": "My first video in DBMS it really is beginner friendly", "likes": 0}}, {"topLevelComment": {"author": "Alexios Gaming", "text": "Teenager to adult", "likes": 0}}, {"topLevelComment": {"author": "Goka ogak", "text": "I love this channel. Wish you guys will split this video into different videos and create a playlist specific for them. So we can watch one after the other and keep track or even go back to a specific video for reference sake. Instead of a 8hrs or even 32hours length of just a video . This will help both us the viewers and you has a content provider.\nFood for thought 🤔", "likes": 0}}, {"topLevelComment": {"author": "Oloore Issa", "text": "Wow! So this was once Caleb curry 😂", "likes": 0}}, {"topLevelComment": {"author": "Waqas Rahman", "text": "Sometimes looks so cute and raw. Specially when he makes jokes", "likes": 0}}, {"topLevelComment": {"author": "JUAN FELIPE HERNANDEZ MOLINA", "text": "U got me at go america an any other country jajaja", "likes": 0}}, {"topLevelComment": {"author": "Tyrone Harding", "text": "How do you join unrelated tables without any  primary or foreign keys?", "likes": 0}, "replies": [{"author": "Ramyak Rohan Mohanty", "text": "You can't.\n\nThe whole point of foreign keys is so that we CAN join unrelated tables.", "likes": 0}]}, {"topLevelComment": {"author": "Pencil russell", "text": "My database teacher 👏🏾👏🏾👏🏾👏🏾👏👏👏👏👏👏👏🏼👏🏼👏🏼👏🏼", "likes": 0}}, {"topLevelComment": {"author": "Thành Japan", "text": "so crazy!\ntired", "likes": 0}}, {"topLevelComment": {"author": "Mudassir Aqeel", "text": "Watched it, gonna miss caleb", "likes": 0}}, {"topLevelComment": {"author": "AGUS MAGELANG", "text": "Yang mau beli rumah milenial\r\nhttps://youtu.be/TPE6UTadH3s", "likes": 0}}, {"topLevelComment": {"author": "Malik Suleman", "text": "is this video only for sql database ? is there any concept of no SQL?", "likes": 0}}, {"topLevelComment": {"author": "Roline John Aguilar", "text": "Just finished the whole course, aw3some man! Thanks", "likes": 0}}, {"topLevelComment": {"author": "Hrushikesh Khonde", "text": "0.25", "likes": 0}}, {"topLevelComment": {"author": "ˊ ˋ", "text": "第一輪成功!", "likes": 0}}, {"topLevelComment": {"author": "Kaustav", "text": "Caleb is a legend. <3 I used to watch his lectures in 2017. I could relate to this guy so much. <3", "likes": 0}}, {"topLevelComment": {"author": "pangyre", "text": "Fun, excellent, comprehensive, clear and accessible. So good.\n\nI would only offer: when security does not start at the beginning of education, it can be extremely hard for some hackers to ever take seriously. Talking about never storing, let alone displaying passwords, only their hashes or encryption keys—instead of explicitly mentioning displaying them in one of the lessons o_0—or the security benefit/necessity of artificial keys would be a great addition to these talks.", "likes": 0}}, {"topLevelComment": {"author": "Daniel Craig", "text": "There are many videos with similar content, but you are way cuter than any of the others... So easier to learn...lol   Hope my dad doesn't see I'm on his account...giggles", "likes": 0}}, {"topLevelComment": {"author": "Seetsa Molapo", "text": "My man's also scared of 666 🤣", "likes": 0}}, {"topLevelComment": {"author": "Raaghav G.R.", "text": "Very informative video 📹 Caleb. I just wanted to say a few things. \n\n1) You look awesome with long hair and a black coat or parka.\n\n2) I liked your bloopers in the end. \n\n3) I watched the full duration of 8 hours of this video 📹.  So, that should give your stats a boost.", "likes": 0}}, {"topLevelComment": {"author": "Anthony A", "text": "So this is the basics of Databasing, what software is the most easiest and most reliable to create your Own Database without having to \"code\"?", "likes": 0}}, {"topLevelComment": {"author": "جمشید حقوقی", "text": "❤❤❤❤❤❤❤❤❤❤❤", "likes": 0}}, {"topLevelComment": {"author": "Brandon's Excel Tutorials", "text": "This is great! I am good with spreadsheets, but trying to be better with databases and larger sets of data", "likes": 1}}, {"topLevelComment": {"author": "MBALI DEVELOPS", "text": "This table saved my semester", "likes": 0}}, {"topLevelComment": {"author": "Horváth Zoltán", "text": "\"This chick over here..Or lady I should say.\" :DD You are funny and this learning material has helped me a lot so far. Excellent work.", "likes": 0}}, {"topLevelComment": {"author": "Hana Mahamed", "text": "I do love this dude ☺☺😍 alot and I do like his way of teaching", "likes": 0}}, {"topLevelComment": {"author": "Kurt Francis", "text": "https://www.youtube.com/watch?v=8ZcxvmTVqQk", "likes": 0}}, {"topLevelComment": {"author": "Massimo", "text": "Pro tip: \n3rd normal form is very rarely used in production, it is infact to be avoided. Why?\n- It's almost always useless to normalize lookup tables since they contain few data.\n- It becomes unnecessarily complex to query data.\n- database design must FIRST AND FOREMOST be done with the business case in mind. Does It make sense for the business to split product data into a hierarchy of related minuscule tables? No it does not.\n\nNormalize when it is useful to do so, otherwise your project will resemble a school test .", "likes": 0}}, {"topLevelComment": {"author": "Seetsa Molapo", "text": "Caleb saying husband to wife is a one to one relationship... I'm like welcome to the Middle East or Africa. It's a one to many relationship my guy", "likes": 0}}, {"topLevelComment": {"author": "Bhargav Pandya", "text": "amazing explanation! you're a great teacher Caleb!", "likes": 0}}, {"topLevelComment": {"author": "Bhavesh Kumar", "text": "@2:11:20. I think a one-to-one relationship can ALWAYS be stored as entity and attributes instead of using two tables. In the user and card example, we won't have any data-integrity issues if we store user's attributes and the card's attributes in one table. The only problem with that approach is that we'll have null values for card_number, issue_date and max_amount for the users who don't have a card issued in their name.", "likes": 0}}, {"topLevelComment": {"author": "Fred", "text": "amazing course!", "likes": 0}}, {"topLevelComment": {"author": "James Florence", "text": "Only a quarter of the way through, this is so helpful. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Aarij Amir", "text": "Love you Uncle", "likes": 0}}, {"topLevelComment": {"author": "kreo debunk", "text": "Is there today a sence to implement own database if there are already tons of this products already?", "likes": 0}}, {"topLevelComment": {"author": "eurisko", "text": "1:56:31 \nThat's Anomalies", "likes": 0}}, {"topLevelComment": {"author": "kafiya kordahab", "text": "database design and database management is it's same?", "likes": 0}}, {"topLevelComment": {"author": "Alma Cablinan❤", "text": "So very helpful sir. Thanks for your time in making this tutorial. I learned a lot from this. God bless!", "likes": 0}}, {"topLevelComment": {"author": "ayoub boom", "text": "Jack harlow teaching databases", "likes": 0}}, {"topLevelComment": {"author": "Bilal Mahmood", "text": "Thanks Caleb for sharing your knowledge :)", "likes": 0}}, {"topLevelComment": {"author": "Osama [NW]", "text": "why be a king when you can be a jem?", "likes": 0}}, {"topLevelComment": {"author": "canyont", "text": "Excellent examples, clearly explained!", "likes": 0}}, {"topLevelComment": {"author": "Leo B Hardison", "text": "A++++", "likes": 0}}, {"topLevelComment": {"author": "Daniel Spencer", "text": "A+++", "likes": 0}}, {"topLevelComment": {"author": "kai", "text": "讓我感到神奇的是，介紹的文字居然是中文", "likes": 0}}, {"topLevelComment": {"author": "Engr Wehelie", "text": "Could please help write below statement as sql query\n\"Display student name, marks of all subjects where the subjects and names of students are foreign keys \"", "likes": 0}}, {"topLevelComment": {"author": "Monika", "text": "Am i an idiot watching  this after learning sql....i DON'T CARE!!....i lov how he is explaining .....this guy ain't BORING ...I tell u that...anyway by😆", "likes": 0}}, {"topLevelComment": {"author": "Sakarie Nuh", "text": "simplicity is a key and i rarely see that in tutorial videos on youtube. i haven't even finished an hour of this video but u already got my attention. im so keen on finishing this video now and thanks for ur effort.", "likes": 0}}, {"topLevelComment": {"author": "namatovu jackline", "text": "Im blessed finding this video today\nGOD BLESS YOU SIR", "likes": 0}}, {"topLevelComment": {"author": "Conor Kamperman", "text": "This video is like a  time lapse of hair growing", "likes": 0}}, {"topLevelComment": {"author": "Lahiru Wijewardana", "text": "Wow.. great video.. Learnt a lot.. 8 hours gone without any effort.. Thanks.. !! BTW.. Caleb Curry is an awesome name...", "likes": 0}}, {"topLevelComment": {"author": "pacino", "text": "thhis young prodigy of Caleb should get a Nobel Prize! Amazingly focus on teaching. You will make a great contribution to this country America and the world I am so sure.", "likes": 1}}, {"topLevelComment": {"author": "Farhat Keinzer", "text": "pure mathematics, specifically matrix", "likes": 0}}, {"topLevelComment": {"author": "Bernard Neal", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Nick Lim", "text": "is this video from 1996?", "likes": 0}}, {"topLevelComment": {"author": "Ndzalama Ngobeni", "text": "Wow!!!!!. You are a miracle.", "likes": 0}}, {"topLevelComment": {"author": "Mahesh Sinha", "text": "Awesome 👍👍👍👍", "likes": 1}}, {"topLevelComment": {"author": "Huncho", "text": "This is great. I'm 4 hours in and still awake. Amazing", "likes": 0}}, {"topLevelComment": {"author": "Preesuss", "text": "2:15:10 How exactly would you add records in this scenario and delete records? I think a one to one relationship would only have a foreign key on one table, not both where they both refer to each other.", "likes": 0}}, {"topLevelComment": {"author": "DJJonPattrsn22", "text": "Good job!  You keep the students attention by making us laugh.  Thank you!\n\nThe word \"attribute\" can be used as a noun (to represent a THING), or as a verb (to describe an action, something one DOES).   Each usage has a unique pronunciation.\nWhen used as a verb, as in the sentence:  \"I attribute the barking to my neighbor's dog.\" the stress falls on the 2nd syllable.   at-TRI-bute\nWhen used as a noun, as in the sentence:  \"Water has two extremely important attributes.\"  the stress falls on the 1st syllable.  AT-tri-bute\nStress is also sometimes referred to as emphasis or accent.  I am denoting stress with capital letters.   Here are some other examples:\nre-LA-tion\nEN-ti-ty\nDA-ta-base\nA-na-lyst\na-NA-ly-sis\n\nMy point…  You are using the WRONG pronunciation dude, and it seriously calls your credibility into question.  Sincerely!   If an instructor does know how to pronounce one of the most basic words that is fundamental to the topic, how in the world am I supposed to have confidence that he actually knows what he's talking about?\n\nYou are clearly using attribute as a noun, but you're using the pronunciation that indicates a verb.  Just look it up, you'll see!   These are not two alternate pronunciations that are interchangeable.  One it used to indicate noun usage, the other is for verb usage.  This isn't just a colloquial difference, this is true for every dialect of English.", "likes": 0}}, {"topLevelComment": {"author": "Chako Ji", "text": "Free Code Camp is a gift that keeps on giving", "likes": 0}}, {"topLevelComment": {"author": "Temu Pro", "text": "O Great Tutorial...Keep it up!", "likes": 0}}, {"topLevelComment": {"author": "Gaurav Arora", "text": "Hi @caleb , Please add BCNF, 4NF and 5NF  .Nobody teaches like you...I'm obsessed with your teaching style...Great course Btw.I completed it in 4 days", "likes": 1}}, {"topLevelComment": {"author": "Kilgore", "text": "that stupid tshirt", "likes": 0}}, {"topLevelComment": {"author": "Swalih hilaws", "text": "good class sir", "likes": 0}}, {"topLevelComment": {"author": "Sailesh Shrestha", "text": "Hey. Been learning a lot so far. Thanks. \nThe question I have is for the example shown for 'Modality' at 5:34:00 . \nShouldn't it be that 'One card-holder can have zero or one card.' and not 'One card may be owned by zero or one owner.' ?\nAlso shouldn't there be a '0' or '|' indicated at the card_holder's side to indicate that 'one card can be owned by at least zero or one owner.'? \nI'm just learning this subject. So got a little confused. Replies would be very much appreciated.", "likes": 0}}, {"topLevelComment": {"author": "dksmoothtube", "text": "Good video however you are miss pronouncing attribute", "likes": 0}, "replies": [{"author": "DJJonPattrsn22", "text": "well, kind of…  I was just going to say the same thing.\nHe's not actually mispronouncing the word. He is using its pronunciation when used as a verb instead of the pronunciation for a noun.  Although he is clearly using it as a noun.", "likes": 0}]}, {"topLevelComment": {"author": "Andrew Raad", "text": "Caleb! great course, thank you for this. I have a question though, how would you go about transforming information from other sources into the correct foreign keys of a table? If i were to read data from a csv that are in strings, but my table has foreign key constraints that are IDs, is there any way that to upload the strings and they automatically get converted to the correct keys? I really did not want to manipulate the information every time i were to upload data.", "likes": 0}}, {"topLevelComment": {"author": "Hafiz Muhammad Anwar", "text": "Very Informative , It's really helpful for understand the Database Design . Thanks for sharing 👍", "likes": 0}}, {"topLevelComment": {"author": "Mr Walkan", "text": "I know this guy.", "likes": 0}}, {"topLevelComment": {"author": "Drew Wilson", "text": "Introduction to Database Normalization - Teach looking sharp today!", "likes": 0}}, {"topLevelComment": {"author": "akshay chaurasiya", "text": "Is this better than the bootcamp SQL course in udemy?", "likes": 0}}, {"topLevelComment": {"author": "Clemson owns the Buckeyes", "text": "Brotha your video is a big help..God bless your soul my man!!!!", "likes": 0}}, {"topLevelComment": {"author": "Santiago Canosa", "text": "Great course, watch the whole 8hs laughed a lot and really enjoyed it.", "likes": 0}}, {"topLevelComment": {"author": "praveen s", "text": "João Félix is teaching Database design course from soccer field 🙂", "likes": 0}}, {"topLevelComment": {"author": "Tarik Belghouar", "text": "Great video, excellent trainer. Thanks Caleb this was a great refresher and would be perfect for people new to databases", "likes": 0}}, {"topLevelComment": {"author": "‣", "text": "Marathon let's gooo", "likes": 1}}, {"topLevelComment": {"author": "beryale x", "text": "Use play spees 1.25 x if do not have spare time", "likes": 1}}, {"topLevelComment": {"author": "Gurfbagel", "text": "You rock Caleb! Thanks for sharing your knowledge!", "likes": 0}}, {"topLevelComment": {"author": "David Mano", "text": "👍", "likes": 0}}, {"topLevelComment": {"author": "Essayas Nigussie", "text": "Clever boy! as my Math teacher used to say.", "likes": 0}}, {"topLevelComment": {"author": "Adil Mughal", "text": "This guy have pretty good skills. Thanks caleb", "likes": 1}}, {"topLevelComment": {"author": "Adam Gontier SA", "text": "Idk why you chose the husband wife examples :D", "likes": 0}}, {"topLevelComment": {"author": "Widowsson", "text": "In data modeling in Poerw BI, is the information table an intermediary table (child) and the deminsional tables the parents?", "likes": 0}}, {"topLevelComment": {"author": "Tom Vos", "text": "Whoo! I made it. I sat through the whole 8 hours (in a few days) and watched the whole thing. I needed clarification on relationships and how to draw them but it turned out there was more about RDMS I didn't know. To be completely honest, I think the video could have been only 4 hours long if you wouldn't have drawn the User / Card Square time after time 🤣", "likes": 0}}, {"topLevelComment": {"author": "Caio Cavalcanti", "text": "if my pk cannot be changed, why I have a foreign key constraint named \"ON UPDATE\"?", "likes": 0}}, {"topLevelComment": {"author": "Gaurav", "text": "The thing I'll certainly won't forget from this video is that Caleb's favorite number is 7.", "likes": 0}}, {"topLevelComment": {"author": "Owo Char", "text": "I just watched the entire thing. Thanks so much for sharing this knowledge. You are amazing!!!", "likes": 0}}, {"topLevelComment": {"author": "Samer Behery", "text": "Fix 2:30:44 .It should be Many to Many", "likes": 0}}, {"topLevelComment": {"author": "Michael McGavin", "text": "nice", "likes": 0}}, {"topLevelComment": {"author": "frankie slowe", "text": "The way he says “attribute” 13:01", "likes": 1}, "replies": [{"author": "DJJonPattrsn22", "text": "he uses the pronunciation of the word when its used as a verb, but he's using it as a noun.", "likes": 0}]}, {"topLevelComment": {"author": "John Turret", "text": "Wow man. Thanks for puting this one online.", "likes": 0}}, {"topLevelComment": {"author": "Mike B", "text": "They're not a-tributes, they're ATT-ributes. Thank you for taking the time to create this video. I've watched many and they're so lame, I have yet to see even an advanced ms access video do anything that a simple excel file could do. It's ridiculous.", "likes": 1}}, {"topLevelComment": {"author": "Mahammad Aliyev", "text": "Can anoyone say any book for database design with full of practise questions and problems?", "likes": 0}}, {"topLevelComment": {"author": "Ivan Yoed", "text": "Watched the whole series. Took lots of notes. Thanks a lot freeCodeCamp and Caleb.", "likes": 0}}, {"topLevelComment": {"author": "pohmakas33", "text": "excellent tutorial, great lad.\nthanks a lot for this", "likes": 0}}, {"topLevelComment": {"author": "Kabilan S", "text": "@5:33:38", "likes": 0}}, {"topLevelComment": {"author": "Ved IQ", "text": "Thank you Caleb. Thank you", "likes": 0}}, {"topLevelComment": {"author": "AlekoDimitrov", "text": "23:45", "likes": 0}}, {"topLevelComment": {"author": "Suheilyn García Umaña", "text": "I love this channel", "likes": 0}}, {"topLevelComment": {"author": "caio vieira", "text": "Very nice tutorial.  Thank you!", "likes": 0}}, {"topLevelComment": {"author": "VI LE", "text": "Read more here TCL phone SHARE front places to all U S A COMPUTERS needs importants informations", "likes": 1}}, {"topLevelComment": {"author": "VI LE", "text": "Breath fresh air out door", "likes": 0}}, {"topLevelComment": {"author": "VI LE", "text": "YOUTUBE", "likes": 1}}, {"topLevelComment": {"author": "VI LE", "text": "DATA BASE needs", "likes": 1}}, {"topLevelComment": {"author": "VI LE", "text": "EMAIL send 2019 USA COMPUTERS    2018 2017 etc more .", "likes": 1}}, {"topLevelComment": {"author": "VI LE", "text": "TCL phone this SHARE    front pages important information needs to all 2019 U S A COMPUTERS    2020 2021 etc more", "likes": 1}}, {"topLevelComment": {"author": "MrEndzo", "text": "This guy database", "likes": 0}}, {"topLevelComment": {"author": "Sergio Bost", "text": "you: C'mon don't be a noob\nalso you: I dont even know you how you pronounce it... \"Postgray\" SQL \njust joking, great vid", "likes": 0}}, {"topLevelComment": {"author": "Mlondy Madida", "text": "This guy is way too cool 😎", "likes": 0}}, {"topLevelComment": {"author": "Eminosrrr", "text": "This is actually child labour. Do you even pay for this kid?", "likes": 0}}, {"topLevelComment": {"author": "Philipp Kushnir", "text": "This is a “must watch” video for all students who pursuing a CS degree. Your database design course will be piece of cake 😁", "likes": 3}, "replies": [{"author": "kangmo Abel (ካንግሞ)", "text": "@Philipp Kushnir what does 1NF mean ?", "likes": 0}, {"author": "Philipp Kushnir", "text": "@Ferdi 100% espesially for 1NF, 2NF, 3NF etc", "likes": 0}, {"author": "Ferdi", "text": "hello, i currently learning how to design a database ERD, is it worth to watch?", "likes": 0}]}, {"topLevelComment": {"author": "Yılmaz DALKIRAN", "text": "His hairs are growing while you watching the video.", "likes": 1}, "replies": [{"author": "kangmo Abel (ካንግሞ)", "text": "😂😂😂😂😂😂😂😂", "likes": 0}, {"author": "Ali dawah fan", "text": "Dalyarak", "likes": 0}]}, {"topLevelComment": {"author": "Jay Keophilavanh", "text": "Anyway for more help?", "likes": 0}}, {"topLevelComment": {"author": "Samuel Onuegbu", "text": "Bro, you're such a blessing here even after 3 years. May you have a GOOD woman for a wife, if you must have one, Amen.", "likes": 0}}, {"topLevelComment": {"author": "moha ed", "text": "what is the next step?", "likes": 1}}, {"topLevelComment": {"author": "Texas-Red", "text": "This kids going places! 😊🤙😁", "likes": 0}}, {"topLevelComment": {"author": "cococrispys", "text": "14:00", "likes": 0}}, {"topLevelComment": {"author": "Ivan Yoed", "text": "Who is Claire?", "likes": 0}}, {"topLevelComment": {"author": "Dee", "text": "Hey Caleb , thank you for your database course , it's helping me a great deal and hopefully I'll be able to design a good database for my small business . Thanks for the great work ,  much appreciated and please buy yourself a whiteboard", "likes": 3}}, {"topLevelComment": {"author": "Debesh Maitra", "text": "Excellent job", "likes": 0}}, {"topLevelComment": {"author": "Maury Aleman", "text": "thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "GO VIRAL", "text": "Your explanation is understandable for everyone thanks teacher", "likes": 0}}, {"topLevelComment": {"author": "sakshi singh", "text": "Oo hey what's up caleb  \nAmazing tutorial , thanks caleb 🙏", "likes": 0}}, {"topLevelComment": {"author": "Leviathan CR", "text": "Oh boy this is to take while to get through...", "likes": 0}}, {"topLevelComment": {"author": "Tasha N", "text": "Awesome. Caleb Curry is such a good teacher. Database design made simple.", "likes": 0}}, {"topLevelComment": {"author": "unknwn_usr", "text": "His Adam's Apple 🍎", "likes": 0}}, {"topLevelComment": {"author": "Matthias Meiksner", "text": "actually, you're very funny. 😆", "likes": 0}}, {"topLevelComment": {"author": "Manjunath", "text": "1:58:38 loved it 😁", "likes": 0}}, {"topLevelComment": {"author": "Back-End Developer", "text": "What if in base data do not comes from any front end side? So What we will do? will we do static or manual store to the base our own data?", "likes": 0}}, {"topLevelComment": {"author": "Khaled El Gammal", "text": "Thank you so much Caleb .. my career owes you a lot", "likes": 0}}, {"topLevelComment": {"author": "Surajit Kakoty", "text": "Caleb Curry You are such a great teacher.The Course is very interesting.", "likes": 0}}, {"topLevelComment": {"author": "Amodu Gbenga", "text": "Silly question - How does this differ from a System Design course? That's if it does ofc...", "likes": 1}}, {"topLevelComment": {"author": "Nossir", "text": "Self Note\nStopped at Foreign Key", "likes": 0}}, {"topLevelComment": {"author": "Nossir", "text": "2:35:41 that's how time travel in Dark works", "likes": 0}}, {"topLevelComment": {"author": "zmffhfltm91", "text": "អរគុណ💎", "likes": 0}}, {"topLevelComment": {"author": "ranjan singh", "text": "Awesome content. The way of teaching is brilliant .It has cleared my concepts.", "likes": 0}}, {"topLevelComment": {"author": "Joe VR", "text": "Love the video!", "likes": 0}}, {"topLevelComment": {"author": "Nour Slimane", "text": "one husband can have more than one wife in my country hahahahaha", "likes": 0}}, {"topLevelComment": {"author": "Common Sense", "text": "Dude grew a beard in the 8 hours of this course.", "likes": 0}}, {"topLevelComment": {"author": "paul ubakanma", "text": "Great work, I've not watched it though, but from the comments, I think it will really help me as a beginner, great work bro", "likes": 0}}, {"topLevelComment": {"author": "Trân Nguyễn", "text": "Thanks a bunch", "likes": 0}}, {"topLevelComment": {"author": "Miha B.", "text": "Man you are the best I found so far. Great presentation. And do not worry about talking fast. I set the speed to 1.5 to get the data flowing faster and I could comprehand everything.", "likes": 0}}, {"topLevelComment": {"author": "S V R", "text": "❤️💯", "likes": 0}}, {"topLevelComment": {"author": "Upasana Chaturvedi", "text": "Just awesome 👏🏼 effort for those who r not able to invest time and money ....quick and efficient...", "likes": 0}}, {"topLevelComment": {"author": "Pavel Komar", "text": "Thanks, Caleb, it was an exiting journey, i could not believe i'd be able to finish 8 hrs and yet i have.", "likes": 0}}, {"topLevelComment": {"author": "Radia Radi", "text": "I love his teaching method ....I didn't get disinterested 🥰", "likes": 0}}, {"topLevelComment": {"author": "Tyler", "text": "🖤", "likes": 0}}, {"topLevelComment": {"author": "Yair Eshel Cahansky", "text": "Theres another reason to use non capital letters for table name in mysql. The scema, and sometimes the data is stored in a file with this name. Windows file names are case insensitive, while linux filenames are case sensative. That means you'll find that things that worked on your local machine, don't work in production and vise versa. I had this bug once, and threw 3 work days on it, because this issue is so rare. Save yourself the troubles.", "likes": 0}}, {"topLevelComment": {"author": "Andes Cósmico", "text": "Very smart. What he says is precise.", "likes": 0}}, {"topLevelComment": {"author": "PANKAJ KUMAR", "text": "Sap basis videos", "likes": 0}}, {"topLevelComment": {"author": "Shabaz Sayed", "text": "I am 31 years old with cs degree and 4 years of experience in backend tech .never have i ever had a smooth journey to learn anything bit lengthy but its easy as pie", "likes": 0}}, {"topLevelComment": {"author": "Francis Kovacs", "text": "There is a difference, big difference between showing (off) what you know and teaching.", "likes": 0}}, {"topLevelComment": {"author": "HK Tepochcalli", "text": "better than my college professor.....what is going on with these colleges...getting too lazy...", "likes": 0}}, {"topLevelComment": {"author": "Chirag Agarwal", "text": "Why does he remind me so much of the silicon valley guy 😂", "likes": 0}}, {"topLevelComment": {"author": "Doorani chanal", "text": "Best share knowledge", "likes": 0}}, {"topLevelComment": {"author": "Mitchell", "text": "Wow, great stuff. This guy is a great teacher. Almost done with the 8+ hour video series. It actually makes me excited to design databases.", "likes": 5}}, {"topLevelComment": {"author": "higheloguy", "text": "0:00 me seeing your face again:\n:)))))))))))))))))))))))))))))))))))))))))))))))", "likes": 0}}, {"topLevelComment": {"author": "Reellron", "text": "The sad part about this video is not being able to up-vote it more than once", "likes": 1}}, {"topLevelComment": {"author": "Claudia Alexander", "text": "You are Amazing...", "likes": 0}}, {"topLevelComment": {"author": "Shashwat Saini", "text": "Just one thing we can do, don't skip ads. 🙌", "likes": 2}}, {"topLevelComment": {"author": "Lansana Kabbah", "text": "I grade you as one of the greatest database instructor. what an opener and best database vivid explanation. I am impressed about your work.", "likes": 0}}, {"topLevelComment": {"author": "Beko Mantein", "text": "Wow, great video. Thanks Caleb. I like your teaching style", "likes": 0}}, {"topLevelComment": {"author": "Adams Mohammed", "text": "You are the best..", "likes": 0}}, {"topLevelComment": {"author": "Badal Kumar", "text": "Awesome video", "likes": 0}}, {"topLevelComment": {"author": "Хасан Шадияров", "text": "Btw superkey is written together because \"super\" doesn't mean super itself here, it's a short form of superset –> so we have \"superset of a key\" = \"superkey\"", "likes": 0}}, {"topLevelComment": {"author": "Хасан Шадияров", "text": "5:02:02\nCaleb: I am not gonna try to memorize 10 videos of content, it's crazy\nMe Watching those 10 videos in a row: 🗿", "likes": 0}}, {"topLevelComment": {"author": "Vimal Kumar", "text": "It's really one of the best channel you can see on Youtube. It's fucking great! It will give you more than any university courses and that too for freeeeee.... only you need is device with internet and you go", "likes": 0}}, {"topLevelComment": {"author": "Zach Brady", "text": "dude couldn't have found a better domain for introducing one-to-one and one-to-many relations than marriage? 0.o", "likes": 0}}, {"topLevelComment": {"author": "Хасан Шадияров", "text": "All his women are bald lol", "likes": 0}}, {"topLevelComment": {"author": "罗文", "text": "thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Michael Shepherd Munemo", "text": "Thanks Caleb. Well Explained was running away from BackEnd by i find myself...great work", "likes": 0}}, {"topLevelComment": {"author": "tariq_ Dev", "text": "Amazing premium intro to python and programming\nhttps://youtu.be/krnFbx1F4oQ", "likes": 0}}, {"topLevelComment": {"author": "John-Paul Matenga", "text": "You deserve a knighthood. Arise Sir Caleb of Curry!!!", "likes": 0}, "replies": [{"author": "rizvy rahman", "text": "Yes. I deserve a knighthood because every moment of my life in my sleeping time evil force takes me remand and create hellish environment.", "likes": 0}]}, {"topLevelComment": {"author": "sief Qasrawi", "text": "Bro first 40 min was the most useless. He’s teaching definitions, which is very indicative of an American teaching system of memorizing. I think the kid is confused about what teaching and conceptualisation means. Even though admiringly he knows way more than me, he is fundamentally confused.", "likes": 0}}, {"topLevelComment": {"author": "Zane Grey", "text": "This man’s course puts my Uni lecture to shame", "likes": 0}}, {"topLevelComment": {"author": "Dut Kulang", "text": "man i have been following you for sometime now am glad that you also made this great beginner course. thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Abraham Mathew", "text": "Hi, If my primary key in membership table is combination of multiple columns then how would i refer this in my member columns as FK?", "likes": 0}}, {"topLevelComment": {"author": "Javi Aniki", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Eisa Ahmed", "text": "Is this course suitable for someone going into data science?", "likes": 0}, "replies": [{"author": "Sharan 999", "text": "Yes", "likes": 0}]}, {"topLevelComment": {"author": "Umar Farid", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "ejkejk", "text": "Nice bro.........", "likes": 0}}, {"topLevelComment": {"author": "Kukudala Anuradha", "text": "It's an  amazing way of teaching  ..thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "edtech by meera", "text": "Is database the same as Dbase3", "likes": 0}}, {"topLevelComment": {"author": "HELLO PETER 🧃", "text": "Were are you from?", "likes": 0}}, {"topLevelComment": {"author": "HELLO PETER 🧃", "text": "How old are you", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Mustafa", "text": "Get this man a whiteboard!", "likes": 0}}, {"topLevelComment": {"author": "Z C", "text": "thank you so much!", "likes": 0}}, {"topLevelComment": {"author": "Mcan Duiken", "text": "Thanks for taking all of the time you put into this and sharing it, very much appreciated!", "likes": 0}}, {"topLevelComment": {"author": "Rk Raju", "text": "Oh hey", "likes": 1}}, {"topLevelComment": {"author": "Randy", "text": "One slight correction . . . it's pronounced \"AT-rib-yutes\" not \"a-TRIB-yutes\". The stress should be on the first syllable not the second.", "likes": 0}, "replies": [{"author": "Dirghayu Joshi", "text": "bruh", "likes": 1}, {"author": "Ameya Shetty", "text": "bruh", "likes": 1}]}, {"topLevelComment": {"author": "digitalconsciousness", "text": "Great talk, but just a tip: when you're saying \"attribute\" around the 13 minute mark, you're pronouncing it using its verb form when you should be pronouncing it using the noun form. \"I attTRIbute my success to watching youtube videos about databases\" vs \"database tables have ATtributes\".", "likes": 4}, "replies": [{"author": "xox3769v", "text": "I noticed this too and I'm glad someone else noticed", "likes": 0}]}, {"topLevelComment": {"author": "ElvenIvy07", "text": "Is it conventional to say the word attribute as if it were a verb rather than a noun in this context or is this just a regional thing? :D", "likes": 0}}, {"topLevelComment": {"author": "lepinecode", "text": "In the end he got long hair so he did this on several weeks :)\nIt reminds me of traditional course in my engineering cours ...in the old days since I know all this already I just reviewed it  at 1.75x speed :D", "likes": 0}}, {"topLevelComment": {"author": "Aref Yazdi", "text": "By far it was greatest video i had seen", "likes": 0}}, {"topLevelComment": {"author": "Kenny Gozali", "text": "Awesome video, learned a lot from it, thanks! :)", "likes": 0}}, {"topLevelComment": {"author": "Jone Master", "text": "Comuter see only 1/0, so data IS always same", "likes": 0}}, {"topLevelComment": {"author": "Rangta Banerjee", "text": "Thanks => https://youtube.com/playlist?list=PLjPCqQYX_TNriEcLOMuuMtZ1ZaIiloTyb", "likes": 1}}, {"topLevelComment": {"author": "Rangta Banerjee", "text": "Good => https://youtube.com/playlist?list=PLjPCqQYX_TNriEcLOMuuMtZ1ZaIiloTyb", "likes": 1}}, {"topLevelComment": {"author": "Klannahar", "text": "OMG i just realize it is over 8 hrs long video.... :( Interesting subject but way too long. Maybe better to split up on shorter videos. Time stams fine but is is looks like a video with a ton of commecrcial with those vertical lines. Harder to get the right jumps between timestams. A small mouse movement will cause 10-20 min jump.", "likes": 0}}, {"topLevelComment": {"author": "Juan De Souza", "text": "database lessons on a blackboard? wth man? thanks but no thanks.", "likes": 0}}, {"topLevelComment": {"author": "Cozy atmosphere ASMR", "text": "Hello everyone, I have one question, I am very new to programming, is the lecture useful for me.", "likes": 1}}, {"topLevelComment": {"author": "Nolan Senn", "text": "If anyone reads this, I took a SQL class at very good program. This video condenses that class and covers everything it did in 8 hours :)", "likes": 1}}, {"topLevelComment": {"author": "Dammy Ige", "text": "I literally just watched you grow a beard or two throughout the course of this video lol", "likes": 0}}, {"topLevelComment": {"author": "Cristian Valls", "text": "my highlights. \n1:42:00  waaat\n1:57:00 hahah", "likes": 0}}, {"topLevelComment": {"author": "Code Cage", "text": "At 6 hours and 26 minutes, we are seeing a \"White Board\" with erasable markers instead of chalk and a chalkboard!", "likes": 0}}, {"topLevelComment": {"author": "Derpy the Spy", "text": "5:33:38 nice", "likes": 0}}, {"topLevelComment": {"author": "Fargendo", "text": "2:41:26 what did Claire do  😂", "likes": 0}}, {"topLevelComment": {"author": "Miguel Caceres", "text": "i love you caleb", "likes": 0}}, {"topLevelComment": {"author": "Sagar Kaul", "text": "Thanks!", "likes": 1}}, {"topLevelComment": {"author": "Raidou Ng", "text": "\"Sorry for for yelling and getting intense\" - xD Gold xD Please someone, do the timestamp of all Caleb's jokes throughout this course xD", "likes": 0}}, {"topLevelComment": {"author": "Larry Norris Koh", "text": "relation in between entity (caleb) and the entity-attributes(name, telephone, sex)", "likes": 0}}, {"topLevelComment": {"author": "Aryan Sharma", "text": "1:38:51 self note.", "likes": 1}}, {"topLevelComment": {"author": "Teflon Pan", "text": "8 HOURS!??! Man.... couldn't you have shortened it to like 8 minutes or sumphin.", "likes": 0}, "replies": [{"author": "Ameya Shetty", "text": "oh yeah big brain time", "likes": 0}]}, {"topLevelComment": {"author": "Inês Borges", "text": "Awsome video Caleb very well explained. Still being viewed after 6 years. I'm Going to recomend this to my friends who are learning database design.", "likes": 2}}, {"topLevelComment": {"author": "Daniel", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "peep dawg", "text": "Pie123, huh? Hope that your bank has some money mate", "likes": 0}}, {"topLevelComment": {"author": "Thomas Potter", "text": "lol i love this guy. thanks for the lecture, helped me so far to understand dd! and I just realize we have (kind-of) same writing, but you're better, mine worsen :v", "likes": 0}}, {"topLevelComment": {"author": "Shujat Khalid", "text": "Thank God there's the option to increase the playback speed. Great course.", "likes": 0}}, {"topLevelComment": {"author": "meron hailu", "text": "O Man thanks for making my life much essayer", "likes": 0}}, {"topLevelComment": {"author": "Fadil", "text": "The best course i've ever taken.", "likes": 0}}, {"topLevelComment": {"author": "Darya M", "text": "Dear Caleb, thank you very much for such amazing tutorial! I've just finished watching it!", "likes": 0}}, {"topLevelComment": {"author": "Rishabh Shukla", "text": "Love from India brother❤️", "likes": 0}}, {"topLevelComment": {"author": "Kaizen169", "text": "This is not a database design course it’s just a introduction to basic rdbms. Database design is where you take a practical use case and design a dB schema for a particular application.", "likes": 4}, "replies": [{"author": "Ameya Shetty", "text": "@Zachary did you happen to find a video on that?", "likes": 0}]}, {"topLevelComment": {"author": "mo2k2", "text": "Calebs the man!", "likes": 1}}, {"topLevelComment": {"author": "nayeem chowdhury", "text": "Your tutorial basic level is auspicious.", "likes": 0}}, {"topLevelComment": {"author": "Ju Young Kim", "text": "Thank you for the long video. It will be useful in my future database design projects.", "likes": 0}}, {"topLevelComment": {"author": "Sebastian", "text": "cool, thanks!", "likes": 0}}, {"topLevelComment": {"author": "Data Str and Algo", "text": "This video is so long that you can see him transforming from using chalk to marker.", "likes": 0}}, {"topLevelComment": {"author": "qazi umer", "text": "that helped me a lot,\n well explained ...", "likes": 0}}, {"topLevelComment": {"author": "aas wijesekara", "text": "THERE IS NO COMPUTER MATHEMATIC FULL TUTORIAL  IN YOU TUBE.. CAN YOU DO IT", "likes": 0}}, {"topLevelComment": {"author": "dubo la", "text": "beard and hair", "likes": 0}}, {"topLevelComment": {"author": "Shriti Shaw", "text": "hey, it's Caleb, the man who created excellent tutorials on C/C++, tbh, I learnt C++ just by watching his tutorials", "likes": 0}}, {"topLevelComment": {"author": "Long Nguyễn Thành", "text": "thanks :3", "likes": 0}}, {"topLevelComment": {"author": "daniel kurnia", "text": "how long you've been take this video, until we all can see his hair and beard is grow", "likes": 0}}, {"topLevelComment": {"author": "kenan", "text": "i can't belive you teach all of this for free you are saints", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:50:22", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:44:04", "likes": 0}}, {"topLevelComment": {"author": "Yu Victor", "text": "thank you for sharing, great videos", "likes": 0}}, {"topLevelComment": {"author": "Darth Vader", "text": "52:24", "likes": 0}}, {"topLevelComment": {"author": "Ravish Mahajan", "text": "Freecodecamp must be officially considered an open university by countries so that one can earn credits and earn degree. You do not realize how much  help you are providing students in poor countries( I hope they have internet connection)", "likes": 0}}, {"topLevelComment": {"author": "Tumi Selepe", "text": "If Caleb thinks I’m gonna spend a whole 8 hours watching this video he is damn right", "likes": 2}}, {"topLevelComment": {"author": "Hariom Sharma", "text": "What an example.😂 many to many relationship", "likes": 0}}, {"topLevelComment": {"author": "4007 Ahamed Kabeer", "text": "Thanks bro..", "likes": 0}}, {"topLevelComment": {"author": "Isuru Sandaruwan", "text": "Great video. Thank you very much.", "likes": 0}}, {"topLevelComment": {"author": "Mario Alberto Hernandez Nuñez", "text": "7:47:34 Well, Is it better to use inner join twice? In this way you just have the users how comment and, in the 2nd join you'll have the videos where the users made comments", "likes": 0}}, {"topLevelComment": {"author": "Evans healthcare clinic", "text": "well elaborate", "likes": 0}}, {"topLevelComment": {"author": "Sanjiv Tamang", "text": "giving example of youtube would be better", "likes": 0}}, {"topLevelComment": {"author": "Ricky RICK", "text": "Big Thanks guy, for everyone you have helpt ! By the way, i'm sure you are a HP. / Zebra, ...", "likes": 0}}, {"topLevelComment": {"author": "Blblbl21", "text": "He is the main character.", "likes": 2}}, {"topLevelComment": {"author": "Darth Vader", "text": "I am 37 years old and professional developer, watching this to refresh my knowledge about Databases. Can say with certainty that this kid is better than my professors. Congratulations, hope you are living happy life and are not addicted to some drugs or something.", "likes": 19}, "replies": [{"author": "Akshar Solanki", "text": "That is serious judgement. Caleb is better than professors. Agreed. My professor had her own struggle to understand and teach the theoretical concepts.", "likes": 1}, {"author": "T C", "text": "Ok Darth Vader=)", "likes": 0}]}, {"topLevelComment": {"author": "Mitej Madan", "text": "Now I can peacefully sleep during the lectures and answer when required.", "likes": 4}}, {"topLevelComment": {"author": "UPENDRA KUMAR", "text": "Thanks Caleb for your wonderful help.", "likes": 0}}, {"topLevelComment": {"author": "Cero", "text": "FYI, such a chad. Really great content my dude :)", "likes": 1}}, {"topLevelComment": {"author": "Bob Chal", "text": "Great video Caleb.  I've designed a relational patient medical record database for a rural India village of 500 families. Now that it's designed I need to figure out how to get the villager data into the DB design. What's the easiest way to enter their data, retrieve it, update it, and print it etc?  I designed the DB using a nice android app called \"Kilm database designer\" but that's just for design step.  Now I need to move forward with data entry, update and reporting.  Can you give me any suggestion for how to proceed most easily?  Any suggestions are appreciated for my next implementation steps following the database design.  Thanks,. Bob C", "likes": 0}}, {"topLevelComment": {"author": "Queenlove Aliyu", "text": "Nice one", "likes": 0}}, {"topLevelComment": {"author": "Mayliveon1", "text": "I did realize much Caleb taught me until I looked at an actual diagram. Caleb is the truth!", "likes": 0}}, {"topLevelComment": {"author": "Victoria Abraham", "text": "'Database design'Nice piece, very educative", "likes": 0}}, {"topLevelComment": {"author": "Wardaman619", "text": "thank you", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:42:30", "likes": 0}}, {"topLevelComment": {"author": "Saranya Ghosh", "text": "This is a time stamp for my reference 1:00:00", "likes": 0}}, {"topLevelComment": {"author": "Marylene De Jesus", "text": "L", "likes": 0}}, {"topLevelComment": {"author": "Payal Gupta", "text": "Hello Sir, Pls tell me some projects Which can be built only using SQL??", "likes": 0}}, {"topLevelComment": {"author": "Commander Shepard", "text": "I prefer the following\nOne to one:Monogamy\nOne to many:Polygamy,one man multiple wives\nMany to many:A massive Orgy", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:28:40 what the hell happened here?", "likes": 0}}, {"topLevelComment": {"author": "Samarth Singh Thakur", "text": "2:54:46", "likes": 0}, "replies": [{"author": "Samarth Singh Thakur", "text": "5:13:19", "likes": 0}, {"author": "Samarth Singh Thakur", "text": "4:12:29", "likes": 0}]}, {"topLevelComment": {"author": "Sathish Mogulagani", "text": "🎓", "likes": 0}}, {"topLevelComment": {"author": "Andrés ", "text": "3:04:05 Gotta keep it family friendly.", "likes": 2}}, {"topLevelComment": {"author": "PowerfulLVE", "text": "Thanks!", "likes": 0}}, {"topLevelComment": {"author": "Eugen Belousov", "text": "Oh not Claire", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:18:40", "likes": 0}}, {"topLevelComment": {"author": "Adel Balbisi Rojas", "text": "good course I LIKE IT, and as suggestion it will be nice to avoid bamboo timelines", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "3:11:30", "likes": 0}}, {"topLevelComment": {"author": "ganesh", "text": "I salute ur valuable effort brother", "likes": 0}}, {"topLevelComment": {"author": "Aleksandar Atanasov", "text": "And how all that presentation actually working on computers, no idea. It is good like a theoretical concept, but the chalkboard is not a computer. Databases and SQL working with computers, not on chalkboards. 8 hours without any practical idea how to put all of this In reality.", "likes": 1}}, {"topLevelComment": {"author": "bornkool", "text": "Wow, I serendipitously stumbled upon this most informative Database tutorial. I am enjoying this young man's presentation. I appreciate the efforts he has made to eloquently present this subject matter. I give much respect and thanks for this enormous presentation of Database design, use, manipulation, and administration.  This video is expanding my knowledge of database design and structure. Thank you.", "likes": 7}}, {"topLevelComment": {"author": "oduduwa nationdynamics", "text": "You teach better than some high degree holders...sometimes its best to learn from the simplicity of youth...", "likes": 1}}, {"topLevelComment": {"author": "Cassini Jr.", "text": "what is conceptual , logical data model, are these things covered in this course?", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "2:19:00", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "2:12:00", "likes": 0}}, {"topLevelComment": {"author": "Happiness & Relaxation ", "text": "What a brilliant young man , i wish you all the best .", "likes": 0}}, {"topLevelComment": {"author": "Darrell Willie", "text": "You are an awesome teacher. Thank you!", "likes": 0}}, {"topLevelComment": {"author": "Shuoyu Chen", "text": "Most meaningful 8 hours I've spent in 2021!", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "2:05:00", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:34:00", "likes": 0}}, {"topLevelComment": {"author": "Coder", "text": "do you think this guy has any gf???", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:25:00", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:22:10", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:13:37", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:11:11", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:09:40", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:09:00", "likes": 0}}, {"topLevelComment": {"author": "Gus Gus", "text": "1:07:20", "likes": 0}}, {"topLevelComment": {"author": "Abdelhafeez Nada", "text": "Hey i'm writing this comment to creat one - to - many relationship 😂😂😂", "likes": 0}}, {"topLevelComment": {"author": "Srikanth K", "text": "Great learning platform", "likes": 0}}, {"topLevelComment": {"author": "Kittidet Lakthong", "text": "Thank you for the best database video ever . Love it.", "likes": 1}}, {"topLevelComment": {"author": "Mayank Mathur", "text": "young Richard Hendrix!", "likes": 0}}, {"topLevelComment": {"author": "max steel ", "text": "Gr8 he clarify at the beginning 1:55 for all data base design.", "likes": 0}}, {"topLevelComment": {"author": "Yu S", "text": "Because i'm japanese, this channel gives me English and IT skill.", "likes": 6}, "replies": [{"author": "Ricardo", "text": "Nice! Same for me, from Venezuela-Latinamerica. Spanish speaker. Btw, japanese is cool (:", "likes": 1}]}, {"topLevelComment": {"author": "Dimas Musa", "text": "8 hours since before midnight, i just realize there were no ads", "likes": 0}}, {"topLevelComment": {"author": "Víctor Steiner", "text": "In general we care about how we call things because with naming usually a definition comes together so we can communicate clearly and with a minimal confidence that we are talking about the same things when we refer to them by their names.", "likes": 0}}, {"topLevelComment": {"author": "lone wolf coding", "text": "im 3rd yr IT student and watching again \nhes good at teaching keep it up", "likes": 0}}, {"topLevelComment": {"author": "Bernardo Cabral", "text": "Amazing", "likes": 0}}, {"topLevelComment": {"author": "GOAnywhere", "text": "amazed to see how chalk is offending few people in the comments.", "likes": 0}}, {"topLevelComment": {"author": "Raven Studios", "text": "Thank You!", "likes": 0}}, {"topLevelComment": {"author": "Wizard Gaming", "text": "Thx man , learnt so many things ,thx for your efforts", "likes": 0}}, {"topLevelComment": {"author": "Hải Nguyễn Việt", "text": "it's better if i'm able to use English subtitle with this video", "likes": 0}}, {"topLevelComment": {"author": "DevOps(DevelopOptions)", "text": "i liked it very mush thanks caleb", "likes": 0}}, {"topLevelComment": {"author": "Reshma Malik", "text": "Keep going free code camp, you are really amazing", "likes": 0}}, {"topLevelComment": {"author": "D R", "text": "One of best videos  I've ever watched.", "likes": 0}}, {"topLevelComment": {"author": "D R", "text": "Very clear explanation . Thanks", "likes": 0}}, {"topLevelComment": {"author": "shaho danyali", "text": "This is unbelievable. This 8 hour video completely covered the 2 topics I had done in two semesters.", "likes": 9}}, {"topLevelComment": {"author": "purnachandra k", "text": "Thank u", "likes": 0}}, {"topLevelComment": {"author": "Ahmed Jimmy", "text": "u made up my day thanks a lot <3", "likes": 0}}, {"topLevelComment": {"author": "Deepak Singh", "text": "Does he teach sql?", "likes": 0}}, {"topLevelComment": {"author": "Antony Kimani", "text": "this guy is a real nerd", "likes": 0}}, {"topLevelComment": {"author": "Kingkor Roy Tirtho", "text": "One of the best course I've taken but can I get the source codes & the cheatsheets?!😂", "likes": 0}}, {"topLevelComment": {"author": "Gabriel Veloz", "text": "02:40:38 what's the story behind claire XD", "likes": 0}}, {"topLevelComment": {"author": "Jon Zen", "text": "subtitled, please!", "likes": 0}}, {"topLevelComment": {"author": "Kristof Busch", "text": "This guy's somewhere between 15 and 35 years old.", "likes": 7}}, {"topLevelComment": {"author": "Dom McKean", "text": "(4:15) Ahhhh! a floating head!", "likes": 0}}, {"topLevelComment": {"author": "Dom McKean", "text": "What happened with Claire?", "likes": 0}}, {"topLevelComment": {"author": "Fudomei tv", "text": "Great !!!", "likes": 0}}, {"topLevelComment": {"author": "J", "text": "I love your teaching style>-<", "likes": 0}}, {"topLevelComment": {"author": "Pruthvina Shavji", "text": "Thank you !!", "likes": 0}}, {"topLevelComment": {"author": "Buhay Online", "text": "simply amazing!", "likes": 1}}, {"topLevelComment": {"author": "Rayner Da Cruz", "text": "Thank you to whoever took their time and added in the video chapters. 🙏", "likes": 0}}, {"topLevelComment": {"author": "035_Shubham Saurav", "text": "I only remember Kaleb the vampire😂😂", "likes": 0}}, {"topLevelComment": {"author": "Ajay Kumar", "text": "👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "KedraIrke", "text": "\"Series\" :D", "likes": 0}}, {"topLevelComment": {"author": "Tom 8", "text": "He looks like Troy Sivan.", "likes": 0}}, {"topLevelComment": {"author": "Adrees Hipster", "text": "Translate arabic ?", "likes": 0}}, {"topLevelComment": {"author": "Mari Park", "text": "I like the way of your teaching in this video. It helps me to understand easily the database fundamental theory. Thank you!", "likes": 2}}, {"topLevelComment": {"author": "Sandeep mishra", "text": "I want a course which covers for the position for data Engineer...Is this course covers all the related material or I've to learn more apart from these.", "likes": 0}}, {"topLevelComment": {"author": "Muhammad Syabani Falif", "text": "Thanks for the course, but can you add subtitle please ? No problem if it is auto generated.", "likes": 0}}, {"topLevelComment": {"author": "Vaibhav Misra", "text": "1:46:06\n5:13:20", "likes": 0}}, {"topLevelComment": {"author": "Alina Gautam", "text": "3:47:38 that's funny", "likes": 0}}, {"topLevelComment": {"author": "nikola pashov", "text": "Jeezus not trying to be rude, but every time he made a joke my desire to keep on watching instantly disappeared.", "likes": 0}}, {"topLevelComment": {"author": "Ria Ria", "text": "I wonder if anyone watched full video", "likes": 1}}, {"topLevelComment": {"author": "Δημήτρης Κ.", "text": "dqdq", "likes": 0}}, {"topLevelComment": {"author": "Mr.T", "text": "Is this still relevant?", "likes": 0}}, {"topLevelComment": {"author": "Ibrahim Bek", "text": "Thanks", "likes": 0}}, {"topLevelComment": {"author": "daniaz", "text": "Hello. Is possible put subtitles in the video ??", "likes": 0}}, {"topLevelComment": {"author": "Jona C", "text": "I cant believe that I make a semester to learn all this and you explain it for a couple of hours 😐 I can't believe this is Free", "likes": 9}}, {"topLevelComment": {"author": "Shivani Singh", "text": "Sir, thanks for effort..it was so helpful.and u look cute", "likes": 0}}, {"topLevelComment": {"author": "Abdo Gebril", "text": "What should i learn next to implement database in real world example?", "likes": 0}}, {"topLevelComment": {"author": "Humberto Vale", "text": "Watching the video in 2021. This is so good. After 3 hours  I realized I love this guy. Caleb is great at explaining each concept with amazing simplicity while being funny at the same time. You're a database hero Caleb! Thank you so much for your outstanding job.", "likes": 27}}, {"topLevelComment": {"author": "amy19355", "text": "I really enjoyed your teaching style!", "likes": 0}}, {"topLevelComment": {"author": "Alexander García", "text": "I'm glad that I have completed the course, totaly worth", "likes": 0}}, {"topLevelComment": {"author": "Will Butcher", "text": "this guy is hilarious lol !", "likes": 0}}, {"topLevelComment": {"author": "Andrea Ho", "text": "This channel should be nominated for an educational Nobel prize.", "likes": 727}, "replies": [{"author": "Mother Nature", "text": "There's no Nobel prize for education.", "likes": 0}, {"author": "Tech with Dipu from 0 to n", "text": "exactly", "likes": 0}, {"author": "Ali Ihsan Donmezer", "text": "wow wow wowwww slow down champion...", "likes": 1}, {"author": "Shashwat Saini", "text": "Tru dat bruh ❤️", "likes": 0}, {"author": "Miguel Angel Villafuerte", "text": "at least, be recognized by UNESCO or any other international organization", "likes": 0}]}, {"topLevelComment": {"author": "TRAP BAGZ", "text": "3 min in, I love the guy, informative and funny imo, bust out laughing more than a few times lmaooo", "likes": 1}}, {"topLevelComment": {"author": "Ahmed Ayman", "text": "Great Course, Finally finished it today, You can find an earlier comment of me. :D", "likes": 1}}, {"topLevelComment": {"author": "Anja Jurgenssen", "text": "Kudos to you, young man  🤗\n\nYou may not be a qualified educator but you have a way of getting the point across in a way that just ... well, works 🤷‍♀️\n\nPlease keep up this excellent work 🤗🤗🤗", "likes": 0}}, {"topLevelComment": {"author": "Larbi Sahli", "text": "Your one to one relationship husband wife table will break in a muslim country.", "likes": 0}}, {"topLevelComment": {"author": "Pelumi Oni", "text": "I just came across this,I can tell from the beginning that I'm not about to waste my time.", "likes": 0}}, {"topLevelComment": {"author": "Bashai Lema", "text": "Thanks! Very informative.", "likes": 0}}, {"topLevelComment": {"author": "Ganesha Nageshappa", "text": "If you like Forrest Gump you will love this course as well, it has got all the emotions and transformations, 🙂", "likes": 1}}, {"topLevelComment": {"author": "Tuấn", "text": "thanks Caleb.", "likes": 0}}, {"topLevelComment": {"author": "allezzthepunk", "text": "how is this free and not on udemy ?", "likes": 0}}, {"topLevelComment": {"author": "Rep@ CryptosRUs", "text": "you are even luckier to know what automated trading systems are... have you heard about the automated trading system yet?", "likes": 0}}, {"topLevelComment": {"author": "COLLINS NANDOKHA", "text": "It is good .", "likes": 1}}, {"topLevelComment": {"author": "Antonio Batarilović", "text": "1:51:24 depends on where you live ;)", "likes": 2}}, {"topLevelComment": {"author": "Bob Donlon", "text": "I love the video, but, one particular word is killing me.", "likes": 2}}, {"topLevelComment": {"author": "Magomed Shamaev", "text": "I can have 4, but I rather use one to one connection 🙂", "likes": 1}}, {"topLevelComment": {"author": "Ahmed Ayman", "text": "1:16:10 Null is \"nolle\" without e pronouncing, which means \"zero\" in german, but used in programming as \"nothing\", lol.", "likes": 1}, "replies": [{"author": "abdelmounim baouia", "text": "it is an english word too", "likes": 0}]}, {"topLevelComment": {"author": "Tsai Kuo-Wei", "text": "Can you add subtitles, even autogenerated is good.  Thank you. Your course is really good.", "likes": 2}}, {"topLevelComment": {"author": "Ванина Янева", "text": "Amazing video", "likes": 0}}, {"topLevelComment": {"author": "TE TOCA LOS COJONES", "text": "could you now do the same video but using a PC ? Thanks", "likes": 0}}, {"topLevelComment": {"author": "wildani wahyuni", "text": "Thank You, i'd like this Vidio Well", "likes": 0}}, {"topLevelComment": {"author": "The Coding Hotel", "text": "cant believe this is free", "likes": 1}}, {"topLevelComment": {"author": "Rob", "text": "Man this video went so long i watched this kid go through puberty!", "likes": 1}}, {"topLevelComment": {"author": "Brandon Mohammed", "text": "HELL IS REAL \n\nHEAVEN IS REAL\n\nGOD IS REAL\n\nJESUS IS THE SON OF GOD\n\nALL THOSE WHO ARE NOT SAVED WILL GO TO HELL AND HELL IS TORTURE FOR ETERNITY BURNING IN NEVER ENDING FIRE, ONCE YOU ARE IN HELL THERE IS NO WAY OUT, HOWEVER RIGHT NOW IT IS POSSIBLE TO PREVENT YOURSELF FROM GOING TO HELL AND BECOMING SAVED AND THERE IS ONLY ONE WAY OUT AND THIS WAY IS JESUS, JESUS DIED AND ROSE AGAIN AS A SACRIFICE FOR OUR SINS SO THAT WE DON'T HAVE TO GO TO HELL AND WE CAN HAVE EVERLASTING LIFE SO WE CAN SPEND ETERNITY WITH HIM IN HEAVEN WHICH IS PURE PARADISE. ALL YOU HAVE TO DO IS TO PUT YOUR FAITH IN JESUS AND TRUST THAT HE WILL SAVE YOU AND THE HOLY SPIRIT WILL MAKE HIS HOME IN YOUR HEART AND LEAD YOU ON THE RIGHT PATH. DON'T DELAY IN TRUSTING JESUS BECAUSE WE CANNOT TELL WHEN IT IS TOO LATE. JESUS IS COMING SOON PLEASE BE READY AND MAKE THE RIGHT CHOICE", "likes": 0}}, {"topLevelComment": {"author": "Mahesh Sanjay Chivate", "text": "Thank you very very much", "likes": 0}}, {"topLevelComment": {"author": "Pitbull Grind", "text": "Love what you do, I also try to explain complex ideas in beginner language on my channel, I would appreciate your support https://www.youtube.com/channel/UC6N4i972Z7F-ozmUWDakS1Q", "likes": 0}}, {"topLevelComment": {"author": "WsoStark", "text": "@seb", "likes": 0}}, {"topLevelComment": {"author": "Amit Chavan", "text": "This is called real teaching. (How to do is meaningless until you don't know why should you do). Thanks for each and every concept.", "likes": 2}}, {"topLevelComment": {"author": "Frankelly Guzman", "text": "Just got done watching it, one semester couldn't teach me all this information, I rlly wish i could meet caleb and thank him personally", "likes": 4}}, {"topLevelComment": {"author": "Md. Yamin", "text": "I have just completed the full video. It took me two days to complete and I get a lot of periods of sleep during watching the video. 😆😅 Because it needs a lot of patients to watch such kind of lengthy video. 😑 Anyway, the video was great and best. I do always love freecodecamp. ♥♥", "likes": 0}}, {"topLevelComment": {"author": "Norbert Cseh", "text": "*Querry*: Sorta like searching, giving us cool results\n\nI just love it. I don't care how many points I lose, if it comes up in the test: I'm writing *THIS*", "likes": 4}}, {"topLevelComment": {"author": "Ulhas Ahire", "text": "Thanks for this training video. Chalkboard makes it more explanatory.", "likes": 0}}, {"topLevelComment": {"author": "DevOps 117", "text": "1:24:57", "likes": 0}}, {"topLevelComment": {"author": "Mickael Richard", "text": "Caleb was single when he started the video, when he finished it he was divorced with 2 children", "likes": 1}}, {"topLevelComment": {"author": "pyk yeh", "text": "best DB tutorial ever", "likes": 1}}, {"topLevelComment": {"author": "UR982T", "text": "Love the moment where he didn’t want to use 666. 😂", "likes": 1}}, {"topLevelComment": {"author": "John Edward", "text": "Are there American guy like him too", "likes": 0}}, {"topLevelComment": {"author": "hammad amjad", "text": "i am high and am listening to him.....he is speaking the languages of God.", "likes": 0}}, {"topLevelComment": {"author": "蘇紹傑", "text": "awesome video!", "likes": 0}}, {"topLevelComment": {"author": "Anant Deshbhratar", "text": "Even are you getting what you are talking", "likes": 0}}, {"topLevelComment": {"author": "Advitiay Anand", "text": "Thanks a lot!", "likes": 0}}, {"topLevelComment": {"author": "anwar", "text": "May I know if this video is complete for the course?", "likes": 0}}, {"topLevelComment": {"author": "David Burch", "text": "1:41:10 I see what you did there.", "likes": 0}}, {"topLevelComment": {"author": "David Burch", "text": "5:42:24 conFLICting data!", "likes": 0}}, {"topLevelComment": {"author": "BARSHA BHATTACHARJEE", "text": "For more visit : https://youtu.be/q2RgFH1rPos", "likes": 0}}, {"topLevelComment": {"author": "Sebin Mathew", "text": "using board and chalk is absolutely fine...but you gotta write properly", "likes": 0}}, {"topLevelComment": {"author": "Nikolai Pavlov", "text": "What a legend! My man grew a beard and long hair while doing the video.", "likes": 0}}, {"topLevelComment": {"author": "Alex Peirson", "text": "Great course, great teacher - thanks Caleb!", "likes": 0}}, {"topLevelComment": {"author": "Saket verma", "text": "he legit look like a backend developer", "likes": 0}}, {"topLevelComment": {"author": "shrikant badge", "text": "Really appreciate your efforts. Thanks. you re changing the world.", "likes": 0}}, {"topLevelComment": {"author": "Paul Jebasingh", "text": "Watch at 2X speeeed", "likes": 0}}, {"topLevelComment": {"author": "Johnny CincoCero", "text": "It's pronounce like sextuple or octuple.", "likes": 0}}, {"topLevelComment": {"author": "malvern mabvira", "text": "why would anyone dislike this?", "likes": 8}}, {"topLevelComment": {"author": "vwesi H", "text": "aws", "likes": 0}}, {"topLevelComment": {"author": "-", "text": "This is definitely the place to start before taking a DB boot camp. \n\nI'm doing a Bootcamp class now and I probably would have been at a loss had I not watched this lecture, first. \n\nIt's long, but that's bc  it's comprehensive. He really gives a good foundation of DB theory concepts, which is immensely helpful to have set in mind BEFORE you try to put it into practice. \n\nI like how he builds on concepts and repeats them as they apply to the new concepts he's introducing. This really helps set the basic framework into your mind. \n\nThe repetition and incremental review is good.", "likes": 3}}, {"topLevelComment": {"author": "Burhanuddin Merchant", "text": "Mad respect for Caleb Curry for recording this absolutely amazing course🙌", "likes": 22}}, {"topLevelComment": {"author": "Daljeet singh", "text": "Osm great job dude 👍👍👍", "likes": 0}}, {"topLevelComment": {"author": "Dominique Cervantes", "text": "10:30 lol", "likes": 0}}, {"topLevelComment": {"author": "Zahid Qayyum", "text": "His favourite number is 6. 😁", "likes": 0}}, {"topLevelComment": {"author": "Classicracer Uk", "text": "Pysco crazy guy very funny", "likes": 0}}, {"topLevelComment": {"author": "Jaime Mint", "text": "i want to learn to be cool, would that help me to get there?", "likes": 0}}, {"topLevelComment": {"author": "Trywell Washington", "text": "8:05:00 rewatched prev 5 min", "likes": 0}}, {"topLevelComment": {"author": "Juan Jose Mamani", "text": "can you put its subtitles please?", "likes": 0}}, {"topLevelComment": {"author": "Alexander J. Nyambi", "text": "awesome lectures thanks Caleb", "likes": 1}}, {"topLevelComment": {"author": "faruk telarevic", "text": "vi niste normalni", "likes": 1}}, {"topLevelComment": {"author": "Chalew Negash", "text": "you are dertiy cad person why you are shout wrongly at time 19:30", "likes": 0}}, {"topLevelComment": {"author": "john smith", "text": "hour and 38 minutes in this is amazing, what a great instructor you are. I just may have a chance to be working with a database:) Thank you for making it very easy to understand and follow.", "likes": 2}}, {"topLevelComment": {"author": "ドイティンガークリスティアン", "text": "you should firstly mention that you only talk about SQL based databases :-|", "likes": 1}}, {"topLevelComment": {"author": "CANIHAZURDREAMSPLS", "text": "Before clicking play, I promised myself I'd take a shot anytime the words \"data\" or \"database(ing)\" were spoken. 2 mins into the video, I needed a new kidney, liver and eyeball.", "likes": 0}}, {"topLevelComment": {"author": "Renata P Henessa", "text": "my 7 weeks of learning in university become 8 hours", "likes": 1}}, {"topLevelComment": {"author": "Ciekawski Łukasz", "text": "thx", "likes": 0}}, {"topLevelComment": {"author": "maher yasir", "text": "introduction to keys are not explained very well", "likes": 0}}, {"topLevelComment": {"author": "martin p", "text": "Appreciate you putting this together. In the future, please consider editing things like erasing the board out of the video to make course a bit shorter.", "likes": 1}}, {"topLevelComment": {"author": "Jaguar⚔️DFIR", "text": "Please excuse my meaningless bantering but I have to vocalize an observation. \n\n\n...\"scheh-mah?\" \"Uh-tribute?\" Whaaaat? 😭\nI'm not asking you to change it or conform to my pronunciation just had to but it out there. lol Great video Celeb. 👍", "likes": 0}}, {"topLevelComment": {"author": "Foji Rngers", "text": "Love your tutorials bro.", "likes": 0}}, {"topLevelComment": {"author": "Tafara", "text": "One husband can only have one wife ? this guy has clearly never been to Africa :):):)", "likes": 0}}, {"topLevelComment": {"author": "Joey Baruch", "text": "@Caleb, great video, thanks for doing this!!\nAt this point in time (1:05:47), you're adding IDs to your user table, and somehow reached the conclusion that the two rows now relate to different entities, while a SSN would have promised that (because the Govt makes sure SSNs are unique) this arbitrarily assigned userID should not. I think this is called a surrogate key, and it's a somewhat artificial way to create uniqueness, but you still don't know if you have entity duplication or not...", "likes": 0}}, {"topLevelComment": {"author": "Wilson Wil", "text": "I accidentally bumped into this video, it is great , Caleb makes me laugh while I am learning a lot. Well done Caleb and thanks a lot for sharing knowledge!", "likes": 3}}, {"topLevelComment": {"author": "fun with python", "text": "Great tutorial ever seen dude you are awesome and examples Are 😏👌👌👌🤘", "likes": 0}}, {"topLevelComment": {"author": "Chihung Hsieh", "text": "I  see this guy with shining eyes. It seems.... penetrate my soul.", "likes": 0}}, {"topLevelComment": {"author": "TapuTapuu", "text": "2:14:47 I have a question about one to one relationship. Why do we need to specify \"card id\" in the \"user\" table when we also put \"user id\" into card table? Isn't \"card id\" in the \"user\" table kind of redundant information if we could simply access information about the card by specifying to which user that card belongs with \"user id\" in the second table and updating that table accordingly, if that makes sense? I.e Why the backwards reference from \"card\" table to \"user\" table is important?", "likes": 0}}, {"topLevelComment": {"author": "Julian M. Kleber", "text": "1:46:00 - I feel you :)", "likes": 0}}, {"topLevelComment": {"author": "Quantum Dream", "text": "One of the best videos for revision. Thanks, Caleb!!!!!", "likes": 0}}, {"topLevelComment": {"author": "dante dt", "text": "11:22 “Advertising...”😂", "likes": 1}}, {"topLevelComment": {"author": "Ichirou Takashima", "text": "The fact that he is left handed makes me proud being a left handed person. And maybe because I'm a millenial (or old), I really did like the chalkboard setup. I was more engrossed than the slideshows and videos setup with no instructor present.", "likes": 0}}, {"topLevelComment": {"author": "Axea", "text": "1:57:00 - aggression against women", "likes": 0}}, {"topLevelComment": {"author": "Doctor broker", "text": "Respect !!", "likes": 0}}, {"topLevelComment": {"author": "Zukaaa", "text": "*_I swear I love this guy_*", "likes": 0}}, {"topLevelComment": {"author": "Tim Connor", "text": "for such a young man he is not a bad teacher", "likes": 0}}, {"topLevelComment": {"author": "Abdi Dek Muhumed", "text": "most usefull thanks", "likes": 0}}, {"topLevelComment": {"author": "Esmeralda Hoxha", "text": "Excellent !!!", "likes": 0}}, {"topLevelComment": {"author": "Karen Hall", "text": "Thank you for simplifying the topic", "likes": 0}}, {"topLevelComment": {"author": "woles ae", "text": "Thanks you so much,  amazing!", "likes": 1}}, {"topLevelComment": {"author": "C H", "text": "Love the \"By His stripes we are healed t-shirt'. God bless you bro. Thanks for the amazing lessons, from Ireland.", "likes": 1}}, {"topLevelComment": {"author": "candle-like Ghost", "text": "1:46:03", "likes": 0}}, {"topLevelComment": {"author": "candle-like Ghost", "text": "Legends says people watch til the end are now gods in database field", "likes": 5}}, {"topLevelComment": {"author": "National Clinical Laboratory", "text": "ur presentation is best but too large video presentation more than 2:oo hours.", "likes": 0}}, {"topLevelComment": {"author": "Elisa .V", "text": "He's the best teacher of the channel", "likes": 0}}, {"topLevelComment": {"author": "Sandeep Patil", "text": "Great effort Caleb!!  Thanks for sharing the video. Explaining a concept is always a tough job. You did it brilliantly.", "likes": 1}}, {"topLevelComment": {"author": "Bintang Giri", "text": "is he, by any chance, spiderman?", "likes": 0}}, {"topLevelComment": {"author": "riteofmind1", "text": "Wow Man!", "likes": 0}}, {"topLevelComment": {"author": "Sanjana Ghosh", "text": "Does this cover topics like transaction and trigger?", "likes": 0}}, {"topLevelComment": {"author": "Duminda Kuruppu", "text": "Thanks man ❤\nOld school teaching with a chalk and super clear explanations.\nAnd a super awesome teacher", "likes": 6}}, {"topLevelComment": {"author": "quantum quant", "text": "I love this guy, fantastic explanation for someone trying to learn this stuff in order to understand how to get started implementing db design.", "likes": 3}}, {"topLevelComment": {"author": "yunus kocatas", "text": "please  seperate this video. sooo long", "likes": 0}}, {"topLevelComment": {"author": "Färid Gülüm", "text": "Which dishonest 452 people disliked the video?", "likes": 1}}, {"topLevelComment": {"author": "Sebastian Calderon", "text": "BTW awesome video! Jam Packed with information! Watched the whole thing!", "likes": 0}}, {"topLevelComment": {"author": "Amar kumar", "text": "I am from  commerce background..\nI don't know what m doing here..😂😂😂", "likes": 1}}, {"topLevelComment": {"author": "Cult Interviews", "text": "At 1:13:44 you can see a shark in the black bored.", "likes": 0}}, {"topLevelComment": {"author": "Jaswinder Singh", "text": "All those dislikes are people from Australia!", "likes": 1}}, {"topLevelComment": {"author": "Sebastian Calderon", "text": "was claire an ex?", "likes": 0}}, {"topLevelComment": {"author": "Ange Kouakou", "text": "Man, you're so good... and sooo funny ! 😄\nI loved that t-shirt Isaiah 53: 5 👍", "likes": 0}}, {"topLevelComment": {"author": "Roberto Perdomo", "text": "Are you the kid from \"The Sixth Sense\" movie??", "likes": 0}}, {"topLevelComment": {"author": "Roberto Perdomo", "text": "I love the sound effects while erasing the blackboard.  Please keep'em coming.", "likes": 0}}, {"topLevelComment": {"author": "Tedd", "text": "If you get rid of the emoji and parentheses for the timestamps in the description, Youtube should be able to recognise them and add chapters to the progress bar. Something very useful for such a long video.", "likes": 0}}, {"topLevelComment": {"author": "Paul-Sebastian Manole", "text": "Marriage examples are funny but really makes me raise an eyebrow...", "likes": 0}}, {"topLevelComment": {"author": "Laurie Cawthorn", "text": "leftie,,,writes with his left hand..", "likes": 0}}, {"topLevelComment": {"author": "John Crosby", "text": "No ones name is name! [crying emoji]", "likes": 0}}, {"topLevelComment": {"author": "Ryan Roga", "text": "Jesus.... 13:00 it's /əˈtriˌbyo͞ot/when it's a verb and /ˈatrəˌbyo͞ot/ when it's a noun, FFS. It's 2018 and you're teaching a course about computers & technology... on a fucking blackboard. freeCodeCamp, please take this down.", "likes": 0}}, {"topLevelComment": {"author": "Tesla Testingwala", "text": "Hai Caleb..I like your attitude. confidence and style. Cheers from India.", "likes": 0}}, {"topLevelComment": {"author": "Mohammad", "text": "u r a great but funny instructor. Thanks for the video.", "likes": 0}}, {"topLevelComment": {"author": "퓨드", "text": "This is a great video. Thank you so much", "likes": 0}}, {"topLevelComment": {"author": "Shreyas Chikhalikar", "text": "3:23:47", "likes": 0}}, {"topLevelComment": {"author": "Education Information", "text": "Nice", "likes": 0}}, {"topLevelComment": {"author": "Eduard Streltsov", "text": "wow, awesome topic", "likes": 0}}, {"topLevelComment": {"author": "hossein salehi", "text": "please add a english subtitle", "likes": 0}}, {"topLevelComment": {"author": "piyush palsania", "text": "thank you sir ...would watch your video later", "likes": 0}}, {"topLevelComment": {"author": "- 60-Lê Tâm Vy", "text": "47:30 Database design", "likes": 0}}, {"topLevelComment": {"author": "SHASHANK SHARMA", "text": "Good work 🤩", "likes": 0}}, {"topLevelComment": {"author": "AmRAICT Bahirdar", "text": "the way you present is very interesting!!!!!", "likes": 0}}, {"topLevelComment": {"author": "Shreyas Ganvkar", "text": "It would make understanding the video better if there were captions .", "likes": 0}}, {"topLevelComment": {"author": "R M", "text": "You should add some information about reporting, object-relational database, nosql database design and security with objet mapping, quality assurance with databases, clustering and load-balancing, critical system.", "likes": 0}}, {"topLevelComment": {"author": "Matthew", "text": "When your writing while listening and suddenly: 1:46:05", "likes": 0}}, {"topLevelComment": {"author": "James Clark", "text": "Im going to just say this before I exploded, GOD BLESS FREECODECAMP!!! You're helping me pass uni!", "likes": 1}}, {"topLevelComment": {"author": "Kiran Kumar", "text": "wow this is cool.kudos to your first video pal...great...", "likes": 0}}, {"topLevelComment": {"author": "Gagan", "text": "7", "likes": 0}}, {"topLevelComment": {"author": "Trevor M", "text": "8 hours? LOL", "likes": 0}}, {"topLevelComment": {"author": "Carlos Pérez Araujo", "text": "TBH I have a crush on this guy", "likes": 0}}, {"topLevelComment": {"author": "Francesca", "text": "Great video!!! Thank you Caleb :-)", "likes": 0}}, {"topLevelComment": {"author": "rushan sandamal", "text": "Thanks 🙏", "likes": 0}}, {"topLevelComment": {"author": "Star Lite", "text": "2:00:00 we having a  Big F**** Orgy right here.", "likes": 0}}, {"topLevelComment": {"author": "tharaka rockz", "text": "Your examples are somewhat boring but appreciate the service of you thankz", "likes": 0}}, {"topLevelComment": {"author": "Bhav Sagar", "text": "Thanx for this course buddy!!\nJust completed it through a week!", "likes": 0}}, {"topLevelComment": {"author": "Kyle Matthew", "text": "It'll take me a month to watch through and apply all this", "likes": 0}}, {"topLevelComment": {"author": "Anmol Dewan", "text": "Just keeping track\n\nDay1: (0:47:16)", "likes": 0}}, {"topLevelComment": {"author": "Matt Bunch", "text": "attribute.. wth", "likes": 0}}, {"topLevelComment": {"author": "wangzi G", "text": "Thanks man, please, start explaining using mysql+php let's say building an online e-commerce system \"not wp or premade stuff\" which can show and control stock, item quantity, add to cart which affects the quantity in the stock, and some internal tables that do calculations. for no voice ppl. thanks again very good demo.", "likes": 0}}, {"topLevelComment": {"author": "Roger Nevez", "text": "1:51:15 *[husband - wife] This is a one to one relationship.*\nMarriage sucks !!!!", "likes": 2}}, {"topLevelComment": {"author": "Paranshu Makwana", "text": "Is it only me? The sound of him writing on the board is really annoying!", "likes": 1}}, {"topLevelComment": {"author": "Stefano Grillo", "text": "this video went from 16yold to 52 yold lol", "likes": 0}}, {"topLevelComment": {"author": "NeutrinoParticle", "text": "Caleb has designed a database of time machine", "likes": 0}}, {"topLevelComment": {"author": "MrEkaito", "text": "Thanks for the great effort of sharing!", "likes": 0}}, {"topLevelComment": {"author": "EvilTim1911", "text": "Not only did this guy do an 8 hour tutorial on databases but he did it all using his left hand to write. Truly impressive.", "likes": 15}, "replies": [{"author": "Shang_chi", "text": "@Jeff Jacques are you being sarcastic 🙄 cuz I am not able to figure out what you are trying to say", "likes": 0}, {"author": "Jeff Jacques", "text": "What's more impressive is that he wrote everything backwards with his right hand, then flipped the video horizontally just to mess with us!", "likes": 4}]}, {"topLevelComment": {"author": "Obida Hasdia", "text": "he began as a kid ended as a man with beard", "likes": 0}}, {"topLevelComment": {"author": "Obida Hasdia", "text": "he grow a beard after this video", "likes": 0}}, {"topLevelComment": {"author": "Supratim Paul", "text": "He didn't know if we were gonna watch the second video, so ended up compiling the whole into one video. Jokes apart, thanks mate.", "likes": 0}}, {"topLevelComment": {"author": "Pax Vostrum", "text": "you have no Indian accent, i'm not sure if i can trust you on that subject", "likes": 9}, "replies": [{"author": "Monke", "text": "If he was bad at his subject he couldn't be here", "likes": 0}]}, {"topLevelComment": {"author": "Exogen Design", "text": "Didn't read anything about Database Schema and never thought it has (Conceptual, logical and Physical) I am just glad what I was doing was right. I Feel so good that I am on the right track despite not knowing the terms and The theory behind it.", "likes": 0}}, {"topLevelComment": {"author": "Ruslan Kardashev", "text": "The most interesting bit 3:04:07", "likes": 0}}, {"topLevelComment": {"author": "Softweb Design", "text": "Nice but its hart to understand man...", "likes": 0}}, {"topLevelComment": {"author": "Celtic Progeny", "text": "The ceiling.", "likes": 0}}, {"topLevelComment": {"author": "Shane CherryMadeCustoms", "text": "Thank you for the wonderful information. i like your personality. you seem like someone id get along with.", "likes": 0}}, {"topLevelComment": {"author": "Djey Kanjaria", "text": "This dude deserves millions of views. Great work, really appreciate his work", "likes": 7}}, {"topLevelComment": {"author": "Francis2k4", "text": "Freecodecamp deserves each of our donations.", "likes": 1}}, {"topLevelComment": {"author": "Pradhumn Kanase", "text": "this contains so much. Thank you  for your efforts", "likes": 0}}, {"topLevelComment": {"author": "eric pham", "text": "with the new data sience we may reduce the need of large database programing", "likes": 0}}, {"topLevelComment": {"author": "Raushan Aryan", "text": "Sir if possible plz share with one project then we can understand complexity.if u mek it with oltp, olap nd nd cube with finding report from Data warehouse , oltp database , olap nd cube", "likes": 0}}, {"topLevelComment": {"author": "Raushan Aryan", "text": "Hi sir, wud u like to make complex database in SQL server with using comlex store procedures has been used nd that store procedures used or implemented with more table, function, joined, view, temp table then we can expert", "likes": 0}}, {"topLevelComment": {"author": "D0c N0tes", "text": "This is the best introduction on database design theory, I've seen. I wish this was out in the 90's. It would have made learning this stuff more pleasant. Kudos to you!\n\nBy the way, you can have a sale without a user, its' called shoplifting lol", "likes": 38}}, {"topLevelComment": {"author": "morteza karimi", "text": "please turn on the auto translate please.", "likes": 0}}, {"topLevelComment": {"author": "Akib Hasan Pavel", "text": "Your video and you is awesome :)", "likes": 0}}, {"topLevelComment": {"author": "Julian Eggle", "text": "Awesome video ! \nBut PLEASE, improve your rectangles :P", "likes": 0}}, {"topLevelComment": {"author": "Nick Jacob", "text": "I like this video but you're destroying the terminology by pronouncing everything wrong. lol", "likes": 0}}, {"topLevelComment": {"author": "Antonio Pisano", "text": "The young Bill Gates", "likes": 0}}, {"topLevelComment": {"author": "Awekening Bro", "text": "oh boi time to not sleep~~~~~~~", "likes": 0}}, {"topLevelComment": {"author": "akshive pandey", "text": "phone no. 1800youwish 😂", "likes": 0}}, {"topLevelComment": {"author": "Khairul Anwar", "text": "Thank you so much sensei ✊", "likes": 0}}, {"topLevelComment": {"author": "Eunice Lacaste", "text": "This Kyle explains concepts really well.", "likes": 0}}, {"topLevelComment": {"author": "khonza izzati", "text": "Thank u so much 🥺", "likes": 0}}, {"topLevelComment": {"author": "Declan Kearns", "text": "2:54:42 Wy wife just asked me if I was watching porn!", "likes": 0}}, {"topLevelComment": {"author": "Movie Man Hollywood", "text": "This is awesome!!", "likes": 1}}, {"topLevelComment": {"author": "Julius Newman", "text": "I pay $40k per year in tuition and this kid is better than my professor.", "likes": 0}}, {"topLevelComment": {"author": "Engineering Quest", "text": "Next time can you use a whiteboard with a marker so that the chalk doesn't squeak. I skipped a lot of high school classes because of not wanting to see teachers write on chalkboard", "likes": 1}}, {"topLevelComment": {"author": "An0ny M0us30", "text": "1:28:47 - An hour and a half into the video and we just learned what SQL stands for haha. All jokes aside though, great series, learnt a lot.", "likes": 2}}, {"topLevelComment": {"author": "J. Wong", "text": "I am just wondering why this guy is so favourite of John and 7.", "likes": 1}}, {"topLevelComment": {"author": "Lena Ara", "text": "Your explanations are so clear and easy to understand! Please make more videos like these, These are so helpful . Thank you", "likes": 1}, "replies": [{"author": "Cult Interviews", "text": "Yup", "likes": 0}]}, {"topLevelComment": {"author": "Mohammad Abid Rasuly", "text": "Null doesnt mean empty it means Unkown data which is meaningless......", "likes": 1}}, {"topLevelComment": {"author": "Mohammad Abid Rasuly", "text": "SQL is a Relational Database Language not a Programming language...", "likes": 1}}, {"topLevelComment": {"author": "Psy-bo Paradox", "text": "I instantly recognized him... Good seeing you mate!", "likes": 0}}, {"topLevelComment": {"author": "Deeba Hoshmand", "text": "I am at 10:15 and I think it is really nice so far, I am going to go through all of this !!!😃", "likes": 0}, "replies": [{"author": "Press Start", "text": "Did you make it?", "likes": 0}]}, {"topLevelComment": {"author": "armada619", "text": "i liked the bdsm part", "likes": 1}}, {"topLevelComment": {"author": "A H", "text": "how old u r?", "likes": 1}}, {"topLevelComment": {"author": "GaLaXie GaLaXie", "text": "I like your energy thank you,the video is wonderful,i learned a lot :)", "likes": 0}}, {"topLevelComment": {"author": "T D P", "text": "I value this young man's time and talent in teaching me a grown person old enough to be his parent\nThank you for teaching me", "likes": 9}}, {"topLevelComment": {"author": "1YangYing", "text": "Damn it, I was looking for a relationship advice.", "likes": 13}, "replies": [{"author": "Piyush Keshari", "text": "😂😂", "likes": 0}]}, {"topLevelComment": {"author": "Haroon Muhammad", "text": "I must say this work is excellent for one who wants to have an idea of what database design is.", "likes": 0}}, {"topLevelComment": {"author": "Ben Bennur", "text": "Everything on my database course at university here for free. Damn. Should've studied at home", "likes": 0}}, {"topLevelComment": {"author": "Syarifah Mardhiah", "text": "Lol why I think Caleb always make subtle joke.... 1:41:10", "likes": 0}}, {"topLevelComment": {"author": "Ali sabir Uppal", "text": "19:40", "likes": 1}}, {"topLevelComment": {"author": "selenium shyamala", "text": "Nice", "likes": 1}}, {"topLevelComment": {"author": "Vitaly Bessonov", "text": "А можно тоже самое только по русски? А то ничего не понимаю. Но вижу что чел старается, картинки рисует, видимо пытается объяснить все дотошно и на \"пальцах\".", "likes": 0}}, {"topLevelComment": {"author": "Absurd 72", "text": "this dude's look is savage.", "likes": 0}}, {"topLevelComment": {"author": "bernard ndassang", "text": "great job !", "likes": 0}}, {"topLevelComment": {"author": "The Average Teens | ATs 👾", "text": "AIIIII Caleb is here!!!", "likes": 1}}, {"topLevelComment": {"author": "J. tavarez", "text": "This dude looks like he knows his stuff not bad at all.", "likes": 1}}, {"topLevelComment": {"author": "Ronald Minj", "text": "Sir\nAfter doing this course of data base design course,  may I get a job.", "likes": 0}}, {"topLevelComment": {"author": "Dornpunzel", "text": "Caleb is so NOT funny when he tries to be. Awkward to watch.", "likes": 1}}, {"topLevelComment": {"author": "Edgard Palacino", "text": "hey boy! Amazing! How old are you? Congratulations.", "likes": 1}}, {"topLevelComment": {"author": "Siciid Boos", "text": "professional left-hand writer :)", "likes": 0}}, {"topLevelComment": {"author": "Yolo King", "text": "Who can help me out making a program wit each other", "likes": 0}}, {"topLevelComment": {"author": "HIM BORY", "text": "wanna be friend?", "likes": 1}}, {"topLevelComment": {"author": "Elaine Harvey", "text": "05202020 Review", "likes": 1}}, {"topLevelComment": {"author": "Seif OA", "text": "young man, you are amazing", "likes": 1}}, {"topLevelComment": {"author": "Jump on Yaya", "text": "love how enthusiastic he is about databases haha", "likes": 1}}, {"topLevelComment": {"author": "Ákos Nyisztor", "text": "Great job! Thank you.", "likes": 0}}, {"topLevelComment": {"author": "Joseph Peterson", "text": "A tribute.", "likes": 1}}, {"topLevelComment": {"author": "B. SAINATH REDDY", "text": "Dog was barking at 1:14:20", "likes": 1}}, {"topLevelComment": {"author": "caio ferreira", "text": "this guy begin the video with 18 year old and finished with 45 lol", "likes": 0}}, {"topLevelComment": {"author": "Pranav", "text": "A kid with a beard is what the first thought popped in my mind.", "likes": 1}}, {"topLevelComment": {"author": "Sahil Taneja", "text": "I have MS MTA exam in a couple of days, finally got good tutorial worth watching.  I can clear my DBMS/RDBMS basic.", "likes": 1}}, {"topLevelComment": {"author": "beboystyle", "text": "Is this the Doogie Howser of Database?", "likes": 1}}, {"topLevelComment": {"author": "mahmoh", "text": "Great  8 hours, thanks", "likes": 1}}, {"topLevelComment": {"author": "Rizaldy Wirawan", "text": "Because English is not my native language, it's hard for me to learn. \n\nI hope we can hand in hand create the subtitle ...", "likes": 0}}, {"topLevelComment": {"author": "Agus Bekti", "text": "Flask-SQLAlchemy bring me here", "likes": 0}}, {"topLevelComment": {"author": "Steven Swain", "text": "You're the man!!! Great video", "likes": 0}}, {"topLevelComment": {"author": "Miłosz", "text": "Hey, I haven't watch this video yet, but I'm definetly going to do it. I'm learning Python Flask Framework and I wanted to create a simple quiz app as a practice and a project, but I wasn't sure how to create my database model, I hope that this tutorial will give me basic knowledge to do it", "likes": 2}, "replies": [{"author": "Cult Interviews", "text": "Did you found this useful to make ur data base?", "likes": 0}]}, {"topLevelComment": {"author": "Elyag", "text": "THANK YOU.", "likes": 0}}, {"topLevelComment": {"author": "Ivy Zheng", "text": "Thank you! It’s very helpful.", "likes": 0}}, {"topLevelComment": {"author": "Dhanoosh Bargav", "text": "PLease change tour handwriting CAleb", "likes": 1}}, {"topLevelComment": {"author": "Ibrahim Ahmad", "text": "Is this one of the main responsibility for full-stack developer / back-end developer to understand about creating database structure?", "likes": 0}}, {"topLevelComment": {"author": "ATOWAPaul", "text": "Thanks for all the good work, I enjoyed watching it and just maybe I finally got it. BTW I'm 75, so lots of time to wet my appetite in databases. One day, when I'm big and strong, I may develop a cool application, yeah!", "likes": 1}}, {"topLevelComment": {"author": "Kevin Perkins", "text": "Suggestion: get on a laptop and show your work instead of chicken scratch on a board....!", "likes": 1}}, {"topLevelComment": {"author": "Dored Haju", "text": "how could you uploaded this big size video here???", "likes": 1}}, {"topLevelComment": {"author": "Lunar Module", "text": "That a very generous video. Wow. 8h.", "likes": 0}}, {"topLevelComment": {"author": "Moaaz Akram", "text": "thank you so muuuuuuuuuuuch i loved it still watching it lol but i like it alot so far <3", "likes": 0}}, {"topLevelComment": {"author": "Mohamed Montaser", "text": "8 hours of writing on white board and not using actual examples or real written sql .. wow", "likes": 1}}, {"topLevelComment": {"author": "Robin ve", "text": "Very clear!! Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Biplab Roy", "text": "He actually grow up at the of this video", "likes": 2}}, {"topLevelComment": {"author": "Swapnil Harpale", "text": "Started watching this video, coz I am building an mobile app and for that I need to design backend, but I am bit confused to how to break my database in small table and how to relate those tables effectively without hampering the performance. \n\nI hope this video answers all my question. \n\n8 hours bring it on", "likes": 1}, "replies": [{"author": "Cult Interviews", "text": "So how do you felt about this video", "likes": 1}]}, {"topLevelComment": {"author": "Tatsu Nguyen", "text": "2:30:42", "likes": 0}}, {"topLevelComment": {"author": "A little meow", "text": "It is a really cool video. Excellent graphical illustrations of complex ideas and abstract jargons. Thank you very much.", "likes": 0}}, {"topLevelComment": {"author": "safa sady", "text": "Caleb, this is the best tutorial I have ever watched anywhere!!!! I am new to this and your explanation and goofy sense of humor is just perfect!! Thank you so much for your efforts and good work!!", "likes": 5}}, {"topLevelComment": {"author": "NEWSNET MIRROR", "text": "Super course, suport my video", "likes": 0}}, {"topLevelComment": {"author": "Ammar Sohail", "text": "I don't have an \"auto generated English caption\" option here. Would someone help me!", "likes": 0}, "replies": [{"author": "Ammar Sohail", "text": "I face difficulty with the accent sometimes..", "likes": 0}]}, {"topLevelComment": {"author": "Obaid ur Rehman", "text": "I enjoyed watching 8 hours without getting bored, and even reversing. This guy has teaching skills, naturally. Loved the lecture as well as the teaching style!", "likes": 225}, "replies": [{"author": "Jeremiah", "text": "So what do you do now?", "likes": 0}, {"author": "Krishna Patel", "text": "@Obaid ur Rehman 😀", "likes": 0}, {"author": "Oluwaferanmi Kolawole", "text": "@Karak 10 I don’t think he did 💀", "likes": 0}, {"author": "Karak 10", "text": "You watched the whole thing in one sitting? I tried watching 1 hour per day.", "likes": 3}, {"author": "Obaid ur Rehman", "text": "@Harsh Vardhan corrected. Thanks!", "likes": 2}]}, {"topLevelComment": {"author": "Rajeshwar. Uma", "text": "Hi your video is very good and help me could you help me better book for SQL and python for advance database please help me", "likes": 1}}, {"topLevelComment": {"author": "coolag74", "text": "Fantabulous...", "likes": 0}}, {"topLevelComment": {"author": "coco", "text": "Thank you so much. very helpful.", "likes": 1}}, {"topLevelComment": {"author": "dapkman", "text": "Great video! Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Vikramaditya Mathur", "text": "Thank you !", "likes": 0}}, {"topLevelComment": {"author": "Brian McGovern", "text": "More costume changes than Jennifer Lopez and Shakira at the superbowl", "likes": 0}}, {"topLevelComment": {"author": "Joel", "text": "Next time you might want to learn the proper way to pronounce attribute.", "likes": 1}}, {"topLevelComment": {"author": "Triple A", "text": "Thank You bro", "likes": 2}}, {"topLevelComment": {"author": "Ivan", "text": "2:39:11 StudentClasses is such a natural name here", "likes": 1}, "replies": [{"author": "National Clinical Laboratory", "text": "What u say to write this comment?", "likes": 0}]}, {"topLevelComment": {"author": "E Y L O L", "text": "✅ DONE!!", "likes": 1}}, {"topLevelComment": {"author": "G3CloudSolution", "text": "I just stumbled on this and was hoping to just watch the first 5 mins then close but ended up watching everything. Great video and so helpful! Well done Caleb and thank you very much.", "likes": 2}}, {"topLevelComment": {"author": "LEVISON PHIRI", "text": "Very useful course", "likes": 1}}, {"topLevelComment": {"author": "sids 24x7", "text": "god bless you sir,  thanks for sharing your knowledge", "likes": 0}}, {"topLevelComment": {"author": "MAHENDRAN SOMU", "text": "VERY EXCELLENT", "likes": 1}}, {"topLevelComment": {"author": "Wisjnu Judho", "text": "speed it up to 1.5. \nI can feel the knowledge \nare flowing inside my brain", "likes": 11}}, {"topLevelComment": {"author": "Subarna Yeasmin Sheemu", "text": "thamk you", "likes": 1}}, {"topLevelComment": {"author": "Subarna Yeasmin Sheemu", "text": "thank you", "likes": 1}}, {"topLevelComment": {"author": "Kuda Media", "text": "ata", "likes": 0}}, {"topLevelComment": {"author": "Finbah", "text": "I love that this teenage boy is writing on a 1970's chalk board. Reminds me of grade school.", "likes": 13}, "replies": [{"author": "Andrew Bartonwood", "text": "He's not a day over 12, surely", "likes": 0}]}, {"topLevelComment": {"author": "Nikola Tesla", "text": "I love learning from younger minds!!!!", "likes": 0}}, {"topLevelComment": {"author": "Angel", "text": "Great review of relational databases!\nThough, if it's your first time learning relational databases and you don't know SQL syntax, know that this video doesn't cover SQL syntax, so you'll need to learn a bit more pausing the video from time to time looking up syntax examples.  Thankfully SQL syntax is quite minimal and is easy to look up using the terms in this video.\nedit: He does cover some syntax when getting into joins at the end.", "likes": 1}, "replies": [{"author": "didar alam", "text": "0", "likes": 0}]}, {"topLevelComment": {"author": "james nagib", "text": "send smart >to me I`m Mohamed nagib Zakaria >and> do kill bed men`s and bed boy`s in ways ok bye > I`m will see you soon or later ok bye", "likes": 0}}, {"topLevelComment": {"author": "james nagib", "text": "do kill bed men`s and bed boy`s in ways ok bye > I`m will see you soon or later ok bye", "likes": 2}}, {"topLevelComment": {"author": "Ahmad Khaliel", "text": "00:05:00", "likes": 0}}, {"topLevelComment": {"author": "Krishna kirshna", "text": "Left handers are good at designing🤗", "likes": 1}, "replies": [{"author": "Prince", "text": "Idhu ennaya vellaiya irukkravan poi solla maatanmaari irukku😂😂😂", "likes": 0}]}, {"topLevelComment": {"author": "Seymour Tompkins", "text": "the word is not pronounced a-TTRIB=ute (unless you're using it as a verb), it's pronounced A-ttrib-ute (long a sound when used as a noun)...minor point, though", "likes": 1}}, {"topLevelComment": {"author": "cristina Dan", "text": "Thanks for this video, great job!! bdw you are super funny :))", "likes": 2}}, {"topLevelComment": {"author": "Dayson Tai", "text": "(0:00:00) Introduction\n⌨️ (0:03:12) What is a Database?\n⌨️ (0:11:04) What is a Relational Database?\n⌨️ (0:23:42) RDBMS\n⌨️ (0:37:32) Introduction to SQL\n⌨️ (0:44:01) Naming Conventions\n⌨️ (0:47:16) What is Database Design?\n⌨️ (1:00:26) Data Integrity\n⌨️ (1:13:28) Database Terms\n⌨️ (1:28:28) More Database Terms\n⌨️ (1:38:46) Atomic Values\n⌨️ (1:44:25) Relationships\n⌨️ (1:50:35) One-to-One Relationships\n⌨️ (1:53:45) One-to-Many Relationships\n⌨️ (1:57:50) Many-to-Many Relationships\n⌨️ (2:02:24) Designing One-to-One Relationships\n⌨️ (2:13:40) Designing One-to-Many Relationships\n⌨️ (2:23:50) Parent Tables and Child Tables\n⌨️ (2:30:42) Designing Many-to-Many Relationships\n⌨️ (2:46:23) Summary of Relationships\n⌨️ (2:54:42) Introduction to Keys\n⌨️ (3:07:24) Primary Key Index\n⌨️ (3:13:42) Look up Table\n⌨️ (3:30:19) Superkey and Candidate Key\n⌨️ (3:48:59) Primary Key and Alternate Key\n⌨️ (3:56:34) Surrogate Key and Natural Key\n⌨️ (4:03:43) Should I use Surrogate Keys or Natural Keys?\n⌨️ (4:13:07) Foreign Key\n⌨️ (4:25:15) NOT NULL Foreign Key\n⌨️ (4:38:17) Foreign Key Constraints\n⌨️ (4:49:50) Simple Key, Composite Key, Compound Key\n⌨️ (5:01:54) Review and Key Points....HA GET IT? KEY points!\n⌨️ (5:10:28) Introduction to Entity Relationship Modeling\n⌨️ (5:17:34) Cardinality\n⌨️ (5:24:41) Modality\n⌨️ (5:35:14) Introduction to Database Normalization\n⌨️ (5:39:48) 1NF (First Normal Form of Database Normalization)\n⌨️ (5:46:34) 2NF (Second Normal Form of Database Normalization)\n⌨️ (5:55:00) 3NF (Third Normal Form of Database Normalization)\n⌨️ (6:01:12) Indexes (Clustered, Nonclustered, Composite Index)\n⌨️ (6:14:36) Data Types\n⌨️ (6:25:55) Introduction to Joins\n⌨️ (6:39:23) Inner Join\n⌨️ (6:54:48) Inner Join on 3 Tables\n⌨️ (7:07:41) Inner Join on 3 Tables (Example)\n⌨️ (7:23:53) Introduction to Outer Joins\n⌨️ (7:29:46) Right Outer Join\n⌨️ (7:35:33) JOIN with NOT NULL Columns\n⌨️ (7:42:40) Outer Join Across 3 Tables\n⌨️ (7:48:24) Alias\n⌨️ (7:52:13) Self Join", "likes": 470}, "replies": [{"author": "kanishka malpana", "text": "Thank you!", "likes": 0}, {"author": "Matthew E", "text": "You absolute ledge!", "likes": 0}, {"author": "Memyselfandthem", "text": "Thank you soooo much!", "likes": 0}, {"author": "NhN Channel", "text": "Sorry! Can you insert sub-English into Video?", "likes": 0}, {"author": "Bica Valgy Alves de Sousa", "text": "This deserves to be on the video description", "likes": 0}]}, {"topLevelComment": {"author": "Rex Myom Ortserga", "text": "@cale curry re u on twitter", "likes": 0}}, {"topLevelComment": {"author": "Rex Myom Ortserga", "text": "are you twitter?", "likes": 0}}, {"topLevelComment": {"author": "Salabh S.G", "text": "Can i apply these principles with access.", "likes": 0}, "replies": [{"author": "Angel", "text": "People still use MS Access?  I believe Access is a relational db, and these concepts apply to relational dbs, so the concepts should overlap.", "likes": 0}]}, {"topLevelComment": {"author": "Par Ish", "text": "Well I am glad that I found a person who's hand writing is equally as adventurous as mine. ;)\nThanks a lot for this course mate!", "likes": 37}, "replies": [{"author": "js I have a lot of playlists", "text": "adventurous is pretty funny", "likes": 2}]}, {"topLevelComment": {"author": "Allison Bramhall", "text": "I came here from Caleb's blog, and was so surprised to see how young he was and also how great his content was! I needed an overview of database logic as a refresher, and this was solid. Really appreciated the examples, the quick-jump links in the description, and his clear language when explaining concepts. He also sprinkles in some genuine funny moments which had me laughing at my desk. I second Christopher Harwell - listen to it at 1.5x speed for sure and slow down to review new concepts.", "likes": 2}}, {"topLevelComment": {"author": "William James Rapp", "text": "WOW !!!!! This is the FIRST video I have seen over the last 10 years ( in my search for learning HTML CSS JS SQL PHP ...)  Where someone is actually  TEACHING information instead of just glossing over information and saying JUST DO WHAT I DO.    \n\nI greatly appreciate actually LEARNING something that is being TAUGHT      THANK YOU YOUNG MAN  THANK YOU.", "likes": 21}}, {"topLevelComment": {"author": "E Y L O L", "text": "Luv ya 💙", "likes": 0}}, {"topLevelComment": {"author": "master code", "text": "i just finished your c++ course and man you were so skin lol", "likes": 2}}, {"topLevelComment": {"author": "William James Rapp", "text": "** QUESTION   I am wanting to build a DATABASE driven Website.  On my web site DATA IS MY COMMERCE .  I will have several data sets.  In  One DB set ( not sure if thats proper terminology ) a CUSTOMER enters data for a FEE ( $5 )  the data form is filled out the Customer presses NEXT button which takes customer to Payment Page.  \nCustomer fills out payment form and presses SUBMIT  after  payment is ACCEPTED or APPROVED  only THEN will data be entered into the data base.    HERE IS QUESTION 1  can that be done and HOW ?\n\n** Also on the same site  other DATA SETS a person can enter data into those sets FOR FREE ( $0 ).  So when Customer fills out form they press submit and data is entered into DB .\n\n\n** On any data The data can be SEARCHED  for FREE ($ 0 ) \n\n\n\nI DO NOT  want this to be a Subscription / nor Membership site.  \n\n\n** ALSO   I want ALL DATA to AUTO DELETE  from the database after a set time period from the date of submission.\n\n\nDo you have any videos on these aspects of DB COLLECTION AND USE ????", "likes": 1}}, {"topLevelComment": {"author": "abukar jeyte", "text": "I realy exiting any update of datta basr lime", "likes": 0}}, {"topLevelComment": {"author": "drop_messages", "text": "8 hour video, check\nusing a chalk board, because old school (as in teaching style, not tech) teachers are the best., check\nno ads, check\none guy, talking about one topic for 8 hours, in a free video check\n.....  I remind myself how lucky I am to get a free education on you tube", "likes": 610}, "replies": [{"author": "Ignacio Reyna", "text": "Still these guys deserve some kind of revenue, being all this content incredible invaluable and given to us for free. I think it's totally deserved.", "likes": 2}, {"author": "Aleksa", "text": "for this video, at least we can do is click skip ad after 5 seconds so the guy get an extra buck for his efforts", "likes": 3}, {"author": "Damilare Taiwo", "text": "@drop_messages Doesn't matter, the ads could be skipped and you can even download and watch offline in 720 HD without ads!", "likes": 11}, {"author": "drop_messages", "text": "@TokyoXtreme  damn, that sucks", "likes": 3}, {"author": "TokyoXtreme", "text": "Alas, there are ads now.", "likes": 2}]}, {"topLevelComment": {"author": "Jas Bangar", "text": "02:44:00 the join on the right side of middle table allows for duplicate values of pk on the right? Please explain?", "likes": 1}}, {"topLevelComment": {"author": "Charan", "text": "is there an advanced version on database design?", "likes": 1}}, {"topLevelComment": {"author": "Jayce1712", "text": "Im not sure husband and wife is a one to one relationship, it can be husband with 4 wives and 50 rape attempts", "likes": 0}}, {"topLevelComment": {"author": "Taewon Yoon", "text": "Thanks for this awesome video\nI loved how you changed your chalkboard to a whiteboard and still have the habit of erasing using your hand haha \nAlso i really appreciate your vibe through out the whole video, ex. die eraser! 3d woo,  letting users keep constant focus while studying!", "likes": 0}}, {"topLevelComment": {"author": "Sal Morreale", "text": "I share your passion for the chalk board. It is something that draws me to your videos.", "likes": 0}}, {"topLevelComment": {"author": "Claire Connaughton", "text": "Thank you very much for this video", "likes": 1}}, {"topLevelComment": {"author": "Samed Kahyaoğlu", "text": "Thank you very much for this all in one course :)", "likes": 1}}, {"topLevelComment": {"author": "Esther", "text": "haha love the joke at 3:52:27", "likes": 0}}, {"topLevelComment": {"author": "Esther", "text": "2:02:07 \"By His stripes we are healed\" - Psalm 53", "likes": 3}}, {"topLevelComment": {"author": "Richie Bonilla", "text": "Thank you so much for making this. Exactly what I was looking for.", "likes": 7}}, {"topLevelComment": {"author": "Alexey0795", "text": "1:41:11", "likes": 0}}, {"topLevelComment": {"author": "Justin Dawson", "text": "Outer Outer JOIN haha, cracked me up lol.", "likes": 0}}, {"topLevelComment": {"author": "Ty Buie", "text": "Thank you Caleb!", "likes": 0}}, {"topLevelComment": {"author": "Daniel Tossutti", "text": "19:17 = braaa\n40:57 = Ahhh", "likes": 2}}, {"topLevelComment": {"author": "Ciandra Pancho", "text": "respect. 💯", "likes": 0}}, {"topLevelComment": {"author": "Yared c", "text": "An amazing tutorial.  Learned alot, thank you", "likes": 1}}, {"topLevelComment": {"author": "Nitin Upadhyay", "text": "Bro hindi me bhi banao", "likes": 1}}, {"topLevelComment": {"author": "Rakib Hossain", "text": "Excellent! Helped me a lot", "likes": 0}}, {"topLevelComment": {"author": "john watkins", "text": "Is this in access or excel?", "likes": 1}, "replies": [{"author": "Andrew Bartonwood", "text": "Powerpoint", "likes": 0}]}, {"topLevelComment": {"author": "Balaporte Jean", "text": "thk you bro\nJésus loves you,he's real\nBelieve in him and repent", "likes": 1}, "replies": [{"author": "Boadi Daniel", "text": "Balaporte Jean that’s a big lie, coz you have no empirical evidence of Jesus, this guy did awesome", "likes": 0}]}, {"topLevelComment": {"author": "Elzantie Santee", "text": "I prefer learning by doing not by watching!", "likes": 1}, "replies": [{"author": "Balaporte Jean", "text": "do after", "likes": 0}]}, {"topLevelComment": {"author": "fff hshf", "text": "introduction to JOINTS", "likes": 1}}, {"topLevelComment": {"author": "Joslynne Hill", "text": "Caleb you are a brilliant teacher. Making complex ideas very simple. Thank you. Wish I had you as a teacher 45 years ago.", "likes": 9}}, {"topLevelComment": {"author": "P R", "text": "This looks awesome! However, I have one tiny problem with this video...I am deaf so I don't know a word you are saying. I have been dying to learn how to design a database properly so I can keep a track of my insane collections. Thanks!", "likes": 8}, "replies": [{"author": "Joshua Rowe", "text": "There's a plethora of written resources online", "likes": 1}]}, {"topLevelComment": {"author": "Fabrice Asse", "text": "That's really great. Thanks a lot", "likes": 1}}, {"topLevelComment": {"author": "Zal", "text": "Time stamp for later 19:15", "likes": 0}}, {"topLevelComment": {"author": "Lord Stark", "text": "wo else take a cup of coffee before clicking on play ?", "likes": 1}}, {"topLevelComment": {"author": "Hack Educ", "text": "Best vídeo about db! I learned in 8 hrs what i didnt in two semesters!", "likes": 34}}, {"topLevelComment": {"author": "Techmail", "text": "Best database course I've watched. Great teacher 👍", "likes": 0}}, {"topLevelComment": {"author": "t kumar", "text": "Hi belive me I have seen  few vidéos  before  yours   ,  your is more undertandable  thanks", "likes": 1}}, {"topLevelComment": {"author": "Mehmet Terzi", "text": "Let's pitch in and buy this guy a shave and some elocution lessons", "likes": 1}}, {"topLevelComment": {"author": "EDUCATIONAL", "text": "Tq Caleb...", "likes": 0}}, {"topLevelComment": {"author": "Isaac L. Quelemine", "text": "Very educative, thanks", "likes": 0}}, {"topLevelComment": {"author": "TheHungryDonut", "text": "2:43:57 lol", "likes": 0}}, {"topLevelComment": {"author": "ifiknewthen13", "text": "Please  split up..at..tri...b...utes\nattributes", "likes": 1}}, {"topLevelComment": {"author": "Artur Tarabanov", "text": "Thank you, Caleb.", "likes": 1}}, {"topLevelComment": {"author": "B. Licious", "text": "Just what I need right now! Thank you!", "likes": 1}}, {"topLevelComment": {"author": "Richard Brown", "text": "Caleb thank you for your presentation.  I am working my way through and wanted to thank you.", "likes": 9}}, {"topLevelComment": {"author": "Alan Lion Gar", "text": "05:35:08 to 05:35:17 >> TIME TRAVEL!!!", "likes": 0}}, {"topLevelComment": {"author": "taxuannam1978 nam", "text": "hi, I'm programmer beginner.  Could you please analytics database design of actual application ? For example if we have a requirement of a sofware , how to design database ?", "likes": 0}}, {"topLevelComment": {"author": "unwolfmelightox", "text": "you're pronouncing attribute wrong. Different word.", "likes": 2}, "replies": [{"author": "TokyoXtreme", "text": "At-TRIB-ute is the verb, whereas AT-trib-ute is the noun (which is the pronunciation he should’ve been using throughout). Maybe his teacher was Indian.", "likes": 0}]}, {"topLevelComment": {"author": "Juan Pablo Gonzalez Larrondo", "text": "You're spectacular Caleb, but what the hell with those USA tshirts man! haha", "likes": 1}, "replies": [{"author": "Epic Meme Name", "text": "Juan Pablo Gonzalez Larrondo uhh maybe because he lives in the US?", "likes": 0}]}, {"topLevelComment": {"author": "Kris", "text": "almost 6 hours into the video.. still going strong :)", "likes": 4}}, {"topLevelComment": {"author": "Kosteri x", "text": "Well, usually there already is a database as a given, but it certainly pays off to experiment with databases at home. They are useful for structuring your information. Of course I disagree with just about everything the dude says ;-)", "likes": 1}}, {"topLevelComment": {"author": "Tung Vu Duc", "text": "It would be amazing if this video have subtitle because english is not my native language, I cannot understand everything he teaching", "likes": 0}}, {"topLevelComment": {"author": "Alex Doroșin", "text": "This video so long you can see his beard growing", "likes": 1626}, "replies": [{"author": "mehdi raghib", "text": "😂😂😂😂😂😂😂😂", "likes": 0}, {"author": "gerarbendfeldt", "text": "True, true, t r u e", "likes": 0}, {"author": "nirut gupta", "text": "@Ken i think he dropped off before that :p", "likes": 0}, {"author": "Gena ANTG", "text": "Lmao", "likes": 0}, {"author": "Ben Jose Joseph", "text": "😀😂🤣🤣", "likes": 0}]}, {"topLevelComment": {"author": "A", "text": "This is amazing! Thank you.", "likes": 0}}, {"topLevelComment": {"author": "ant a", "text": "50 minutes into this course. \nI'm an older guy so the presenter here looks really young to me. \n\n\nI just have to say this young man rocks.. He's a born teacher.. Makes concepts very easy to grasp. \n\n\nAwesome job.. keep up the good work.", "likes": 5}}, {"topLevelComment": {"author": "Saten Harutyunyan", "text": "love this guy, saved my job interview <3 thanks\nwhen is get rich ill pay you back :)", "likes": 6}, "replies": [{"author": "Shaurya Kapoor", "text": "I was wondering if you got the notification for my questions above? Thank You", "likes": 0}, {"author": "Shaurya Kapoor", "text": "Also did you watch the entire video or only a part of it?", "likes": 0}, {"author": "Shaurya Kapoor", "text": "what question did they ask in your job interview?", "likes": 0}]}, {"topLevelComment": {"author": "Colby Merchlewitz", "text": "a tribute lol...", "likes": 1}}, {"topLevelComment": {"author": "Jonas Herseth", "text": "There goes my evening and night....", "likes": 3}, "replies": [{"author": "Techmail", "text": "lol :)", "likes": 0}]}, {"topLevelComment": {"author": "ANKUSH KAUSHAL", "text": "how to display content from database on website", "likes": 2}}, {"topLevelComment": {"author": "conclude here", "text": "this dude saved my grades bro thanks", "likes": 8}}, {"topLevelComment": {"author": "Roshan tripath", "text": "thanks", "likes": 1}}, {"topLevelComment": {"author": "Enixio", "text": "At 5:59:17 shouldn't it be a better idea to leave the star value (1-5) in the review table, and make the star table from star (PK and FK), and star meaning only? It would work right? Am I missing something? Awesome video by the way!", "likes": 1}}, {"topLevelComment": {"author": "Carson H", "text": "ATT-ri-bute. att-RI-bute is the verb", "likes": 2}}, {"topLevelComment": {"author": "Frank Martin", "text": "I'm planning to make some time to follow the whole program.", "likes": 0}}, {"topLevelComment": {"author": "Nick Fleming", "text": "I wish you would say attribute correctly. A-pple -> A-ttribute\nwhat you're saying is a verb", "likes": 3}, "replies": [{"author": "Jonas Herseth", "text": "Yeah, I was a bit confused :P He's probably only ever read it and never heard it spoken.", "likes": 0}]}, {"topLevelComment": {"author": "yasin hajilou", "text": "Where is caption??i need thatt 😭😭😭", "likes": 0}}, {"topLevelComment": {"author": "Jeremy Then", "text": "Put the speed at 2x and save 4 hours. You can understand him properly that fast.", "likes": 1}}, {"topLevelComment": {"author": "Yaowen Liang", "text": "Left hand omg....", "likes": 0}}, {"topLevelComment": {"author": "Mike Mengel", "text": "This is Relational Database Design, not Database Design", "likes": 1}}, {"topLevelComment": {"author": "SomeGuy StandingHere", "text": "That mariage exemple for many to many relationship got out of hands so quickly xD", "likes": 9}, "replies": [{"author": "Andrew Pratt", "text": "\"She's not so good lookin'\" 1:56:44", "likes": 1}]}, {"topLevelComment": {"author": "Spacecase", "text": "Save yourself 2 hours and 45 minutes by watching this at 1.5x speed", "likes": 246}, "replies": [{"author": "विशाल कुमार", "text": "save your hole time by reading time_stamp", "likes": 0}, {"author": "Programmer", "text": "save yourself by not watching the video", "likes": 0}, {"author": "Mr.T", "text": "tbh I never do this but it is actually optimal in watching this", "likes": 0}, {"author": "TRAP BAGZ", "text": "@Jason Siu Ching Yuen no need to get dramatic there jason lol", "likes": 0}, {"author": "TRAP BAGZ", "text": "LOL", "likes": 0}]}, {"topLevelComment": {"author": "abdalla sobhy", "text": "Excellent 👌", "likes": 0}}, {"topLevelComment": {"author": "srk", "text": "Well Done !!!", "likes": 0}}, {"topLevelComment": {"author": "Han nu", "text": "Luv this video, easy to understand \nSubscribed!", "likes": 0}}, {"topLevelComment": {"author": "Iliyan Draganov", "text": "Really - 8 hours???? The first developer low - keep thinks simple.", "likes": 1}}, {"topLevelComment": {"author": "Mr. Skeffington", "text": "Ahem, at·trib·ute\r, verb, /əˈtriˌbyo͞ot/ (not 'a' tribute)", "likes": 10}}, {"topLevelComment": {"author": "Aiman Md Halid", "text": "exactly, tommorow is my Database Design final , here i am.. last minute is greaaaat lol.. im fked up", "likes": 1}}, {"topLevelComment": {"author": "Aiman Md Halid", "text": "exactly, tommorow is my Database Design final , here i am.. last minute is greaaaat lol.. im fked up", "likes": 2}, "replies": [{"author": "Aiman Md Halid", "text": "@Prabhu Ji horrible honestly, too many command question.", "likes": 0}, {"author": "Prabhu Ji", "text": "How was the exam?", "likes": 0}]}, {"topLevelComment": {"author": "Tiny", "text": "for example websites for example", "likes": 1}}, {"topLevelComment": {"author": "computing power", "text": "you are amazing :)", "likes": 1}}, {"topLevelComment": {"author": "ymzl", "text": "subtitle pls..", "likes": 1}}, {"topLevelComment": {"author": "Ashwani Pratap", "text": "What's the best approach to store multiple values for one attribute? i.e. If we want to store more than one phone numbers for particular customer. \nAt last, Thanks for such a good and descriptive tutorial.", "likes": 0}, "replies": [{"author": "Eldhose VJ", "text": "I think if you use mongo dB as your data base , the best way to store multiple phone number of a single person is to use an array, when you don't have idea how many phone number user want to store.", "likes": 0}]}, {"topLevelComment": {"author": "Yosef Mulatu", "text": "looong but i got everything that i was missing in the middles while teaching myself!!10q", "likes": 0}, "replies": [{"author": "Jesus is God", "text": "Yosef Mulatu habeshana India tekotaterachewut ayidel?", "likes": 0}]}, {"topLevelComment": {"author": "Talha Karim", "text": "8 hour and no ads. Respect", "likes": 1}}, {"topLevelComment": {"author": "Lucas Tarso", "text": "You're  hella funny bro lol. Loved the lecture! You really make it easy to understand. Cheers!", "likes": 3}}, {"topLevelComment": {"author": "Shev Chenko", "text": "Wow... Best video.. 😁👍", "likes": 1}}, {"topLevelComment": {"author": "Veiko plays", "text": "Huuuuuuge thanks! Learned a Lot! Thank's to You I was able to start my project and excel at it! \nPlease consider adding more code exaples, like table creation and FOREIGN KEY assignment..", "likes": 9}, "replies": [{"author": "Shacklez Showdown", "text": "@John Bruder you know excel is a word in English?", "likes": 0}, {"author": "John Bruder", "text": "Did you say excel??  That's not a database.  It's a spreadsheet.  LoL.  Gotcha!!", "likes": 1}]}, {"topLevelComment": {"author": "Elsie Blakley", "text": "I need inventory that has many items.  I was going to try ACCESS, but no one wants or cannot help. I have o/a 50 doll heads, which has different arms, legs, bodies, wigs, eyes wigs. I need to list the names and be able to connect heads to different parts (.  which can be changed to fit to make them baby, child,  teen etc.  Also color of any of above.  I have ACCESS in. My computer, need to be able to connect choices to fit the head.  My email is elsieblakley8@gmail.com. Thank you, I have watched your program.", "likes": 1}}, {"topLevelComment": {"author": "Taee Savage", "text": "Shoutout to you for breaking this down to my understanding. I recently enrolled in a database class and was referred from a classmate to watch it. Im glad I did, thank you so much. You are awesome!", "likes": 86}, "replies": [{"author": "This is America ", "text": "I know, this is Awsome, he's a like a Old-School Professor, that is So Cute. I am an Old-school person.", "likes": 2}]}, {"topLevelComment": {"author": "Mohammed Al-lami", "text": "this videos is really good and helpful my suggestion is to use a plastic board with colored markers it will help you to be more creative and will save you the efforts of erasing the board", "likes": 4}}, {"topLevelComment": {"author": "Mohammed Al-lami", "text": "no ads >>>>>>>>> respect", "likes": 282}}, {"topLevelComment": {"author": "Elsie Blakley", "text": "Thank you.", "likes": 1}}, {"topLevelComment": {"author": "Anil Kumar", "text": "It's really nice learning experience with you , Thanks", "likes": 1}}, {"topLevelComment": {"author": "Parag Kadam", "text": "I have never needed to use anything part from PK and FK, am I missing something?", "likes": 0}}, {"topLevelComment": {"author": "Vitaliy Kondrenko", "text": "i'm watching this only 10 minutes and all i can think about is how high are u... I'm sorry but your expression  fantastic... xD", "likes": 1}}, {"topLevelComment": {"author": "Arsalan jewellery", "text": "Sir  how I can make a concept logic database and make a software plz make a video on any projects sir", "likes": 0}}, {"topLevelComment": {"author": "Михаил Фаузель", "text": "Can you do something like this about non-sql databases? Like mongo db", "likes": 0}}, {"topLevelComment": {"author": "Ali Asif", "text": "hello I'm from india I am watching your video good working brother 👍", "likes": 3}}, {"topLevelComment": {"author": "ngaihte", "text": "Noice! Smort!", "likes": 0}}, {"topLevelComment": {"author": "amina", "text": "Speed to 2x, well im ready :D", "likes": 11}}, {"topLevelComment": {"author": "Лом Якубов", "text": "Thank you so much Caleb! I learned a lot!", "likes": 0}}, {"topLevelComment": {"author": "Chaloo", "text": "2:40:44 LOL his expression, Claire what u did to him?", "likes": 5}, "replies": [{"author": "Vita Ethio", "text": "You mad it that far?", "likes": 0}]}, {"topLevelComment": {"author": "Deep Space", "text": "You are lovely and teach really good. Love from Earth lol", "likes": 0}}, {"topLevelComment": {"author": "Obesco", "text": "Please I want to become database analysis, how can my dream comes through", "likes": 0}}, {"topLevelComment": {"author": "nathan underBSD", "text": "1st watch slept, 2nd watch shorten to 4 hours, 3rd watch shorten to 2 hours. then slept again. Good job.", "likes": 1}}, {"topLevelComment": {"author": "M. D", "text": "Thoroughly enjoying this thanks so much... nothing like going down to the basics to give clear eyed view of stuff", "likes": 1}}, {"topLevelComment": {"author": "dhanya anup", "text": "Very useful sir..Thank you", "likes": 0}}, {"topLevelComment": {"author": "Valentin Marin", "text": "Keep up the good work kid !", "likes": 0}}, {"topLevelComment": {"author": "Kenney", "text": "If the relational database is confusing to you pay extra special attention to the process of normalizing the database and the differences between first, second, third and fourth normal form. Once you master that concept it will be simple to grasp.", "likes": 9}}, {"topLevelComment": {"author": "Moco Coco", "text": "Speaking with about 4 years of experience in programing including Microsoft SQL server I can say that as far as natural vs surrogate keys are concerned surrogate key is used without a second thought. Most DB servers have this built in Auto Increment feature with number (integer usually) seed and increment options to pick and then they auto increment without any necessary care from our side. In special cases a so called GUID is used (Global Unique Identifier) which is a 30 something (39 I think) characters in length which at least by the book should be unique in the entire world. But matching 39 characters against thousands or even millions of rows in a Child table takes a lot more resources and time.", "likes": 0}}, {"topLevelComment": {"author": "pandey rachna", "text": "Thank u so much kudos to u heartily thanks", "likes": 2}}, {"topLevelComment": {"author": "Monaco Design", "text": "this guy has a very high sense of humor, geee~~~can't stop watching his video", "likes": 1}}, {"topLevelComment": {"author": "emanandchill", "text": "1:46:07 bro chill Lol.  #eraserlivesmatter", "likes": 2}}, {"topLevelComment": {"author": "emanandchill", "text": "Wow...8 hours.. Well..I guess...speed 1.75 😎 Seriously, thanks for the vid.", "likes": 1}}, {"topLevelComment": {"author": "Peter Froberg", "text": "Respect for this long very nice powerful information Video ... Thank you", "likes": 3}}, {"topLevelComment": {"author": "hotmandead1", "text": "*correction 5:12:10 \n\nERD -> (Entity) relationship diagram / model", "likes": 7}}, {"topLevelComment": {"author": "jozee mgao", "text": "I like you...Thank you", "likes": 1}}, {"topLevelComment": {"author": "BahawalTV", "text": "I have created a concise video on database design.", "likes": 1}, "replies": [{"author": "ONKAR TIWARI", "text": "Can you share me the link of your video?", "likes": 0}]}, {"topLevelComment": {"author": "Lulseged Abera", "text": "awesome discussions and keep it up pl.", "likes": 0}}, {"topLevelComment": {"author": "Valeriia Protsko", "text": "Great explanation, thanks! Spreadsheets and Database are both powerful ways to store the data, and I do not necessarily agree with the examples for Excel vs Database, it would be probably easy to select the employees in Excel then learn how to write a proper query. They are different in another way - when you enter data to the spreadsheet it is your responsibility to maintain order and put correct information into the right cell. If you intended to put data into cell B5 but entered it into C5, Excel wouldn't inform you about this. In relational databases, there is a structure that you have to obey. I recommend checking Airtable.com to build a prototype and practice with database design, understand the tables and records,  (they have a generous free plan).\n_________added after watching all 8 hours (yay!! I did it)______\nAll the information is organized in a perfect way, and it makes total sense. If Caleb skipped the beginning or made it faster, it would be much harder to understand the normalization and joints. Totally worth watching. After this video, it will be easy to practice in real DB.", "likes": 0}}, {"topLevelComment": {"author": "Manik Dhingra", "text": "can you tell me from where to study data communication and networking , system analysis and design. this video was awesome loved it.", "likes": 0}}, {"topLevelComment": {"author": "Simon Stain", "text": "who cares if you can use the right terms? your boss, your coworkers, everyone you will ever talk to about databases...", "likes": 1}}, {"topLevelComment": {"author": "mostafa4321", "text": "Excellent work Caleb. I am actually trying to learn SQL and Database design and your explanation is so basic makes accessible and easy to grasp. BTW I am in my 50s so it may be a bit challenging but I am getting it. keep up the awesome job", "likes": 516}, "replies": [{"author": "Michael Schirmer", "text": "Tha'ts funny.  I'm in my 50s and learning.  I keep excel sheets on information that tie together and looking to up my game and hope database design will improve it.", "likes": 1}, {"author": "Krishna Patel", "text": "@Gabe Segun i dont think age matters at all to learn anything at any age....its actually really insping for me at 30s after reading your comment,,,and it motivates me a lot when i get to know about people like you who are trying to get in touch with technologies at this age. Its really inspoing a lot...In my opinion, at this age if you are trying to learn a new stuff then its a proud moement whoever is reading this comment", "likes": 1}, {"author": "Bhawna Bedi", "text": "Do we have IT sector job for age 50 as well? Just curious as i will also be same after few years", "likes": 0}, {"author": "Silver Lion", "text": "@Gabe Segun If people say that...they are not your friends. I hope that 3-years later you stuck with it and are flourishing in the field.", "likes": 2}, {"author": "Tertius Akademia", "text": "@Gabe Segun Not if it's something you're passionate about: Passion trumps a lot of things.", "likes": 2}]}, {"topLevelComment": {"author": "Mohammad Noushad Siddiqui", "text": "U r great", "likes": 1}}, {"topLevelComment": {"author": "Abdul H. Montazir", "text": "Awesome piece of work! Well illustrated", "likes": 0}}, {"topLevelComment": {"author": "Single Eagle", "text": "**ฉายาที่ใช้ในเว็บต่างๆ เขาหมายถึงใครครับ ?**\n*1 อีอ้วนอัปลักษณ์ อำมหิต พุงปลิ้น ขาถ่าง หีอ้า แตดดำ*\nหรือ ใช้ฉายาอีกอย่างหนึ่งว่า\n*2 อีเงี่ยน เก็บกด หีอ้า แตดดำ*\nหมายถึงใครบ้างครับ ?", "likes": 0}}, {"topLevelComment": {"author": "kumari das", "text": "Thanks a lot", "likes": 0}}, {"topLevelComment": {"author": "Uttam Gurung", "text": "Nice and descriptive tutorial..liked it,,thanks", "likes": 1}}, {"topLevelComment": {"author": "datta tayde", "text": "Can you plz give me your email id", "likes": 1}}, {"topLevelComment": {"author": "datta tayde", "text": "Can you please create some videos on banking database,\nWith all the real-time examples.\nAnd show some module which modules are there. And data flow diagram.", "likes": 3}}, {"topLevelComment": {"author": "F Society", "text": "Please, subtitle ingglis", "likes": 0}}, {"topLevelComment": {"author": "Rahul Nayak", "text": "outstanding", "likes": 1}}, {"topLevelComment": {"author": "Phinidy Ngore", "text": "dude you have grown more beards towards the end of the video", "likes": 1}, "replies": [{"author": "Karim Helemish", "text": ":) :) :D :D", "likes": 0}]}, {"topLevelComment": {"author": "NSPW LLC", "text": "This Freecode camp Caleb Grew Up litterally in The Video he Actually Grew a Beard.... That's Dedication and Consistancy..... I subscribed ....", "likes": 18}}, {"topLevelComment": {"author": "Kuldeep Pal", "text": "Hey dude I also want to join freecodecamp", "likes": 1}}, {"topLevelComment": {"author": "Reginald Odhiambo", "text": "Wow... I owe you a holiday hahahaha", "likes": 1}}, {"topLevelComment": {"author": "Kurd-Box", "text": "Best teacher, best channel, always expecting the best from that channel , this video is a treasure", "likes": 14}}, {"topLevelComment": {"author": "hicham Lotfi", "text": "great teacher\nthank you bro", "likes": 0}}, {"topLevelComment": {"author": "hector alvarado", "text": "I was anxious all the class wating for the blackboard to make a scratchy sound, made me pay more atention.", "likes": 0}}, {"topLevelComment": {"author": "Informative Content", "text": "Caleb is 😘😘❤", "likes": 1}}, {"topLevelComment": {"author": "Tomas Licak", "text": "I really like this tutorial", "likes": 1}}, {"topLevelComment": {"author": "R B", "text": "Thank you bro", "likes": 1}}, {"topLevelComment": {"author": "Ismael Chavez Sanchez", "text": "Thanks indeed. Very basic. it fulfills my needs of knowledge about this important topic or science.", "likes": 0}}, {"topLevelComment": {"author": "Onde está Gabriel", "text": "you're so cute omg", "likes": 2}}, {"topLevelComment": {"author": "Mario Zamora", "text": "This series was amazing!!! Thanks so much Caleb. I've been able to design a few databases because of this and I feel so confident! So thankful I found your course :)", "likes": 45}}, {"topLevelComment": {"author": "Kranx Joy", "text": "@freecodecamp.org: Is this video's content different than in your other video - SQL - Full course for beginners\r? Would you recommend watching this to someone who has already watched the other video. I know it doesn't hurt, but its 8 hours long video thats why I am asking.", "likes": 3}, "replies": [{"author": "pandey rachna", "text": "Definitely", "likes": 0}, {"author": "hard & code", "text": "@freeCodeCamp.org hello! Respected sir,  in ur lecture u've explained about null. Sir whether null or 0 or \"space character\" are same. For example, if any user enters a 0 or \"spaces\" in the field then that entry is equal to null? Plz explain. I shall be highly obliged to you for your kind help. Thank you.", "likes": 0}, {"author": "Kranx Joy", "text": "@freeCodeCamp.org Thanks for replying. I will watch both. You guys are doing a great job.", "likes": 0}, {"author": "freeCodeCamp.org", "text": "Yes, this video is different. The SQL video is more technical and how to use SQL. This video is higher level. It is about the theory of designing databases.", "likes": 1}]}, {"topLevelComment": {"author": "Kranx Joy", "text": "Thanks for sharing this with us.", "likes": 0}}, {"topLevelComment": {"author": "Francis Gohil", "text": "i need tution of algorithm and oops", "likes": 1}}, {"topLevelComment": {"author": "saiful islam", "text": "Hey is this not too short video", "likes": 1}}, {"topLevelComment": {"author": "Venkata Mahanandi Kumar Buma", "text": "Tupil: Intersection of row and column is called Tupil.", "likes": 2}, "replies": [{"author": "Baldev Singh", "text": "Venkata Buma tuple", "likes": 0}]}, {"topLevelComment": {"author": "Matt Banak", "text": "Your pronunciation of attributes is really throwing me off! Good stuff though!", "likes": 2}, "replies": [{"author": "Roronoa_D_Law", "text": "?", "likes": 0}, {"author": "sjhuz01", "text": "Yeah, that drove me nuts to the point I couldn't keep watching the intro & had to skip ahead.  \n\"atTRIBute\" = verb ... \"ATtribute\" = noun. ... EDIT: Fixed around 5hrs:45 ... Phew! Good course overall :)", "likes": 1}]}, {"topLevelComment": {"author": "Paul Choh", "text": "Bro... very well explained. Thank you! \n\nExtra brownie points for using a chalkboard and not a whiteboard :P", "likes": 10}}, {"topLevelComment": {"author": "tsebo mokoena", "text": "So,8 hours hey?", "likes": 0}}, {"topLevelComment": {"author": "Vitalii", "text": "thanks", "likes": 1}}, {"topLevelComment": {"author": "A H", "text": "how old u r?", "likes": 1}}, {"topLevelComment": {"author": "Harsha Dilan", "text": "Very Useful Nice Video. Please give us a complete full course video about blockchain development.", "likes": 2}}, {"topLevelComment": {"author": "German Kreither Feliu", "text": "WOW... Exactly What i was looking for. I'm hype 😎😎", "likes": 0}}, {"topLevelComment": {"author": "AdiL IsmaiL", "text": "Plz break it down to smaller video files and make it as a playlist", "likes": 2}, "replies": [{"author": "Girl Boss Plan", "text": "I agree 👍", "likes": 0}]}, {"topLevelComment": {"author": "moses flood", "text": "Oh! I wish had this video be divided into parts because it's difficult to download 8hr video Takes a lot of time and space:(", "likes": 0}, "replies": [{"author": "freeCodeCamp.org", "text": "Try here: https://www.youtube.com/playlist?list=PL_c9BZzLwBRK0Pc28IdvPQizD2mJlgoID", "likes": 0}]}, {"topLevelComment": {"author": "Brighton Chabula", "text": "Very useful content.. just finished watching and the content is good", "likes": 23}}, {"topLevelComment": {"author": "Justin Herrera", "text": "video looks like a 5 years ago tutorial", "likes": 1}, "replies": [{"author": "Andy Miller", "text": "@Mr. Anderson Wow thank you very much for that detailed answere!!\nMy goal would be to develope a website for opening hours (webscraping will be a huge topic), but on jourmey i guess i will be able to do much more stuff.\nNever really understood why people were saying that knowledge is power, just with databases i became enlightened.\nAnyways thanks for your help!", "likes": 1}, {"author": "Mr. Anderson", "text": "​@Andy Miller I wouldn't say specialize, the next step could be learning just enough php or any other server side language, anyways php is the easiest, just learn enought to make a database connection and process forms, then model something, just whatever. One good strategy could be to watch, and think how your local business work, model them, and start playing with that. If that seems just too much and you don't know where to start, try to make classic projects: todo list, sales system. All the above if you want to be a freelancer.\n\nOn the other sider if you are pursuing a serious career as a developer I'll add a couple of things: learn formally about entity relationship modelling, get a book on database modelling to learn concepts like cartesian product, sets theory, and at least the object oriented programming paradigm to make organized code. That surely could help!", "likes": 0}, {"author": "Andy Miller", "text": "Alcides Apaza Yanarico would the next step be now to specialize on a specific database language such as php?", "likes": 0}, {"author": "Mr. Anderson", "text": "It's because it is, but if you're completely new to database design I recomend it", "likes": 1}]}, {"topLevelComment": {"author": "Mauro Ymgch", "text": "Great content!!! Thanks for sharing.", "likes": 1}}, {"topLevelComment": {"author": "Rohini Kumar D", "text": "thanks for the tutorial bro.. you have covered from basics to advanced with full clarifications in single video :)\nGreat Job!!", "likes": 1}}, {"topLevelComment": {"author": "John Garzon", "text": "Excellent  course my friend...you deserve  the best regards ...it was so useful for me.. thank you...👍👍👍👍", "likes": 1}}, {"topLevelComment": {"author": "Lester J", "text": "You are so funny hahahaha XD", "likes": 1}}, {"topLevelComment": {"author": "Tobias Wimmer", "text": "duude 8 hours without ads", "likes": 522}}, {"topLevelComment": {"author": "justin prather", "text": "Lmao I love how excited he got when \"we\" asked what is a database? This guy is awesome so far 10/10.", "likes": 17}}, {"topLevelComment": {"author": "Siddharth Tiwari", "text": "You guys are best.", "likes": 1}}, {"topLevelComment": {"author": "SR", "text": "WELCOME TO THE FREECODECAMP CALEB CURRY", "likes": 7}}, {"topLevelComment": {"author": "MHH Studio", "text": "Wow and wowed", "likes": 0}}, {"topLevelComment": {"author": "ubuntu kali", "text": "Good job boy", "likes": 1}}, {"topLevelComment": {"author": "M.PAVANKUMAR REDDY", "text": "upload full course on sql server", "likes": 4}, "replies": [{"author": "Fidan Gill", "text": "You can find it on calebs youtube channel.", "likes": 0}]}, {"topLevelComment": {"author": "M.PAVANKUMAR REDDY", "text": "addi videos in sqlserver", "likes": 1}}, {"topLevelComment": {"author": "amit negi", "text": "I request you to create such detail video on nosql database like mongoDB", "likes": 1}}, {"topLevelComment": {"author": "David Schreiter", "text": "This is of tremendous help. Love that is it not language specific and focuses on the conceptual level. Thank you much!", "likes": 19}}, {"topLevelComment": {"author": "Tanmay Mishra", "text": "This is exactly what I was looking for today!!😊", "likes": 42}, "replies": [{"author": "just nazmus", "text": "Tanmay are you single?", "likes": 0}]}, {"topLevelComment": {"author": "daky dakyion", "text": "Guys what is the best way to learn dealing with databases in ASP.NET framework in visual studio", "likes": 0}}, {"topLevelComment": {"author": "36nagraj", "text": "what is the blog name", "likes": 1}, "replies": [{"author": "freeCodeCamp.org", "text": "www.calebcurry.com", "likes": 0}]}, {"topLevelComment": {"author": "TheNewWay", "text": "Make one video on python 3", "likes": 3}}, {"topLevelComment": {"author": "Aeril Ashraf", "text": "enable substitle please", "likes": 11}, "replies": [{"author": "hormari naftaada", "text": "azhr .can i help you this issue of the language  problems .", "likes": 0}]}, {"topLevelComment": {"author": "Tim Biden", "text": "Caleb is an AWESOME teacher. He seriously helped me pass a section of my bootcamp. Can't wait to finish my current NodeJS course so I can start this one.", "likes": 4}}, {"topLevelComment": {"author": "emil josef", "text": "Thank you for this! :D", "likes": 2}}, {"topLevelComment": {"author": "freeCodeCamp.org", "text": "Want to know what to learn next? Learn SQL: https://www.youtube.com/watch?v=HXV3zeQKqGY", "likes": 13}, "replies": [{"author": "Lephenix", "text": "please add automatic subtitle", "likes": 0}]}, {"topLevelComment": {"author": "Mokhtar Elfoly", "text": "Respect , may Allah(God) bless you", "likes": 7}, "replies": [{"author": "Akash Pal", "text": "@[oldlonecoder] 😂😂👌👌", "likes": 0}, {"author": "Erx fav", "text": "Mza if the truth is fanatical, I am one of His biggest fans. Call me a fanatic. \n\nAnd go examine your judgments \nThings are not always what they seem", "likes": 0}, {"author": "Erx fav", "text": "Mokhtar Elfoly no, you are foolish and confused. Have you not read the Bible and what Jesus said Himself? What he claimed and did? You follow a false religion of death. You are misled and lied to. That hook you are reading is of the devil. And you find your comfort in the unknown. In darkness l. Mohammad was a liar and pedophile and murderous theif! He has no place with the One true God and never had it. He has misled tens of thousands of people into hell! And you think he is the way.. shake my head...\nJESUS said He is the Way the Truth and the Life and NO ONE comes to the Father (God) but by Him...\n\nKeep believing and spreading your lies and you will end up in hell with the rest of the world.. this world belongs to the evil one. The same who misleads the masses.. and is tricking you. You have no righteousness of your own.. as neither do I.. all are guilty before God.. and God has given one way out, one answer.. and that is Jesus Christ His Son the Messiah. Glory be to the King forever and ever and ever. Amen", "likes": 0}, {"author": "Erx fav", "text": "lalaithan this is not religion m. And his is not an argument. Only people who do not think objective truth exists or who have not sought it think in this way", "likes": 0}, {"author": "Erx fav", "text": "shaikh mohiyuddin oh and PS “this guy” didn’t “just like something” “this guy” thinks “allah” is God and is spreading a demonic agenda and message straight from hell.. whether he fully realizes it or not.. but according to YOU, I should just be quiet and shut up in the name of “positivity”... uh the ignorance m..", "likes": 0}]}, {"topLevelComment": {"author": "Tesfay Simon", "text": "⌨️ (0:00:00) Introduction\n⌨️ (0:03:12) What is a Database?\n⌨️ (0:11:04) What is a Relational Database?\n⌨️ (0:23:41) RDBMS\n⌨️ (0:27:30) Introduction to SQL\n⌨️ (0:43:58) Naming Conventions\n⌨️ (0:47:14) What is Database Design?\n⌨️ (1:00:23) Data Integrity\n⌨️ (1:13:26) Database Terms\n⌨️ (1:28:26) More Database Terms\n⌨️ (1:38:43) Atomic Values\n⌨️ (1:44:23) Relationships\n⌨️ (1:50:29) One-to-One Relationships\n⌨️ (1:53:38) One-to-Many Relationships\n⌨️ (1:57:43) Many-to-Many Relationships\n⌨️ (2:02:16) Designing One-to-One Relationships\n⌨️ (2:13:33) Designing One-to-Many Relationships\n⌨️ (2:23:42) Parent Tables and Child Tables\n⌨️ (2:30:34) Designing Many-to-Many Relationships\n⌨️ (2:46:14) Summary of Relationships\n⌨️ (2:54:32) Introduction to Keys\n⌨️ (3:07:14) Primary Key Index\n⌨️ (3:13:31) Look up Table\n⌨️ (3:30:07) Superkey and Candidate Key\n⌨️ (3:48:44) Primary Key and Alternate Key\n⌨️ (3:56:11) Surrogate Key and Natural Key\n⌨️ (4:03:29) Should I use Surrogate Keys or Natural Keys?\n⌨️ (4:12:52) Foreign Key\n⌨️ (4:45:06) NOT NULL Foreign Key\n⌨️ (4:38:02) Foreign Key Constraints\n⌨️ (4:49:34) Simple Key, Composite Key, Compound Key\n⌨️ (5:01:36) Review and Key Points....HA GET IT? KEY points!\n⌨️ (5:10:09) Introduction to Entity Relationship Modeling\n⌨️ (5:17:14) Cardinality\n⌨️ (5:24:21) Modality\n⌨️ (5:34:54) Introduction to Database Normalization\n⌨️ (5:39:28) 1NF (First Normal Form of Database Normalization)\n⌨️ (5:46:14) 2NF (Second Normal Form of Database Normalization)\n⌨️ (5:54:40) 3NF (Third Normal Form of Database Normalization)\n⌨️ (6:00:52) Indexes (Clustered, Nonclustered, Composite Index)\n⌨️ (6:14:16) Data Types\n⌨️ (6:25:35) Introduction to Joins\n⌨️ (6:38:60) Inner Join\n⌨️ (6:54:26) Inner Join on 3 Tables\n⌨️ (7:07:18) Inner Join on 3 Tables (Example)\n⌨️ (7:23:26) Introduction to Outer Joins\n⌨️ (7:29:33) Right Outer Join\n⌨️ (7:35:07) JOIN with NOT NULL Columns\n⌨️ (7:42:14) Outer Join Across 3 Tables\n⌨️ (7:47:56) Alias\n⌨️ (7:54:39) Self Join", "likes": 904}, "replies": [{"author": "Daniel Grieve", "text": "@pastuh xD", "likes": 0}, {"author": "Dhaarani 1292668", "text": "Thank you", "likes": 0}, {"author": "Social Catalyst", "text": "Thanks🙏🙏🙏 great job", "likes": 1}, {"author": "Yamina Atmaoui", "text": "Thank you so much❤", "likes": 0}, {"author": "tanvir ahmed sohag", "text": "Thank you very much", "likes": 0}]}, {"topLevelComment": {"author": "mjshaheed", "text": "Caleb is one of the nicest and genuine persons on YouTube. I am glad that I have been following him for more than 5 years.", "likes": 104}, "replies": [{"author": "Mohammed Falih", "text": "@Neneさん 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "likes": 0}, {"author": "Neneさん", "text": "@Brandon Mohammed now build a database to store your stupidity.", "likes": 9}, {"author": "Brandon Mohammed", "text": "HELL IS REAL \n\nHEAVEN IS REAL\n\nGOD IS REAL\n\nJESUS IS THE SON OF GOD\n\nALL THOSE WHO ARE NOT SAVED WILL GO TO HELL AND HELL IS TORTURE FOR ETERNITY BURNING IN NEVER ENDING FIRE, ONCE YOU ARE IN HELL THERE IS NO WAY OUT, HOWEVER RIGHT NOW IT IS POSSIBLE TO PREVENT YOURSELF FROM GOING TO HELL AND BECOMING SAVED AND THERE IS ONLY ONE WAY OUT AND THIS WAY IS JESUS, JESUS DIED AND ROSE AGAIN AS A SACRIFICE FOR OUR SINS SO THAT WE DON'T HAVE TO GO TO HELL AND WE CAN HAVE EVERLASTING LIFE SO WE CAN SPEND ETERNITY WITH HIM IN HEAVEN WHICH IS PURE PARADISE. ALL YOU HAVE TO DO IS TO PUT YOUR FAITH IN JESUS AND TRUST THAT HE WILL SAVE YOU AND THE HOLY SPIRIT WILL MAKE HIS HOME IN YOUR HEART AND LEAD YOU ON THE RIGHT PATH. DON'T DELAY IN TRUSTING JESUS BECAUSE WE CANNOT TELL WHEN IT IS TOO LATE. JESUS IS COMING SOON PLEASE BE READY AND MAKE THE RIGHT CHOICE", "likes": 0}, {"author": "Norman Henderson", "text": "Followed him for 5 years?, he must have been very young at that time.", "likes": 4}]}, {"topLevelComment": {"author": "Abhishek Kumar", "text": "Thank u for this awesome video", "likes": 4}}, {"topLevelComment": {"author": "Sourav Nandi", "text": "I first thought 8 minutes. and then :-O", "likes": 15}, "replies": [{"author": "Not2Day", "text": "Rip", "likes": 2}]}, {"topLevelComment": {"author": "Shishu Kumar Choudhary", "text": "Sir your are awesome", "likes": 13}}, {"topLevelComment": {"author": "Mitch G", "text": "8 hours? Holy sweet Mercy. I ain't sleepin.", "likes": 138}, "replies": [{"author": "Gigel Chiazna", "text": "not if you run it a 1.25 or 1.5 speed", "likes": 11}]}, {"topLevelComment": {"author": "Tzirineto", "text": "Exactly what I needed RIGHT NOW! THANK YOU!!!!", "likes": 17}}]}