{"video": {"id": "ZU1B9LGjnAA", "publishedAt": "2018-07-23T14:56:29Z", "title": "Emotional Intelligence for Engineers", "description": "Whether you’re discussing tradeoffs with a designer, rallying support for a new tool, or reviewing someone’s code, emotional intelligence is essential for effective software engineering. This talk provides a framework for understanding your own behavior and cultivating empathy for others. You’ll leave inspired to apply these skills to unlock your full potential as a developer and a human being!\n\nSoftware may be built on machines, but it’s built by and for human beings. To be a highly effective software engineer, you must be able to navigate human interactions successfully. Emotional intelligence is the set of competencies that will allow you to do just that!\n\nPresented by April Wensel at PyTennessee February 11, 2018.\n\nThanks to April for letting us post her amazing talk!\n\n🔗Check out April's website for more resources: https://compassionatecoding.com/\n\n--\n\nLearn to code for free and get a developer job: https://www.freecodecamp.org\n\nRead hundreds of articles on programming: https://medium.freecodecamp.org", "duration": "PT30M49S", "likes": "174", "views": "6327"}, "comments": [{"topLevelComment": {"id": "UgxW3KoRYoVhsx12iYV4AaABAg", "publishedAt": "2020-08-14T08:23:13Z", "author": "Highmount Digital with Brandon Bair", "text": "Thanks for sharing these insights for emotional intelligence.  Two years old but it still applies.  EI can be the difference between working and growing as a leader🤔😊", "likes": 0}}, {"topLevelComment": {"id": "Ugyjo--Spj7gmFQJ92N4AaABAg", "publishedAt": "2019-08-12T16:47:59Z", "author": "Isuru Nanayakkara", "text": "Call me emotionally unintelligent but if you get so offended and hung up on such a trivial thing like the usage of 'guys' in normal casual speech, then I doubt that person's intelligence to begin with.", "likes": 3}}, {"topLevelComment": {"id": "UgwObETnVMO2F3xJoMl4AaABAg", "publishedAt": "2019-06-11T06:46:08Z", "author": "Gurupreet Singh Chagger", "text": "My tshirt got the quote \" You buy a 5$ coffee? You are F***ING SOFT \" on it", "likes": 0}}, {"topLevelComment": {"id": "Ugw7a_tTa0kCTjEM16Z4AaABAg", "publishedAt": "2018-09-17T20:13:07Z", "author": "Charbel Sarkis", "text": "I like how she screams. Please stop calling them soft skills.", "likes": 1}}, {"topLevelComment": {"id": "UgzMOxfDGIVlSB8rKJl4AaABAg", "publishedAt": "2018-07-30T16:03:56Z", "author": "Coding Commanders", "text": "I 💗 April Wensel! I new it was her just by the title! ✌💖💻", "likes": 2}}, {"topLevelComment": {"id": "Ugz4GHO9NHT6Xe1I2DV4AaABAg", "publishedAt": "2018-07-24T15:47:01Z", "author": "Martha Anne", "text": "I don't understand how the NVC conversation between Morgan and Alex solved anything. The first conversation, while heated, might have done more for the project than the second by removing Alex from the task. The second conversation encourages Alex, who clearly has a problem with impulse control, INAPPROPRIATELY putting his own needs above those of his team,  and respecting the decision making processes of the company, to continue doing all of those things. \n\nI assume that management/team is doing the task as a group because it is better in the long run, perhaps even faster. If Alex thinks it isn't better, the appropriate behavior for Alex would be to readdress the group requirement with the team, not go off vigilante style and do whatever he wants. If the requirement is really that offensive to him maybe the culture at this business is not a good fit for him.\n\nMorgan in the \"Morgan using NVC\" example is clearly no more competent in managing himself than Alex. He gives in to emotionalism when it will likely damage the cohesiveness of the team. Why should Alex be the only one who gets to disregard procedures? What does this do the moral of the team? What kind of expectations are we setting by allowing one person to disrupt the work flow like this? Will Alex's tactic work for others to get what they want? \n\nI think that trying to understand and empathize with the people around me is a good thing. It helps me make better decisions, but only because I've spent some time developing emotional and mental discipline. Many people aren't able to what's \"right\" once they've triggered an emotional empathy response in themselves, with another person's feelings/point of view. Having \"emotional intelligence\" is about balance between emotion and thought, and having a clear set of articulated values that one measures their actions against. In this case, is it more important to make one coworker feel \"better\" in the moment OR be a responsible caretaker for the whole team (INCLUSIVE of the one member having a problem at the moment)? \n\nI think you know which side I''m on! ;)", "likes": 2}}, {"topLevelComment": {"id": "Ugw-4lFbd7Bq5MBCXGB4AaABAg", "publishedAt": "2018-07-24T14:18:39Z", "author": "DeepWaterz", "text": "This just isn't what i was expecting. At all :(", "likes": 10}}, {"topLevelComment": {"id": "Ugxsj03AKg8Xs_x8X3p4AaABAg", "publishedAt": "2018-07-23T22:27:54Z", "author": "IG Mant", "text": "So this is the new buzzword now that \"company culture\" got beaten like a dead horse. Guess these oxygen thieves need to justify their paychecks with more team building BS that only wastes everybody's time.", "likes": 8}}, {"topLevelComment": {"id": "UgyZyN449kOL4i3yQDh4AaABAg", "publishedAt": "2018-07-23T22:04:41Z", "author": "jkuhl", "text": "Lost me when she started going on about not using the term \"guys.\"  I think everyone knows that NO ONE refers to \"guys\" in a gendered sense when talking about a general group of people, whether it's mixed sexes or not.  Give me a break.", "likes": 21}, "replies": [{"id": "UgyZyN449kOL4i3yQDh4AaABAg.8j3HdekMV7F8yY2p0YG9GF", "publishedAt": "2019-08-12T16:42:31Z", "author": "Isuru Nanayakkara", "text": "Kevin Isom If you take the word 'guys' in speech that literally, then the problem is with how you perceive things.", "likes": 0}, {"id": "UgyZyN449kOL4i3yQDh4AaABAg.8j3HdekMV7F8lPoy8ag_V_", "publishedAt": "2018-09-20T09:10:39Z", "author": "IG Mant", "text": "@Kevin Isom language has context, even within the same language the use and meaning of certain words changes between cultures (ie: fag is slang for a cigarette in the UK and not a slur). I have seen women use the term guys even among themselves, nobody cares.", "likes": 1}, {"id": "UgyZyN449kOL4i3yQDh4AaABAg.8j3HdekMV7F8jTLamHILhV", "publishedAt": "2018-08-03T00:59:29Z", "author": "Wrongderful", "text": "I thought I was the only one noticing that. Man, this and she is scary.", "likes": 4}, {"id": "UgyZyN449kOL4i3yQDh4AaABAg.8j3HdekMV7F8jH1IVYwC7z", "publishedAt": "2018-07-29T06:11:12Z", "author": "Kevin Isom", "text": "Actually, you are incorrect. Language matters. It is a gendered word, claiming otherwise is lazy and wrong.", "likes": 3}]}, {"topLevelComment": {"id": "UgyHMurXZKR-GexEmxh4AaABAg", "publishedAt": "2018-07-23T18:22:56Z", "author": "GDI Bass", "text": "Heey I saw this talk at San Diego Start Up Week.  Great talk.  You had posted another video from a woman at another Python Convention about the same thing.  It's so true.  Nobody wants to work with \"jerk\" programmers.", "likes": 2}}, {"topLevelComment": {"id": "UgzEfvrZ_cptsNUnvKR4AaABAg", "publishedAt": "2018-07-23T15:41:04Z", "author": "Daniel A.", "text": "This could've been way better.", "likes": 5}, "replies": [{"id": "UgzEfvrZ_cptsNUnvKR4AaABAg.8j2ajzeg69Q8lPpNO6K0bx", "publishedAt": "2018-09-20T09:14:14Z", "author": "IG Mant", "text": "@Daniel A. You aren't, the people peddling these talking points are just trying to get companies to hire them to \"spread awareness\" (actually force employees to attend pointless meetings that look like this video) and pay them handsomely for this.", "likes": 0}, {"id": "UgzEfvrZ_cptsNUnvKR4AaABAg.8j2ajzeg69Q8j2qLkKddIx", "publishedAt": "2018-07-23T17:57:25Z", "author": "Daniel A.", "text": "Most of this pretty much only applies to americans (the language policing thing, languages other than English are extremely gendered, so it's impossible to do this and people don't really mind it in other cultures) or to people who've been living inside a cave without human interaction until 10 minutes ago (observations that are too obvious to be talking points). Or maybe I am a person with social skills above average (I don't think so). EDIT: This is supposed to be constructive criticism. Hope i'm not appearing to be unintelligent.", "likes": 9}, {"id": "UgzEfvrZ_cptsNUnvKR4AaABAg.8j2ajzeg69Q8j2jlj3dopm", "publishedAt": "2018-07-23T16:59:56Z", "author": "Abstraction", "text": "Daniel A. How so?", "likes": 1}]}, {"topLevelComment": {"id": "UgzFiJCsf14atl4V8Z54AaABAg", "publishedAt": "2018-07-23T14:59:25Z", "author": "Shashank Sam", "text": "yay", "likes": 3}}]}